local 商店处理类 = class()

function 商店处理类:初始化()
	local n = {
		{
			"红缨枪",
			"曲尖枪",
			"锯齿矛",
			"乌金三叉戟",
			"火焰枪",
			"墨杆金钩",
			"玄铁矛",
			"金蛇信",
			"丈八点钢矛",
			"暗夜",
			"梨花",
			"霹雳",
			"刑天之逆",
			"五虎断魂",
			"飞龙在天",
			"天龙破城",
			"弑皇"
		},
		{
			"青铜斧",
			"开山斧",
			"双面斧",
			"双弦钺",
			"精钢禅钺",
			"黄金钺",
			"乌金鬼头镰",
			"狂魔镰",
			"恶龙之齿",
			"破魄",
			"肃魂",
			"无敌",
			"五丁开山",
			"元神禁锢",
			"护法灭魔",
			"碧血干戚",
			"裂天"
		},
		{
			"青铜短剑",
			"铁齿剑",
			"吴越剑",
			"青锋剑",
			"龙泉剑",
			"黄金剑",
			"游龙剑",
			"北斗七星剑",
			"碧玉剑",
			"鱼肠",
			"倚天",
			"湛卢",
			"魏武青虹",
			"灵犀神剑",
			"四法青云",
			"霜冷九州",
			"擒龙"
		},
		{
			"双短剑",
			"镔铁双剑",
			"龙凤双剑",
			"竹节双剑",
			"狼牙双剑",
			"鱼骨双剑",
			"赤焰双剑",
			"墨玉双剑",
			"梅花双剑",
			"阴阳",
			"月光双剑",
			"灵蛇",
			"金龙双剪",
			"连理双树",
			"祖龙对剑",
			"紫电青霜",
			"浮犀"
		},
		{
			"五色缎带",
			"幻彩银纱",
			"金丝彩带",
			"无极丝",
			"天蚕丝带",
			"云龙绸带",
			"七彩罗刹",
			"缚神绫",
			"九天仙绫",
			"彩虹",
			"流云",
			"碧波",
			"秋水落霞",
			"晃金仙绳",
			"此最相思",
			"揽月摘星",
			"九霄"
		},
		{
			"铁爪",
			"天狼爪",
			"幽冥鬼爪",
			"青龙牙",
			"勾魂爪",
			"玄冰刺",
			"青刚刺",
			"华光刺",
			"龙鳞刺",
			"撕天",
			"毒牙",
			"胭脂",
			"九阴勾魂",
			"雪蚕之刺",
			"贵霜之牙",
			"忘川三途",
			"离钩"
		},
		{
			"折扇",
			"铁骨扇",
			"精钢扇",
			"铁面扇",
			"百折扇",
			"劈水扇",
			"神火扇",
			"阴风扇",
			"风云雷电",
			"太极",
			"玉龙",
			"秋风",
			"画龙点睛",
			"秋水人家",
			"逍遥江湖",
			"浩气长舒",
			"星瀚"
		},
		{
			"细木棒",
			"金丝魔棒",
			"玉如意",
			"点金棒",
			"云龙棒",
			"幽路引魂",
			"满天星",
			"水晶棒",
			"日月光华",
			"沧海",
			"红莲",
			"盘龙",
			"降魔玉杵",
			"青藤玉树",
			"墨玉骷髅",
			"丝萝乔木",
			"醍醐"
		},
		{
			"松木锤",
			"镔铁锤",
			"八棱金瓜",
			"狼牙锤",
			"烈焰锤",
			"破甲战锤",
			"震天锤",
			"巨灵神锤",
			"天崩地裂",
			"八卦",
			"鬼牙",
			"雷神",
			"混元金锤",
			"九瓣莲花",
			"鬼王蚀日",
			"狂澜碎岳",
			"碎寂"
		},
		{
			"牛皮鞭",
			"牛筋鞭",
			"乌龙鞭",
			"钢结鞭",
			"蛇骨鞭",
			"玉竹金铃",
			"青藤柳叶鞭",
			"雷鸣嗜血鞭",
			"混元金钩",
			"龙筋",
			"百花",
			"吹雪",
			"游龙惊鸿",
			"仙人指路",
			"血之刺藤",
			"牧云清歌",
			"霜陨"
		},
		{
			"黄铜圈",
			"精钢日月圈",
			"离情环",
			"金刺轮",
			"风火圈",
			"赤炎环",
			"蛇形月",
			"子母双月",
			"斜月狼牙",
			"如意",
			"乾坤",
			"月光双环",
			"别情离恨",
			"金玉双环",
			"九天金线",
			"无关风月",
			"朝夕"
		},
		{
			"柳叶刀",
			"苗刀",
			"夜魔弯刀",
			"金背大砍刀",
			"雁翅刀",
			"破天宝刀",
			"狼牙刀",
			"龙鳞宝刀",
			"黑炎魔刀",
			"冷月",
			"屠龙",
			"血刃",
			"偃月青龙",
			"晓风残月",
			"斩妖泣血",
			"业火三灾",
			"鸣鸿"
		},
		{
			"曲柳杖",
			"红木杖",
			"白椴杖",
			"墨铁拐",
			"玄铁牛角杖",
			"鹰眼法杖",
			"腾云杖",
			"引魂杖",
			"碧玺杖",
			"业焰",
			"玉辉",
			"鹿鸣",
			"庄周梦蝶",
			"凤翼流珠",
			"雪蟒霜寒",
			"碧海潮生",
			"弦月"
		},
		{
			"硬木弓",
			"铁胆弓",
			"紫檀弓",
			"宝雕长弓",
			"錾金宝弓",
			"玉腰弯弓",
			"连珠神弓",
			"游鱼戏珠",
			"灵犀望月",
			"非攻",
			"幽篁",
			"百鬼",
			"冥火薄天",
			"龙鸣寒水",
			"太极流光",
			"九霄风雷",
			"若木"
		},
		{
			"琉璃珠",
			"水晶珠",
			"珍宝珠",
			"翡翠珠",
			"莲华珠",
			"夜灵珠",
			"如意宝珠",
			"沧海明珠",
			"无量玉璧",
			"离火",
			"飞星",
			"月华",
			"回风舞雪",
			"紫金葫芦",
			"裂云啸日",
			"云雷万里",
			"赤明"
		},
		{
			"钝铁重剑",
			"桃印铁刃",
			"赭石巨剑",
			"壁玉长铗",
			"青铜古剑",
			"金错巨刃",
			"惊涛雪",
			"醉浮生",
			"沉戟天戊",
			"鸦九",
			"昆吾",
			"弦歌",
			"墨骨枯麟",
			"腾蛇郁刃",
			"秋水澄流",
			"百辟镇魂",
			"长息"
		},
		{
			"油纸伞",
			"红罗伞",
			"紫竹伞",
			"锦绣椎",
			"幽兰帐",
			"琳琅盖",
			"孔雀羽",
			"金刚伞",
			"落梅伞",
			"鬼骨",
			"云梦",
			"枕霞",
			"碧火琉璃",
			"雪羽穿云",
			"月影星痕",
			"浮生归梦",
			"晴雪"
		},
		{
			"素纸灯",
			"竹骨灯",
			"红灯笼",
			"鲤鱼灯",
			"芙蓉花灯",
			"如意宫灯",
			"玲珑盏",
			"玉兔盏",
			"冰心盏",
			"蟠龙",
			"云鹤",
			"风荷",
			"金风玉露",
			"凰火燎原",
			"月露清愁",
			"夭桃秾李",
			"荒尘"
		},
		{
			{
				"方巾",
				"簪子"
			},
			{
				"布帽",
				"玉钗"
			},
			{
				"面具",
				"梅花簪子"
			},
			{
				"纶巾",
				"珍珠头带"
			},
			{
				"缨络丝带",
				"凤头钗"
			},
			{
				"羊角盔",
				"媚狐头饰"
			},
			{
				"水晶帽",
				"玉女发冠"
			},
			{
				"乾坤帽",
				"魔女发冠"
			},
			{
				"黑魔冠",
				"七彩花环"
			},
			{
				"白玉龙冠",
				"凤翅金翎"
			},
			{
				"水晶夔帽",
				"寒雉霜蚕"
			},
			{
				"翡翠曜冠",
				"曜月嵌星"
			},
			{
				"金丝黑玉冠",
				"郁金流苏簪"
			},
			{
				"白玉琉璃冠",
				"玉翼附蝉翎"
			},
			{
				"兽鬼珐琅面",
				"鸾羽九凤冠"
			},
			{
				"紫金磐龙冠",
				"金珰紫焰冠"
			},
			{
				"浑天玄火盔",
				"乾元鸣凤冕"
			}
		},
		{
			"护身符",
			"五色飞石",
			"珍珠链",
			{
				"骷髅吊坠",
				"苍魂珠"
			},
			{
				"江湖夜雨",
				"九宫坠"
			},
			{
				"荧光坠子",
				"高速之星"
			},
			{
				"风月宝链",
				"八卦坠"
			},
			{
				"碧水青龙",
				"鬼牙攫魂"
			},
			{
				"万里卷云",
				"疾风之铃"
			},
			"七彩玲珑",
			"黄玉琉佩",
			"鸾飞凤舞",
			"衔珠金凤佩",
			"七璜珠玉佩",
			"鎏金点翠佩",
			"紫金碧玺佩",
			"落霞陨星坠"
		},
		{
			{
				"布裙",
				"布衣"
			},
			{
				"丝绸长裙",
				"皮衣"
			},
			{
				"五彩裙",
				"鳞甲"
			},
			{
				"龙鳞羽衣",
				"锁子甲"
			},
			{
				"天香披肩",
				"紧身衣"
			},
			{
				"金缕羽衣",
				"钢甲"
			},
			{
				"霓裳羽衣",
				"夜魔披风"
			},
			{
				"流云素裙",
				"龙骨甲"
			},
			{
				"七宝天衣",
				"死亡斗篷"
			},
			{
				"飞天羽衣",
				"神谕披风"
			},
			{
				"穰花翠裙",
				"珊瑚玉衣"
			},
			{
				"金蚕丝裙",
				"金蚕披风"
			},
			{
				"紫香金乌裙",
				"乾坤护心甲"
			},
			{
				"碧霞彩云衣",
				"蝉翼金丝甲"
			},
			{
				"金丝蝉翼衫",
				"金丝鱼鳞甲"
			},
			{
				"五彩凤翅衣",
				"紫金磐龙甲"
			},
			{
				"鎏金浣月衣",
				"混元一气甲"
			}
		},
		{
			"腰带",
			"缎带",
			"银腰带",
			{
				"水晶腰带",
				"玉树腰带"
			},
			{
				"琥珀腰链",
				"白面狼牙"
			},
			{
				"乱牙咬",
				"魔童大牙"
			},
			{
				"攫魂铃",
				"双魂引"
			},
			{
				"兽王腰带",
				"百窜云"
			},
			{
				"八卦锻带",
				"圣王坠"
			},
			"幻彩玉带",
			"珠翠玉环",
			"金蟾含珠",
			"乾坤紫玉带",
			"琉璃寒玉带",
			"蝉翼鱼佩带",
			"磐龙凤翔带",
			"紫霄云芒带"
		},
		{
			"布鞋",
			"牛皮靴",
			"马靴",
			"侠客履",
			"神行靴",
			"绿靴",
			"追星踏月",
			"九州履",
			"万里追云履",
			"踏雪无痕",
			"平步青云",
			"追云逐电",
			"乾坤天罡履",
			"七星逐月靴",
			"碧霞流云履",
			"金丝逐日履",
			"辟尘分光履"
		},
		{
			"竹编护腕",
			"皮腕",
			"针腕",
			"骨镯",
			"青铜护腕",
			"玛瑙护腕",
			"琉璃护腕",
			"镂空银镯",
			"笼玉镯",
			"嵌宝金腕",
			"玳瑁护腕",
			"七星宝腕",
			"缚龙筋",
			"凤翎护腕",
			"织锦彩带",
			"冰蚕丝带"
		},
		{
			"竹编脖环",
			"钢圈",
			"荆棘环",
			"骨环",
			"青铜颈环",
			"玛瑙石环",
			"琉璃环",
			"九曲环",
			"笼玉环",
			"嵌宝金环",
			"玳瑁环",
			"七星宝环",
			"缚龙圈",
			"鸾尾环",
			"织锦颈圈",
			"冰蚕丝圈"
		},
		{
			"竹藤甲",
			"皮甲",
			"刺甲",
			"骨排甲",
			"青铜披甲",
			"玛瑙软甲",
			"琉璃罩甲",
			"连环铠甲",
			"笼玉甲",
			"嵌宝金甲",
			"玳瑁衣",
			"七星宝甲",
			"缚龙甲",
			"凤凰彩衣",
			"织锦软褡",
			"冰蚕织甲"
		},
		{
			"商品棉布",
			"商品佛珠",
			"商品扇子",
			"商品武器"
		},
		{
			"商品纸钱",
			"商品夜明珠",
			"商品首饰",
			"商品珍珠"
		},
		{
			"商品帽子",
			"商品盐",
			"商品蜡烛",
			"商品酒"
		},
		{
			"商品木材",
			"商品鹿茸",
			"商品面粉",
			"商品符"
		},
		{
			"商品人参",
			"商品铃铛",
			"商品香油",
			"商品麻线"
		}
	}
	self.商品列表 = {
		{
			"方巾*500",
			"簪子*500",
			"布衣*500",
			"布裙*500",
			"布鞋*500",
			"护身符*500",
			"腰带*500",
			"布帽*1000",
			"玉钗*1000",
			"皮衣*1000",
			"丝绸长裙*1000",
			"牛皮靴*1000",
			"五色飞石*1000",
			"缎带*1000"
		},
		{
			"四叶花*100",
			"紫丹罗*80",
			"血色茶花*1500",
			"熊胆*2500",
			"丁香水*1500",
			"麝香*2500",
			"金创药*5000",
			"佛光舍利子*30000",
			"枯萎的金莲*100"
		},
		{
			"折扇*500",
			"红缨枪*500",
			"牛皮鞭*500",
			"曲柳杖*500",
			"铁爪*500",
			"松木锤*500",
			"琉璃珠*500",
			"双短剑*500",
			"青铜短剑*500",
			"柳叶刀*500",
			"青铜斧*500",
			"五色缎带*500",
			"黄铜圈*500",
			"硬木弓*500",
			"细木棒*500",
			"钝铁重剑*500",
			"素纸灯*500",
			"油纸伞*500"
		},
		{
			"铁骨扇*1000",
			"曲尖枪*1000",
			"牛筋鞭*1000",
			"红木杖*1000",
			"天狼爪*1000",
			"镔铁锤*1000",
			"水晶珠*1000",
			"镔铁双剑*1000",
			"铁齿剑*1000",
			"苗刀*1000",
			"开山斧*1000",
			"幻彩银纱*1000",
			"精钢日月圈*1000",
			"铁胆弓*1000",
			"金丝魔棒*1000",
			"桃印铁刃*1000",
			"竹骨灯*1000",
			"红罗伞*1000"
		},
		{
			"摄妖香*1000",
			"洞冥草*50",
			"飞行符*500",
			"宠物口粮*500",
			"高级宠物口粮*2500"
		},
		{
			"飞行符*500",
			"乾坤袋*7000"
		},
		{
			"面具*5000",
			"梅花簪子*5000",
			"鳞甲*5000",
			"五彩裙*5000",
			"马靴*5000"
		},
		{
			"精钢扇*5000",
			"锯齿矛*5000",
			"乌龙鞭*5000",
			"白椴杖*5000",
			"幽冥鬼爪*5000",
			"八棱金瓜*5000",
			"珍宝珠*5000",
			"龙凤双剑*5000",
			"吴越剑*5000",
			"夜魔弯刀*5000",
			"双面斧*5000",
			"金丝彩带*5000",
			"离情环*5000",
			"紫檀弓*5000",
			"玉如意*5000",
			"赭石巨剑*5000",
			"红灯笼*5000",
			"紫竹伞*5000"
		},
		{
			"包子*100"
		},
		{
			"乌金三叉戟*9000",
			"双弦钺*9000",
			"青锋剑*9000",
			"竹节双剑*9000",
			"无极丝*9000",
			"青龙牙*9000",
			"铁面扇*9000",
			"点金棒*9000",
			"狼牙锤*9000",
			"钢结鞭*9000",
			"金刺轮*9000",
			"金背大砍刀*9000",
			"墨铁拐*9000",
			"宝雕长弓*9000",
			"翡翠珠*9000",
			"壁玉长铗*9000",
			"鲤鱼灯*9000",
			"锦绣椎*9000"
		},
		{
			"纶巾*9000",
			"珍珠头带*9000",
			"水晶腰带*9000",
			"玉树腰带*9000",
			"侠客履*9000",
			"龙鳞羽衣*9000",
			"锁子甲*9000",
			"骷髅吊坠*9000",
			"苍魂珠*9000"
		},
		{
			"白玉骨头*200",
			"天青地白*200",
			"龙须草*140"
		},
		{
			"摄妖香*1000",
			"洞冥草*50",
			"宠物口粮*500",
			"高级宠物口粮*2500"
		},
		{
			"女儿红*500"
		},
		{
			"九宫坠*14000",
			"白面狼牙*14000",
			"江湖夜雨*14000",
			"凤头钗*14000",
			"缨络丝带*14000",
			"神行靴*14000",
			"琥珀腰链*14000",
			"紧身衣*14000",
			"天香披肩*14000"
		},
		{},
		{
			"灵脂*200",
			"曼陀罗花*275",
			"鬼切草*200",
			"佛手*80"
		},
		{
			"秘制红罗羹*12000",
			"秘制绿罗羹*12000"
		},
		{
			"香叶*140",
			"百色花*140",
			"鬼切草*200",
			"佛手*80",
			"七叶莲*150"
		},
		{
			"银腰带*5000",
			"珍珠链*5000",
			"腰带*500",
			"护身符*500"
		},
		[24] = {
			"高级魔兽要诀*15000000",
			"魔兽要诀*4000000",
			"灵饰指南书*8000000",
			"元灵晶石*5000000"
		},
		[25] = {
			"四叶花*100",
			"紫丹罗*80"
		},
		[26] = {
			"青龙石*20",
			"白虎石*20",
			"朱雀石*20",
			"玄武石*20",
			"彩果*50",
			"金柳露*30",
			"超级金柳露*50",
			"魔兽要诀*30",
			"高级魔兽要诀*80",
			"神兜兜*80",
			"点化石*100",
			"附魔宝珠*100"
		},
		[50] = {
			"旋复花*80",
			"曼陀罗花*275",
			"灵脂*200"
		}
	}

	for i = 1, 18 do
		self.商品列表[16][i] = n[i][5] .. "*14000"
	end
end

function 商店处理类:刷新跑商商品买入价格()
	self.商品列表[27] = {
		"商品棉布*" .. 取随机数(3200, 3800),
		"商品佛珠*" .. 取随机数(6200, 8000),
		"商品扇子*" .. 取随机数(3500, 4200),
		"商品武器*" .. 取随机数(3600, 4500)
	}
	self.商品列表[28] = {
		"商品棉布*" .. 取随机数(3200, 3800),
		"商品佛珠*" .. 取随机数(6200, 8000),
		"商品扇子*" .. 取随机数(3500, 4200),
		"商品武器*" .. 取随机数(3600, 4500)
	}
	self.商品列表[29] = {
		"商品纸钱*" .. 取随机数(2600, 3400),
		"商品夜明珠*" .. 取随机数(7600, 9000),
		"商品首饰*" .. 取随机数(3600, 4800),
		"商品珍珠*" .. 取随机数(5000, 6000)
	}
	self.商品列表[30] = {
		"商品纸钱*" .. 取随机数(2600, 3400),
		"商品夜明珠*" .. 取随机数(7600, 9000),
		"商品首饰*" .. 取随机数(3600, 4800),
		"商品珍珠*" .. 取随机数(5000, 6000)
	}
	self.商品列表[31] = {
		"商品帽子*" .. 取随机数(3000, 4000),
		"商品盐*" .. 取随机数(4800, 6000),
		"商品蜡烛*" .. 取随机数(1500, 2500),
		"商品酒*" .. 取随机数(3200, 4500)
	}
	self.商品列表[32] = {
		"商品帽子*" .. 取随机数(3000, 4000),
		"商品盐*" .. 取随机数(4800, 6000),
		"商品蜡烛*" .. 取随机数(1500, 2500),
		"商品酒*" .. 取随机数(3200, 4500)
	}
	self.商品列表[33] = {
		"商品木材*" .. 取随机数(3200, 5000),
		"商品鹿茸*" .. 取随机数(6800, 8500),
		"商品面粉*" .. 取随机数(2500, 3500),
		"商品符*" .. 取随机数(4500, 6000)
	}
	self.商品列表[34] = {
		"商品木材*" .. 取随机数(3200, 5000),
		"商品鹿茸*" .. 取随机数(6800, 8500),
		"商品面粉*" .. 取随机数(2500, 3500),
		"商品符*" .. 取随机数(4500, 6000)
	}
	self.商品列表[35] = {
		"商品人参*" .. 取随机数(6500, 9000),
		"商品铃铛*" .. 取随机数(3200, 4800),
		"商品香油*" .. 取随机数(3200, 5000),
		"商品麻线*" .. 取随机数(2000, 3800)
	}
	self.商品列表[36] = {
		"商品人参*" .. 取随机数(6500, 9000),
		"商品铃铛*" .. 取随机数(3200, 4800),
		"商品香油*" .. 取随机数(3200, 5000),
		"商品麻线*" .. 取随机数(2000, 3800)
	}
	self.商品列表[43] = {
		"商品剪刀*" .. 取随机数(4000, 8000)
	}
end

function 商店处理类:刷新跑商商品卖出价格()
	self.商品列表[37] = {
		"商品棉布*" .. 取随机数(3200, 3800),
		"商品佛珠*" .. 取随机数(6200, 8000),
		"商品扇子*" .. 取随机数(3500, 4200),
		"商品武器*" .. 取随机数(3600, 4500)
	}
	self.商品列表[38] = {
		"商品纸钱*" .. 取随机数(2600, 3400),
		"商品夜明珠*" .. 取随机数(7600, 9000),
		"商品首饰*" .. 取随机数(3600, 4800),
		"商品珍珠*" .. 取随机数(5000, 6000)
	}
	self.商品列表[39] = {
		"商品帽子*" .. 取随机数(3000, 4000),
		"商品盐*" .. 取随机数(4800, 6000),
		"商品蜡烛*" .. 取随机数(1500, 2500),
		"商品酒*" .. 取随机数(3200, 4500)
	}
	self.商品列表[40] = {
		"商品木材*" .. 取随机数(3200, 5000),
		"商品鹿茸*" .. 取随机数(6800, 8500),
		"商品面粉*" .. 取随机数(2500, 3500),
		"商品符*" .. 取随机数(4500, 6000)
	}
	self.商品列表[41] = {
		"商品人参*" .. 取随机数(6500, 9000),
		"商品铃铛*" .. 取随机数(3200, 4800),
		"商品香油*" .. 取随机数(3200, 5000),
		"商品麻线*" .. 取随机数(2000, 3800)
	}
	self.商品列表[42] = {
		"商品剪刀*" .. 取随机数(4000, 8000)
	}
end

function 商店处理类:设置迷宫宝箱(id)
	当前抽奖类型[id] = "迷宫宝箱"
	local 奖励列表 = {
		{
			"特殊魔兽要诀",
			10
		},
		{
			"高级魔兽要诀",
			20
		},
		{
			"魔兽要诀",
			100,
			广播 = false
		},
		{
			"种族坐骑礼包",
			5
		},
		{
			"祥瑞坐骑礼包",
			3
		},
		{
			"随机三级法宝",
			10
		},
		{
			"魔兽残卷",
			100
		},
		{
			"特效石碎片",
			10
		},
		{
			"五行石",
			10
		},
		{
			"特技石",
			20
		},
		{
			"七彩石",
			20
		},
		{
			"百炼晶石碎片",
			20
		},
		{
			"高级召唤兽内丹",
			20
		},
		{
			"召唤兽内丹",
			30,
			广播 = false
		},
		{
			"坐骑内丹",
			20
		},
		{
			"金柳露",
			50,
			广播 = false
		},
		{
			"超级金柳露",
			30,
			广播 = false
		},
		{
			"通灵神臂",
			50,
			广播 = false
		},
		{
			"通灵神符",
			30
		},
		{
			"通灵神戒",
			15
		},
		{
			"通灵重置丹",
			50,
			广播 = false
		},
		{
			"高级通灵重置丹",
			30
		},
		{
			"超级通灵重置丹",
			20
		},
		{
			"神兜兜",
			30
		},
		{
			"属性转换符",
			50,
			广播 = false
		},
		{
			宝石列表[1],
			50,
			"2~5级" .. 宝石列表[1]
		},
		{
			宝石列表[2],
			50,
			"2~5级" .. 宝石列表[2]
		},
		{
			宝石列表[3],
			50,
			"2~5级" .. 宝石列表[3]
		},
		{
			宝石列表[4],
			50,
			"2~5级" .. 宝石列表[4]
		},
		{
			宝石列表[5],
			50,
			"2~5级" .. 宝石列表[5]
		},
		{
			宝石列表[6],
			50,
			"2~5级" .. 宝石列表[6]
		},
		{
			宝石列表[7],
			50,
			"2~5级" .. 宝石列表[7]
		},
		{
			宝石列表[8],
			50,
			"2~5级" .. 宝石列表[8]
		},
		{
			宝石列表[9],
			50,
			"2~5级" .. 宝石列表[9]
		},
		{
			"钟灵石",
			30,
			"1~2级钟灵石"
		},
		{
			"源生之灵",
			1,
			"神兽雪精灵"
		},
		{
			"源生之灵",
			1,
			"神兽小龙人"
		},
		{
			"源生之灵",
			1,
			"神兽时光叽"
		},
		{
			"源生之灵",
			0.9,
			"齐天小圣"
		},
		{
			"源生之灵",
			0.8,
			"神兽孙小圣"
		},
		{
			"源生之灵",
			1,
			"兔乖乖"
		},
		{
			"召唤兽蛋",
			8,
			"小肥羊"
		},
		{
			"召唤兽蛋",
			8,
			"小欣"
		},
		{
			"召唤兽蛋",
			8,
			"小雪人"
		},
		{
			"召唤兽蛋",
			8,
			"团团"
		},
		{
			"召唤兽蛋",
			8,
			"嵩鼠"
		},
		{
			"召唤兽蛋",
			8,
			"战神罗成"
		},
		{
			"召唤兽蛋",
			8,
			取特殊野怪名称()
		},
		{
			"召唤兽蛋",
			8,
			取特殊野怪名称()
		},
		{
			"召唤兽蛋",
			8,
			取特殊野怪名称()
		},
		{
			"九转金丹",
			50,
			广播 = false
		},
		{
			"修炼果",
			50,
			广播 = false
		},
		{
			"龙鳞",
			50,
			广播 = false
		},
		{
			"避水珠",
			50,
			广播 = false
		},
		{
			"金刚石",
			50,
			广播 = false
		},
		{
			"定魂珠",
			50,
			广播 = false
		},
		{
			"夜光珠",
			50,
			广播 = false
		},
		{
			"易经丹",
			50,
			广播 = false
		},
		{
			"百炼精铁",
			20,
			"100~120级随机百炼精铁"
		},
		{
			"制造指南书",
			20,
			"100~120级随机制造指南书"
		},
		{
			"元灵晶石",
			20,
			"80~120级随机元灵晶石"
		},
		{
			"灵饰指南书",
			20,
			"80~120级随机灵饰指南书"
		},
		{
			"随机法宝",
			20,
			"1~2级随机法宝"
		},
		{
			"驾驭宝典",
			20
		},
		{
			"彩果",
			50
		},
		{
			"随机法宝",
			20,
			"1~2级随机法宝"
		},
		{
			"黄帝内经",
			0.5,
			"黄帝内经"
		},
		{
			"蚩尤武诀",
			0.5,
			"蚩尤武诀"
		},
		{
			"还魂秘术",
			0.5,
			"还魂秘术"
		},
		{
			"六艺修行书",
			0.5,
			"六艺修行书"
		}
	}

	快捷设置宝箱(id, 奖励列表)
end

快捷设置宝箱 = function(id, 奖励列表)
	神秘宝箱[id] = {}
	local 奖励参数 = {}
	local aa = 列表打乱重组(取多项数字列表(1, #奖励列表, 24))

	for i = 1, 44 do
		神秘宝箱[id][i] = {
			名称 = 奖励列表[aa[i]][1],
			说明 = 奖励列表[aa[i]][3] or 奖励列表[aa[i]][1],
			备注 = 奖励列表[aa[i]][3] or 奖励列表[aa[i]][1],
			广播 = 奖励列表[aa[i]].广播
		}

		if i == 1 then
			奖励参数[i] = 奖励列表[aa[i]][2]
		else
			奖励参数[i] = 奖励参数[i - 1] + 奖励列表[aa[i]][2]
		end
	end

	local 奖励 = 取随机数(1, 奖励参数[#奖励参数] * 100)

	for i = 1, #奖励参数 do
		if 奖励 <= 奖励参数[i] * 100 then
			神秘宝箱[id].中奖 = i

			break
		end
	end
end

function 商店处理类:设置点卡宝箱1(id)
	神秘宝箱[id] = {}
	当前抽奖类型[id] = "点卡宝箱"
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 5450)
	local 说明 = ""
	奖励 = math.ceil(奖励 / 10)
	local 奖励1 = math.ceil(取随机数(1, 5000) / 10)
	local 奖励2 = math.ceil(取随机数(1, 5000) / 10)

	while 奖励1 == 奖励2 do
		奖励2 = math.ceil(取随机数(1, 5000) / 10)
	end

	if 奖励 <= 20 then
		中奖 = 2
	elseif 奖励 <= 35 then
		中奖 = 20
	elseif 奖励 <= 55 then
		中奖 = 18
	elseif 奖励 <= 75 then
		中奖 = 19
	elseif 奖励 <= 85 then
		中奖 = 1
	elseif 奖励 <= 105 then
		中奖 = 3
	elseif 奖励 <= 130 then
		中奖 = 5
	elseif 奖励 <= 150 then
		中奖 = 6
	elseif 奖励 <= 170 then
		中奖 = 7
	elseif 奖励 <= 190 then
		中奖 = 8
	elseif 奖励 <= 210 then
		中奖 = 21
	elseif 奖励 <= 230 then
		中奖 = 11
		elseif 奖励 <= 240 then
		中奖 = 41
		elseif 奖励 <= 260 then
		中奖 = 42
		elseif 奖励 <= 285 then
		中奖 = 43
		elseif 奖励 <= 140 then
		中奖 = 44
		elseif 奖励 <= 65 then
		中奖 = 45
		elseif 奖励 <= 45 then
		中奖 = 46
	elseif 奖励 <= 250 then
		中奖 = 12
	elseif 奖励 <= 270 then
		中奖 = 13
	elseif 奖励 <= 310 then
		中奖 = 14
	elseif 奖励 <= 330 then
		中奖 = 15
	elseif 奖励 <= 350 then
		中奖 = 16
	elseif 奖励 <= 370 then
		中奖 = 24
	elseif 奖励 <= 390 then
		中奖 = 23
	elseif 奖励 <= 410 then
		中奖 = 17
		elseif 奖励 <= 415 then
		中奖 = 25
		elseif 奖励 <= 420 then
		中奖 = 26
		elseif 奖励 <= 425 then
		中奖 = 27
		elseif 奖励 <= 430 then
		中奖 = 28
		elseif 奖励 <= 435 then
		中奖 = 29
		elseif 奖励 <= 440 then
		中奖 = 30
		elseif 奖励 <= 445 then
		中奖 = 31
		elseif 奖励 <= 450 then
		中奖 = 32
		elseif 奖励 <= 455 then
		中奖 = 33
		elseif 奖励 <= 460 then
		中奖 = 34
		elseif 奖励 <= 465 then
		中奖 = 35
		elseif 奖励 <= 470 then
		中奖 = 36
		elseif 奖励 <= 475 then
		中奖 = 37
		elseif 奖励 <= 480 then
		中奖 = 38
		elseif 奖励 <= 485 then
		中奖 = 39
		elseif 奖励 <= 490 then
		中奖 = 40
	elseif 奖励 <= 500 then
		if 取随机数() >= 50 then
			中奖 = 10
		else
			中奖 = 31
		end
	else
		中奖 = 42
	end

	if 奖励 == 奖励1 then
		中奖 = 9
	elseif 奖励 == 奖励2 then
		中奖 = 4
	end

	神秘宝箱[id] = {
		{
			名称 = "特殊魔兽要诀",
			备注 = "随机特殊魔兽要诀一本",
			说明 = "特殊魔兽要诀"
		},
		{
			名称 = "金银锦盒",
			备注 = "金银锦盒50个",
			说明 = "金银锦盒50个"
		},
		{
			名称 = "特效石碎片",
			备注 = "随机特效石碎片一个",
			说明 = "随机特效石碎片一个"
		},
		{
			名称 = "神行百变·坐骑礼包",
			备注 = "特殊坐骑【神行百变】",
			说明 = "特殊坐骑【神行百变】"
		},
		{
			名称 = "高级魔兽要诀",
			备注 = "高级魔兽要诀",
			说明 = "高级魔兽要诀"
		},
		{
			名称 = "五行石",
			备注 = "五行石一个",
			说明 = "五行石一个"
		},
		{
			名称 = "百炼晶石碎片",
			备注 = "随机2-3个百炼晶石碎片",
			说明 = "10个碎片可合成一块百炼晶石"
		},
		{
			名称 = "七彩石",
			备注 = "七彩石1个",
			说明 = "七彩石1个"
		},
		{
			名称 = "百变坐骑·坐骑礼包",
			备注 = "特殊坐骑【百变坐骑】",
			说明 = "特殊坐骑【百变坐骑】"
		},
		{
			名称 = "百炼晶石",
			备注 = "百炼晶石一个",
			说明 = "使用后获得百炼打造资格"
		},
		{
			名称 = "特赦令牌",
			备注 = "特赦令牌3个",
			说明 = "特赦令牌3个"
		},
		{
			名称 = "属性转换符",
			备注 = "属性转换符5张",
			说明 = "属性转换符5张"
		},
		{
			名称 = "超级金柳露",
			备注 = "超级金柳露10个",
			说明 = "超级金柳露10个"
		},
		{
			名称 = "高级召唤兽内丹",
			备注 = "高级召唤兽内丹",
			说明 = "高级召唤兽内丹"
		},
		{
			名称 = "召唤兽内丹",
			备注 = "召唤兽内丹",
			说明 = "召唤兽内丹"
		},
		{
			名称 = "金柳露",
			备注 = "金柳露99个",
			说明 = "金柳露99个"
		},
		{
			名称 = "超级通灵重置丹",
			备注 = "超级通灵重置丹1个",
			说明 = "超级通灵重置丹1个"
		},
		{
			名称 = "通灵神戒",
			备注 = "随机技能通灵神戒一个",
			说明 = "随机技能通灵神戒一个"
		},
		{
			名称 = "高级通灵重置丹",
			备注 = "高级通灵重置丹2个",
			说明 = "高级通灵重置丹2个"
		},
		{
			名称 = "通灵神臂",
			备注 = "双技能通灵神臂一个",
			说明 = "双技能通灵神臂一个"
		},
		{
			名称 = "通灵神符",
			备注 = "随机技能通灵神符一个",
			说明 = "随机技能通灵神符一个"
		},
		{
			名称 = "坐骑内丹",
			备注 = "坐骑内丹3个",
			说明 = "坐骑内丹3个"
		},
		{
			名称 = "通灵重置丹",
			备注 = "通灵重置丹10个",
			说明 = "通灵重置丹10个"
		},
		{
			名称 = "神兜兜",
			备注 = "神兜兜1-5个",
			说明 = "神兜兜1-5个"
		},
		{
			名称 = "中",
			备注 = "中1-5个",
			说明 = "中1-5个"
		},
		{
			名称 = "秋",
			备注 = "秋1-5个",
			说明 = "秋1-5个"
		},
		{
			名称 = "节",
			备注 = "节1-5个",
			说明 = "节1-5个"
		},
		{
			名称 = "快",
			备注 = "快1-5个",
			说明 = "快1-5个"
		},
		{
			名称 = "乐",
			备注 = "乐1-5个",
			说明 = "乐1-5个"
		},
		{
			名称 = "属性石",
			备注 = "属性石1-5个",
			说明 = "属性石1-5个"
		},
		{
			名称 = "召唤兽蛋",
			备注 = "召唤兽蛋1-5个",
			说明 = "召唤兽蛋1-5个"
		},
		{
			名称 = "13技能定制法宠礼包",
			备注 = "13技能定制法宠礼包",
			说明 = "13技能定制法宠礼包"
		},

		{
			名称 = "15技能定制法宠礼包",
			备注 = "15技能定制法宠礼包",
			说明 = "15技能定制法宠礼包"
		},


		{
			名称 = "13技能定制物宠礼包",
			备注 = "13技能定制物宠礼包",
			说明 = "13技能定制物宠礼包"
		},


		{
			名称 = "15技能定制物宠礼包",
			备注 = "15技能定制物宠礼包",
			说明 = "15技能定制物宠礼包"
		},


		{
			名称 = "10技能胚子召唤兽礼包",
			备注 = "10技能胚子召唤兽礼包",
			说明 = "10技能胚子召唤兽礼包"
		},
		{
			名称 = "12技能胚子召唤兽礼包",
			备注 = "12技能胚子召唤兽礼包",
			说明 = "12技能胚子召唤兽礼包"
		},
		{
			名称 = "14技能胚子召唤兽礼包",
			备注 = "14技能胚子召唤兽礼包",
			说明 = "14技能胚子召唤兽礼包"
		},
		{
			名称 = "16技能胚子召唤兽礼包",
			备注 = "16技能胚子召唤兽礼包",
			说明 = "16技能胚子召唤兽礼包"
		},
		{
			名称 = "18技能胚子召唤兽礼包",
			备注 = "18技能胚子召唤兽礼包",
			说明 = "18技能胚子召唤兽礼包"
		},
		{
			名称 = "20技能胚子召唤兽礼包",
			备注 = "20技能胚子召唤兽礼包",
			说明 = "20技能胚子召唤兽礼包"
		},
		{
			名称 = "金砖",
			备注 = "金砖",
			说明 = "金砖"
		},
		{
			名称 = "月饼",
			备注 = "月饼",
			说明 = "月饼"
		},
		{
			名称 = "修炼果",
			备注 = "修炼果",
			说明 = "修炼果"
		},
		{
			名称 = "九转金丹",
			备注 = "九转金丹",
			说明 = "九转金丹"
		},
			{
			名称 = "资质丸",
			备注 = "资质丸",
			说明 = "资质丸"
		},




		中奖 = 中奖
	}
end

function 商店处理类:设置神秘宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 410)
	local 说明 = ""

	if 奖励 <= 1 then
		中奖 = 4
	elseif 奖励 <= 5 then
		中奖 = 9
	elseif 奖励 <= 30 then
		中奖 = 17
	elseif 奖励 <= 40 then
		中奖 = 20
	elseif 奖励 <= 10 then
		中奖 = 21
	elseif 奖励 <= 60 then
		中奖 = 18
	elseif 奖励 <= 70 then
		中奖 = 19
	elseif 奖励 <= 90 then
		中奖 = 1
	elseif 奖励 <= 110 then
		中奖 = 3
	elseif 奖励 <= 130 then
		中奖 = 5
	elseif 奖励 <= 150 then
		中奖 = 6
	elseif 奖励 <= 170 then
		中奖 = 7
	elseif 奖励 <= 190 then
		中奖 = 8
	elseif 奖励 <= 210 then
		中奖 = 10
	elseif 奖励 <= 230 then
		中奖 = 11
	elseif 奖励 <= 250 then
		中奖 = 12
	elseif 奖励 <= 270 then
		中奖 = 13
	elseif 奖励 <= 310 then
		中奖 = 14
	elseif 奖励 <= 330 then
		中奖 = 15
	elseif 奖励 <= 350 then
		中奖 = 16
	elseif 奖励 <= 370 then
		中奖 = 22
	elseif 奖励 <= 390 then
		中奖 = 23
	else
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "星辉石",
			备注 = "随机3-6级星辉石",
			说明 = "如星光一样璀璨的宝石\n散发出耀眼的光芒\n用于强化灵饰效果"
		},
		{
			名称 = "金银锦盒",
			备注 = "金银锦盒99个",
			说明 = "金银锦盒99个"
		},
		{
			名称 = "光芒石",
			备注 = "随机4-8级光芒石",
			说明 = [[
聚天地之精华而成的宝石
通体散发着夺目的光彩
令人不敢直视
是用来合成装备的神奇矿石]]
		},
		{
			名称 = "110级无级别武器",
			备注 = "110级无级别武器",
			说明 = "110级无级别武器"
		},
		{
			名称 = "高级魔兽要诀",
			备注 = "高级魔兽要诀",
			说明 = "高级魔兽要诀"
		},
		{
			名称 = "太阳石",
			备注 = "随机4-8级太阳石",
			说明 = "从上古时期流传至今的“太阳之石”\n附有神力\n是用来合成装备的神奇矿石"
		},
		{
			名称 = "舍利子",
			备注 = "随机4-8级舍利子",
			说明 = "佛的舍利子是合成装备的神秘材料"
		},
		{
			名称 = "新仙玉锦囊",
			备注 = "新仙玉锦囊1个",
			说明 = "新仙玉锦囊1个"
		},
		{
			名称 = "110级无级别装备",
			备注 = "110级无级别装备",
			说明 = "110级无级别装备"
		},
		{
			名称 = "黑宝石",
			备注 = "随机4-8级黑宝石",
			说明 = "坚硬无比的宝石\n表面看起来毫不起眼\n实际上却蕴涵着巨大的力量"
		},
		{
			名称 = "特赦令牌",
			备注 = "特赦令牌1-10个",
			说明 = "特赦令牌1-10个"
		},
		{
			名称 = "月亮石",
			备注 = "随机4-8级月亮石",
			说明 = [[
由月宫中流落到人间的宝石
吸取了月光之精华
能起到鼓舞和提神的作用
是用来合成装备的神奇矿石]]
		},
		{
			名称 = "红玛瑙",
			备注 = "随机4-8级红玛瑙",
			说明 = "红色的玛瑙石\n是合成装备的神秘材料"
		},
		{
			名称 = "高级召唤兽内丹",
			备注 = "高级召唤兽内丹",
			说明 = "高级召唤兽内丹"
		},
		{
			名称 = "召唤兽内丹",
			备注 = "召唤兽内丹",
			说明 = "召唤兽内丹"
		},
		{
			名称 = "高级魔兽要诀",
			备注 = "高级魔兽要诀",
			说明 = "高级魔兽要诀"
		},
		{
			名称 = "100级无级别武器",
			备注 = "100级无级别武器",
			说明 = "100级无级别武器"
		},
		{
			名称 = "超级金柳露",
			备注 = "超级金柳露1-50个",
			说明 = "超级金柳露"
		},
		{
			名称 = "金柳露",
			备注 = "金柳露1-99个",
			说明 = "金柳露"
		},
		{
			名称 = "100级无级别装备",
			备注 = "100级无级别装备",
			说明 = "100级无级别装备"
		},
		{
			名称 = "100级装备礼包",
			备注 = "100级装备礼包",
			说明 = "100级装备礼包"
		},
		{
			名称 = "金砖",
			备注 = "30万银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "仙丹",
			备注 = "50万经验",
			说明 = "获得一定量的经验。"
		},
		{
			名称 = "神兜兜",
			备注 = "神兜兜1-20个",
			说明 = "神兜兜1-20个"
		},
		中奖 = 中奖
	}
end

function 商店处理类:刷新珍品()
	local 等级范围 = {
		5,
		7,
		6,
		8,
		5,
		6
	}

	for n = 21, 23 do
		self.商品列表[n] = {}

		for i = 1, 取随机数(25, 25) do
			local 等级 = 等级范围[取随机数(1, #等级范围)]
			local 名称 = 取随机装备名称(等级)
			local 价格 = 0

			if 等级 == 5 then
				价格 = 10000
			elseif 等级 == 6 then
				价格 = 50000
			elseif 等级 == 7 then
				价格 = 100000
			elseif 等级 >= 8 then
				价格 = 150000
			end

			self.商品列表[n][i] = 名称 .. "*" .. 价格
		end
	end
end

function 商店处理类:设置仙玉神秘宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 561)
	local 说明 = ""

	if 奖励 <= 30 then
		中奖 = 23
	elseif 奖励 <= 60 then
		中奖 = 5
	elseif 奖励 <= 90 then
		中奖 = 15
	elseif 奖励 <= 140 then
		中奖 = 11
	elseif 奖励 <= 180 then
		中奖 = 10
	elseif 奖励 <= 220 then
		中奖 = 6
	elseif 奖励 <= 260 then
		中奖 = 13
	elseif 奖励 <= 300 then
		中奖 = 12
	elseif 奖励 <= 340 then
		中奖 = 3
	elseif 奖励 <= 380 then
		中奖 = 7
	elseif 奖励 <= 420 then
		中奖 = 1
	elseif 奖励 <= 450 then
		中奖 = 22
	elseif 奖励 <= 480 then
		中奖 = 8
	elseif 奖励 <= 500 then
		中奖 = 18
	elseif 奖励 <= 510 then
		中奖 = 2
	elseif 奖励 <= 525 then
		中奖 = 14
	elseif 奖励 <= 529 then
		中奖 = 16
	elseif 奖励 <= 532 then
		中奖 = 19
	elseif 奖励 <= 542 then
		中奖 = 20
	elseif 奖励 <= 550 then
		中奖 = 17
	elseif 奖励 <= 554 then
		中奖 = 9
	elseif 奖励 <= 558 then
		中奖 = 4
	elseif 奖励 <= 560 then
		中奖 = 21
	elseif 奖励 <= 561 then
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "星辉石",
			备注 = "随机11-14级宝石",
			说明 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		},
		{
			名称 = "100点卡",
			备注 = "100点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "光芒石",
			备注 = "随机11-16级宝石",
			说明 = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "高级武器",
			备注 = "随机160级本角色使用武器，属性偏高。",
			说明 = "随机160级本角色使用武器，属性偏高。"
		},
		{
			名称 = "储备",
			备注 = "获得一亿的储备金",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "太阳石",
			备注 = "随机11-16级宝石",
			说明 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "舍利子",
			备注 = "随机11-16级宝石",
			说明 = "佛的舍利子是合成装备的神秘材料。"
		},
		{
			名称 = "超级金柳露",
			备注 = "超级金柳露",
			说明 = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。"
		},
		{
			名称 = "高级装备",
			备注 = "随机160级本角色使用装备，属性偏高。",
			说明 = "随机160级本角色使用装备，属性偏高。"
		},
		{
			名称 = "黑宝石",
			备注 = "随机11-16级宝石",
			说明 = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		},
		{
			名称 = "储备",
			备注 = "获得一亿的储备金。",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "月亮石",
			备注 = "随机11-16级宝石",
			说明 = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "红玛瑙",
			备注 = "随机11-16级宝石",
			说明 = "红色的玛瑙石，是合成装备的神秘材料。"
		},
		{
			名称 = "120点卡",
			备注 = "120点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "随机法宝",
			备注 = "随机获得一个一级法宝。",
			说明 = "随机一级法宝。"
		},
		{
			名称 = "200点卡",
			备注 = "200点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "武器",
			备注 = "随机160级本角色使用武器。",
			说明 = "随机160级本角色使用武器。"
		},
		{
			名称 = "高级兽决",
			备注 = "随机高级兽诀或特殊魔兽要诀一本。",
			说明 = "随机高级兽诀或特殊魔兽要诀一本。"
		},
		{
			名称 = "500点卡",
			备注 = "500点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "装备",
			备注 = "随机获取160级装备一件。",
			说明 = "随机160级本角色使用装备。"
		},
		{
			名称 = "1000点卡",
			备注 = "1000点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "金砖",
			备注 = "5000W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "仙丹",
			备注 = "一亿点经验",
			说明 = "获得一定量的经验。"
		},
		{
			名称 = "2000点卡",
			备注 = "2000点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		中奖 = 中奖
	}
end

function 商店处理类:设置海啸仙玉神秘宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 561)
	local 说明 = ""

	if 奖励 <= 30 then
		中奖 = 23
	elseif 奖励 <= 60 then
		中奖 = 5
	elseif 奖励 <= 90 then
		中奖 = 15
	elseif 奖励 <= 140 then
		中奖 = 11
	elseif 奖励 <= 180 then
		中奖 = 10
	elseif 奖励 <= 220 then
		中奖 = 6
	elseif 奖励 <= 260 then
		中奖 = 13
	elseif 奖励 <= 300 then
		中奖 = 12
	elseif 奖励 <= 340 then
		中奖 = 3
	elseif 奖励 <= 380 then
		中奖 = 7
	elseif 奖励 <= 420 then
		中奖 = 1
	elseif 奖励 <= 450 then
		中奖 = 22
	elseif 奖励 <= 455 then
		中奖 = 8
	elseif 奖励 <= 480 then
		中奖 = 18
	elseif 奖励 <= 510 then
		中奖 = 2
	elseif 奖励 <= 525 then
		中奖 = 14
	elseif 奖励 <= 529 then
		中奖 = 16
	elseif 奖励 <= 555 then
		中奖 = 19
	elseif 奖励 <= 556 then
		中奖 = 20
	elseif 奖励 <= 557 then
		中奖 = 17
	elseif 奖励 <= 558 then
		中奖 = 9
	elseif 奖励 <= 559 then
		中奖 = 4
	elseif 奖励 <= 560 then
		中奖 = 21
	elseif 奖励 <= 561 then
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "星辉石",
			备注 = "随机5-12级宝石",
			说明 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		},
		{
			名称 = "百炼精铁",
			备注 = "140级随机书铁",
			说明 = "140级随机书铁"
		},
		{
			名称 = "光芒石",
			备注 = "随机5-12级宝石",
			说明 = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "高级武器",
			备注 = "随机160级本角色使用武器，属性偏高。",
			说明 = "随机160级本角色使用武器，属性偏高。"
		},
		{
			名称 = "储备",
			备注 = "获得一亿的储备金",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "太阳石",
			备注 = "随机11-16级宝石",
			说明 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "舍利子",
			备注 = "随机11-16级宝石",
			说明 = "佛的舍利子是合成装备的神秘材料。"
		},
		{
			名称 = "神兜兜",
			备注 = "获得一个或者99个神兜兜",
			说明 = "获得一个或者99个神兜兜"
		},
		{
			名称 = "高级装备",
			备注 = "随机160级本角色使用装备，属性偏高。",
			说明 = "随机160级本角色使用装备，属性偏高。"
		},
		{
			名称 = "黑宝石",
			备注 = "随机5-12级宝石",
			说明 = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		},
		{
			名称 = "魔兽残卷",
			备注 = "获得3个魔兽残卷",
			说明 = "获得3个魔兽残卷"
		},
		{
			名称 = "月亮石",
			备注 = "随机5-12级宝石",
			说明 = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "红玛瑙",
			备注 = "随机5-12级宝石",
			说明 = "红色的玛瑙石，是合成装备的神秘材料。"
		},
		{
			名称 = "制造指南书",
			备注 = "150级随机书铁",
			说明 = "150级随机书铁"
		},
		{
			名称 = "随机法宝",
			备注 = "随机获得一个一级法宝。",
			说明 = "随机一级法宝。"
		},
		{
			名称 = "20点卡",
			备注 = "20点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "武器",
			备注 = "随机160级本角色使用武器。",
			说明 = "随机160级本角色使用武器。"
		},
		{
			名称 = "高级兽决",
			备注 = "随机高级兽诀或特殊魔兽要诀一本。",
			说明 = "随机高级兽诀或特殊魔兽要诀一本。"
		},
		{
			名称 = "50点卡",
			备注 = "50点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "装备",
			备注 = "随机获取160级装备一件。",
			说明 = "随机160级本角色使用装备。"
		},
		{
			名称 = "100点卡",
			备注 = "100点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "金砖",
			备注 = "5000W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "仙丹",
			备注 = "一亿点经验",
			说明 = "获得一定量的经验。"
		},
		{
			名称 = "200点卡",
			备注 = "200点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		中奖 = 中奖
	}
end

function 商店处理类:设置钥匙神秘宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 1000)
	local 说明 = ""

	if 奖励 <= 30 then
		中奖 = 1
	elseif 奖励 <= 170 then
		中奖 = 2
	elseif 奖励 <= 210 then
		中奖 = 3
	elseif 奖励 <= 215 then
		中奖 = 4
	elseif 奖励 <= 245 then
		中奖 = 5
	elseif 奖励 <= 285 then
		中奖 = 6
	elseif 奖励 <= 325 then
		中奖 = 7
	elseif 奖励 <= 425 then
		中奖 = 8
	elseif 奖励 <= 430 then
		中奖 = 9
	elseif 奖励 <= 470 then
		中奖 = 10
	elseif 奖励 <= 510 then
		中奖 = 11
	elseif 奖励 <= 550 then
		中奖 = 12
	elseif 奖励 <= 590 then
		中奖 = 13
	elseif 奖励 <= 690 then
		中奖 = 14
	elseif 奖励 <= 700 then
		中奖 = 15
	elseif 奖励 <= 740 then
		中奖 = 16
	elseif 奖励 <= 750 then
		中奖 = 17
	elseif 奖励 <= 850 then
		中奖 = 18
	elseif 奖励 <= 880 then
		中奖 = 19
	elseif 奖励 <= 890 then
		中奖 = 20
	elseif 奖励 <= 920 then
		中奖 = 21
	elseif 奖励 <= 940 then
		中奖 = 22
	elseif 奖励 <= 980 then
		中奖 = 23
	else
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "星辉石",
			备注 = "随机3-10级宝石",
			说明 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		},
		{
			名称 = "200点卡",
			备注 = "200点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "光芒石",
			备注 = "随机4-12级宝石",
			说明 = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "高级武器",
			备注 = "随机160级本角色使用武器。",
			说明 = "随机160级本角色使用武器。"
		},
		{
			名称 = "储备",
			备注 = "获得6666W的储备金",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "太阳石",
			备注 = "随机4-12级宝石",
			说明 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "舍利子",
			备注 = "随机4-12级宝石",
			说明 = "佛的舍利子是合成装备的神秘材料。"
		},
		{
			名称 = "超级金柳露",
			备注 = "超级金柳露",
			说明 = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。"
		},
		{
			名称 = "高级装备",
			备注 = "随机160级本角色使用装备。",
			说明 = "随机160级本角色使用装备。"
		},
		{
			名称 = "黑宝石",
			备注 = "随机4-12级宝石",
			说明 = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		},
		{
			名称 = "储备",
			备注 = "获得6666W的储备金。",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "月亮石",
			备注 = "随机4-12级宝石",
			说明 = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "红玛瑙",
			备注 = "随机4-12级宝石",
			说明 = "红色的玛瑙石，是合成装备的神秘材料。"
		},
		{
			名称 = "300点卡",
			备注 = "300点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "随机法宝",
			备注 = "随机获得一个一级法宝。",
			说明 = "随机一级法宝。"
		},
		{
			名称 = "400点卡",
			备注 = "400点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "武器",
			备注 = "随机150级本角色使用武器。",
			说明 = "随机150级本角色使用武器。"
		},
		{
			名称 = "高级兽决",
			备注 = "随机高级兽诀一本。",
			说明 = "随机高级兽诀一本。"
		},
		{
			名称 = "600点卡",
			备注 = "600点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "装备",
			备注 = "随机获取150级装备一件。",
			说明 = "随机150级本角色使用装备。"
		},
		{
			名称 = "1000点卡",
			备注 = "1000点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "金砖",
			备注 = "4000W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "仙丹",
			备注 = "4000W点经验",
			说明 = "获得一定量的经验。"
		},
		{
			名称 = "2500点卡",
			备注 = "2500点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		中奖 = 中奖
	}
end

function 商店处理类:设置老唐宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 1000)
	local 说明 = ""

	if 奖励 <= 10 then
		中奖 = 1
	elseif 奖励 <= 15 then
		中奖 = 2
	elseif 奖励 <= 16 then
		中奖 = 3
	elseif 奖励 <= 316 then
		中奖 = 4
	elseif 奖励 <= 416 then
		中奖 = 5
	elseif 奖励 <= 426 then
		中奖 = 6
	elseif 奖励 <= 431 then
		中奖 = 7
	elseif 奖励 <= 436 then
		中奖 = 8
	elseif 奖励 <= 438 then
		中奖 = 9
	elseif 奖励 <= 439 then
		中奖 = 10
	elseif 奖励 <= 444 then
		中奖 = 11
	elseif 奖励 <= 454 then
		中奖 = 12
	elseif 奖励 <= 504 then
		中奖 = 13
	elseif 奖励 <= 507 then
		中奖 = 14
	elseif 奖励 <= 512 then
		中奖 = 15
	elseif 奖励 <= 562 then
		中奖 = 16
	elseif 奖励 <= 612 then
		中奖 = 17
	elseif 奖励 <= 712 then
		中奖 = 18
	elseif 奖励 <= 812 then
		中奖 = 19
	elseif 奖励 <= 817 then
		中奖 = 20
	elseif 奖励 <= 818 then
		中奖 = 21
	elseif 奖励 <= 828 then
		中奖 = 22
	elseif 奖励 <= 978 then
		中奖 = 23
	else
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "10点卡",
			备注 = "10点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "50点卡",
			备注 = "50点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "100点卡",
			备注 = "100点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "金砖1",
			备注 = "500W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "金砖2",
			备注 = "1000W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "160级装备礼包",
			备注 = "160级装备礼包",
			说明 = "内含一套160级无级别装备,属性随机。"
		},
		{
			名称 = "150级装备礼包",
			备注 = "150级装备礼包",
			说明 = "内含一套150级无级别装备,属性随机。"
		},
		{
			名称 = "星辉石",
			备注 = "星辉石",
			说明 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "九转金丹",
			备注 = "500品九转金丹",
			说明 = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "元灵晶石",
			备注 = "元灵晶石。",
			说明 = "140级元灵晶石。"
		},
		{
			名称 = "灵饰指南书",
			备注 = "灵饰指南书。",
			说明 = "140级灵饰指南书。"
		},
		{
			名称 = "融合石",
			备注 = "融合石",
			说明 = "具有神秘而强大的力量，可在熔合失败时保护装备不会损坏。"
		},
		{
			名称 = "观照万象",
			备注 = "观照万象。",
			说明 = "特殊兽决观照万象。"
		},
		{
			名称 = "特殊兽诀",
			备注 = "特殊兽诀",
			说明 = "获得特殊兽诀一本。"
		},
		{
			名称 = "随机5级宝石",
			备注 = "随机5级宝石",
			说明 = "随机5级宝石"
		},
		{
			名称 = "高级兽决",
			备注 = "高级兽决",
			说明 = "随机高级魔兽要诀一本。"
		},
		中奖 = 中奖
	}
end

function 商店处理类:设置钥匙星级神秘宝箱(id)
	神秘宝箱[id] = {}
	local 名称 = ""
	local 参数 = {}
	local 备注 = ""
	local 奖励 = 取随机数(1, 561)
	local 说明 = ""

	if 奖励 <= 30 then
		中奖 = 23
	elseif 奖励 <= 60 then
		中奖 = 5
	elseif 奖励 <= 90 then
		中奖 = 15
	elseif 奖励 <= 140 then
		中奖 = 11
	elseif 奖励 <= 180 then
		中奖 = 10
	elseif 奖励 <= 220 then
		中奖 = 6
	elseif 奖励 <= 260 then
		中奖 = 13
	elseif 奖励 <= 300 then
		中奖 = 12
	elseif 奖励 <= 340 then
		中奖 = 3
	elseif 奖励 <= 380 then
		中奖 = 7
	elseif 奖励 <= 420 then
		中奖 = 1
	elseif 奖励 <= 450 then
		中奖 = 22
	elseif 奖励 <= 480 then
		中奖 = 8
	elseif 奖励 <= 500 then
		中奖 = 18
	elseif 奖励 <= 510 then
		中奖 = 2
	elseif 奖励 <= 525 then
		中奖 = 14
	elseif 奖励 <= 529 then
		中奖 = 16
	elseif 奖励 <= 532 then
		中奖 = 19
	elseif 奖励 <= 542 then
		中奖 = 20
	elseif 奖励 <= 550 then
		中奖 = 17
	elseif 奖励 <= 554 then
		中奖 = 9
	elseif 奖励 <= 558 then
		中奖 = 4
	elseif 奖励 <= 560 then
		中奖 = 21
	elseif 奖励 <= 561 then
		中奖 = 24
	end

	神秘宝箱[id] = {
		{
			名称 = "星辉石",
			备注 = "随机11-14级宝石",
			说明 = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		},
		{
			名称 = "100点卡",
			备注 = "100点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "光芒石",
			备注 = "随机11-16级宝石",
			说明 = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "高级武器",
			备注 = "随机160级本角色使用武器，属性偏高。",
			说明 = "随机160级本角色使用武器，属性偏高。"
		},
		{
			名称 = "储备",
			备注 = "获得一亿的储备金",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "太阳石",
			备注 = "随机11-16级宝石",
			说明 = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "舍利子",
			备注 = "随机11-16级宝石",
			说明 = "佛的舍利子是合成装备的神秘材料。"
		},
		{
			名称 = "超级金柳露",
			备注 = "超级金柳露",
			说明 = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效。可以把怪物变成0级，是用来炼妖的神奇物品。"
		},
		{
			名称 = "高级装备",
			备注 = "随机160级本角色使用装备，属性偏高。",
			说明 = "随机160级本角色使用装备，属性偏高。"
		},
		{
			名称 = "黑宝石",
			备注 = "随机11-16级宝石",
			说明 = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		},
		{
			名称 = "储备",
			备注 = "获得一亿的储备金。",
			说明 = "获得一定量的储备。"
		},
		{
			名称 = "月亮石",
			备注 = "随机11-16级宝石",
			说明 = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		},
		{
			名称 = "红玛瑙",
			备注 = "随机11-16级宝石",
			说明 = "红色的玛瑙石，是合成装备的神秘材料。"
		},
		{
			名称 = "120点卡",
			备注 = "120点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "随机法宝",
			备注 = "随机获得一个一级法宝。",
			说明 = "随机一级法宝。"
		},
		{
			名称 = "200点卡",
			备注 = "200点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "武器",
			备注 = "随机160级本角色使用武器。",
			说明 = "随机160级本角色使用武器。"
		},
		{
			名称 = "高级兽决",
			备注 = "随机高级兽诀或特殊魔兽要诀一本。",
			说明 = "随机高级兽诀或特殊魔兽要诀一本。"
		},
		{
			名称 = "500点卡",
			备注 = "500点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "装备",
			备注 = "随机获取160级装备一件。",
			说明 = "随机160级本角色使用装备。"
		},
		{
			名称 = "1000点卡",
			备注 = "1000点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		{
			名称 = "金砖",
			备注 = "5000W两银子",
			说明 = "获得一定量的银子。"
		},
		{
			名称 = "仙丹",
			备注 = "一亿点经验",
			说明 = "获得一定量的经验。"
		},
		{
			名称 = "2000点卡",
			备注 = "2000点点卡",
			说明 = "经典点卡，可兑换一定的仙玉。"
		},
		中奖 = 中奖
	}
end

function 商店处理类:更新(dt)
end

function 商店处理类:显示(x, y)
end

return 商店处理类
