local 商城处理类 = class()

function 商城处理类:初始化()
	self.购买组号 = nil
	self.购买编号 = nil
	self.购买数量 = nil
	self.购买分类 = nil
end

function 商城处理类:加载商品()
	self.商品组 = {
		[18] = {
			杂货 = {},
			仙玉 = {},
			积分 = {},
			折扣 = {},
			宝宝 = {},
			法宝 = {},
			锦衣祥瑞 = {},
			锦衣 = {},
			祥瑞 = {},
			足迹 = {},
			足印 = {},
			比武积分 = {},
			种族积分 = {},
			副本积分 = {},
			妖魔积分 = {},
			军功 = {},
		},
		[19] = {
			活跃兑换 = {}
		}
	}

	if 单机设置 then
		self.商品组[18].杂货 = {
			{
				名称 = "海马",
				价格 = 300000,
				可叠加 = true
			},
			{
				名称 = "分解符",
				价格 = 50000,
				可叠加 = true
			},
			{
				子类 = 9,
				分类 = 6,
				价格 = 3000000,
				名称 = "钨金",
				总类 = 5,
				可叠加 = false
			},
			{
				子类 = 1,
				分类 = 4,
				价格 = 10000,
				名称 = "青龙石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 2,
				分类 = 4,
				价格 = 10000,
				名称 = "白虎石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 3,
				分类 = 4,
				价格 = 10000,
				名称 = "朱雀石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 4,
				分类 = 4,
				价格 = 10000,
				名称 = "玄武石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "光芒石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 2,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "月亮石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 3,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "太阳石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 4,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "舍利子",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 5,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "红玛瑙",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 6,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "黑宝石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 7,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "神秘石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 1,
				分类 = 6,
				价格 = 100000,
				名称 = "昆仑玉",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "光芒石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 2,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "月亮石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 3,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "太阳石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 4,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "舍利子",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 5,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "红玛瑙",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 6,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "黑宝石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 7,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "神秘石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 5,
				分类 = 6,
				价格 = 1600000,
				名称 = "昆仑玉",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "光芒石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 2,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "月亮石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 3,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "太阳石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 4,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "舍利子",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 5,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "红玛瑙",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 6,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "黑宝石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 7,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "神秘石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 10,
				分类 = 6,
				价格 = 51200000,
				名称 = "昆仑玉",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "光芒石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 2,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "月亮石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 3,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "太阳石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 4,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "舍利子",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 5,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "红玛瑙",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 6,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "黑宝石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 7,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "神秘石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 15,
				分类 = 6,
				价格 = 1638400000,
				名称 = "昆仑玉",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 1,
				分类 = 6,
				价格 = 10000,
				名称 = "星辉石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 5,
				分类 = 6,
				价格 = 10000*3^4,
				名称 = "星辉石",
				总类 = 5,
				可叠加 = true
			},
			{
				子类 = 1001,
				级别限制 = 10,
				分类 = 6,
				价格 = 10000*3^9,
				名称 = "星辉石",
				总类 = 5,
				可叠加 = true
			},
			{
				"仙玉商城",
				"心源",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 2000000,
				名称 = "钟灵石",
				附加特性 = "心源",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"狂浪滔天",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "狂浪滔天",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"固若金汤",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "固若金汤",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"锐不可当",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "锐不可当",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"通真达灵",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "通真达灵",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"血气方刚",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "血气方刚",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"健步如飞",
				子类 = 8,
				级别限制 = 1,
				分类 = 6,
				价格 = 1000000,
				名称 = "钟灵石",
				附加特性 = "健步如飞",
				总类 = 5,
				可叠加 = false
			},
			-- {
			-- 	名称 = "30级制造指南书",
			-- 	价格 = 30000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "30级百炼精铁",
			-- 	价格 = 30000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "40级制造指南书",
			-- 	价格 = 40000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "40级百炼精铁",
			-- 	价格 = 40000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "50级制造指南书",
			-- 	价格 = 60000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "50级百炼精铁",
			-- 	价格 = 60000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "60级制造指南书",
			-- 	价格 = 600000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "60级百炼精铁",
			-- 	价格 = 300000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "70级制造指南书",
			-- 	价格 = 700000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "70级百炼精铁",
			-- 	价格 = 350000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "80级制造指南书",
			-- 	价格 = 800000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "80级百炼精铁",
			-- 	价格 = 400000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "90级制造指南书",
			-- 	价格 = 2700000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "90级百炼精铁",
			-- 	价格 = 1350000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	灵气 = 50,
			-- 	分类 = 11,
			-- 	价格 = 10000,
			-- 	名称 = "九眼天珠",
			-- 	级别限制 = 45,
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	灵气 = 60,
			-- 	分类 = 11,
			-- 	价格 = 80000,
			-- 	名称 = "九眼天珠",
			-- 	级别限制 = 65,
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	灵气 = 70,
			-- 	分类 = 11,
			-- 	价格 = 150000,
			-- 	名称 = "九眼天珠",
			-- 	级别限制 = 85,
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	灵气 = 80,
			-- 	分类 = 11,
			-- 	价格 = 250000,
			-- 	名称 = "九眼天珠",
			-- 	级别限制 = 105,
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	灵气 = 90,
			-- 	分类 = 11,
			-- 	价格 = 450000,
			-- 	名称 = "九眼天珠",
			-- 	级别限制 = 135,
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			{
				子类 = 1,
				灵气 = 100,
				分类 = 11,
				价格 = 600000,
				名称 = "九眼天珠",
				级别限制 = 155,
				总类 = 3,
				可叠加 = false
			},
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 45,
			-- 	分类 = 10,
			-- 	价格 = 300000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 45,
			-- 	分类 = 10,
			-- 	价格 = 300000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 45,
			-- 	分类 = 10,
			-- 	价格 = 300000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 55,
			-- 	分类 = 10,
			-- 	价格 = 600000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 55,
			-- 	分类 = 10,
			-- 	价格 = 600000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 55,
			-- 	分类 = 10,
			-- 	价格 = 600000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 65,
			-- 	分类 = 10,
			-- 	价格 = 1000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 65,
			-- 	分类 = 10,
			-- 	价格 = 1000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 65,
			-- 	分类 = 10,
			-- 	价格 = 1000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 75,
			-- 	分类 = 10,
			-- 	价格 = 135000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 75,
			-- 	分类 = 10,
			-- 	价格 = 135000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 75,
			-- 	分类 = 10,
			-- 	价格 = 135000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 85,
			-- 	分类 = 10,
			-- 	价格 = 2050000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 85,
			-- 	分类 = 10,
			-- 	价格 = 2050000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 85,
			-- 	分类 = 10,
			-- 	价格 = 2050000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 95,
			-- 	分类 = 10,
			-- 	价格 = 4000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 95,
			-- 	分类 = 10,
			-- 	价格 = 4000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 95,
			-- 	分类 = 10,
			-- 	价格 = 4000000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 105,
			-- 	分类 = 10,
			-- 	价格 = 7500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 105,
			-- 	分类 = 10,
			-- 	价格 = 7500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 105,
			-- 	分类 = 10,
			-- 	价格 = 7500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 115,
			-- 	分类 = 10,
			-- 	价格 = 11500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "护腕",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 115,
			-- 	分类 = 10,
			-- 	价格 = 11500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "项圈",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	子类 = 1,
			-- 	级别限制 = 115,
			-- 	分类 = 10,
			-- 	价格 = 11500000,
			-- 	名称 = "上古锻造图策",
			-- 	种类 = "铠甲",
			-- 	总类 = 3,
			-- 	可叠加 = false
			-- },
			{
				子类 = 1,
				级别限制 = 155,
				分类 = 10,
				价格 = 15000000,
				名称 = "上古锻造图策",
				种类 = "护腕",
				总类 = 3,
				可叠加 = false
			},
			{
				子类 = 1,
				级别限制 = 155,
				分类 = 10,
				价格 = 15000000,
				名称 = "上古锻造图策",
				种类 = "项圈",
				总类 = 3,
				可叠加 = false
			},
			{
				子类 = 1,
				级别限制 = 155,
				分类 = 10,
				价格 = 15000000,
				名称 = "上古锻造图策",
				种类 = "铠甲",
				总类 = 3,
				可叠加 = false
			},
			{
				名称 = "100级装备礼包",
				价格 = 12000000,
				数量 = 1,
				可叠加 = false
			},
			{
				名称 = "120级装备礼包",
				价格 = 24000000,
				数量 = 1,
				可叠加 = true
			},
			{
				名称 = "140级装备礼包",
				价格 = 36000000,
				数量 = 1,
				可叠加 = true
			},
			{
				名称 = "60级灵饰礼包",
				价格 = 5000000,
				可叠加 = false
			},
			{
				名称 = "80级灵饰礼包",
				价格 = 10000000,
				可叠加 = false
			},
			{
				子类 = 1,
				阶品 = 13333,
				分类 = 4,
				价格 = 1999999,
				名称 = "珍露酒",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = 1,
				阶品 = 13333,
				分类 = 1,
				价格 = 1999999,
				名称 = "九转回魂丹",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = 1,
				阶品 = 13333,
				分类 = 1,
				价格 = 1999999,
				名称 = "五龙丹",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = 1,
				阶品 = 13333,
				分类 = 1,
				价格 = 1999999,
				名称 = "金香玉",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = 1,
				阶品 = 13333,
				分类 = 1,
				价格 = 199999,
				名称 = "风水混元丹",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = "天覆阵",
				价格 = 1000000,
				名称 = "鬼谷子",
				总类 = 13,
				可叠加 = true
			},
			{
				名称 = "鬼谷子",
				价格 = 1000000,
				数量 = 1,
				可叠加 = false
			},
			{
				"魔兽要诀",
				名称 = "魔兽要诀",
				价格 = 199999,
				可叠加 = false
			},
			{--不常用，放到后面
				名称 = "回收符",
				价格 = 10000,
				可叠加 = false
			},
			{--不常用，放到后面
				名称 = "灵箓",
				价格 = 500000,
				可叠加 = true
			},
			{--不常用，放到后面
				名称 = "碎星锤",
				价格 = 500000,
				可叠加 = false
			},
			{--不常用，放到后面
				名称 = "超级碎星锤",
				价格 = 1000000,
				可叠加 = false
			},
			{
				耐久 = 100,
				分类 = 100,
				价格 = 100000,
				名称 = "顺逆神针",
				总类 = 2000,
				可叠加 = false
			},
			{--不常用，放到后面
				名称 = "月华露",
				价格 = 50000,
				阶品 = 50,
				可叠加 = true
			},
			{
				名称 = "易经丹",
				价格 = 500000,
				可叠加 = true
			},
			{
				名称 = "玉葫灵髓",
				价格 = 1000000,
				可叠加 = true
			},
			{
				名称 = "储灵袋",
				价格 = 5000000,
				可叠加 = true
			},
			{
				名称 = "清灵净瓶",
				价格 = 1000000,
				可叠加 = true
			},
			{
				子类 = 160,
				分类 = 2,
				价格 = 100000,
				名称 = "神兵图鉴",
				总类 = 4,
				可叠加 = true
			},
			{
				子类 = 160,
				分类 = 2,
				价格 = 100000,
				名称 = "灵宝图鉴",
				总类 = 4,
				可叠加 = true
			},
			{
				子类 = 0,
				价格 = 100000,
				名称 = "金柳露",
				总类 = 3,
				可叠加 = true
			},
			{
				名称 = "桂花丸",
				价格 = 1000000,
				阶品 = 1000,
				可叠加 = true
			},
			{
				名称 = "人参果",
				价格 = 1000000,
				可叠加 = true
			},
			{
				名称 = "飞行符",
				价格 = 1000,
				可叠加 = true
			},
			{
				名称 = "摄妖香",
				价格 = 500,
				可叠加 = true
			},
			-- {
			-- 	名称 = "1号助战装备礼包",
			-- 	价格 = 100000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "2号助战装备礼包",
			-- 	价格 = 100000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "3号助战装备礼包",
			-- 	价格 = 100000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "4号助战装备礼包",
			-- 	价格 = 100000,
			-- 	可叠加 = false
			-- },
			-- {
			-- 	名称 = "30级装备礼包",
			-- 	价格 = 100000,
			-- 	可叠加 = false
			-- },
		}
	else
		self.商品组[18].杂货 = {
			{
				地图 = 1001,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "红色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 312,
						y = 7
					},
					[2] = {
						x = 495,
						y = 11
					},
					[5] = {
						x = 12,
						y = 273
					},
					[3] = {
						x = 12,
						y = 273
					},
					[7] = {
						x = 192,
						y = 105
					},
					[4] = {
						x = 362,
						y = 167
					},
					[6] = {
						x = 277,
						y = 240
					},
					[8] = {
						x = 413,
						y = 68
					},
					[9] = {
						x = 465,
						y = 124
					},
					[10] = {
						x = 379,
						y = 19
					},
					[11] = {
						x = 290,
						y = 85
					},
					[12] = {
						x = 481,
						y = 181
					},
					[13] = {
						x = 472,
						y = 251
					},
					[14] = {
						x = 145,
						y = 81
					},
					[15] = {
						x = 106,
						y = 48
					},
					[16] = {
						x = 442,
						y = 37
					},
					[17] = {
						x = 170,
						y = 148
					},
					[18] = {
						x = 519,
						y = 131
					},
					[19] = {
						x = 326,
						y = 268
					},
					[20] = {
						x = 173,
						y = 252
					},
					[21] = {
						x = 222,
						y = 244
					},
					[22] = {
						x = 414,
						y = 227
					},
					[23] = {
						x = 25,
						y = 218
					},
					[24] = {
						x = 371,
						y = 243
					},
					[25] = {
						x = 255,
						y = 177
					},
					[26] = {
						x = 434,
						y = 163
					}
				}
			},
			{
				地图 = 1501,
				分类 = 2,
				价格 = 50000,
				x = 212,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "白色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 122,
						y = 18
					},
					{
						x = 234,
						y = 17
					},
					{
						x = 265,
						y = 113
					},
					{
						x = 175,
						y = 120
					},
					{
						x = 103,
						y = 79
					},
					{
						x = 17,
						y = 134
					},
					{
						x = 65,
						y = 42
					},
					{
						x = 179,
						y = 69
					},
					{
						x = 45,
						y = 70
					},
					{
						x = 226,
						y = 139
					},
					{
						x = 64,
						y = 133
					},
					{
						x = 202,
						y = 110
					}
				}
			},
			{
				地图 = 1070,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "黄色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 105,
						y = 17
					},
					{
						x = 139,
						y = 193
					},
					{
						x = 94,
						y = 91
					},
					{
						x = 31,
						y = 130
					},
					{
						x = 91,
						y = 192
					},
					{
						x = 88,
						y = 141
					},
					{
						x = 67,
						y = 109
					},
					{
						x = 50,
						y = 70
					},
					{
						x = 38,
						y = 185
					},
					{
						x = 122,
						y = 143
					}
				}
			},
			{
				地图 = 1092,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "绿色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 14,
						y = 11
					},
					{
						x = 206,
						y = 12
					},
					{
						x = 78,
						y = 98
					},
					{
						x = 150,
						y = 135
					},
					{
						x = 118,
						y = 58
					},
					{
						x = 182,
						y = 124
					},
					{
						x = 124,
						y = 112
					},
					{
						x = 59,
						y = 113
					},
					{
						x = 35,
						y = 81
					}
				}
			},
			{
				地图 = 1208,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "蓝色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 141,
						y = 24
					},
					{
						x = 17,
						y = 24
					},
					{
						x = 12,
						y = 109
					},
					{
						x = 91,
						y = 61
					},
					{
						x = 181,
						y = 91
					},
					{
						x = 148,
						y = 107
					},
					{
						x = 85,
						y = 25
					}
				}
			},
			{
				地图 = 1110,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "黄色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 243,
						y = 276
					},
					{
						x = 35,
						y = 258
					},
					{
						x = 134,
						y = 156
					},
					{
						x = 44,
						y = 14
					},
					{
						x = 285,
						y = 55
					},
					{
						x = 40,
						y = 129
					},
					{
						x = 200,
						y = 94
					}
				}
			},
			{
				地图 = 1173,
				分类 = 2,
				价格 = 50000,
				x = 312,
				次数 = 99,
				子类 = 50,
				y = 7,
				名称 = "蓝色合成旗",
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 370,
						y = 105
					},
					{
						x = 626,
						y = 45
					},
					{
						x = 584,
						y = 93
					},
					{
						x = 531,
						y = 11
					},
					{
						x = 237,
						y = 69
					},
					{
						x = 230,
						y = 16
					},
					{
						x = 61,
						y = 13
					},
					{
						x = 17,
						y = 27
					},
					{
						x = 13,
						y = 64
					},
					{
						x = 27,
						y = 101
					}
				}
			},
			{
				地图 = 1122,
				x = 59,
				分类 = 1,
				价格 = 10000,
				次数 = 30,
				子类 = 50,
				y = 62,
				名称 = "蓝色导标旗",
				总类 = 11,
				可叠加 = false
			},
			{
				地图 = 1003,
				x = 40,
				分类 = 1,
				价格 = 10000,
				次数 = 30,
				子类 = 50,
				y = 18,
				名称 = "白色导标旗",
				总类 = 11,
				可叠加 = false
			},
		}
	end

	if 单机设置 then
		self.商品组[18].仙玉 = {
			{
				名称 = "150级装备礼包",
				价格 = 200000,
				数量 = 1,
				可叠加 = true
		},
			{
				子类 = 3,
				价格 = 10000,
				分类 = 4,
				气血 = 999999999,
				名称 = "秘制红罗羹",
				总类 = 1,
				可叠加 = true
			},
			{
				子类 = 3,
				魔法 = 999999999,
				分类 = 4,
				价格 = 10000,
				名称 = "秘制绿罗羹",
				总类 = 1,
				可叠加 = true
			},
			{
				"仙玉商城",
				"打造符",
				价格 = 8000,
				名称 = "打造符",
				玩家名称 = "系统出品",
				级别限制 = 160,
				可叠加 = true
			},
			{
				"仙玉商城",
				"打造符",
				价格 = 8000,
				名称 = "裁缝符",
				玩家名称 = "系统出品",
				级别限制 = 160,
				可叠加 = true
			},
			{
				"仙玉商城",
				"打造符",
				价格 = 8000,
				名称 = "炼金符",
				玩家名称 = "系统出品",
				级别限制 = 160,
				可叠加 = true
			},
			{
				价格 = 1000,
				名称 = "特效石碎片",
				特效 = "无级别限制",
				数量 = 1,
				可叠加 = true
			},
			{
				"仙玉商城",
				"特效石碎片",
				名称 = "特效石碎片",
				价格 = 50000,
				数量 = 1,
				可叠加 = false
			},
			{
				"仙玉商城",
				"特技石",
				名称 = "特技石",
				价格 = 50000,
				数量 = 1,
				可叠加 = false
			},
			{
				"仙玉商城",
				"五行石",
				名称 = "五行石",
				价格 = 50000,
				可叠加 = true
			},
			{
				"仙玉商城",
				"七彩石",
				名称 = "七彩石",
				价格 = 50000,
				可叠加 = true
			},
			{
				"仙玉商城",
				"属性转换符",
				名称 = "属性转换符",
				价格 = 5000,
				可叠加 = true
			},
			{
				"仙玉商城",
				"通灵重置丹",
				名称 = "通灵重置丹",
				价格 = 500,
				可叠加 = true
			},
			{
				"仙玉商城",
				"通灵重置丹",
				名称 = "高级通灵重置丹",
				价格 = 1500,
				可叠加 = true
			},
			{
				"仙玉商城",
				"通灵重置丹",
				名称 = "超级通灵重置丹",
				价格 = 5000,
				可叠加 = true
			},
			{
				"仙玉商城",
				"通灵神臂",
				次数 = 2,
				子类 = 2,
				分类 = 9,
				价格 = 10000,
				名称 = "通灵神臂",
				总类 = 2,
				级别限制 = 0,
				可叠加 = false
			},
			{
				"仙玉商城",
				"通灵神符",
				次数 = 2,
				子类 = 2,
				分类 = 9,
				价格 = 50000,
				名称 = "通灵神符",
				总类 = 2,
				级别限制 = 0,
				可叠加 = false
			},
			{
				"仙玉商城",
				"通灵神戒",
				次数 = 2,
				子类 = 2,
				分类 = 9,
				价格 = 100000,
				名称 = "通灵神戒",
				总类 = 2,
				级别限制 = 0,
				可叠加 = false
			},
			{
				"仙玉商城",
				"2倍经验丹",
				名称 = "2倍经验丹",
				价格 = 500,
				可叠加 = true
			},
			{
				"仙玉商城",
				"3倍经验丹",
				名称 = "3倍经验丹",
				价格 = 300,
				可叠加 = true
			},
			{
				"仙玉商城",
				"10倍经验丹",
				名称 = "10倍经验丹",
				价格 = 1000,
				可叠加 = true
			},
			{
				"仙玉商城",
				-- "未激活的符石1级",
				名称 = "未激活的符石1级",
				子类 = 1,
				价格 = 5000,
				可叠加 = false
			},
			{
				"仙玉商城",
				-- "未激活的符石2级",
				名称 = "未激活的符石2级",
				子类 = 2,
				价格 = 10000,
				可叠加 = false
			},
			{
				"仙玉商城",
				-- "未激活的符石3级",
				名称 = "未激活的符石3级",
				子类 = 3,
				价格 = 50000,
				可叠加 = false
			},
			{
				"仙玉商城",
				-- "未激活的星石",
				名称 = "未激活的星石",
				价格 = 50000,
				可叠加 = false
			},
			{
				子类 = 6,
				分类 = 2,
				价格 = 500,
				名称 = "符石卷轴",
				总类 = 889,
				可叠加 = true
			},
			{
				名称 = "驾驭宝典",
				价格 = 3000,
				总类 = 5,
				可叠加 = true
			},
			{
				"仙玉商城",
				"坐骑内丹",
				子类 = 1,
				分类 = 1,
				价格 = 5000,
				名称 = "坐骑内丹",
				总类 = 9,
				可叠加 = true
			},
			{
				"仙玉商城",
				"圣兽丹",
				名称 = "圣兽丹",
				价格 = 200,
				可叠加 = true
			},
			{
				子类 = 0,
				分类 = 1,
				价格 = 100000,
				名称 = "宠物饰品通用丹",
				总类 = 680,
				可叠加 = false
			},
			{
				"仙玉商城",
				"点化石",
				子类 = 1,
				分类 = 5,
				价格 = 5000,
				名称 = "点化石",
				总类 = 5,
				可叠加 = false
			},
			{
				"仙玉商城",
				"点化石",
				子类 = 1,
				分类 = 5,
				价格 = 5000,
				名称 = "点化石",
				总类 = 5,
				可叠加 = true
			},
			{
				名称 = "附魔宝珠",
				价格 = 8000,
				可叠加 = true
			},
			{
				名称 = "六艺修行书",
				价格 = 50000,
				可叠加 = true
			},
			{
				名称 = "10技能胚子召唤兽礼包",
				价格 = 100000,
				可叠加 = true
			},
			{
				名称 = "12技能胚子召唤兽礼包",
				价格 = 300000,
				可叠加 = true
			},
			{
				名称 = "14技能胚子召唤兽礼包",
				价格 = 500000,
				可叠加 = true
			},
			{
				名称 = "16技能胚子召唤兽礼包",
				价格 = 1000000,
				可叠加 = true
			},
			{
				名称 = "18技能胚子召唤兽礼包",
				价格 = 1500000,
				可叠加 = true
			},
			{
				名称 = "20技能胚子召唤兽礼包",
				价格 = 3000000,
				可叠加 = true
			},
			{
				名称 = "中秋节卡片",
				价格 = 350000,
				可叠加 = true
			},
			{
				名称 = "中",
				价格 = 880000,
				可叠加 = true
			},
			{
				名称 = "秋",
				价格 = 880000,
				可叠加 = true
			},
			{
				名称 = "节",
				价格 = 880000,
				可叠加 = true
			},
			{
				名称 = "快",
				价格 = 880000,
				可叠加 = true
			},
			{
				名称 = "乐",
				价格 = 880000,
				可叠加 = true
			},
			{
				附带技能 = "观照万象", 
				总类 = 3, 
				子类 = 0, 
				名称 = "特殊魔兽要诀", 
				价格 = 8888888, 
				分类 = 1
			} 
		}
		local 变身卡价格 = {
			100,
			500,
			1000,
			1800,
			1200,
			3905,
			6400,
			12800,
			25600,
			51200
		}

		for i = 1, 10 do
			for n = 1, #变身卡范围[i] do
				local mx = 变身卡范围[i][n]
				self.商品组[18].仙玉[#self.商品组[18].仙玉 + 1] = 列表1合并到列表2(变身卡数据[mx], {
					名称 = "怪物卡片",
					可叠加 = false,
					次数 = 商城变身卡次数,
					造型 = mx,
					价格 = 变身卡价格[i]
				})
			end
		end
	else
		self.商品组[18].仙玉 = {}
		local 变身卡价格 = {}
	end

	self.商品组[18].积分 = 获取商城积分兑换通用商品列表()
	self.商品组[18].比武积分 = 获取商城积分兑换通用商品列表()
	self.商品组[18].种族积分 = 获取商城积分兑换通用商品列表()
	self.商品组[18].副本积分 = 获取商城积分兑换通用商品列表()
	self.商品组[18].妖魔积分 = 获取商城积分兑换通用商品列表()
	self.商品组[18].军功 = {
		{
			名称 = "鬼谷子",
			价格 = 30,
			数量 = 1,
			可叠加 = false
		},
		{
			名称 = "高级魔兽要诀",
			价格 = 50,
			数量 = 1,
			可叠加 = false
		},
		{
			名称 = "特殊魔兽要诀",
			价格 = 200,
			数量 = 1,
			可叠加 = false
		},
		{
			总类 = 2,
			子类 = 2,
			分类 = 9,
			价格 = 150,
			名称 = "通灵神戒",
			次数 = 2,
			级别限制 = 0,
			可叠加 = false
		},
		{
			名称 = "超级通灵重置丹",
			价格 = 80,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "召唤兽内丹",
			价格 = 15,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "高级召唤兽内丹",
			价格 = 30,
			数量 = 1,
			可叠加 = true
		},
		{
			阶品 = 300,
			价格 = 3,
			名称 = "九转金丹",
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "修炼果",
			价格 = 3,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "易经丹",
			价格 = 10,
			数量 = 1,
			可叠加 = true
		},
		{
			价格 = 100,
			名称 = "特效石碎片",
			特效 = "无级别限制",
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "特效石碎片",
			价格 = 50,
			数量 = 1,
			可叠加 = false
		},
		{
			名称 = "五行石",
			价格 = 50,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "七彩石",
			价格 = 50,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "特技石",
			价格 = 50,
			数量 = 1,
			可叠加 = false
		},
		{
			名称 = "属性转换符",
			价格 = 20,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "高级藏宝图",
			价格 = 30,
			数量 = 1,
			可叠加 = false
		},
		{
			子类 = 0,
			级别限制 = 160,
			分类 = 2,
			价格 = 150,
			名称 = "战魄",
			总类 = 67,
			可叠加 = true
		},
		{
			子类 = 0,
			分类 = 3,
			价格 = 50,
			名称 = "陨铁",
			总类 = 65,
			可叠加 = true
		},
		{
			名称 = "150级百炼精铁",
			价格 = 150,
			可叠加 = false
		},
		{
			名称 = "150级制造指南书",
			价格 = 200,
			可叠加 = false
		}
	}
	for n = 2, 4 do
		for i = 1, #法宝列表[n] do
			table.insert(self.商品组[18].军功, self:商城取法宝(法宝列表[n][i], n, true))
		end
	end

	self.商品组[18].折扣 = {
		{
			名称 = "展翅高飞",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "展翅高飞") + 0
		},
		{
			名称 = "旗开得胜",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "旗开得胜") + 0
		},
		{
			名称 = "霸王雄风",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "霸王雄风") + 0
		},
		{
			名称 = "独眼观天",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "独眼观天") + 0
		},
		{
			名称 = "威武不屈",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "威武不屈") + 0
		},
		{
			名称 = "深藏不露",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "深藏不露") + 0
		},
		{
			名称 = "异域浓情",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "异域浓情") + 0
		},
		{
			名称 = "流星天马",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "流星天马") + 0
		},
		{
			名称 = "威猛将军",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "威猛将军") + 0
		},
		{
			名称 = "知情达理",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "知情达理") + 0
		},
		{
			名称 = "气宇轩昂",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "气宇轩昂") + 0
		},
		{
			名称 = "如花似玉",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "如花似玉") + 0
		},
		{
			名称 = "傲视天下",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "傲视天下") + 0
		},
		{
			名称 = "铁血豪情",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "铁血豪情") + 0
		},
		{
			名称 = "唯我独尊",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "唯我独尊") + 0
		},
		{
			名称 = "叱咤风云",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "叱咤风云") + 0
		},
		{
			名称 = "异域风情",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "异域风情") + 0
		},
		{
			名称 = "假面勇者",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "假面勇者") + 0
		},
		{
			名称 = "霓裳魅影",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "霓裳魅影") + 0
		},
		{
			名称 = "披星戴月",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "披星戴月") + 0
		},
		{
			名称 = "烈焰燃情",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "烈焰燃情") + 0
		},
		{
			名称 = "天雨流芳",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "天雨流芳") + 0
		},
		{
			名称 = "灵光再现",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "灵光再现") + 0
		},
		{
			名称 = "倾国倾城",
			总类 = "坐骑饰品",
			可叠加 = false,
			价格 = f函数.读配置(程序目录 .. "功能设置\\" .. "商城价格.ini", "仙玉商城", "倾国倾城") + 0
		}
	}
	self.商品组[18].锦衣祥瑞 = {
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "斗战胜佛",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "斗战胜佛·月白",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "浪淘纱·白",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "化圣战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦1",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦2",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦3",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦4",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦5",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦6",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦7",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦8",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦9",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦10",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦11",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦12",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "战锦13",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "白金箍",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "青花瓷月白",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "花重云",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "水云归墨黑",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "五毒",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "青花瓷战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "飞天舞战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "羽仙歌战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "浪淘纱战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "冰雪玉兔战锦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "花间梦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "鹿角弯弯",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "水云归",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "飞天舞朝露",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "炽云缎墨黑",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "从军行",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "从军行月曜",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "绯雪织凝霜",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "冰寒绡月白",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "蒹葭苍苍寒月",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "浪淘纱墨黑",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "萌萌小厨",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "霞姿月韵",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "雪眸影夜烬",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "夜影",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "官服",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "闲云野鹤",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "明光宝甲",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "化圣",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "渡劫",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 100000,
			名称 = "青花瓷墨黑",
			总类 = 2,
			可叠加 = false
		}
	}
	self.商品组[18].锦衣 = {
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "青花瓷",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "万灵夜游",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "羽仙歌",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "飞天舞",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "碧华锦凝雪",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "黑浪淘纱",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "冰灵蝶翼·月笼沙",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "冰雪玉兔",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "锦绣幻梦",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "浪淘纱",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "浪淘纱·月白",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "铃儿叮当",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "萌狮闹春",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "蜜蜂嗡嗡",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "齐天大圣",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "顽皮小恶魔",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "尖叫男爵",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "夏日清凉黑",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "纤云纱·墨黑",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "雁翎银钩·月笼沙",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "夜影红",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "夜之孤煞",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "萤雪轻裘",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "驭龙猎手",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "重溟软甲",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "竹林熊猫",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "金色羽裳",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "白色鹿帽",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "成亲礼装",
			总类 = 2,
			可叠加 = false
		},
		{
			锦衣 = true,
			子类 = 1,
			分类 = 15,
			价格 = 3000,
			名称 = "雪色锦衣",
			总类 = 2,
			可叠加 = false
		}
	}
	self.商品组[18].祥瑞 = {
		{
			名称 = "种族坐骑礼包",
			价格 = 500000,
			可叠加 = false
		},
		{
			名称 = "祥瑞坐骑礼包",
			价格 = 200000,
			可叠加 = false
		},
		{
			名称 = "神行百变·坐骑礼包",
			价格 = 9999999,
			可叠加 = false
		},
		{
			名称 = "百变坐骑·坐骑礼包",
			价格 = 9999999,
			可叠加 = false
		},
		{
			名称 = "如意符",
			价格 = 1000,
			数量 = 1,
			可叠加 = true
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "蝴蝶兰",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("蝴蝶兰")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "桦木圆桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("桦木圆桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "五谷轮回桶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("五谷轮回桶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "凤凰傲意图",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("凤凰傲意图")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "狮子图屏风",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("狮子图屏风")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "神仙帐",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("神仙帐")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "麻布地毯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("麻布地毯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "虎威太师椅",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("虎威太师椅")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "红木地板",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("红木地板")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "桦木立柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("桦木立柜")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "紫檀马桶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("紫檀马桶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "大理石影壁",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("大理石影壁")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "猛虎坐山图",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("猛虎坐山图")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "榛木床",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("榛木床")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "窗帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("窗帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "福",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("福")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "对联",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("对联")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "横批",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("横批")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "月牙凳",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("月牙凳")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "银烛台",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("银烛台")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "蓝绸绣花帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("蓝绸绣花帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "波丝地毯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("波丝地毯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "千佛图",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("千佛图")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "双鱼吉庆柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("双鱼吉庆柜")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "仙人掌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("仙人掌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "雕花马桶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("雕花马桶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "水仙",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("水仙")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "漆花地板",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("漆花地板")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "花鸟图屏风",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("花鸟图屏风")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "龟鹤延年灯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("龟鹤延年灯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "壮丽山河",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("壮丽山河")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "踏春图",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("踏春图")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "红木八仙桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("红木八仙桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "黑麻垂蔓帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("黑麻垂蔓帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "雕花马桶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("雕花马桶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "漆花竹凳",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("漆花竹凳")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白虎皮地毯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白虎皮地毯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "天山云雪",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("天山云雪")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "桦木靠背椅",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("桦木靠背椅")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "百兽镇邪桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("百兽镇邪桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "八宝呈祥桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("八宝呈祥桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "黄锻锦边帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("黄锻锦边帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "彩绘立柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("彩绘立柜")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "夕阳山水图",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("夕阳山水图")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "兽皮地毯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("兽皮地毯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "麻木地毯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("麻木地毯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "红杏闹春帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("红杏闹春帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "紫檀雕花椅",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("紫檀雕花椅")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "印花屏风",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("印花屏风")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "玉瓷画瓶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("玉瓷画瓶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "嵌玉虎纹桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("嵌玉虎纹桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "招财聚宝柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("招财聚宝柜")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "八卦镇邪塌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("八卦镇邪塌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "龙凤呈祥",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("龙凤呈祥")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "文竹",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("文竹")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "金座雕龙屏风",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("金座雕龙屏风")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "木地板",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("木地板")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "长信女宫灯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("长信女宫灯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "紫檀雕花柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("紫檀雕花柜")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "宁安夜梦",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("宁安夜梦")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "彩绘花瓶",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("彩绘花瓶")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白鹤展翅帘",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白鹤展翅帘")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "桦木地板",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("桦木地板")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "君子兰",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("君子兰")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白栅绿竹门",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白栅绿竹门")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "篱笆花圃",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("篱笆花圃")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "篱笆院墙",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("篱笆院墙")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "石凳",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("石凳")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "石制宫灯",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("石制宫灯")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "石制影壁",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("石制影壁")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "石桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("石桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "大理石凳",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("大理石凳")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "大理石花圃",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("大理石花圃")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "大理石桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("大理石桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "红漆雕花门",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("红漆雕花门")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "青瓷花盆",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("青瓷花盆")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "青石路砖",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("青石路砖")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "青铜鼎",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("青铜鼎")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "石制院墙",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("石制院墙")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白玉花圃",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白玉花圃")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白玉狮子",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白玉狮子")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白玉石凳",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白玉石凳")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白玉石桌",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白玉石桌")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "白玉影壁",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("白玉影壁")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "花岗石路砖",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("花岗石路砖")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "混土砖石院墙",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("混土砖石院墙")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "金丝楠木门",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("金丝楠木门")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "山水盆景",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("山水盆景")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "四圣兽之白虎",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("四圣兽之白虎")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "四圣兽之青龙",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("四圣兽之青龙")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "四圣兽之玄武",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("四圣兽之玄武")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "四圣兽之朱雀",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("四圣兽之朱雀")[2]
		},
		{
			子类 = 1,
			分类 = 1,
			价格 = 1000,
			名称 = "物品柜",
			数量 = 1,
			可叠加 = true,
			总类 = 取物品数据("物品柜")[2]
		}
	}
	self.商品组[18].足迹 = {
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "龙卷风足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "皮球足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "雀屏足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "旋律足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "枫叶足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "飞天足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "两心相悦足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "心花怒放",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "雷电足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "寒冰足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "星星祈愿",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "地狱焰火",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "元宝足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "光剑足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "雪花足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "浮游水母",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "闪光足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "青草足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "糖果足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "玉剑足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "晶翅足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "蝴蝶足迹",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "爱的泡泡",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "爱的风暴",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "璀璨烟花",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 3,
			分类 = 17,
			价格 = 3000,
			名称 = "心享气球",
			总类 = 2,
			锦衣 = true
		}
	}
	self.商品组[18].足印 = {
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "浩瀚星河",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "烈焰澜翻",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "水墨游龙",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "星光熠熠",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "双鲤寄情",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "凌波微步",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "荷塘涟漪",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "雪花飘落",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "月影婆娑",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "祥云瑞气",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "花的海洋",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "爱的光影",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "珠落玉盘",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "红叶随风",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "九霄云图",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "月半潮墨黑",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "琪花瑶草",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "财源滚滚",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "寒霜冰凌",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "金枝春绽",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "九尾庞庞",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "浪淘沙墨黑",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "浪淘沙月白",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "凌霄天宫",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "凌霄天宫墨黑",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "凌霄天宫月白",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "流云蝶影",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "琪草瑶花",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "沙骨王座",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "午夜魔蝠",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "星驰剑阵",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "星驰剑阵染",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "月半潮",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "月半潮月白",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "云龙梦",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "云龙梦墨黑",
			总类 = 2,
			锦衣 = true
		},
		{
			子类 = 2,
			分类 = 16,
			价格 = 3000,
			名称 = "云龙梦月白",
			总类 = 2,
			锦衣 = true
		}
	}
	self.商品组[18].宝宝 = {
		{
			名称 = "超级神龙",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级神龙"
		},
		{
			名称 = "超级腾蛇",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级腾蛇"
		},
		{
			名称 = "超级青鸾",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级青鸾"
		},
		{
			名称 = "超级人参娃娃",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级人参娃娃"
		},
		{
			名称 = "超级海豚",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级海豚"
		},
		{
			名称 = "超级神牛",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级神牛"
		},
		{
			名称 = "超级神虎",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级神虎"
		},
		{
			名称 = "超级神兔",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级神兔"
		},
		{
			名称 = "超级泡泡",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级泡泡"
		},
		{
			名称 = "超级大熊猫",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级大熊猫"
		},
		{
			名称 = "超级金猴",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级金猴"
		},
		{
			名称 = "超级大象",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级大象"
		},
		{
			名称 = "超级灵鹿",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级灵鹿"
		},
		{
			名称 = "超级白泽",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级白泽"
		},
		{
			名称 = "超级赤焰兽",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级赤焰兽"
		},
		{
			名称 = "超级麒麟",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级麒麟"
		},
		{
			名称 = "超级大鹏",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级大鹏"
		},
		{
			名称 = "超级灵狐",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级灵狐"
		},
		{
			名称 = "超级孔雀",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级孔雀"
		},
		{
			名称 = "超级神马",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神马"
		},
		{
			名称 = "超级六耳猕猴",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级六耳猕猴"
		},
		{
			名称 = "超级神羊",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神羊"
		},
		{
			名称 = "超级土地公公",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级土地公公"
		},
		{
			名称 = "超级神猴",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神猴"
		},
		{
			名称 = "超级玉兔",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级玉兔"
		},
		{
			名称 = "超级神鸡",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神鸡"
		},
		{
			名称 = "超级筋斗云",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级筋斗云"
		},
		{
			名称 = "超级神蛇",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神蛇"
		},
		{
			名称 = "超级神狗",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神狗"
		},
		{
			名称 = "飞天",
			类型 = "神兽",
			价格 = 99999,
			模型 = "飞天"
		},
		{
			名称 = "超级神鼠",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神鼠"
		},
		{
			名称 = "超级神猪",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神猪"
		},
		{
			名称 = "超级小白龙",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级小白龙"
		},
		{
			名称 = "超级猪小戒",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级猪小戒"
		},
		{
			名称 = "壬寅神虎",
			类型 = "神兽",
			价格 = 199999,
			模型 = "壬寅神虎"
		},
		{
			名称 = "神兽小龙人",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽小龙人"
		},
		{
			名称 = "神兽雪精灵",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽雪精灵"
		},
		{
			名称 = "神兽时光叽",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽时光叽"
		},
		{
			名称 = "神兽百灵羊",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽百灵羊"
		},
		{
			名称 = "神兽孙小圣",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽时光叽"
		},
		{
			名称 = "兔乖乖",
			类型 = "神兽",
			价格 = 99999,
			模型 = "神兽百灵羊"
		},
		{
			名称 = "齐天小圣",
			类型 = "神兽",
			价格 = 99999,
			模型 = "齐天小圣"
		},
		{
			名称 = "超级神柚",
			类型 = "神兽",
			价格 = 99999,
			模型 = "超级神柚"
		},
		{
			名称 = "神兽鲲鹏",
			类型 = "神兽",
			价格 = 199999,
			模型 = "鲲鹏"
		},
		{
			名称 = "仙兽翼龙",
			类型 = "神兽",
			价格 = 199999,
			模型 = "仙兽翼龙"
		},
		{
			名称 = "超级离火兽",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级离火兽"
		},
		{
			名称 = "辛丑神牛",
			类型 = "神兽",
			价格 = 199999,
			模型 = "辛丑神牛"
		},
		{
			名称 = "癸卯神兔",
			类型 = "神兽",
			价格 = 199999,
			模型 = "癸卯神兔"
		},
		{
			名称 = "超级红孩儿",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级红孩儿"
		},
		{
			名称 = "超级飞廉",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级飞廉"
		},
		{
			名称 = "食铁兽",
			类型 = "神兽",
			价格 = 199999,
			模型 = "食铁兽"
		},
		{
			名称 = "甲辰神龙",
			类型 = "神兽",
			价格 = 199999,
			模型 = "甲辰神龙"
		},
		{
			名称 = "超级有熊",
			类型 = "神兽",
			价格 = 199999,
			模型 = "超级有熊"
		}
	}

	self.商品组[18].法宝 = {}
	for n = 1, 4 do
		if n ~= 4 or 单机设置 then
			for i = 1, #法宝列表[n] do
				table.insert(self.商品组[18].法宝, self:商城取法宝(法宝列表[n][i], n))
			end
		end
	end

	-- if 单机设置 then
	-- 	for n = 1, 4 do
	-- 		if n ~= 4 or 单机设置 then
	-- 			for i = 1, #法宝列表[n] do
	-- 				table.insert(self.商品组[18].法宝, self:商城取法宝(法宝列表[n][i], n))
	-- 			end
	-- 		end
	-- 	end
	-- else
	-- 	for n = 1, 1 do
	-- 		if n ~= 4 or 单机设置 then
	-- 			for i = 1, #法宝列表[n] do
	-- 				table.insert(self.商品组[18].法宝, self:商城取法宝(法宝列表[n][i], n))
	-- 			end
	-- 		end
	-- 	end
	-- end

	self.商品组[18].活跃兑换 = {
		{
			"特赦令牌",
			名称 = "特赦令牌",
			价格 = 5000,
			可叠加 = true
		},
		{
			名称 = "召唤兽内丹",
			价格 = 15000,
			可叠加 = false
		},
		{
			名称 = "高级召唤兽内丹",
			价格 = 30000,
			可叠加 = false
		},
		{
			名称 = "高级魔兽要诀",
			价格 = 15000,
			可叠加 = false
		}
	}
	self.商品组[19].活跃兑换 = {
		{
			"特赦令牌",
			名称 = "特赦令牌",
			价格 = 5000,
			可叠加 = true
		},
		{
			名称 = "召唤兽内丹",
			价格 = 15000,
			可叠加 = false
		},
		{
			名称 = "高级召唤兽内丹",
			价格 = 30000,
			可叠加 = false
		},
		{
			名称 = "高级魔兽要诀",
			价格 = 15000,
			可叠加 = false
		}
	}
end

function 获取商城积分兑换通用商品列表()
	local 积分兑换通用商品列表 = {
		{
			名称 = "魔兽残卷",
			价格 = 15,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "青龙石",
			价格 = 1,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "白虎石",
			价格 = 1,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "朱雀石",
			价格 = 1,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "玄武石",
			价格 = 1,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "金柳露",
			价格 = 1,
			数量 = 3,
			可叠加 = true
		},
		{
			名称 = "超级金柳露",
			价格 = 2,
			数量 = 1,
			可叠加 = true
		},
		{
			名称 = "高级魔兽要诀",
			价格 = 100,
			数量 = 1,
			可叠加 = false
		},
		{
			名称 = "易经丹",
			价格 = 20,
			数量 = 1,
			可叠加 = true
		},
		{
			总类 = 2,
			子类 = 2,
			分类 = 9,
			价格 = 20,
			名称 = "通灵神臂",
			次数 = 2,
			级别限制 = 0,
			可叠加 = false
		},
		{
			总类 = 2,
			子类 = 2,
			分类 = 9,
			价格 = 100,
			名称 = "通灵神符",
			次数 = 2,
			级别限制 = 0,
			可叠加 = false
		},
		{
			总类 = 2,
			子类 = 2,
			分类 = 9,
			价格 = 500,
			名称 = "通灵神戒",
			次数 = 2,
			级别限制 = 0,
			可叠加 = false
		}
	}
	return 积分兑换通用商品列表
end

function 商城处理类:商城取法宝(名称, 等级, 军功)
	local aa = {
		10000,
		50000,
		100000,
		500000
	}

	if 军功 ~= nil then
		aa = {
			50,
			200,
			400,
			800
		}
	end

	local 识别码 = os.time() .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列
	随机序列 = 随机序列 + 1
	local 法宝数据 = {}
	local 道具 = 取物品数据(名称)
	法宝数据.名称 = 名称
	法宝数据.总类 = 1000
	法宝数据.分类 = 道具[3]
	法宝数据.使用 = 道具[5]
	法宝数据.特技 = 道具[6]
	法宝数据.气血 = 0
	法宝数据.可叠加 = false
	法宝数据.魔法 = 取灵气上限(道具[3])
	法宝数据.角色限制 = 道具[7] or 0
	法宝数据.五行 = "随机五行"
	法宝数据.伤害 = 道具[8] or 0
	法宝数据.当前经验 = 0
	法宝数据.升级经验 = 法宝经验[法宝数据.分类][1]
	法宝数据.识别码 = 识别码
	法宝数据.价格 = aa[等级]

	return 法宝数据
end

function 商城处理类:数据处理(id, 内容)
	self.允许购买 = true
	self.购买组号 = 内容.组号 + 0
	self.购买编号 = 内容.编号
	self.购买数量 = math.abs(math.floor(内容.数量))
	self.购买分类 = 内容.分类
	self.购买总量 = nil

	if id == nil or 内容 == nil then
		--print(1111111111111.0)
		print("未找到商城数据id:" .. id .. " 内容:" .. 内容)
		return 0
	end

	local 仙玉 = f函数.读配置(程序目录 .. "data\\" .. 玩家数据[id].账号 .. "\\账号信息.txt", "账号配置", "仙玉") + 0
	local 银子 = 玩家数据[id].角色.数据.银子
	local 积分 = 玩家数据[id].角色.数据.比武积分.当前积分
	local 当前活跃 = 玩家数据[id].角色.数据.累积活跃.当前活跃

	if self.购买数量 > 9999 then
		发送数据(玩家数据[id].连接id, 7, "#y/您的购买的数量超过9999个!")

		return 0
	end

	if self.购买数量 <= 0 then
		发送数据(玩家数据[id].连接id, 7, "#y/您的购买的数量小于0个!")

		return 0
	end

	if self.购买数量 == nil or self.购买分类 == "宝宝" then
		self.购买数量 = 1
	elseif self.购买数量 == nil or self.购买数量 ~= nil and self.购买数量 < 1 then
		self.购买数量 = 1
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
		self.购买总量 = math.abs(内容.数量)
		self.购买数量 = 1
	else
		self.购买数量 = self.购买数量 + 0
	end

	if math.floor(self.购买数量) ~= self.购买数量 then
		写配置("./ip封禁.ini", "ip", 玩家数据[id].ip, 1)
		发送数据(玩家数据[id].连接id, 998, "请注意你的角色异常！已经对你进行封IP")

		return
	end

	local 购买价格 = self.商品组[self.购买组号][self.购买分类][self.购买编号].价格
	local 购买总价 = math.abs(self.商品组[self.购买组号][self.购买分类][self.购买编号].价格 * (self.购买总量 or self.购买数量))

	if math.floor(购买总价) ~= 购买总价 then
		写配置("./ip封禁.ini", "ip", 玩家数据[id].ip, 1)
		发送数据(玩家数据[id].连接id, 998, "请注意你的角色异常！已经对你进行封IP")

		return
	end

	if self.购买分类 == "宝宝" then
		if 玩家数据[id].角色.数据.召唤兽携带数量 <= #玩家数据[id].召唤兽.数据 then
			发送数据(玩家数据[id].连接id, 7, "#y/您当前无法携带更多的召唤兽了")

			self.允许购买 = false

			return 0
		elseif 仙玉 < 购买总价 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")

			self.允许购买 = false

			return 0
		elseif self.允许购买 then
			self:扣除仙玉(仙玉, 购买价格, id)
			玩家数据[id].召唤兽:添加召唤兽(self.商品组[self.购买组号][self.购买分类][self.购买编号].模型, nil, nil, true, 0, 内容.物法)
			发送数据(玩家数据[id].连接id, 7,
				"#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类 == "法宝" then
		if 仙玉 < 购买价格 then
			发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")

			self.允许购买 = false

			return
		end

		if 购买总价 <= 0 then
			发送数据(玩家数据[id].连接id, 7, "#y/出现错误")

			self.允许购买 = false

			return
		end

		if self.允许购买 then
			self:扣除仙玉(仙玉, 购买价格, id)
			玩家数据[id].道具:给予法宝(id, self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
			发送数据(玩家数据[id].连接id, 7,
				"#y/您花费了#R/" .. 购买价格 .. "#Y/点仙玉购买了1个#R/" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类 == "杂货" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()

			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")

				self.允许购买 = false

				return
			end

			if 银子 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的银子不足")

				self.允许购买 = false
			end

			if 购买总价 <= 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/出现错误")

				self.允许购买 = false

				return
			end

			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					玩家数据[id].角色:扣除银子(购买总价, 0, 0, "商店购买", 1)
				else
					玩家数据[id].角色:扣除银子(购买价格, 0, 0, "商店购买", 1)
				end

				self:获取商城道具(id)
			else
				return
			end
		end

		if self.允许购买 then
			发送数据(玩家数据[id].连接id, 7,
				"#y/您花费了#R/" ..
				购买总价 ..
				"#Y/两银子购买了#R/" ..
				math.abs(内容.数量 * (self.商品组[self.购买组号][self.购买分类][self.购买编号].数量 or 1)) ..
				"个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
		end
	elseif self.购买分类 == "比武积分" or self.购买分类 == "副本积分" or self.购买分类 == "种族积分" or self.购买分类 == "妖魔积分" or self.购买分类 == "军功" then
		self.临时格子 = 玩家数据[id].角色:取道具格子()

		if self.临时格子 == 0 then
			发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")

			self.允许购买 = false

			return
		end

		if self.购买数量 > 1 and self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 ~= nil then
			发送数据(玩家数据[id].连接id, 7, "#y/贵重物品每次买一个")

			self.允许购买 = false

			return
		else
			self.允许购买 = true
		end

		if self.允许购买 then
			if self.购买分类 == "比武积分" then
				if 玩家数据[id].角色:扣除积分(购买总价, "积分商城", 1) == false then
					常规提示(id, "你的比武积分不足。")

					return
				end
			elseif self.购买分类 == "副本积分" then
				if 玩家数据[id].角色:扣除副本积分(购买总价, "积分商城", 1) == false then
					常规提示(id, "你的副本积分不足。")

					return
				end
			elseif self.购买分类 == "妖魔积分" then
				if 玩家数据[id].角色:扣除妖魔积分(购买总价, "积分商城", 1) == false then
					常规提示(id, "你的妖魔积分不足。")

					return
				end
			elseif self.购买分类 == "种族积分" then
				if 玩家数据[id].角色:扣除种族积分(购买总价, "积分商城", 1) == false then
					常规提示(id, "你的种族积分不足。")

					return
				end
			elseif self.购买分类 == "军功" and 玩家数据[id].角色:扣除军功(购买总价, "军功商城", 1) == false then
				常规提示(id, "你的可用军功不足。")

				return
			end

			self:获取商城道具(id)
		end

		发送数据(玩家数据[id].连接id, 7,
			"#y/您花费了#R/" ..
			购买总价 ..
			"#Y/点" ..
			self.购买分类 ..
			"购买了#R/" ..
			math.abs(内容.数量 * (self.商品组[self.购买组号][self.购买分类][self.购买编号].数量 or 1)) ..
			"个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	elseif self.购买分类 == "活跃兑换" then
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()

			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")

				self.允许购买 = false

				return
			end

			if self.购买数量 > 1 and self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 ~= nil then
				发送数据(玩家数据[id].连接id, 7, "#y/贵重物品每次买一个")

				self.允许购买 = false

				return
			else
				self.允许购买 = true
			end

			if 玩家数据[玩家数据[id].连接id].角色.数据.累积活跃.当前积分 < 购买总价 then
				print(玩家数据[玩家数据[id].连接id].角色.数据.累积活跃.当前积分)
				发送数据(玩家数据[id].连接id, 7, "#y/您的可用活跃不足")

				self.允许购买 = false
			end

			if self.允许购买 then
				if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
					玩家数据[id].角色:扣除活跃(购买总价, "活跃兑换", 1)
				else
					玩家数据[id].角色:扣除活跃(购买价格, 0, 0, "活跃兑换", 1)
				end

				self:获取商城道具(id)
			end
		end

		发送数据(玩家数据[id].连接id, 7,
			"#y/您花费了#R/" ..
			购买总价 ..
			"#Y/点可用活跃购买了#R/" ..
			math.abs(内容.数量 * (self.商品组[self.购买组号][self.购买分类][self.购买编号].数量 or 1)) ..
			"个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	else
		for n = 1, self.购买数量 do
			self.临时格子 = 玩家数据[id].角色:取道具格子()

			if self.临时格子 == 0 then
				发送数据(玩家数据[id].连接id, 7, "#y/您身上似乎没有多余的道具存放空间")

				self.允许购买 = false

				return
			end

			if self.购买数量 > 1 and self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 ~= nil then
				发送数据(玩家数据[id].连接id, 7, "#y/贵重物品每次买一个")

				self.允许购买 = false

				return
			else
				self.允许购买 = true
			end

			if 仙玉 < 购买总价 then
				发送数据(玩家数据[id].连接id, 7, "#y/您的仙玉不足")

				self.允许购买 = false

				return
			end

			if self.允许购买 then
				self:扣除仙玉(仙玉, 购买总价, id)
				self:获取商城道具(id)
			end
		end

		发送数据(玩家数据[id].连接id, 7,
			"#y/您花费了#R/" ..
			购买总价 ..
			"#Y/点仙玉购买了#R/" ..
			math.abs(内容.数量 * (self.商品组[self.购买组号][self.购买分类][self.购买编号].数量 or 1)) ..
			"个" .. self.商品组[self.购买组号][self.购买分类][self.购买编号].名称)
	end
end

function 商城处理类:获取商城道具(id)
	if self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "小额银票" then
		玩家数据[id].角色:添加银子(1000000, "商城购买", 1)
		常规提示(id, "#Y/恭喜你从商城购买了#R/100万两银子#Y/。")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "大额银票" then
		玩家数据[id].角色:添加银子(200000000, "商城购买", 1)
		常规提示(id, "#Y/恭喜你从商城购买了#R/两亿两银子#Y/。")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级随机灵饰指南书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			6
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级随机灵饰指南书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			8
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级随机灵饰指南书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			10
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级随机灵饰指南书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			12
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机灵饰指南书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			14
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级元灵晶石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			6
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级元灵晶石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			8
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级元灵晶石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			10
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级元灵晶石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			12
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级元灵晶石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			14
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-80灵饰书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			6,
			8
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-80元灵石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			6,
			8
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-100灵饰书" then
		玩家数据[id].道具:给予道具(id, "灵饰指南书", {
			6,
			8,
			10
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-100元灵石" then
		玩家数据[id].道具:给予道具(id, "元灵晶石", {
			6,
			8,
			10
		})
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "随机百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			5,
			6
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "随机制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			5,
			6
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-90百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			9
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-90制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			9
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-100百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			10
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60-100制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			10
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级随机指南书" then
		玩家数据[id].道具:给予书铁(id, {
			14,
			14
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级随机指南书" then
		玩家数据[id].道具:给予书铁(id, {
			15,
			15
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "30级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			3,
			3
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "30级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			3,
			3
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "40级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			4,
			4
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "40级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			4,
			4
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "50级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			5,
			5
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "50级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			5,
			5
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			6
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "60级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			6,
			6
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "70级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			7,
			7
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "70级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			7,
			7
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			8,
			8
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "80级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			8,
			8
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "90级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			9,
			9
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "90级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			9,
			9
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			10,
			10
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "100级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			10,
			10
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "110级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			11,
			11
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "110级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			11,
			11
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			12,
			12
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "120级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			12,
			12
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "130级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			13,
			13
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "130级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			13,
			13
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			14,
			14
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "140级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			14,
			14
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级百炼精铁" then
		玩家数据[id].道具:给予书铁(id, {
			15,
			15
		}, "精铁")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "150级制造指南书" then
		玩家数据[id].道具:给予书铁(id, {
			15,
			15
		}, "指南书")
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "属性石" or self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "资质丸" then
		玩家数据[id].道具:给予道具(id, self.商品组[self.购买组号][self.购买分类][self.购买编号].名称, 1)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "初级神魂丹" then
		玩家数据[id].道具:给予道具(id, "初级神魂丹", 1)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "未激活的符石1级" then
		玩家数据[id].道具:给予道具(id, "未激活的符石", 1)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "未激活的符石2级" then
		玩家数据[id].道具:给予道具(id, "未激活的符石", 2)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "未激活的符石3级" then
		玩家数据[id].道具:给予道具(id, "未激活的符石", 3)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "未激活的星石" then
		玩家数据[id].道具:给予道具(id, "未激活的星石", 1)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "高级藏宝图" then
		玩家数据[id].道具:给予道具(id, "高级藏宝图", 1)
	elseif self.商品组[self.购买组号][self.购买分类][self.购买编号].名称 == "鬼谷子" and self.商品组[self.购买组号][self.购买分类][self.购买编号].子类 == nil then
		玩家数据[id].道具:给予道具(id, "鬼谷子", 1)
	else
		self.道具编号 = 玩家数据[id].道具:取新编号()
		玩家数据[id].道具.数据[self.道具编号] = table.loadstring(table.tostring(self.商品组[self.购买组号][self.购买分类][self.购买编号]))
		玩家数据[id].道具.数据[self.道具编号].识别码 = id .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列

		if self.商品组[self.购买组号][self.购买分类][self.购买编号].可叠加 then
			玩家数据[id].道具.数据[self.道具编号].数量 = self.购买总量 * (self.商品组[self.购买组号][self.购买分类][self.购买编号].数量 or 1)
		end

		if self.商品组[self.购买组号][self.购买分类][self.购买编号].总类 == 1001 then
			玩家数据[id].道具.数据[self.道具编号].不可交易 = true
			玩家数据[id].道具.数据[self.道具编号].专用 = true
		end

		玩家数据[id].角色.数据.道具[self.临时格子] = self.道具编号

		if 玩家数据[id].道具.数据[self.道具编号].名称 == "高级魔兽要诀" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取高级要诀()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "魔兽要诀" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取低级要诀()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "特殊魔兽要诀" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取特殊要诀()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "神兽兽决" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 神兽要诀()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "赌一赌观照万象" then
			if 取随机数() <= 100 then
				玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 观照万象()
			else
				玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取低级要诀()
			end

			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "特效石碎片" then
			玩家数据[id].道具.数据[self.道具编号].特效 = 玩家数据[id].道具.数据[self.道具编号].特效 or 取特效()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "特技石" then
			玩家数据[id].道具.数据[self.道具编号].特效 = 玩家数据[id].道具.数据[self.道具编号].特效 or 取特技()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "六艺修行书" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取六艺技能()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "点化石" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取高级要诀点化()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 通灵装备1[玩家数据[id].道具.数据[self.道具编号].名称] ~= nil then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 取护符技能(玩家数据[id].道具.数据[self.道具编号].名称)
			玩家数据[id].道具.数据[self.道具编号].等级 = 取护符等级(玩家数据[id].道具.数据[self.道具编号].名称)
		elseif 取列表中是否存在内容(玩家数据[id].道具.数据[self.道具编号].名称, "通灵重置丹") then
			玩家数据[id].道具.数据[self.道具编号].等级 = 取护符等级(玩家数据[id].道具.数据[self.道具编号].名称)
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "召唤兽内丹" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取内丹()
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].名称 == "高级召唤兽内丹" then
			玩家数据[id].道具.数据[self.道具编号].附带技能 = 玩家数据[id].道具.数据[self.道具编号].附带技能 or 取内丹("高级")
			玩家数据[id].道具.数据[self.道具编号].可叠加 = true
		elseif 玩家数据[id].道具.数据[self.道具编号].总类 == "坐骑饰品" then
			local 坐骑饰品 = 取物品数据(玩家数据[id].道具.数据[self.道具编号].名称)
			玩家数据[id].道具.数据[self.道具编号].子类 = 坐骑饰品[4]
		end

		刷新道具行囊单格(id, "道具", self.临时格子, self.道具编号)
	end
end

内存加密 = function(内容)
	return 内容
end

function 商城处理类:扣除仙玉(仙玉, 扣除价格, id)
	仙玉 = 仙玉 - 扣除价格

	f函数.写配置(程序目录 .. "data\\" .. 玩家数据[id].账号 .. "\\账号信息.txt", "账号配置", "仙玉", 仙玉)
end

function 商城处理类:取商品组数据(id, 序号, 积分商城, 需要数据)
	self.发送消息 = {}
	序号 = 序号 + 0
	local 妖魔兑换积分 = 0
	local 副本积分 = 0
	local 种族积分 = 0
	local 累积活跃 = 0
	local 当前活跃 = 0
	local 当前军功 = 0

	if 玩家数据[id].角色.数据.副本积分 ~= nil then
		副本积分 = 玩家数据[id].角色.数据.副本积分
	end

	if 妖魔积分 ~= nil and 妖魔积分[id] ~= nil then
		妖魔兑换积分 = 妖魔积分[id].当前
	end

	if 玩家数据[id].角色.数据.军功 ~= nil and 玩家数据[id].角色.数据.军功.当前 ~= nil then
		当前军功 = 玩家数据[id].角色.数据.军功.当前
	end

	if 玩家数据[id].角色.数据.累积活跃 ~= nil then
		累积活跃 = 玩家数据[id].角色.数据.累积活跃.总积分
		当前活跃 = 玩家数据[id].角色.数据.累积活跃.当前积分
	end

	if 玩家数据[id].角色.数据.种族积分 == nil then
		玩家数据[id].角色.数据.种族积分 = 0
	end

	种族积分 = 玩家数据[id].角色.数据.种族积分

	if 玩家数据[id].账号 == nil or id == nil or 序号 == nil or self.商品组[序号] == nil then
		print(1111111111111.0)

		return 0
	end

	self.商品组[序号].银子 = 玩家数据[id].角色.数据.银子
	self.商品组[序号].积分数 = {
		比武积分 = 玩家数据[id].角色.数据.比武积分.当前积分,
		种族积分 = 种族积分,
		副本积分 = 副本积分,
		妖魔积分 = 妖魔兑换积分,
		累积活跃 = 累积活跃,
		当前活跃 = 当前活跃,
		军功 = 当前军功
	}
	self.商品组[序号].组号 = 序号
	self.商品组[序号].商城版本 = 商城版本

	if 临时仙玉列表[玩家数据[id].账号] ~= nil then
		添加仙玉写入(临时仙玉列表[玩家数据[id].账号], 玩家数据[id].账号, "打开商城同步仙玉", 1)

		临时仙玉列表[玩家数据[id].账号] = nil
	end

	self.商品组[序号].仙灵玉 = f函数.读配置(程序目录 .. "data\\" .. 玩家数据[id].账号 .. "\\账号信息.txt", "账号配置", "仙玉") + 0

	if 积分商城 ~= nil then
		self.商品组[序号].序列 = 2
	else
		self.商品组[序号].序列 = 1
	end

	if 序号 == 18 then
		if 玩家数据[id].角色.数据.商城版本 ~= 商城版本 or 需要数据 == true then
			发送数据(玩家数据[id].连接id, 3700, self.商品组[序号])

			玩家数据[id].角色.数据.商城版本 = 商城版本 + 0
		else
			发送数据(玩家数据[id].连接id, 3700, {
				积分数 = self.商品组[序号].积分数,
				仙灵玉 = self.商品组[序号].仙灵玉,
				银子 = self.商品组[序号].银子
			})
		end
	elseif 序号 == 19 then
		发送数据(玩家数据[id].连接id, 3701, self.商品组[序号])
	end
end

function 商城处理类:更新(dt)
end

function 商城处理类:显示(x, y)
end

return 商城处理类
