定制装备特效数量 = 5
定制装备百炼数量 = 2
充值道具详情 = {
	神兽 = {
		{
			"神兽自选礼包",
			1,
			10
		}
	},
	神兽5 = {
		{
			"神兽自选礼包",
			5,
			10
		}
	},
	百变坐骑 = {
		{
			"百变坐骑·坐骑礼包",
			1,
			99
		}
	},
	百变坐骑5 = {
		{
			"百变坐骑·坐骑礼包",
			5,
			99
		}
	},
	神行百变 = {
		{
			"神行百变·坐骑礼包",
			1,
			99
		}
	},
	神行百变5 = {
		{
			"神行百变·坐骑礼包",
			5,
			99
		}
	},
	["10胚子"] = {
		{
			"10技能胚子召唤兽礼包",
			1,
			2
		}
	},
	["10胚子5"] = {
		{
			"10技能胚子召唤兽礼包",
			5,
			2
		}
	},
	["10胚子10"] = {
		{
			"10技能胚子召唤兽礼包",
			10,
			2
		}
	},
	["12胚子"] = {
		{
			"12技能胚子召唤兽礼包",
			1,
			5
		}
	},
	["12胚子5"] = {
		{
			"12技能胚子召唤兽礼包",
			5,
			5
		}
	},
	["12胚子10"] = {
		{
			"12技能胚子召唤兽礼包",
			10,
			5
		}
	},
	["14胚子"] = {
		{
			"14技能胚子召唤兽礼包",
			1,
			15
		}
	},
	["14胚子5"] = {
		{
			"14技能胚子召唤兽礼包",
			5,
			15
		}
	},
	["14胚子10"] = {
		{
			"14技能胚子召唤兽礼包",
			10,
			15
		}
	},
	["16胚子"] = {
		{
			"16技能胚子召唤兽礼包",
			1,
			40
		}
	},
	["16胚子5"] = {
		{
			"16技能胚子召唤兽礼包",
			5,
			40
		}
	},
	["16胚子10"] = {
		{
			"16技能胚子召唤兽礼包",
			10,
			40
		}
	},
	["18胚子"] = {
		{
			"18技能胚子召唤兽礼包",
			1,
			100
		}
	},
	["18胚子5"] = {
		{
			"18技能胚子召唤兽礼包",
			5,
			100
		}
	},
	["18胚子10"] = {
		{
			"18技能胚子召唤兽礼包",
			10,
			100
		}
	},
	["20胚子"] = {
		{
			"20技能胚子召唤兽礼包",
			1,
			200
		}
	},
	["20胚子5"] = {
		{
			"20技能胚子召唤兽礼包",
			5,
			200
		}
	},
	["20胚子10"] = {
		{
			"20技能胚子召唤兽礼包",
			10,
			200
		}
	},
	金银锦盒 = {
		{
			"金银锦盒",
			80,
			1
		}
	},
	金银锦盒10 = {
		{
			"金银锦盒",
			800,
			1
		}
	},
	金银锦盒50 = {
		{
			"金银锦盒",
			4000,
			1
		}
	},
	百炼晶石 = {
		{
			"百炼晶石",
			1,
			8
		}
	},
	百炼晶石5 = {
		{
			"百炼晶石",
			5,
			8
		}
	},
	百炼晶石10 = {
		{
			"百炼晶石",
			10,
			8
		}
	},
	物理神宠 = {
		{
			"14技能定制攻宠礼包",
			1,
			100
		}
	},
	法术神宠 = {
		{
			"14技能定制法宠礼包",
			1,
			100
		}
	},
	定制套装 = {
		{
			"160级武器定制礼包",
			1,
			350
		},
		{
			"160级头盔定制礼包",
			1,
			0
		},
		{
			"160级项链定制礼包",
			1,
			0
		},
		{
			"160级衣服定制礼包",
			1,
			0
		},
		{
			"160级腰带定制礼包",
			1,
			0
		},
		{
			"160级鞋子定制礼包",
			1,
			0
		},
		{
			"属性转换符",
			60,
			0
		}
	},
	定制武器 = {
		{
			"160级武器定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	},
	定制头盔 = {
		{
			"160级头盔定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	},
	定制项链 = {
		{
			"160级项链定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	},
	定制衣服 = {
		{
			"160级衣服定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	},
	定制腰带 = {
		{
			"160级腰带定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	},
	定制鞋子 = {
		{
			"160级鞋子定制礼包",
			1,
			100
		},
		{
			"属性转换符",
			10,
			0
		}
	}
}
自选宠物列表 = {
	"壬寅神虎",
	"甲辰神龙",
	"癸卯神兔",
	"癸卯神兔_睡梦",
	"超级人参娃娃",
	"超级六耳猕猴",
	"超级土地公公",
	"超级大熊猫",
	"超级大象",
	"超级大象使者",
	"超级大鹏",
	"超级孔雀",
	"超级小白龙",
	"超级有熊",
	"超级泡泡",
	"超级海豚",
	"超级灵狐",
	"超级灵鹿",
	"超级猪小戒",
	"超级玉兔",
	"超级白泽",
	"超级白泽使者",
	"超级神兔",
	"超级神柚",
	"超级神牛",
	"超级神狗",
	"超级神猪",
	"超级神猴",
	"超级神羊",
	"超级神虎",
	"超级神蛇",
	"超级神马",
	"超级神鸡",
	"超级神鼠",
	"超级神龙",
	"超级离火兽",
	"超级筋斗云",
	"超级红孩儿",
	"超级腾蛇",
	"超级赤焰兽",
	"超级金猴",
	"超级青鸾",
	"飞天",
	"超级飞廉",
	"超级麒麟",
	"辛丑神牛",
	"鲲鹏",
	"龙马",
	"食铁兽",
	"逍遥神牛",
	"兔乖乖",
	"神兽孙小圣",
	"仙兽翼龙",
	"神兽小龙人",
	"神兽雪精灵",
	"神兽时光叽",
	"神兽百灵羊",
	"齐天小圣",
	"泡泡灵仙·剑侠客",
	"泡泡灵仙·巫蛮儿",
	"泡泡灵仙·杀破狼",
	"泡泡灵仙·神天兵",
	"泡泡灵仙·羽灵神",
	"泡泡灵仙·飞燕女",
	"泡泡灵仙·骨精灵",
	"泡泡灵仙·龙太子",
	"恶魔泡泡",
	"恶魔泡泡(哭泣)",
	"恶魔泡泡(困惑)",
	"恶魔泡泡(奸笑)",
	"恶魔泡泡(白眼)",
	"草龟",
	"元宝龟",
	"冰龟",
	"冰火龟",
	"火云龟",
	"熔岩龟",
	"毒云龟",
	"毒花龟(夜)",
	"毒花龟(日)",
	"云龟",
	"岩龟",
	"岩冰龟",
	"沙虫",
	"草叶虫",
	"草叶魂虫",
	"竹笋虫",
	"天机虫",
	"火沙虫",
	"熔火虫",
	"月光虫",
	"月光金乌虫",
	"金乌虫",
	"金乌火虫",
	"金乌月光虫",
	"食魂虫(夜)",
	"食魂虫(日)",
	"火月蛙",
	"熔火蛙",
	"积水蛙",
	"积水鬼蛙",
	"望月蛙",
	"雪蛙",
	"雪月蛙",
	"月光雪蛙",
	"鬼蛙",
	"泡泡",
	"护卫",
	"树怪",
	"大海龟",
	"巨蛙",
	"章鱼",
	"海星",
	"狸",
	"沙狸",
	"强盗沙狸",
	"海狸",
	"纵火狸",
	"胖海狸",
	"强盗狸",
	"强盗鬼狸",
	"鬼狸",
	"鬼火狸",
	"雪狸",
	"野猪",
	"野猪x",
	"大蝙蝠",
	"海毛虫",
	"强盗",
	"强盗x",
	"山贼",
	"山贼x",
	"赌徒",
	"赌徒x",
	"狐狸精",
	"狐狸精x",
	"羊头怪",
	"羊头怪x",
	"花妖",
	"花妖x",
	"骷髅怪",
	"骷髅怪x",
	"蛤蟆精",
	"蛤蟆精x",
	"老虎",
	"老虎x",
	"黑熊",
	"黑熊x",
	"野鬼",
	"野鬼x",
	"虾兵",
	"虾兵x",
	"蟹将",
	"蟹将x",
	"牛妖",
	"牛妖x",
	"小龙女",
	"小龙女x",
	"狼",
	"狼x",
	"牛头",
	"牛头x",
	"马面",
	"马面x",
	"僵尸",
	"僵尸x",
	"龟丞相",
	"龟丞相x",
	"蜘蛛精",
	"蜘蛛精x",
	"兔子怪",
	"兔子怪x",
	"黑熊精",
	"黑熊精x",
	"黑山老妖",
	"黑山老妖x",
	"蝴蝶仙子",
	"蝴蝶仙子x",
	"雷鸟人",
	"雷鸟人x",
	"白熊",
	"白熊x",
	"古代瑞兽",
	"古代瑞兽x",
	"天兵",
	"天兵x",
	"风伯",
	"风伯x",
	"地狱战神",
	"地狱战神x",
	"阿宝",
	"花铃",
	"天将",
	"天将x",
	"蛟龙",
	"蛟龙x",
	"凤凰",
	"凤凰x",
	"蚌精",
	"鲛人",
	"碧水夜叉",
	"雨师",
	"雨师x",
	"独角鬼王",
	"月影仙",
	"龙鲤",
	"炼丹童子",
	"星灵仙子",
	"星灵仙子x",
	"巡游天神",
	"巡游天神x",
	"犀牛将军人形",
	"犀牛将军兽形",
	"锦毛貂精",
	"千年蛇魅",
	"芙蓉仙子",
	"芙蓉仙子x",
	"如意仙子",
	"如意仙子x",
	"野猪精",
	"百足将军",
	"鼠先锋",
	"泪妖",
	"镜妖",
	"日游神",
	"金翼",
	"吸血鬼",
	"吸血鬼x",
	"幽灵",
	"幽灵x",
	"灵符女娲",
	"律法女娲",
	"阴阳伞",
	"云游火",
	"玄珠灵仙",
	"巨石守卫(昼)",
	"狐不归",
	"虬龙",
	"五行山神(金)",
	"五行山神(木)",
	"五行山神(水)",
	"五行山神(火)",
	"五行山神(土)",
	"鬼将",
	"鬼将x",
	"净瓶女娲",
	"幽萤娃娃",
	"画魂",
	"巨石守卫(夜)",
	"涂山瞳",
	"大力金刚",
	"大力金刚x",
	"夜罗刹",
	"夜罗刹x",
	"雾中仙",
	"雾中仙x",
	"灵鹤",
	"灵鹤x",
	"炎魔神",
	"炎魔神x",
	"噬天虎",
	"噬天虎x",
	"金铙僧",
	"月魅",
	"夜游神",
	"幻姬",
	"琴仙",
	"踏云兽",
	"红萼仙子",
	"葫芦宝贝",
	"猫灵人形",
	"猫灵兽形",
	"狂豹人形",
	"黑白狂豹人形",
	"狂豹兽形",
	"蝎子精",
	"龙龟",
	"机关人",
	"机关兽",
	"机关鸟",
	"连弩车",
	"巴蛇",
	"长眉灵猴",
	"巨力神猿",
	"修罗傀儡鬼",
	"藤蔓妖花",
	"无常鬼差(白)",
	"无常鬼差(黑)",
	"执音",
	"有苏鸩",
	"司辰侍者(未来)",
	"司辰侍者(过去)",
	"混沌兽",
	"蜃气妖",
	"修罗傀儡妖",
	"金身罗汉",
	"曼珠沙华",
	"毗舍童子",
	"暗黑毗舍童子",
	"真陀护法",
	"灵灯侍者",
	"涂山雪",
	"魔化毗舍童子",
	"雷龙",
	"觉醒涂山雪",
	"司风",
	"司雪",
	"司雨",
	"自在心猿",
	"持国巡守",
	"增长巡守",
	"般若天女",
	"广目巡守",
	"多闻巡守",
	"妙华天女",
	"谛听",
	"暗黑谛听",
	"长乐灵仙",
	"沙暴",
	"牛虱",
	"燧明兽",
	"九色鹿",
	"雪人",
	"哮天犬",
	"蚩尤",
	"熊猫武神",
	"狐狸",
	"小丫丫",
	"小仙女",
	"小毛头",
	"小神灵",
	"小精灵",
	"小魔头",
	"善财童子鼓",
	"善财童子玉",
	"小彩蝶",
	"小蓝娥",
	"小浪鼓",
	"小绅士",
	"小圣斗士",
	"小兔兔",
	"小DJ",
	"小卷发",
	"小羊角",
	"小战神",
	"小神女",
	"偃甲(女0)",
	"偃甲(女1)",
	"偃甲(女2)",
	"偃甲(男0)",
	"偃甲(男1)",
	"偃甲(男2)",
	"东海龙王",
	"九头精怪",
	"二郎神",
	"刑天",
	"周杰伦",
	"地涌夫人",
	"地藏王",
	"大大王",
	"天女魃",
	"孙婆婆",
	"孙悟空",
	"小夫子",
	"巫奎虎",
	"巫师",
	"帮派妖兽",
	"幽冥焰01",
	"幽冥焰02",
	"幽冥焰03",
	"幽冥焰04",
	"新程咬金",
	"无名",
	"春十三娘",
	"李靖",
	"火星人",
	"牛魔王",
	"猪八戒",
	"珠子",
	"男人_胖和尚",
	"男人_镖头",
	"白晶晶",
	"知了王",
	"程咬金",
	"空度禅师",
	"红衣女鬼",
	"莫忘",
	"菩提祖师",
	"薛礼",
	"观音姐姐",
	"镇元大仙",
	"阎罗王",
	"雨师妾",
	"风祖飞廉",
	"鬼偃",
	"齐天大圣",
	"芭将军",
	"木桩",
	"老夫子",
	"琴瑟仙女",
	"二大王",
	"红孩儿",
	"白骨精",
	"广目天王",
	"新猪八戒",
	"紫霞",
	"新孙悟空",
	"小欣",
	"神武雨师",
	"萼华仙子",
	"蚩尤武魂",
	"神武风伯",
	"幽灵虎",
	"龙虾骑士",
	"战神罗成",
	"死亡骑士",
	"贪狼",
	"小肥羊",
	"月影兔",
	"玄武",
	"金钱龟",
	"金麟鹿",
	"吉祥",
	"嵩鼠",
	"龙须豹",
	"杨二郎",
	"小雪人",
	"团团",
	"龙仙",
	"武罗仙子",
	"暗黑龙",
	"剑灵双子",
	"太极捶童子",
	"暗雷豹",
	"黑灵猫",
	"红衣战锤使",
	"美猴王",
	"火熔石",
	"三尾火狐",
	"骏天马",
	"鲛人鱼",
	"狗头人",
	"巨灵狼",
	"黑翼弓使",
	"无名上仙",
	"光辉女神",
	"四翼上仙",
	"大象精",
	"四臂魔神",
	"老鹰精",
	"氪金大佬",
	"超级三眼娃",
	"太极真君",
	"托塔娃",
	"巨斧猛男",
	"齐天大圣",
	"酷炫佬",
	"酷炫老逼登",
	"风火轮器灵",
	"月宫仙子",
	"夜莺",
	"蓝凤凰",
	"熊猫大侠",
	"白無常",
	"拽王",
	"萌狗",
	"小红孩儿",
	"月仙",
	"狮仙",
	"剑仙",
	"判官",
	"龙羽",
	"罗汉",
	"龙王",
	"天师",
	"战将",
	"狂狮",
	"佛子",
	"葫仙",
	"法僧",
	"金衣仙",
	"龙剑士",
	"龙剑女",
	"水龙",
	"画仙",
	"天帝",
	"镇元",
	"鬼君",
	"鹿君",
	"火女",
	"福禄仙",
	"天后",
	"太极老君",
	"天兵统领",
	"阎王爷",
	"赵云",
	"紫霞仙子",
	"阿朱",
	"白子画",
	"貂蝉",
	"凤九",
	"关羽",
	"Q版魔化毗舍童子",
	"花无缺",
	"剑圣",
	"巨灵神",
	"李蓉蓉",
	"怜星",
	"光明战神",
	"洛神",
	"赤炎战神",
	"神僧",
	"青霞仙子",
	"火龙骑士",
	"杀阡陌",
	"通臂猿猴",
	"白龙骑士",
	"尉迟恭",
	"蓝人龙",
	"邀月",
	"太极神君",
	"赵敏",
	"大蛇丸",
	"干柿鬼鲛",
	"佩恩",
	"李洛克",
	"小南",
	"春野樱",
	"宇智波带土",
	"宇智波鼬",
	"宇智波佐助",
	"女仙",
	"斧魂",
	"剑魂",
	"枪魂",
	"月皇",
	"鬼妃",
	"月灵",
	"琴鹤",
	"晶怪",
	"魂女猫",
	"金凤凰",
	"砍刀猴",
	"金长毛猪",
	"蓝衣剑魂",
	"鸟妖仙",
	"龙魂仙女",
	"黑悟空",
	"孙行者",
	"白衣剑客",
	"猫女",
	"莲女",
	"绿衣女神",
	"五彩神女",
	"红衣仙女",
	"葫芦小金刚",
	"路飞",
	"部落勇士",
	"部落酋长",
	"幼狮",
	"嘲风",
	"吕布",
	"魔化吕布",
	"神射手",
	"黑猫警长",
	"惊奇队长",
	"灭霸",
	"绿巨人",
	"钢铁侠",
	"雷神托尔",
	"智慧女神",
	"龙女",
	"呆枭",
	"怒鳞",
	"紫焰妖姬",
	"白素贞",
	"彩蝶依依",
	"春岚蔷薇",
	"剑姬",
	"小青",
	"妖星",
	"女飞贼",
	"白娘子",
	"貂裘红衣",
	"小魔女",
	"小狐狸",
	"蓝仙女",
	"女捕头",
	"女狐妖",
	"三尾妖狐",
	"蝠女",
	"男狐妖",
	"婚纱女",
	"红娘子",
	"蝶妖",
	"鬼魅",
	"六道带土",
	"大筒木辉夜",
	"鼬",
	"佐助",
	"小佐助",
	"旗木卡卡西",
	"鸣人",
	"小鸣人",
	"带土",
	"我爱罗",
	"六道斑",
	"镜子变脸",
	"手铃变脸",
	"三叉变脸",
	"长鞭变脸",
	"金锤变脸",
	"喷火变脸",
	"关羽变脸",
	"黑脸判官",
	"青衣",
	"卧龙",
	"小蓝",
	"虎王",
	"白脸京剧",
	"黑脸京剧"
}
自选宠物列表1 = {}

for i = 1, #自选宠物列表 do
	自选宠物列表1[自选宠物列表[i]] = 1
end

localmp = require("ForYourOwnUse/MessagePack")
__S服务 = require("ForYourOwnUse/PackServer")("服务", "-->内网连接")
__S服务.发送_ = __S服务.发送

function __S服务:发送(id, ...)
	self:发送_(id, localmp.pack({
		...
	}))
end

function __S服务:gm发送(id, ...)
	self:发送_(id, ...)
end

__S服务:置工作线程数量(500)

__S服务:置预投递数量(5000)

随机序列 = 0
错误日志 = {}
__N连接数 = 0
__C客户信息 = {}
fgf = "123229*-*123229"
fgc = "123229@+@123229"
NB开关 = false
服务端参数 = {
	运行时间 = 0,
	启动时间 = os.time(),
	分钟 = os.date("%M", os.time()),
	小时 = os.date("%H", os.time())
}

require("lfs")

程序目录 = lfs.currentdir() .. "\\"
初始目录 = 程序目录
format = string.format
星期 = os.date("%w")
f函数 = require("ffi函数2")
ffi = require("ffi")
无双西游 = false
盒子账号 = "5571696"
盒子名称 = "泰迪"
管理账号 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "管理账号")

文件是否存在 = function(name)
	local f = io.open(name, "r")

	if f ~= nil then
		io.close(f)

		return true
	else
		return false
	end
end

读取数据文件没有则空表 = function(文件路径)
	if 文件是否存在(文件路径) then
		return table.loadstring(读入文件(文件路径))
	else
		return {}
	end
end

信息框 = function(msg, title, type)
	ffi.C.MessageBoxA(nil, msg, title or "信息", mtype or 0)
end

机器码 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "机器码")
服务器名称 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "服务器名称")
服务端参数.ip = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "ip")
服务端参数.端口 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "端口")
版本 = "Yoru鏊kari17錒=熬" .. "淼ji"
微变爆率 = false
GM工具 = true
吊游定制 = false
助战消费 = true
追忆年华 = true
神兽定制 = false
烹饪三药定制 = false
五虎上将定制 = true
定制八卦炉 = false
刻晴定制 = false
强化技能 = false
二级药品定制 = false
新手召唤兽定制 = false
定制装备融合 = false
侠义任务定制 = false
福利宝箱 = true
魔化沙僧 = false
魔化取经 = false
七十二地煞星 = false
结婚定制 = false
VIP定制 = true
调试模式 = false
假人系统 = true
-- if 服务端参数.ip == "127.0.0.1" then
-- 	假人系统 = false
-- else
-- 	假人系统 = false
-- end

服务器关闭 = {
	计时 = 300,
	开关 = false,
	起始 = os.time()
}
跑镖遇怪时间 = {
	计时 = 120,
	开关 = false,
	起始 = os.time()
}

require("Script/角色处理类/符石组合类")
require("Script/数据中心/宝宝")
require("Script/数据中心/宝图")
require("Script/数据中心/变身卡")
require("Script/数据中心/场景NPC")
require("Script/数据中心/场景NPC1")
require("Script/数据中心/场景等级")
require("Script/数据中心/场景名称")
require("Script/数据中心/传送圈位置")
require("Script/数据中心/传送位置")
require("Script/数据中心/法术技能特效")
require("Script/数据中心/活动")
require("Script/数据中心/角色")
require("Script/数据中心/明暗雷怪")
require("Script/数据中心/取经验")
require("Script/数据中心/取师门")
require("Script/数据中心/染色")
require("Script/数据中心/物品")
require("Script/数据中心/野怪")
require("Script/数据中心/题库")
require("Script/数据中心/掉落数据")
require("Script/数据中心/装备特技")
require("Script/系统处理类/共用")
require("Script/数据中心/符石组合")

假人玩家处理类在线 = true
物品类 = require("Script/角色处理类/内存类_物品")
宝宝类 = require("Script/角色处理类/宝宝")
地图坐标类 = require("Script/地图处理类/地图坐标类")
路径类 = require("Script/地图处理类/路径类")
地图处理类 = require("Script/地图处理类/地图处理类")()
假人玩家处理类 = require("Script/Bot/CatBooth")()

if 假人玩家处理类 == nil then
	假人玩家处理类在线 = false
end

摆摊假人处理类 = require("Script/Bot/摆摊假人")()
假人代码 = loadstring(读入文件("摆摊假人.txt"))

摆摊假人处理类:addBoothNpc(假人代码())
摆摊假人处理类:功能开关(true)

if 假人系统 then
	json = require("Script/Bot/json")
	BBTableBiz = require("Script/Bot/BBTableBiz")
	BoothBotBiz = require("Script/Bot/BoothBotBiz")
	ItemTableBiz = require("Script/Bot/ItemTableBiz")
	BoothDb = require("Script/Bot/BoothDb").创建()
	假人初始化 = require("Script/Bot/BoothDb")
	BoothCtrl = require("Script/Bot/BoothCtrl").创建()
	BotBiz = require("Script/Bot/BotBiz")
	TeamBotBiz = require("Script/Bot/TeamBotBiz")
	BotDb = require("Script/Bot/BotDb").创建()
	BotCtrl = require("Script/Bot/BotCtrl").创建()
	BotManager = require("Script/Bot/BotManager").创建()
end

账号记录 = {}
房屋数据 = {}
网络处理类 = require("Script/系统处理类/网络处理类")()
系统处理类 = require("Script/系统处理类/系统处理类")()
聊天处理类 = require("Script/系统处理类/聊天处理类")()
任务处理类 = require("Script/系统处理类/任务处理类")()
管理工具类 = require("Script/系统处理类/管理工具类")()
游戏活动类 = require("Script/系统处理类/游戏活动类")()
角色处理类 = require("Script/角色处理类/角色处理类")
道具处理类 = require("Script/角色处理类/道具处理类")
装备处理类 = require("Script/角色处理类/装备处理类")
礼包奖励类 = require("Script/角色处理类/礼包奖励类")()
通用道具 = require("Script/角色处理类/道具处理类")()
帮派处理类 = require("Script/角色处理类/帮派处理类")()
对话处理类 = require("Script/对话处理类/初始")()
商店处理类 = require("Script/商店处理类/商店处理类")()
商城处理类 = require("Script/商店处理类/商城处理类")()
队伍处理类 = require("Script/角色处理类/队伍处理类")()
战斗准备类 = require("Script/战斗处理类/战斗准备类")()
战斗处理类 = require("Script/战斗处理类/战斗处理类")
召唤兽处理类 = require("Script/角色处理类/召唤兽处理类")
助战处理类 = require("Script/角色处理类/助战系统")
孩子处理类 = require("Script/角色处理类/孩子处理类")
商城神兽 = require("Script/数据中心/商城神兽")
召唤兽仓库类 = require("Script/角色处理类/召唤兽仓库类")

商店处理类:刷新珍品()
商店处理类:刷新跑商商品买入价格()
商城处理类:加载商品()

管理工具类2 = require("Script/系统处理类/管理工具类2")()
幻化处理类 = require("Script/角色处理类/幻化处理类")()
打造处理类 = require("Script/角色处理类/打造处理类")()
刷怪处理 = require("Script/系统处理类/刷怪处理")()
全局坐骑资料 = require("script/数据中心/坐骑库")()
拍卖系统类 = require("Script/系统处理类/拍卖系统类")()
帮战活动类 = require("Script/系统处理类/帮战活动类")()
副本处理类 = require("Script/副本处理类/副本处理类")()
长安保卫战 = require("Script/系统处理类/新增活动/长安保卫战")()
雁塔地宫 = require("Script/系统处理类/新增活动/雁塔地宫")()
天降辰星 = require("Script/系统处理类/新增活动/天降辰星")()
大闹天宫 = require("Script/系统处理类/新增活动/副本/大闹天宫")()
黑风山 = require("Script/系统处理类/新增活动/副本/黑风山")()
挂机系统 = require("Script/系统处理类/新增活动/挂机系统")()
老猫附体 = false
临时题库 = 读入文件("sjtk.txt")
临时题库 = 分割文本(临时题库, "*")
三界题库 = {}
铃铛记录 = {}

for n = 1, #临时题库 do
	临时题库[n] = 分割文本(临时题库[n], "？")
	三界题库[n] = {
		问题 = 临时题库[n][1],
		答案 = 临时题库[n][2]
	}
end

三界书院 = {
	答案 = "",
	开关 = false,
	结束 = 60,
	起始 = os.time(),
	间隔 = 取随机数(60, 90) * 60,
	名单 = {}
}

获取IP限制数 = function()
	return f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "多开限制") + 0
end

加载排行榜 = function()
	排行榜数据 = 读取数据文件没有则空表("tysj/排行榜.txt")
	召唤兽排行榜数据 = 读取数据文件没有则空表("tysj/召唤兽排行榜.txt")
	装备排行榜数据 = 读取数据文件没有则空表("tysj/装备排行榜.txt")
end

加载排行榜()

装备类型列表 = {
	"头盔",
	"项链",
	"武器",
	"衣服",
	"腰带",
	"鞋子"
}

刷新装备排行榜 = function(装备数据, 主人名称, 分数)
	local 符合 = true

	if 装备排行榜数据.头盔 == nil then
		装备排行榜数据.头盔 = {}
	end

	if 装备排行榜数据.项链 == nil then
		装备排行榜数据.项链 = {}
	end

	if 装备排行榜数据.武器 == nil then
		装备排行榜数据.武器 = {}
	end

	if 装备排行榜数据.衣服 == nil then
		装备排行榜数据.衣服 = {}
	end

	if 装备排行榜数据.腰带 == nil then
		装备排行榜数据.腰带 = {}
	end

	if 装备排行榜数据.鞋子 == nil then
		装备排行榜数据.鞋子 = {}
	end

	local 类型 = 装备类型列表[装备数据.分类]
	local 判断数据 = 装备数据.识别码

	for k = 1, #装备排行榜数据[类型] do
		if 装备排行榜数据[类型][k].识别码 == 判断数据 then
			if 装备排行榜数据[类型][k].分数 <= 分数 then
				符合 = false

				if 装备排行榜数据[类型][k].分数 < 分数 then
					装备排行榜数据[类型][k] = {
						分数 = 分数,
						主人名称 = 主人名称,
						装备名称 = 装备数据.名称,
						装备数据 = DeepCopy(装备数据),
						识别码 = 判断数据
					}
					装备排行榜数据[类型][k].装备数据.临时附魔 = nil
					装备排行榜数据[类型][k].装备数据.星位 = nil

					table.sort(装备排行榜数据[类型], function (a, b)
						return b.分数 < a.分数
					end)
				end

				break
			end

			table.remove(装备排行榜数据[类型], k)

			break
		end
	end

	if 符合 then
		if #装备排行榜数据[类型] >= 10 and 分数 <= 装备排行榜数据[类型][10].分数 then
			return
		else
			装备排行榜数据[类型][#装备排行榜数据[类型] + 1] = {
				分数 = 分数,
				主人名称 = 主人名称,
				装备名称 = 装备数据.名称,
				装备数据 = DeepCopy(装备数据),
				识别码 = 判断数据
			}

			table.sort(装备排行榜数据[类型], function (a, b)
				return b.分数 < a.分数
			end)

			for m = 1, #装备排行榜数据[类型] do
				if m > 10 then
					table.remove(装备排行榜数据[类型])
				else
					装备排行榜数据[类型][m].装备数据.临时附魔 = nil
					装备排行榜数据[类型][m].装备数据.星位 = nil
				end
			end
		end
	end
end

刷新召唤兽排行榜 = function(bb数据, 主人名称, 分数)
	local 符合 = true

	if 召唤兽排行榜数据.评分 == nil then
		召唤兽排行榜数据.评分 = {}
	end

	if 召唤兽排行榜数据.气血 == nil then
		召唤兽排行榜数据.气血 = {}
	end

	if 召唤兽排行榜数据.伤害 == nil then
		召唤兽排行榜数据.伤害 = {}
	end

	if 召唤兽排行榜数据.法伤 == nil then
		召唤兽排行榜数据.法伤 = {}
	end

	if 召唤兽排行榜数据.防御 == nil then
		召唤兽排行榜数据.防御 = {}
	end

	if 召唤兽排行榜数据.法防 == nil then
		召唤兽排行榜数据.法防 = {}
	end

	if 召唤兽排行榜数据.速度 == nil then
		召唤兽排行榜数据.速度 = {}
	end

	local 排行榜索引 = {
		法伤 = "法伤",
		伤害 = "伤害",
		速度 = "速度",
		气血 = "气血",
		评分 = "评分",
		法防 = "法防",
		防御 = "防御"
	}

	for i, v in pairs(排行榜索引) do
		符合 = true
		local 判断id = bb数据.认证码
		local 判断数据 = bb数据[v]

		if i == "评分" then
			判断数据 = 分数
		end

		for k = 1, #召唤兽排行榜数据[i] do
			if 召唤兽排行榜数据[i][k].认证码 == 判断id then
				if 判断数据 <= 召唤兽排行榜数据[i][k].分数 then
					符合 = false
					local 召唤兽数据 = DeepCopy(bb数据)
					召唤兽数据.宠物图鉴系统 = nil
					召唤兽数据.进阶属性 = nil
					召唤兽数据.面板技能 = nil
					召唤兽数据.内丹 = nil
					召唤兽数据.套装 = nil
					召唤兽数据.统御属性 = nil
					召唤兽排行榜数据[i][k] = {
						bb数据 = 召唤兽数据,
						主人名称 = 主人名称,
						分数 = 判断数据,
						名称 = bb数据.名称,
						模型 = bb数据.模型,
						认证码 = 判断id
					}

					if 召唤兽排行榜数据[i][k].分数 < 判断数据 then
						table.sort(召唤兽排行榜数据[i], function (a, b)
							return b.分数 < a.分数
						end)
					end

					break
				end

				table.remove(召唤兽排行榜数据[i], k)

				break
			end
		end

		if 符合 and (#召唤兽排行榜数据[i] < 10 or 判断数据 > 召唤兽排行榜数据[i][10].分数) then
			召唤兽排行榜数据[i][#召唤兽排行榜数据[i] + 1] = {
				更新 = 1,
				分数 = 判断数据
			}

			if #召唤兽排行榜数据[i] >= 1 then
				table.sort(召唤兽排行榜数据[i], function (a, b)
					return b.分数 < a.分数
				end)
			end

			for m = 1, #召唤兽排行榜数据[i] do
				if m > 10 then
					table.remove(召唤兽排行榜数据[i])
				elseif 召唤兽排行榜数据[i][m].更新 == 1 then
					local 召唤兽数据 = DeepCopy(bb数据)
					召唤兽数据.宠物图鉴系统 = nil
					召唤兽数据.进阶属性 = nil
					召唤兽数据.面板技能 = nil
					召唤兽数据.内丹 = nil
					召唤兽数据.套装 = nil
					召唤兽数据.统御属性 = nil
					召唤兽排行榜数据[i][m] = {
						bb数据 = 召唤兽数据,
						主人名称 = 主人名称,
						分数 = 判断数据,
						名称 = bb数据.名称,
						模型 = bb数据.模型,
						认证码 = 判断id
					}
				end
			end
		end
	end
end

领取特殊官职称谓 = function(id, 称谓)
	if id == nil or 玩家数据[id] == nil or 称谓 == nil or 特殊官职称谓要求[称谓] == nil then
		return
	end

	local 要求 = 特殊官职称谓要求[称谓]
	local 文功 = (玩家数据[id].角色.数据.文功 or 0) + 0
	local 武勋 = (玩家数据[id].角色.数据.武勋 or 0) + 0
	local 总贡献 = 文功 + 武勋

	if 总贡献 < 要求.总贡献 or 文功 < 要求.文功 or 武勋 < 要求.武勋 then
		return
	else
		if 要求.满足其一 ~= nil and 文功 < 要求.满足其一 and 武勋 < 要求.满足其一 then
			return
		end

		玩家数据[id].角色:添加称谓(id, 称谓)
	end
end

刷新特殊官职称谓 = function()
	昨日特殊称谓列表 = DeepCopy(今日特殊称谓列表 or {})
	今日特殊称谓列表 = {}
	官职防多次 = os.time()

	f函数.写配置(程序目录 .. "配置文件.ini", "主要配置", "官职防多次", 官职防多次)

	if 排行榜数据.文功 == nil then
		排行榜数据.文功 = {}
	end

	if 排行榜数据.武勋 == nil then
		排行榜数据.武勋 = {}
	end

	if 排行榜数据.总贡献 == nil then
		排行榜数据.总贡献 = {}
	end

	if #排行榜数据.文功 > 0 then
		for i = 1, #排行榜数据.文功 do
			cw = "功标青史·太傅"

			if i <= 5 then
				cw = "功标青史·太师"
			end

			if 今日特殊称谓列表[排行榜数据.文功[i].id] == nil then
				今日特殊称谓列表[排行榜数据.文功[i].id] = {}
			end

			今日特殊称谓列表[排行榜数据.文功[i].id][#今日特殊称谓列表[排行榜数据.文功[i].id] + 1] = cw
			今日特殊称谓列表[排行榜数据.文功[i].id][cw] = 1
		end
	end

	if #排行榜数据.武勋 > 0 then
		for i = 1, #排行榜数据.武勋 do
			cw = "铁券丹书·太保"

			if i <= 5 then
				cw = "铁券丹书·太尉"
			end

			if 今日特殊称谓列表[排行榜数据.武勋[i].id] == nil then
				今日特殊称谓列表[排行榜数据.武勋[i].id] = {}
			end

			今日特殊称谓列表[排行榜数据.武勋[i].id][#今日特殊称谓列表[排行榜数据.武勋[i].id] + 1] = cw
			今日特殊称谓列表[排行榜数据.武勋[i].id][cw] = 1
		end
	end

	if #排行榜数据.总贡献 > 0 then
		for i = 1, #排行榜数据.总贡献 do
			cw = "国士无双·国公"

			if i <= 5 then
				cw = "金章紫绶·郡王"

				if i == 1 then
					cw = "御赐金封·辅佐王"
				end
			end

			if 今日特殊称谓列表[排行榜数据.总贡献[i].id] == nil then
				今日特殊称谓列表[排行榜数据.总贡献[i].id] = {}
			end

			今日特殊称谓列表[排行榜数据.总贡献[i].id][#今日特殊称谓列表[排行榜数据.总贡献[i].id] + 1] = cw
			今日特殊称谓列表[排行榜数据.总贡献[i].id][cw] = 1
		end
	end

	local aa = 判断是否为空表(昨日特殊称谓列表)

	for k, v in pairs(玩家数据) do
		local 称谓列表 = ""

		if aa then
			称谓列表 = 列表模式转换(玩家数据[k].角色.数据.称谓 or {})

			for i = 1, #特殊官职称谓列表 do
				if 称谓列表[特殊官职称谓列表[i]] ~= nil and (今日特殊称谓列表[k] == nil or 今日特殊称谓列表[k][特殊官职称谓列表[i]] == nil) then
					玩家数据[k].角色:删除称谓(k, 特殊官职称谓列表[i])
				end
			end
		elseif 昨日特殊称谓列表[k] ~= nil then
			称谓列表 = 列表模式转换(玩家数据[k].角色.数据.称谓 or {})

			for i = 1, #特殊官职称谓列表 do
				if 称谓列表[特殊官职称谓列表[i]] ~= nil and (今日特殊称谓列表[k] == nil or 今日特殊称谓列表[k][特殊官职称谓列表[i]] == nil) then
					玩家数据[k].角色:删除称谓(k, 特殊官职称谓列表[i])
				end
			end

			昨日特殊称谓列表[k] = nil
		end

		if 今日特殊称谓列表[k] ~= nil then
			for i = 1, #今日特殊称谓列表[k] do
				if 称谓列表 == "" then
					称谓列表 = 列表模式转换(玩家数据[k].角色.数据.称谓 or {})
				end

				if 称谓列表[今日特殊称谓列表[k][i]] == nil then
					领取特殊官职称谓(k, 今日特殊称谓列表[k][i])
				end
			end
		end

		玩家数据[k].角色.数据.官职更新 = 官职防多次
	end
end

上线更新数据 = function(id)
	上线更新官职称谓(id)

	玩家数据[id].角色.数据.商城版本 = nil
	玩家数据[id].角色.数据.超级行囊打开 = {}
	玩家数据[id].角色.数据.道具行囊打开 = {}
	玩家数据[id].角色.数据.道具仓库打开 = {}
	玩家数据[id].角色.数据.辅助技能学习次数 = 玩家数据[id].角色.数据.辅助技能学习次数 or 1
	玩家数据[id].角色.数据.助战辅助技能学习次数 = 玩家数据[id].角色.数据.助战辅助技能学习次数 or 1
end

上线更新官职称谓 = function(id)
	if 玩家数据[id].角色.数据.官职更新 == 官职防多次 then
		return
	end

	local aa = 判断是否为空表(昨日特殊称谓列表)
	local 称谓列表 = ""

	if aa then
		称谓列表 = 列表模式转换(玩家数据[id].角色.数据.称谓 or {})

		for i = 1, #特殊官职称谓列表 do
			if 称谓列表[特殊官职称谓列表[i]] ~= nil and (今日特殊称谓列表[id] == nil or 今日特殊称谓列表[id][特殊官职称谓列表[i]] == nil) then
				玩家数据[id].角色:删除称谓(id, 特殊官职称谓列表[i])
			end
		end
	elseif 昨日特殊称谓列表[id] ~= nil then
		称谓列表 = 列表模式转换(玩家数据[id].角色.数据.称谓 or {})

		for i = 1, #特殊官职称谓列表 do
			if 称谓列表[特殊官职称谓列表[i]] ~= nil and (今日特殊称谓列表[id] == nil or 今日特殊称谓列表[id][特殊官职称谓列表[i]] == nil) then
				玩家数据[id].角色:删除称谓(id, 特殊官职称谓列表[i])
			end
		end

		昨日特殊称谓列表[id] = nil
	end

	if 今日特殊称谓列表[id] ~= nil then
		for i = 1, #今日特殊称谓列表[id] do
			if 称谓列表 == "" then
				称谓列表 = 列表模式转换(玩家数据[id].角色.数据.称谓 or {})
			end

			if 称谓列表[今日特殊称谓列表[id][i]] == nil then
				领取特殊官职称谓(id, 今日特殊称谓列表[id][i])
			end
		end
	end

	玩家数据[id].角色.数据.官职更新 = 官职防多次
end

刷新角色单个排行榜 = function(id, 类型, 分数)
	if 排行榜数据[类型] ~= nil then
		for k = 1, #排行榜数据[类型] do
			if 排行榜数据[类型][k].id == id then
				排行榜数据[类型][k] = {
					id = id,
					分数 = 分数,
					名称 = 玩家数据[id].角色.数据.名称
				}

				if k > 1 and 排行榜数据[类型][k - 1].分数 < 分数 then
					table.sort(排行榜数据[类型], function (a, b)
						return b.分数 < a.分数
					end)
				end

				return
			end

			if k == #排行榜数据[类型] then
				if k < 10 then
					排行榜数据[类型][k + 1] = {
						id = id,
						分数 = 分数,
						名称 = 玩家数据[id].角色.数据.名称
					}
				else
					排行榜数据[类型][k] = {
						id = id,
						分数 = 分数,
						名称 = 玩家数据[id].角色.数据.名称
					}

					if k > 1 and 排行榜数据[类型][k - 1].分数 < 分数 then
						table.sort(排行榜数据[类型], function (a, b)
							return b.分数 < a.分数
						end)
					end
				end
			end
		end
	end
end

定制装备不上排行榜列表 = {
	法伤 = 1,
	伤害 = 1,
	速度 = 1,
	气血 = 1
}

定制装备检测 = function(id)
	if 玩家数据[id] ~= nil then
		for i = 1, #玩家数据[id].角色.数据.装备 do
			local aa = 玩家数据[id].角色.数据.装备[1]

			if 玩家数据[id].道具.数据[aa] ~= nil and 玩家数据[id].道具.数据[aa].隐藏 ~= nil then
				return true
			end
		end
	end
end

刷新排行榜 = function(id)
	local 符合 = true

	if 排行榜数据.等级 == nil then
		排行榜数据.等级 = {}
	end

	if 排行榜数据.气血 == nil then
		排行榜数据.气血 = {}
	end

	if 排行榜数据.伤害 == nil then
		排行榜数据.伤害 = {}
	end

	if 排行榜数据.法伤 == nil then
		排行榜数据.法伤 = {}
	end

	if 排行榜数据.速度 == nil then
		排行榜数据.速度 = {}
	end

	if 排行榜数据.仙玉 == nil then
		排行榜数据.仙玉 = {}
	end

	if 排行榜数据.财富 == nil then
		排行榜数据.财富 = {}
	end

	if 排行榜数据.文功 == nil then
		排行榜数据.文功 = {}
	end

	if 排行榜数据.武勋 == nil then
		排行榜数据.武勋 = {}
	end

	if 排行榜数据.总贡献 == nil then
		排行榜数据.总贡献 = {}
	end

	if 排行榜数据.通天塔 == nil then
		排行榜数据.通天塔 = {}
	end

	local 排行榜索引 = {
		文功 = "文功",
		仙玉 = "仙玉",
		伤害 = "伤害",
		气血 = "最大气血",
		财富 = "银子",
		通天塔 = "通天塔",
		武勋 = "武勋",
		法伤 = "法伤",
		速度 = "速度",
		总贡献 = "总贡献",
		等级 = "等级"
	}

	for i, v in pairs(排行榜索引) do
		符合 = true
		local 判断id = id
		local 判断数据 = 玩家数据[id].角色.数据[v] or 0

		if i == "仙玉" then
			判断id = 玩家数据[id].账号
			判断数据 = f函数.读配置(程序目录 .. "data\\" .. 玩家数据[id].账号 .. "\\账号信息.txt", "账号配置", "仙玉") + 0
		elseif i == "通天塔" then
			if 通天塔数据[id] ~= nil then
				判断数据 = 通天塔数据[id].层数 or 0
			else
				判断数据 = 0
			end

		elseif i == "总贡献" then
			判断数据 = (玩家数据[id].角色.数据.文功 or 0) + (玩家数据[id].角色.数据.武勋 or 0)
		end

		local 定制装备 = false

		if 定制装备不上排行榜列表[i] ~= nil and 定制装备检测(id) == true then
			定制装备 = true
			判断数据 = qz(判断数据 / 2)
		end

		for k = 1, #排行榜数据[i] do
			if 排行榜数据[i][k].id == 判断id then
				if 判断数据 <= 排行榜数据[i][k].分数 then
					符合 = false
					排行榜数据[i][k] = {
						id = 判断id,
						分数 = 判断数据,
						名称 = 玩家数据[id].角色.数据.名称
					}

					if 排行榜数据[i][k].分数 < 判断数据 then
						table.sort(排行榜数据[i], function (a, b)
							return b.分数 < a.分数
						end)
					end

					break
				end

				table.remove(排行榜数据[i], k)

				break
			end
		end

		if 符合 and (#排行榜数据[i] < 10 or 判断数据 > 排行榜数据[i][10].分数) then
			排行榜数据[i][#排行榜数据[i] + 1] = {
				id = 判断id,
				分数 = 判断数据,
				名称 = 玩家数据[id].角色.数据.名称
			}

			if #排行榜数据[i] >= 1 then
				table.sort(排行榜数据[i], function (a, b)
					return b.分数 < a.分数
				end)
			end

			if #排行榜数据[i] > 10 then
				for m = 11, #排行榜数据[i] do
					table.remove(排行榜数据[i])
				end
			end
		end
	end
end

数据存档 = {}

循环函数 = function()
	服务端参数.运行时间 = 服务端参数.运行时间 + 1

	if 战斗准备类 ~= nil then
		战斗准备类:更新(dt)
	end

	长安保卫战:活动定时器()

	if 任务处理类 ~= nil then
		任务处理类:更新()
	end

	if os.time() - 塔怪刷新 >= 600 then
		任务处理类:设置大雁塔怪(id)

		塔怪刷新 = os.time()
	elseif os.time() - 剑会匹配 >= 5 then
		系统处理类:剑会天下单人匹配处理()
		系统处理类:剑会天下三人匹配处理()
		系统处理类:剑会天下五人匹配处理()

		剑会匹配 = os.time()
	elseif os.time() - 年兽 >= 7200 then
		商店bb = {}
		变异商店bb = {}
		年兽 = os.time()
	elseif os.time() - 水果刷新 >= 1200 then
		任务处理类:捣乱的水果(id)

		水果刷新 = os.time()
	elseif os.time() - 天庭叛逆刷新 >= 1500 then
		任务处理类:设置天庭叛逆(id)

		天庭叛逆刷新 = os.time()
	elseif os.time() - 建邺东海刷新 >= 1800 then
		任务处理类:设置建邺东海小活动(id)

		建邺东海刷新 = os.time()
	elseif os.time() - 保存数据 >= 600 then
		保存系统数据()

		保存数据 = os.time()
	elseif os.time() - 异步保存数据 >= 15 then
		保存玩家数据()

		异步保存数据 = os.time()
	end

	时辰函数()

	if os.time() - 服务端参数.启动时间 >= 1 then
		整秒处理(os.date("%S", os.time()))

		服务端参数.启动时间 = os.time()
	end

	if os.date("%X", os.time()) == os.date("%H", os.time()) .. ":00:00" then
		整点处理(os.date("%H", os.time()))
	elseif 服务端参数.分钟 ~= os.date("%M", os.time()) and os.date("%S", os.time()) == "00" then
		整分处理(os.date("%M", os.time()))
	end

	if os.time() - 副本更新 >= 1 then
		if 副本处理类 ~= nil then
			副本处理类:更新()
		end

		副本更新 = os.time()
	end
end

刷新每日十二祖巫 = function()
	今日祖巫数据 = {
		今日 = 取列表多项(十二祖巫列表, 3)
	}
	今日祖巫数据.今日1 = 列表模式转换(今日祖巫数据.今日)
end

刷新每日 = function()
	奖励名称 = {}
	师门数据 = {}
	押镖数据 = {}
	心魔宝珠 = {}
	十二生肖 = {}
	科举数据 = {}
	双倍数据 = {}
	三倍数据 = {}
	在线时间 = {}
	新手活动 = {}
	快捷抓鬼次数 = {}
	月卡数据 = {}
	一键师门 = {}
	一键抓鬼 = {}
	一键封妖 = {}
	一键官职 = {}
	抓鬼仙玉 = 0
	雪人限制 = {}

	重置副本()
	任务处理类:开启迷宫()
	天降辰星:开启活动()
	任务处理类:开启镖王活动()

	if tonumber(os.date("%w")) == 1 then
		雁塔地宫:每周归零()
	else
		雁塔地宫:每日下调()
	end

	刷新每日十二祖巫()

	生死劫数据.次数 = {}
	比武奖励 = {}
	剑会天下 = {}
	剑会天下单人匹配 = {}
	剑会天下三人匹配 = {}
	剑会天下五人匹配 = {}
	剑会天下次数统计 = {}
	活动次数 = {
		日期 = os.date("%m月%d日")
	}
	新手活动 = {}
	副本奖励 = {}

	for n, v in pairs(玩家数据) do
		副本奖励[n] = {}
	end

	活跃数据 = {}

	for n, v in pairs(玩家数据) do
		活跃数据[n] = {
			领取300活跃 = false,
			领取500活跃 = false,
			领取400活跃 = false,
			领取200活跃 = false,
			领取100活跃 = false,
			活跃度 = 0
		}
	end

	发送公告("#G美好的一天从这一秒开始，游戏对应的活动任务数据已经刷新，大家可以前去领取任务或参加活动了")

	for n, v in pairs(任务数据) do
		if 任务数据[n].类型 == 7 then
			local id = 任务数据[n].玩家id

			if 玩家数据[id] ~= nil then
				玩家数据[id].角色:取消任务(n)
				常规提示(id, "由于科举数据已经刷新，您本次的活动资格已经被强制取消，请重新参加此活动！")
			end

			任务数据[n] = nil
		end
	end

	交易中心 = {}

	初始化交易中心()
end

保存大额日志 = function()
	if 大额日志内容 == nil then
		大额日志内容 = "日志创建\n"
	end

	if 大额日志内容 == "日志创建\n" then
		return
	end

	local mc = os.date("%Y年%m月%d日%H时%M分%S秒")

	写出文件("大额日志记录/" .. mc .. ".txt", 大额日志内容)

	大额日志内容 = "日志创建\n"
end

整秒处理 = function(时间)
	for k, v in pairs(退出战斗列表) do
		if 玩家数据[v] ~= nil and 玩家数据[v].战斗 ~= 0 then
			战斗准备类.战斗盒子[玩家数据[v].战斗]:结束战斗2()
		else
			退出战斗列表[k] = nil
		end
	end

	发送传音阵列()

	if 三界书院.开关 and 三界书院.结束 <= os.time() - 三界书院.起始 then
		三界书院.开关 = false

		for n = 1, #三界书院.名单 do
			if 玩家数据[三界书院.名单[n].id] ~= nil then
				玩家数据[三界书院.名单[n].id].道具:给予道具(三界书院.名单[n].id, "金银锦盒", 5)
				玩家数据[三界书院.名单[n].id].角色:添加银子(1000, "答题", 1)
				添加仙玉(5, 玩家数据[三界书院.名单[n].id].账号, 三界书院.名单[n].id, "答题")

				if n <= 10 and (取随机数() <= 10 or n == 1) then
					玩家数据[三界书院.名单[n].id].道具:给予道具(三界书院.名单[n].id, "坐骑内丹", 1)
					广播消息({
						频道 = "xt",
						内容 = "#G/(世界答题)#R" .. 三界书院.名单[n].名称 .. "#G才思敏捷，作答正确，获得了#R坐骑内丹#G一个！"
					})
				end
			end
		end

		广播消息({
			频道 = "xt",
			内容 = "#Y/正确答案：#R/" .. 三界书院.答案
		})

		if #三界书院.名单 == 0 then
			广播消息({
				频道 = "xt",
				内容 = "#Y/真是遗憾，竟然无人可以回答正确。"
			})
		else
			local 卡片等级 = 取随机数(4, 9)

			广播消息({
				频道 = "xt",
				内容 = "#Y/知识就是金钱，每一位作答正确的玩家均获得1000银子，5仙玉以作奖励#G" .. 三界书院.名单[1].名称 .. "#Y/以#R/" .. 三界书院.名单[1].用时 .. "#Y/秒惊人的飞速抢先作答正确，获得了额外的#G/10#Y/个金银锦盒和一张#G/" .. 卡片等级 .. "#Y/级怪物卡片的奖励和2000银子，10点仙玉"
			})

			if 玩家数据[三界书院.名单[1].id] ~= nil then
				玩家数据[三界书院.名单[1].id].角色:添加银子(2000, "答题", 1)
				添加仙玉(10, 玩家数据[三界书院.名单[1].id].账号, 三界书院.名单[1].id, "答题")
				玩家数据[三界书院.名单[1].id].道具:给予道具(三界书院.名单[1].id, "金银锦盒", 10)
				玩家数据[三界书院.名单[1].id].道具:给予道具(三界书院.名单[1].id, "怪物卡片", 卡片等级)
				常规提示(三界书院.名单[1].id, "你获得了一张" .. 卡片等级 .. "级怪物卡片和10个金银锦盒！")

				if 取随机数() <= 1 then
					玩家数据[三界书院.名单[1].id].道具:给予道具(三界书院.名单[1].id, "祥瑞坐骑礼包", 1)
					广播消息({
						频道 = "xt",
						内容 = "#G/(世界答题)#R" .. 三界书院.名单[1].名称 .. "#G才思敏捷，作答正确，让考官大感欣慰，因此获得了考官赠予的#R祥瑞坐骑礼包#G一个！"
					})
				end
			end
		end
	end

	-- if 假人系统 then
	-- 	任务处理类:假人刷屏2()--secondLoop()
	-- end

	for n, v in pairs(玩家数据) do
		if 玩家数据[n].角色:取任务(300) ~= 0 and 玩家数据[n].角色.数据.跑镖遇怪时间 ~= nil and 玩家数据[n].角色.数据.跑镖遇怪时间 <= os.time() then
			任务处理类:跑镖遇怪()
		end
	end

	for n, v in pairs(玩家数据) do
		if 玩家数据[n].角色.数据.帮派限时属性 == nil then
			玩家数据[n].角色.数据.帮派限时属性 = os.time()
		end

		if 玩家数据[n].角色.数据.帮派限时属性开关 == nil then
			玩家数据[n].角色.数据.帮派限时属性开关 = 1
		end

		if 玩家数据[n].角色.数据.帮派限时属性 ~= nil and 玩家数据[n].角色.数据.帮派限时属性开关 == true and 玩家数据[n].角色.数据.帮派限时属性 < os.time() then
			玩家数据[n].角色.数据.帮派限时属性开关 = false
		end

		if 玩家数据[n].角色.数据.帮派限时属性开关 == false then
			玩家数据[n].角色.数据.最大气血 = 玩家数据[n].角色.数据.最大气血 - 500
			玩家数据[n].角色.数据.伤害 = 玩家数据[n].角色.数据.伤害 - 150
			玩家数据[n].角色.数据.防御 = 玩家数据[n].角色.数据.防御 - 50
			玩家数据[n].角色.数据.帮派限时属性开关 = 1
		end
	end

	if 服务器关闭 ~= nil and 服务器关闭.开关 then
		服务器关闭.计时 = 服务器关闭.计时 - 1

		__S服务:输出("服务器关闭倒计时：" .. 服务器关闭.计时)

		if 服务器关闭.计时 <= 60 and 服务器关闭.计时 > 0 then
			广播消息({
				频道 = "xt",
				内容 = "#Y/服务器将在#R/" .. 服务器关闭.计时 .. "#Y/秒后关闭,请所有玩家立即下线。"
			})
		elseif 服务器关闭.计时 <= 0 then
			玩家全部下线()
		end
	end

	for n, v in pairs(玩家数据) do
		if 玩家数据[n] ~= nil and 玩家数据[n].角色 ~= nil and 玩家数据[n].管理 == nil then
			玩家数据[n].角色:增加在线时间()
		end
	end

	藏宝阁更新()

	if 时间 == "01" and 服务端参数.小时 == "0" and 服务端参数.分钟 == "0" then
		刷新每日()
	end

	if 首席争霸开启 ~= nil and os.time() - 首席争霸开启 >= 600 then
		开启首席争霸()

		首席争霸开启 = nil
	end

	if 比武开启 ~= nil and os.time() - 比武开启 >= 600 then
		游戏活动类:开启比武大会比赛()

		比武开启 = nil
	end

	if 迷宫数据.开关 and os.time() - 迷宫数据.事件 >= 300 then
		迷宫数据.事件 = os.time()

		任务处理类:刷新迷宫小怪()
	end

	if 宝藏山数据.开关 then
		宝藏山数据.间隔 = 宝藏山数据.间隔 - 1

		if 宝藏山数据.间隔 == 60 then
			地图处理类:当前消息广播1(5001, "#Y各位玩家请注意，宝藏山将在#R1#Y分钟后刷出宝箱。")
		elseif 宝藏山数据.间隔 == 30 then
			地图处理类:当前消息广播1(5001, "#Y各位玩家请注意，宝藏山将在#R30#Y秒后刷出宝箱。")
		elseif 宝藏山数据.间隔 <= 0 then
			任务处理类:宝藏山刷出宝箱()

			宝藏山数据.间隔 = 180
		end

		if os.time() - 宝藏山数据.起始 >= 999999 then
			宝藏山数据.开关 = false

			广播消息({
				频道 = "xt",
				内容 = "#G/宝藏山活动已经结束，处于场景内的玩家将被自动传送出场景。"
			})
			地图处理类:清除地图玩家(5001, 1226, 115, 15)
		end
	end

	for n, v in pairs(自动遇怪) do
		if 玩家数据[n] == nil then
			自动遇怪[n] = nil
		end

		if 自动遇怪[n] ~= nil and 自动遇怪[n] ~= 0 and 服务端参数.自动遇怪时间 <= os.time() - (自动遇怪[n] + 1) then
			if 玩家数据[n].战斗 == 0 and 取队长权限(n) and 取场景等级(玩家数据[n].角色.数据.地图数据.编号) ~= nil then
				自动遇怪[n] = 0

				if 取随机数(1, 10000) <= 暗雷遇神兽几率 * 10 then
					战斗准备类:创建战斗(n, 100225, 0)
					常规提示(n, "#Y你遇到神兽啦!!!")
				else
					战斗准备类:创建战斗(n, 100001, 0)
				end
			elseif 玩家数据[n].角色.数据.地图数据.编号 >= 1601 and 玩家数据[n].角色.数据.地图数据.编号 <= 1620 then
				自动遇怪[n] = 0

				战斗准备类:创建战斗(n, 100019)
			else
				自动遇怪[n] = os.time()
			end
		end
	end

	if 自动挂机间隔 <= 0 then
		挂机系统:处理()

		自动挂机间隔 = 自动挂机间隔标准 + 0
	else
		自动挂机间隔 = 自动挂机间隔 - 1
	end

	for n, v in pairs(自动捉鬼) do
		if 玩家数据[n] == nil then
			自动捉鬼[n] = nil
		end

		if 自动捉鬼[n] ~= nil and 自动捉鬼[n] ~= 0 and 服务端参数.自动捉鬼时间 <= os.time() - (自动捉鬼[n] + 1) then
			if 玩家数据[n].战斗 == 0 and 取队长权限(n) then
				自动捉鬼[n] = 0

				if 活动次数查询(n, "自动捉鬼") == false then
					玩家数据[n].角色.数据.自动捉鬼 = false

					常规提示(n, "#Y/次数不足，关闭自动捉鬼功能！")

					自动捉鬼[n] = nil

					发送数据(玩家数据[n].连接id, 48.1, {
						自动捉鬼 = 玩家数据[n].角色.数据.自动捉鬼
					})

					return
				end

				战斗准备类:创建战斗(n + 0, 100239)
			else
				自动捉鬼[n] = os.time()
			end
		end
	end
end

整点处理 = function(时刻)
	if 服务端参数.小时 == 时刻 then
		return 0
	else
		服务端参数.小时 = 时刻
		服务端参数.分钟 = "0"

		保存系统数据()

		for n, v in pairs(玩家数据) do
			if 玩家数据[n] ~= nil then
				发送数据(v.连接id, 3521.1)
			end
		end

		广播消息({
			频道 = "xt",
			内容 = format("#G全服#物品已经#Y刷新\n快去找找有啥好东西吧#1")
		})
		摆摊假人处理类:Refresh()
	end

	if 帮派数据 ~= nil then
		for i = 1, #帮派数据 do
			if 帮派数据[i] ~= nil then
				帮派处理类:维护处理(i)
			end
		end
	end

	if 时刻 == "0" then
		保存大额日志()
	elseif 时刻 == "9" then
	elseif 时刻 == "11" then
	elseif 时刻 == "12" then
		保存大额日志()
	elseif 时刻 == "17" then
	elseif 时刻 == "18" then
	elseif 时刻 == "19" then
		长安保卫战:开启活动()
		刷怪处理:星期六活动()
	elseif 时刻 == "20" then
		刷怪处理:结束星期六活动()
		游戏活动类:开启剑会天下()
	elseif 时刻 == "21" then
		游戏活动类:关闭剑会天下()
	elseif 时刻 == "22" then
	elseif 时刻 == "23" then
	end
end

随机种子 = 10086

整分处理 = function(时间)
	if string.len(大额日志内容) >= 10240 then
		保存大额日志()
	end

	for k, v in pairs(临时仙玉列表) do
		添加仙玉写入(v, k, "每分同步仙玉", 1)
	end

	临时仙玉列表 = {}
	local aa1 = 1

	if ygsj() <= 50 then
		aa1 = -1
	end

	随机种子 = ((随机种子 or 0) + ygsj(1000)) * aa1

	math.randomseed(tostring(os.time() + 随机种子))

	服务端参数.分钟 = 时间

	if 服务端参数.小时 ~= 0 and 服务端参数.分钟 ~= 0 and 活动次数.日期 ~= os.date("%m月%d日") then
		刷新每日()
	end

	if 时间 == "00" or 时间 == "10" or 时间 == "20" or 时间 == "30" or 时间 == "40" or 时间 == "50" then
		商店处理类:刷新跑商商品买入价格()
		任务处理类:小鬼子(id)
		任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)

		for i, v in pairs(跑商) do
			跑商[i] = 取商品卖出价格(i)
		end

		if 时间 == "10" or 时间 == "30" or 时间 == "50" then
			保存系统数据()
		elseif 时间 == "20" or 时间 == "40" or 时间 == "00" then
			collectgarbage("collect")
		end
	end

	if 服务端参数.小时 + 0 >= 12 and 服务端参数.小时 + 0 <= 17 and 三界书院.间隔 <= os.time() - 三界书院.起始 then
		三界书院.起始 = os.time()

		任务处理类:开启三界书院()
	end

	if 时间 == "50" then
		任务处理类:刷出星宿()
		任务处理类:刷出星宿()
		任务处理类:刷出星宿()
		任务处理类:刷出星宿()
		任务处理类:刷出星宿()
		任务处理类:刷出星宿()
		任务处理类:刷出散财童子()
		任务处理类:刷新世界BOSS()


	elseif  时间 == "1" or  时间 == "3" or 时间 == "6"

    	or 时间 == "8"or  时间 == "9"or 时间 == "11"or 时间 == "13" or 时间 == "57"or 时间 == "59"--or  时间 == "51" or 时间 == "52"or 时间 == "53"or 时间 == "54"or 时间 == "56"or 时间 == "57"or 时间 == "58"or 时间 == "59"then




    	or 时间 == "19"or  时间 == "20"or   时间 == "24"  or  时间 == "23" or  时间 == "21"  or 时间 == "46"or 时间 == "47"or 时间 == "48" or  时间 == "34" or 时间 == "38"or 时间 == "36"then


    	任务处理类:假人刷屏2()



     elseif 时间 == "2"or 时间 == "4"or 时间 == "7"or 时间 == "9"or 时间 == "12"or 时间 == "32"or 时间 == "33"

    		 or 时间 == "41"or 时间 == "42"or 时间 == "43"or 时间 == "44"

    	or 时间 == "21"or 时间 == "23"or 时间 == "34"or  时间 == "26"or 时间 == "27"then

    	任务处理类:假人刷屏1()


	elseif 时间 == "28" then
		商店处理类:刷新珍品()


	elseif 时间 == "30" then
		任务处理类:突厥探子()
		任务处理类:突厥精英()
		任务处理类:刷出妖魔鬼怪()
		任务处理类:刷新门派入侵()
		任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:化圣六(id)
	任务处理类:化圣六(id)
	任务处理类:化圣六(id)




	elseif 时间 == "00" then
		任务处理类:突厥探子()
		任务处理类:突厥精英()
		任务处理类:捣乱的年兽()
		任务处理类:刷新门派入侵()
		任务处理类:刷出妖魔鬼怪()
	elseif 时间 == "15" then
		任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
			任务处理类:决战九黎城(id)
			任务处理类:决战九黎城(id)
				任务处理类:决战九黎城(id)
		任务处理类:突厥探子()
		任务处理类:修炼宝箱()
		任务处理类:突厥精英()

	elseif 时间 == "45" then
		任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
			任务处理类:决战九黎城(id)
			任务处理类:决战九黎城(id)
				任务处理类:决战九黎城(id)
		任务处理类:突厥探子()
		任务处理类:修炼宝箱()
		任务处理类:突厥精英()



	elseif 时间 == "10" then
		任务处理类:刷出新服福利BOSS()
		任务处理类:刷出知了王()
		任务处理类:开启地煞星任务()
		任务处理类:开启天罡星任务()
		 任务处理类:超级boss(id)
		  任务处理类:超级boss(id)
		   任务处理类:超级boss(id)
	elseif 时间 == "20" then
		任务处理类:刷新世界BOSS()
		任务处理类:福利宝箱()
		任务处理类:刷出知了王()
		任务处理类:出其不意终结者(id)
		  任务处理类:出其不意终结者(id)
		    任务处理类:出其不意终结者(id)
		      任务处理类:出其不意终结者后转(id)
	elseif 时间 == "40" then
		任务处理类:刷出新服福利BOSS()
		任务处理类:开启地煞星任务()
		任务处理类:开启天罡星任务()
	    任务处理类:出其不意终结者(id)
	      任务处理类:出其不意终结者(id)
	        任务处理类:出其不意终结者(id)
	         任务处理类:出其不意终结者后转(id)
	elseif 时间 == "35" then
		任务处理类:刷出知了王()
		任务处理类:五虎上将关羽(id)
		任务处理类:五虎上将关羽(id)
		任务处理类:五虎上将关羽(id)
	elseif 时间 == "37" then

		 for i, v in pairs(玩家数据) do
					if 玩家数据[i] ~= nil  then
						玩家数据[i].道具:发放在线奖励(i)
					end
				end


    elseif 时间 == "58" then
	任务处理类:五虎上将关羽(id)
	任务处理类:五虎上将关羽(id)
	任务处理类:五虎上将关羽(id)
	end
end

名称数据 = {}
队伍数据 = {}
道具记录 = {}
交易数据 = {}
捉鬼数据 = {}
妖魔积分 = {}
游戏数据 = {}
师门数据 = {}
新手活动 = {}
活跃数据 = {}
押镖数据 = {}
心魔宝珠 = {}
十二生肖 = {}
科举数据 = {}
自动遇怪 = {}
自动捉鬼 = {}
帮派数据 = {}
帮派竞赛 = {}
神秘宝箱 = {}
炼丹炉 = {}
炼丹查看 = {}
商品存放 = {}
比武大会 = {}
首席争霸 = {}
充值数据 = {}
打造熟练度数据 = {}
今日祖巫数据 = {}
银子数据 = {}
签到数据 = {}
成就数据 = {}
交易中心 = {}
VIP数据 = {}
帮派缴纳情况 = {}
商店bb = {}
变异商店bb = {}
抓鬼仙玉 = 0
房屋数据 = {}
师徒数据 = {}
新手活动 = {}
观察藏宝阁数据 = {}
活动次数 = {}
皇宫飞贼 = {
	开关 = false
}
迷宫数据 = {
	开关 = false
}
镖王活动 = {
	开关 = false
}
降妖伏魔 = {
	开关 = false
}
国庆活动 = {
	保卫战 = {
		积分 = 0,
		地图 = 1110,
		次数 = 0,
		开关 = false,
		玩家 = {},
		起始 = os.time()
	}
}
副本列表 = {
	"天蓬娶亲",
	"白龙闹海",
	"乌鸡国",
	"车迟斗法",
	"水陆大会",
	"通天河",
	"大闹天宫",
	"齐天大圣",
	"一斛珠",
	"黑风山"
}
副本数据 = {}

for i = 1, #副本列表 do
	副本数据[副本列表[i]] = {
		进行 = {},
		完成 = {}
	}
end

宝藏山数据 = {
	刷新 = 0,
	间隔 = 600,
	开关 = false,
	起始 = os.time()
}
剧情数据 = {
	渡劫 = {
		进行 = {}
	}
}
年兽数据 = {}
十二辰星 = {
	起始 = 0,
	开关 = false,
	记录 = {}
}
闯关参数 = {
	起始 = 0,
	开关 = false,
	记录 = {}
}
飞升开关 = true
时辰信息 = {
	当前 = 1,
	天气 = 0,
	刷新 = 60,
	起始 = os.time()
}
昼夜参数 = 1
聊天监控 = {}
比武排行 = {}
qz = math.floor
异步保存次数 = 0
交易中心配置 = {
	"50级装备书铁",
	"60级装备书铁",
	"70级装备书铁",
	"80级装备书铁",
	"90级装备书铁",
	"100级装备书铁",
	"110级装备书铁",
	"120级装备书铁",
	"130级装备书铁",
	"140级装备书铁",
	"150级装备书铁",
	"160级装备书铁",
	"低级兽决",
	"高级兽决",
	"特殊兽决",
	"道具",
	"低级灵饰书铁",
	"高级灵饰书铁",
	"野怪1",
	"野怪2",
	"野怪3",
	"野怪4",
	"野怪5",
	"野怪6"
}
交易中心配置1 = {}

快捷读配置文件 = function(主要配置, 配置, 为空写入值, 倍率)
	if 倍率 == nil then
		倍率 = 1
	end

	local aa = f函数.读配置(程序目录 .. "配置文件.ini", 主要配置, 配置)

	if aa == "空" then
		aa = 为空写入值

		f函数.写配置(程序目录 .. "配置文件.ini", 主要配置, 配置, 为空写入值)
	end

	if tonumber(aa) ~= nil and tonumber(aa) >= 0 then
		aa = tonumber(aa) * 倍率
	end

	return aa
end

读取自定义配置 = function()
	服务端参数.时间 = os.time()
	服务端参数.连接限制 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "连接数") + 0
	服务端参数.角色id = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "id") + 0
	服务端参数.经验获得率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "经验") + 0
	服务端参数.经验获得率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "经验") + 0
	服务端参数.银子获得率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "银子") + 0
	服务端参数.储备获得率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "储备") + 0
	服务端参数.角色升级潜能点 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "角色升级潜能点") + 0
	服务端参数.助战升级潜能点 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "助战升级潜能点") + 0
	服务端参数.宝宝升级潜能点 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "宝宝升级潜能点") + 0
	服务端参数.坐骑升级潜能点 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "坐骑升级潜能点") + 0
	服务端参数.倍率模式 = 倍率模式 + 0
	服务端参数.BB经验模式 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "不参战得经验开关") + 0
	服务端参数.专用概率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "鉴定专用概率") + 0
	服务端参数.专用属性上限 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "专用属性上限") * 1000 + 0
	服务端参数.专用属性下限 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "专用属性下限") * 1000 + 0
	服务端参数.自动遇怪时间 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "自动遇怪时间") + 0
	服务端参数.自动捉鬼时间 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "自动捉鬼时间") + 0
	服务端参数.自动战斗等待时间 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "自动战斗等待时间") + 0
	服务端参数.回合命令时间 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "回合命令时间")

	if 服务端参数.回合命令时间 == "空" then
		服务端参数.回合命令时间 = 60

		f函数.写配置(程序目录 .. "配置文件.ini", "主要配置", "回合命令时间", 60)
	else
		服务端参数.回合命令时间 = qz(tonumber(服务端参数.回合命令时间)) + 0
	end

	野外宝宝概率 = 快捷读配置文件("主要配置", "野外宝宝概率", 2, 100)
	野外变异概率 = 快捷读配置文件("主要配置", "野外变异概率", 0.15, 100)
	野外特殊宝宝概率 = 快捷读配置文件("主要配置", "野外特殊宝宝概率", 0.15, 100)
	暗雷遇神兽几率 = 快捷读配置文件("主要配置", "野外神兽概率", 0.05, 100)
	属性石数量 = 快捷读配置文件("主要配置", "属性石可使用数量", 属性石数量, 1)
	中秋炮数量 = 快捷读配置文件("主要配置", "中秋炮可使用数量", 中秋炮数量, 1)
	资质丸数量 = 快捷读配置文件("主要配置", "资质丸可使用数量", 资质丸数量, 1)
	大力神丸数量 = 快捷读配置文件("主要配置", "大力神丸可使用数量", 大力神丸数量, 1)
	local zz = {
		"攻击资质",
		"防御资质",
		"体力资质",
		"法力资质",
		"速度资质",
		"躲闪资质",
		"成长"
	}

	for i = 1, #zz do
		资质上限[zz[i]] = 快捷读配置文件("召唤兽资质上限", zz[i], 资质上限[zz[i]], 1)
		神兽资质上限[zz[i]] = 快捷读配置文件("神兽资质上限", zz[i], 神兽资质上限[zz[i]], 1)
	end

	打书必上技能数 = math.min(快捷读配置文件("主要配置", "打书必上技能数", 4, 1), 24)
	打书最大格子数 = math.min(快捷读配置文件("主要配置", "打书最大格子数", 10, 1), 24)
	合宠保底技能数量 = 快捷读配置文件("主要配置", "合宠保底技能数量", 5, 1)
	装备全部位绿字 = 快捷读配置文件("主要配置", "装备全部位绿字", 0, 1)

	if 装备全部位绿字 == 1 then
		装备全部位绿字 = true
	else
		装备全部位绿字 = false
	end

	if 打书最大格子数 < 打书必上技能数 then
		打书必上技能数 = 打书最大格子数 + 0
	end

	追加法术概率倍率 = 快捷读配置文件("主要配置", "追加法术概率倍率", 1, 1)
	百炼词条叠加 = 快捷读配置文件("主要配置", "百炼词条叠加", 0)

	if 百炼词条叠加 == 1 then
		百炼词条叠加 = true
	else
		百炼词条叠加 = false
	end

	百炼词条高数值 = 快捷读配置文件("主要配置", "百炼词条高数值", 0)

	if 百炼词条高数值 == 1 then
		百炼词条高数值 = true
	else
		百炼词条高数值 = false
	end

	bb套装生效件数 = 快捷读配置文件("主要配置", "召唤兽套装生效件数", 3)
	角色套装a = 快捷读配置文件("主要配置", "角色套装生效件数1", 3)
	角色套装b = math.max(快捷读配置文件("主要配置", "角色套装生效件数2", 5), 角色套装a)
	服务端参数.愤怒超限 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "允许愤怒超限") + 0
	门派减伤开关 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "同门派减伤") + 0
	官职防多次 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "官职防多次")

	if 官职防多次 == "空" then
		官职防多次 = os.time()

		f函数.写配置(程序目录 .. "配置文件.ini", "主要配置", "官职防多次", 官职防多次)
	else
		官职防多次 = tonumber(官职防多次)
	end

	if 门派减伤开关 == 1 then
		门派减伤开关 = true
	else
		门派减伤开关 = false
	end

	服务端参数.特效追加概率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "特效追加概率") + 0
	服务端参数.强化特效追加概率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "强化特效追加概率") + 0
	服务端参数.难度 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "难度") + 0
	服务端参数.服务器上限 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "服务器上限") + 0
	服务端参数.属性石伤害 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石伤害") + 0
	服务端参数.属性石灵力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石灵力") + 0
	服务端参数.属性石防御 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石防御") + 0
	服务端参数.属性石速度 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石速度") + 0
	服务端参数.属性石气血 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石气血") + 0
	服务端参数.属性石魔法 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石魔法") + 0
	服务端参数.属性石力量 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石力量") + 0
	服务端参数.属性石魔力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石魔力") + 0
	服务端参数.属性石耐力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石耐力") + 0
	服务端参数.属性石体质 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石体质") + 0
	服务端参数.属性石敏捷 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "属性石敏捷") + 0
	服务端参数.中秋炮伤害 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮伤害") + 0
	服务端参数.中秋炮灵力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮灵力") + 0
	服务端参数.中秋炮防御 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮防御") + 0
	服务端参数.中秋炮速度 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮速度") + 0
	服务端参数.中秋炮气血 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮气血") + 0
	服务端参数.中秋炮魔法 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮魔法") + 0
	服务端参数.中秋炮力量 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮力量") + 0
	服务端参数.中秋炮魔力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮魔力") + 0
	服务端参数.中秋炮耐力 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮耐力") + 0
	服务端参数.中秋炮体质 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮体质") + 0
	服务端参数.中秋炮敏捷 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "中秋炮敏捷") + 0
	服务端参数.资质丸 = {
		攻击资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-攻击资质下限") + 0,
		攻击资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-攻击资质上限") + 0,
		防御资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-防御资质下限") + 0,
		防御资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-防御资质上限") + 0,
		体力资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-体力资质下限") + 0,
		体力资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-体力资质上限") + 0,
		法力资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-法力资质下限") + 0,
		法力资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-法力资质上限") + 0,
		速度资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-速度资质下限") + 0,
		速度资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-速度资质上限") + 0,
		躲闪资质下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-躲闪资质下限") + 0,
		躲闪资质上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-躲闪资质上限") + 0,
		成长下限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-成长下限") * 1000 + 0,
		成长上限 = f函数.读配置(程序目录 .. "特色道具参数.ini", "道具配置", "资质丸-成长上限") * 1000 + 0
	}
	管理账号 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "管理账号")

	if 管理账号 ~= "空" then
		管理账号列表[管理账号] = 1
	end

	武神坛使者 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "武神坛使者") + 0
	充值比例 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "充值比例") + 0
	兑换比例 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "点卡比仙玉") + 0
	打造熟练度开关 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "打造熟练度开关") + 0
	打书模式 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "打书模式") + 0
	角色移速 = f函数.读配置(程序目录 .. "配置文件.ini", "其他设置", "角色移速") + 0
	月卡移速 = f函数.读配置(程序目录 .. "配置文件.ini", "其他设置", "月卡加成移速") + 0
	助战奖励换算 = f函数.读配置(程序目录 .. "配置文件.ini", "其他设置", "助战奖励换算人数")


	if 助战奖励换算 ~= "空" then
		助战奖励换算人数 = qz(助战奖励换算) + 0
	end

	全局奖励倍率1 = f函数.读配置(程序目录 .. "配置文件.ini", "其他设置", "全局奖励倍率")

	if 全局奖励倍率1 ~= "空" then
		全局奖励倍率 = qz(全局奖励倍率1) + 0
	end

	经脉限制 = f函数.读配置(程序目录 .. "配置文件.ini", "其他设置", "经脉限制")

	if 经脉限制 == 1 or 经脉限制 == "1" then
		经脉限制开关 = true
	else
		经脉限制开关 = false
	end

	for i = 1, #交易中心配置 do
		交易中心配置1[交易中心配置[i]] = f函数.读配置(程序目录 .. "交易中心配置.ini", "交易中心", 交易中心配置[i])
	end

	服务端参数.交易中心刷新 = f函数.读配置(程序目录 .. "jyzx.ini", "主要配置", "jyzx") or ""
	服务端参数.刷新坐骑召唤兽统御 = f函数.读配置(程序目录 .. "jyzx.ini", "主要配置", "zqbb") or ""
	全局战斗难度 = {}
	local sx = {
		"伤害",
		"气血",
		"灵力",
		"速度",
		"防御",
		"法防",
		"躲避",
		"魔法"
	}

	for i = 1, #sx do
		全局战斗难度[sx[i]] = f函数.读配置(程序目录 .. "配置文件.ini", "全局怪物属性", sx[i]) + 0
	end
end

读取自定义配置()

if 刷新交易中心 and 服务端参数.交易中心刷新 ~= 更新交易中心 then
	f函数.写配置(程序目录 .. "jyzx.ini", "主要配置", "jyzx", 更新交易中心)
	初始化交易中心()
end

节日开关 = false
首席争霸报名开关 = false
首席争霸进场 = false
首席争霸开关 = false
宝箱开关 = false
服务端参数.连接数 = 0
游泳开关 = false
网关认证 = false
比武大会报名开关 = false
在线数据 = {}
玩家数据 = {}
双倍数据 = {}
三倍数据 = {}
在线时间 = {}
剑会记录 = {}
快捷抓鬼次数 = {}
月卡数据 = {}
一键师门 = {}
一键抓鬼 = {}
一键封妖 = {}
一键官职 = {}
雪人限制 = {}
藏宝阁记录 = ""
水果刷新 = os.time()
剑会匹配 = os.time()
年兽 = os.time()
塔怪刷新 = os.time()
天庭叛逆刷新 = os.time()
建邺东海刷新 = os.time()
可以抓捕 = os.time()
王者荣耀 = os.time()
保存数据 = os.time()
异步保存数据 = os.time()
副本更新 = os.time()

__S服务:启动(服务端参数.ip, 服务端参数.端口)
__S服务:置标题("更多游戏请访问游戏海湾资源网:www.2018gm.com-服务端    当前在线人数：" .. __N连接数)

随机序列 = 0

__S服务:输出("开始加载科举题库")

local 临时题库 = 读入文件("tk.txt")
local 题库 = 分割文本(临时题库, "#-#")
科举题库 = {}

for n = 1, #题库 do
	科举题库[n] = 分割文本(题库[n], "=-=")
end

__S服务:输出(format("加载题库结束，总共加载了%s道科举题目", #科举题库))

三界书院 = {
	答案 = "",
	开关 = false,
	结束 = 60,
	起始 = os.time(),
	间隔 = 取随机数(30, 90),
	名单 = {}
}

__S服务:输出(format("加载题库结束，总共加载了%s道科举题目", #科举题库))

读取tysj数据 = function()
	临时数据 = table.loadstring(读入文件("tysj/任务数据.txt"))
	帮派数据 = table.loadstring(读入文件("tysj/帮派数据.txt"))
	神秘宝箱 = table.loadstring(读入文件("tysj/神秘宝箱.txt"))
	比武大会 = table.loadstring(读入文件("tysj/比武大会.txt"))
	首席争霸 = table.loadstring(读入文件("tysj/首席争霸.txt"))
	帮派竞赛 = table.loadstring(读入文件("tysj/帮派竞赛.txt"))
	经验数据 = table.loadstring(读入文件("tysj/经验数据.txt"))
	押镖数据 = table.loadstring(读入文件("tysj/押镖数据.txt"))
	银子数据 = table.loadstring(读入文件("tysj/银子数据.txt"))
	充值数据 = table.loadstring(读入文件("tysj/充值数据.txt"))
	名称数据 = table.loadstring(读入文件("tysj/名称数据.txt"))
	妖魔积分 = table.loadstring(读入文件("tysj/妖魔数据.txt"))
	消息数据 = table.loadstring(读入文件("tysj/消息数据.txt"))
	生死劫数据 = table.loadstring(读入文件("tysj/生死劫数据.txt"))
	好友黑名单 = table.loadstring(读入文件("tysj/好友黑名单.txt"))
	活跃数据 = table.loadstring(读入文件("tysj/活跃数据.txt"))
	活动次数 = table.loadstring(读入文件("tysj/活动次数.txt"))
	副本奖励 = table.loadstring(读入文件("tysj/副本奖励.txt"))
	支线奖励 = table.loadstring(读入文件("tysj/支线奖励.txt"))
	首杀记录 = table.loadstring(读入文件("tysj/首杀记录.txt"))
	签到数据 = table.loadstring(读入文件("tysj/签到数据.txt"))
	通天塔数据 = table.loadstring(读入文件("tysj/通天塔数据.txt"))
	房屋数据 = table.loadstring(读入文件("tysj/房屋数据.txt"))
	藏宝阁数据 = table.loadstring(读入文件("tysj/藏宝阁数据.txt"))
	寄存数据 = table.loadstring(读入文件("tysj/寄存数据.txt"))
	师徒数据 = table.loadstring(读入文件("tysj/师徒数据.txt"))
	国庆数据 = table.loadstring(读入文件("tysj/国庆数据.txt"))
	比武奖励 = table.loadstring(读入文件("tysj/比武奖励.txt"))
	战宠奖励 = table.loadstring(读入文件("tysj/战宠奖励.txt"))
	拍卖系统数据 = table.loadstring(读入文件("tysj/拍卖系统.txt"))
	成就数据 = table.loadstring(读入文件("tysj/成就数据.txt"))
	交易中心 = table.loadstring(读入文件("tysj/交易中心.txt"))
	雪人活动 = table.loadstring(读入文件("tysj/雪人活动.txt"))
	图鉴系统 = table.loadstring(读入文件("tysj/图鉴系统.txt"))
	比武大会 = table.loadstring(读入文件("tysj/比武大会.txt"))
	打造熟练度数据 = 读取数据文件没有则空表("tysj/打造熟练度数据.txt")
	今日祖巫数据 = 读取数据文件没有则空表("tysj/今日祖巫数据.txt")
end

读取tysj数据()

if 判断是否为空表(今日祖巫数据) then
	刷新每日十二祖巫()
end

if 雪人活动.雪人鼻子 == nil then
	雪人活动.雪人鼻子 = 0
	雪人活动.雪人帽子 = 0
	雪人活动.雪人眼睛 = 0
	雪人活动.上限 = 1000
end

if 首杀记录.商人的鬼魂 == nil then
	首杀记录.商人的鬼魂 = 0
	首杀记录.妖风 = 0
	首杀记录.白鹿精 = 0
	首杀记录.酒肉和尚 = 0
	首杀记录.守门天兵 = 0
end

剑会天下开关 = false
剑会天下单人匹配开关 = true
剑会天下三人匹配开关 = true
剑会天下五人匹配开关 = true
剑会天下单人匹配 = {}
剑会天下三人匹配 = {}
剑会天下五人匹配 = {}
剑会天下次数统计 = {}

if f函数.文件是否存在("tysj/剑会天下.txt") == false then
	剑会天下 = {}

	写出文件("tysj/剑会天下.txt", table.tostring(剑会天下))
else
	剑会天下 = table.loadstring(读入文件("tysj/剑会天下.txt"))
end

if f函数.文件是否存在("tysj/比武大会.txt") == false then
	比武大会 = {
		报名 = {},
		积分 = {}
	}

	写出文件("tysj/比武大会.txt", table.tostring(比武大会))
else
	比武大会 = table.loadstring(读入文件("tysj/比武大会.txt"))
end

if 定制八卦炉 then
	炼丹炉 = table.loadstring(读入文件("tysj/炼丹炉.txt"))
	炼丹炉.时间 = 120
end

任务数据 = {}

if 经验数据.排行 == nil then
	经验数据.排行 = {}
	经验数据.百亿 = {}
	经验数据.千亿 = {}
end

for n, v in pairs(临时数据) do
	任务数据[临时数据[n].存储id] = table.loadstring(table.tostring(临时数据[n]))
end

地图处理类:加载房屋()

function __S服务:启动成功()
	return 0
end

function __S服务:GetIPLimit()
	return f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "多开限制") + 0
end

限制时间戳 = os.time()

text_to_hex = function(text)
	local hex_str = ""

	for i = 1, #text do
		local ascii_code = string.byte(text, i)
		local hex = string.format("%02X", ascii_code)
		hex_str = hex_str .. hex
	end

	return hex_str
end

文本混淆 = function(wb, 解密)
	local aa = wb .. ""
	local aa1 = {
		"0",
		"1",
		"2",
		"3",
		"4",
		"5",
		"6",
		"7",
		"8",
		"9",
		"a",
		"b",
		"c",
		"d",
		"e",
		"f",
		"g",
		"h",
		"i",
		"j",
		"k",
		"l",
		"m",
		"n",
		"o",
		"p",
		"q",
		"r",
		"s",
		"t",
		"u",
		"v",
		"w",
		"x",
		"y",
		"z"
	}
	local aa2 = {
		"à",
		"ō",
		"ó",
		"ē",
		"ú",
		"ǔ",
		"é",
		"ě",
		"è",
		"ī",
		"í",
		"ǐ",
		"ā",
		"á",
		"ǎ",
		"ì",
		"ū",
		"ù",
		"ǖ",
		"ǒ",
		"ò",
		"ǘ",
		"ǚ",
		"ǜ",
		"ü",
		"ê",
		"ɑ",
		"\\xa8\\xbc",
		"ń",
		"ň",
		"\\xa8\\xbf",
		"ъ",
		"ы",
		"ь",
		"э",
		"ю"
	}

	if 解密 == nil then
		for i = 1, #aa1 do
			aa = string.gsub(aa, aa1[i], aa2[i])
		end
	else
		for i = 1, #aa1 do
			aa = string.gsub(aa, aa2[i], aa1[i])
		end
	end

	return aa
end

function __S服务:连接进入(ID, IP, PORT)
	服务端连接id = ID

	if f函数.读配置(程序目录 .. "ip封禁.ini", "ip", IP) == "1" or f函数.读配置(程序目录 .. "ip封禁.ini", "ip", IP) == 1 then
		__S服务:输出(string.format("封禁ip的客户进入试图进入(%s):%s:%s", ID, IP, PORT))
		发送数据(ID, 997, "")
	end

	if __N连接数 < 10000 and IP ~= nil then
		if IP == "127.0.0.1" and 网关认证 == false then
			__S服务:输出(string.format("网关进入(%s):%s:%s", ID, IP, PORT))
		else
			__S服务:输出(string.format("GM工具进入(%s):%s:%s", ID, IP, PORT))
		end

		__N连接数 = __N连接数 + 1

		if 神兽开服时间 ~= nil then
			__S服务:置标题("更多游戏请访问游戏海湾资源网:www.2018gm.com-服务端   当前在线人数：" .. __N连接数 .. "     [" .. os.date("%Y", 神兽开服时间) .. "年" .. os.date("%m", 神兽开服时间) .. "月" .. os.date("%d", 神兽开服时间) .. "日 " .. os.date("%X", 神兽开服时间) .. "]")
		else
			__S服务:置标题("更多游戏请访问游戏海湾资源网:www.2018gm.com-服务端    当前在线人数：" .. __N连接数)
		end

		__C客户信息[ID] = {
			IP = IP,
			认证 = os.time(),
			PORT = PORT
		}

		if IP == "127.0.0.1" and 网关认证 == false then
			网关认证 = true
			__C客户信息[ID].网关 = true
			服务端参数.网关id = ID
		end
	--else
		--发送数据(ID, 998, "你已经登录了游戏,请勿多开")
		--__S服务:断开连接(ID)
	end
end

藏宝阁更新 = function()
	local 改变 = false

	for i, v in pairs(藏宝阁数据) do
		for n = 1, #藏宝阁数据[i] do
			if 藏宝阁数据[i][n] ~= nil and 藏宝阁数据[i][n].结束时间 < os.time() then
				local id = 藏宝阁数据[i][n].所有者

				if i ~= "银两" and i ~= "召唤兽" and i ~= "角色" then
					if 寄存数据[id] == nil then
						寄存数据[id] = {
							{
								类型 = "物品",
								物品 = 藏宝阁数据[i][n].物品
							}
						}
					else
						寄存数据[id][#寄存数据[id] + 1] = {
							类型 = "物品",
							物品 = 藏宝阁数据[i][n].物品
						}
					end
				elseif i == "银两" then
					if 寄存数据[id] == nil then
						寄存数据[id] = {
							{
								类型 = "银子",
								数额 = 藏宝阁数据[i][n].数额
							}
						}
					else
						寄存数据[id][#寄存数据[id] + 1] = {
							类型 = "银子",
							数额 = 藏宝阁数据[i][n].数额
						}
					end
				elseif i == "召唤兽" then
					if 寄存数据[id] == nil then
						寄存数据[id] = {
							{
								类型 = "召唤兽",
								召唤兽 = 藏宝阁数据[i][n].召唤兽
							}
						}
					else
						寄存数据[id][#寄存数据[id] + 1] = {
							类型 = "召唤兽",
							召唤兽 = 藏宝阁数据[i][n].召唤兽
						}
					end
				elseif i == "角色" then
					local 角色信息 = table.loadstring(读入文件("data/" .. 藏宝阁数据.角色[n].角色信息.账号 .. "/" .. 藏宝阁数据.角色[n].所有者 .. "/角色.txt"))
					角色信息.藏宝阁出售 = nil

					写出文件("data/" .. 藏宝阁数据.角色[n].角色信息.账号 .. "/" .. 藏宝阁数据.角色[n].所有者 .. "/角色.txt", table.tostring(角色信息))

					角色信息 = nil
				end

				table.remove(藏宝阁数据[i], n)

				改变 = true
			end
		end
	end

	if 改变 then
		for i, v in pairs(观察藏宝阁数据) do
			if 玩家数据[i] ~= nil then
				发送数据(玩家数据[i].连接did, 12205, 藏宝阁数据)
			else
				玩家数据[i] = nil
			end
		end
	end
end

function __S服务:连接退出(ID)
	if __C客户信息[ID] then
		__N连接数 = __N连接数 - 1

		if __C客户信息[ID].网关 then
			网关认证 = false

			__S服务:输出(string.format("网关客户退出(%s):%s:%s", ID, __C客户信息[ID].IP, __C客户信息[ID].PORT))
		end
	else
		__S服务:输出("连接不存在(连接退出)。")
	end

	collectgarbage("collect")
end

function __S服务:数据到达(ID, ...)
	if ID == nil then
		print("接收空链接数据，异常抛出")

		return
	end

	if localmp ~= nil then
		if __C客户信息[ID] then
			if __C客户信息[ID].网关 then
				local arg = localmp.unpack(...)

				网络处理类:数据处理(arg[1], arg[2])
			else
				local arg = {
					[2] = ...,
					[3] = ID
				}

				管理工具类2:数据处理(arg)
			end
		else
			__S服务:输出("连接不存在(数据到达)。")
		end
	else
		local arg = {
			...
		}

		if __C客户信息[ID] then
			if __C客户信息[ID].网关 then
				网络处理类:数据处理(...)
			else
				arg[3] = ID

				管理工具类2:数据处理(arg)
			end
		else
			__S服务:输出("连接不存在(数据到达)。")
		end
	end
end

function __S服务:错误事件(ID, EO, IE)
	if __C客户信息[ID] then
		__S服务:输出(string.format("错误事件(%s):%s,%s:%s", ID, __错误[EO] or EO, __C客户信息[ID].IP, __C客户信息[ID].PORT))
	else
		__S服务:输出("连接不存在(错误事件)。")
	end
end

重置副本 = function()
	for i = 1, #副本列表 do
		副本数据[副本列表[i]].完成 = {}
	end
end

更改打书模式 = function()
	if 打书模式 == 1 then
		打书模式 = 0

		print("#P(打书模式)#Y当前打书模式：直接顶书")
		发送公告("#G服务器当前#R召唤兽打书模式#G已变更为#R直接顶书#G，要给召唤兽打书的玩家请注意！")
	else
		打书模式 = 1

		print("#P(打书模式)#Y当前打书模式：提示顶书")
		发送公告("#G服务器当前#R召唤兽打书模式#G已变更为#R提示顶书#G(顶书会提示顶掉的技能、玩家可选择是否顶书)。")
	end
end

输入函数 = function(t, 数字id)
	if t == "@gxdm" then
		代码函数 = loadstring(读入文件("代码.txt"))

		代码函数()
		__S服务:输出("更新代码成功")
	elseif t == "@sxbt" then
		for n, v in pairs(玩家数据) do
			if 玩家数据[n] ~= nil then
				发送数据(v.连接id, 3521.1)
			end
		end

		广播消息({
			频道 = "xt",
			内容 = format("#G全服#物品已经#Y刷新\n快去找找有啥好东西吧#1")
		})
		摆摊假人处理类:Refresh()
	elseif t == "@bcrz" then
		local 保存语句 = ""

		for n = 1, #错误日志 do
			保存语句 = 保存语句 .. 时间转换(错误日志[n].时间) .. "：#换行符" .. 错误日志[n].记录 .. "#换行符" .. "#换行符"
		end

		写出文件("错误日志.txt", 保存语句)

		错误日志 = {}

		__S服务:输出("保存错误日志成功")
	elseif t == "lmft" then
		老猫附体 = not 老猫附体
		local word = "开启"

		if not 老猫附体 then
			word = "关闭"
		end

		__S服务:输出("序号侦查当前状态为：" .. word)
	elseif t == "@cklb" then
		查看在线列表()
	elseif t == "@qzxx" then
		for n, v in pairs(玩家数据) do
			发送数据(玩家数据[n].连接id, 998, "您的账号已被强制下线，请重新登陆！")
		end
	elseif t == "bbjyms" or t == "宝宝经验模式" then
		if 召唤兽获得经验模式 == 1 then
			召唤兽获得经验模式 = 0


			print("(重启服务端失效)当前宝宝经验获取模式：参战获得")
		else
			召唤兽获得经验模式 = 1

			print("(重启服务端失效)当前宝宝经验获取模式：全体获得")
		end
	elseif t == "@cshjyzx" or t == "666" then
		交易中心 = {}

		初始化交易中心()
		整点处理(1)
		广播消息({
			频道 = "xt",
			内容 = format("#G全服#物品已经#Y刷新\n快去找找有啥好东西吧#1")
		})
		摆摊假人处理类:Refresh()
	elseif t == "@gxjyzx" then
		更新交易中心涨跌幅()
elseif t == "ttt" then
		 通天塔数据 = {}

	elseif t == "@bcsj" or t == "111" then
		保存所有玩家数据()
		保存系统数据()
	elseif t == "@tgds" then
		任务处理类:开启地煞星任务()
		任务处理类:开启天罡星任务()
	elseif t == "yz+1" then
		服务端参数.银子获得率 = 服务端参数.银子获得率 + 1

		print("(重启服务端失效)当前银子获取倍率：" .. 服务端参数.银子获得率)
	elseif t == "yz-1" then
		服务端参数.银子获得率 = 服务端参数.银子获得率 - 1

		print("(重启服务端失效)当前银子获取倍率：" .. 服务端参数.银子获得率)
	elseif t == "jy+1" then
		服务端参数.经验获得率 = 服务端参数.经验获得率 + 1

		print("(重启服务端失效)当前经验倍率：" .. 服务端参数.经验获得率)
	elseif t == "jy-1" then
		服务端参数.经验获得率 = 服务端参数.经验获得率 - 1

		print("(重启服务端失效)当前经验获取倍率：" .. 服务端参数.经验获得率)
	elseif t == "jy+5" then
		服务端参数.经验获得率 = 服务端参数.经验获得率 + 5

		print("(重启服务端失效)当前经验倍率：" .. 服务端参数.经验获得率)
	elseif t == "jy-5" then
		服务端参数.经验获得率 = 服务端参数.经验获得率 - 5

		print("(重启服务端失效)当前经验获取倍率：" .. 服务端参数.经验获得率)
	elseif t == "@kqjh" then
		游戏活动类:开启剑会天下()
	elseif t == "@gbjh" then
		游戏活动类:关闭剑会天下()
	elseif t == "sxhd" then
		刷新活动()
	elseif t == "ymgg" then
		任务处理类:刷出妖魔鬼怪()
	elseif t == "fyrw" then
		任务处理类:刷新封妖任务()
	elseif t == "kqcabwz" then
		长安保卫战:开启活动()
	elseif string.find(tostring(t), "wbjm ") then
		local ml = 分割文本(t, " ")

		print(文本混淆(ml[2], 1))
		print("aaa")
	elseif t == "lwrz" then
		联网认证倒计时 = 1
	elseif t == "csfs" or string.find(tostring(t), "csfs ") then
		玩家数据[10012].角色:添加飞升技能()
	elseif t == "刷新配置" or t == "sxpz" then
		读取自定义配置()
		print("服务端配置已刷新！")
	elseif t == "打书模式" or t == "dsms" then
		更改打书模式()
	elseif t == "@ckfb" then
		local 总数 = 0

		for i, v in pairs(任务数据) do
			if 任务数据[i].类型 == 131 then
				总数 = 总数 + 1
			end
		end

		总数 = 0

		for n, v in pairs(地图处理类.地图单位[6021]) do
			总数 = 总数 + 1
		end
	elseif t == "@sxwzry" then
		任务处理类:刷出王者荣耀()
		elseif t == "@55" then
		任务处理类:假人刷屏2()
		任务处理类:假人刷屏1()
	elseif t == "@sxmhfs" then
		任务处理类:刷新吊游定制()
	elseif t == "@bbw" then
		任务处理类:设置幼儿园()
	elseif t == "sxflbx" then
		任务处理类:福利宝箱()
	elseif t == "@gxsc" then
		商城处理类:加载商品()
	elseif t == "@csrw" then
		table.print(地图处理类.地图单位[6024])
	elseif t == "kqyy" then
		任务处理类:开启游戏比赛()
	elseif t == "sxyk" then
		玩家全部下线()
	elseif t == "@kqgm" then
		GM工具 = false
	elseif t == "@gbgm" then
		GM工具 = true
	elseif t == "开启爆率" then
		微变爆率 = true

		发送公告("#S各位玩家请注意，六倍爆率已开启,玩家的天堂正式起航,所有爆率提高,物品奖励翻倍！。")
	elseif t == "关闭爆率" then
		微变爆率 = false

		发送公告("#S各位玩家请注意，六倍爆率已关闭,地狱模式来临了！。")
	elseif t == "@hysx" then
		活跃数据 = {}
	elseif t == "@scpj" then
		刷怪处理:星期二活动()
	elseif t == "@sxzd" then
		刷新每日()
	elseif t == "@sjtk" then
		三界书院.起始 = os.time()

		任务处理类:开启三界书院()
	elseif t == "@bcjl" then
		补偿奖励 = true

		发送公告("#R各位玩家请注意，因为本次更新修改了大量数据，因此开启节日活动进行补偿大家！谢谢大家的支持与理解！。")
		广播消息({
			频道 = "xt",
			内容 = format("各位玩家请注意，因为本次更新修改了大量数据，因此开启节日活动进行补偿大家！谢谢大家的支持与理解！。")
		})
	elseif t == "@gbbcjl" then
		补偿奖励 = false

		发送公告("#R各位玩家请注意，补偿奖励已关闭！。")
		广播消息({
			频道 = "xt",
			内容 = format("各位玩家请注意，补偿奖励已关闭！！")
		})
	elseif t == "@bwbm" then
		比武大会报名开关 = true
		比武大会.报名 = {}

		发送公告("#Y/英雄比武大会活动已经进入报名阶段，请打算参加活动的玩家在19点前前往长安城比武大会主持人处进行报名。")
		广播消息({
			频道 = "xt",
			内容 = format("英雄比武大会活动已经进入报名阶段，请打算参加活动的玩家在19点前前往长安城比武大会主持人处进行报名。")
		})
	elseif t == "@bwrc" then
		发送公告("#Y/英雄比武大会活动已经开放入场，请参加比武大会的玩家前往长安城比武大会主持人处进行入场。")
		游戏活动类:开启比武大会入场()
	elseif t == "@kqbw" then
		比武大会报名开关 = false

		游戏活动类:开启比武大会比赛()
	elseif t == "@jsbw" then
		游戏活动类:结束比武大会比赛()
	elseif t == "@bwqc" then
		比武大会报名开关 = false
		比武大会.入场 = false
		比武大会.比赛 = false
		比武大会.精锐组 = {
			青龙 = {},
			白虎 = {}
		}
		比武大会.神威组 = {
			青龙 = {},
			白虎 = {}
		}
		比武大会.天科组 = {
			青龙 = {},
			白虎 = {}
		}
		比武大会.天元组 = {
			青龙 = {},
			白虎 = {}
		}
		比武大会.玩家表 = {}
		比武大会.本次积分 = {}

		游戏活动类:强制清除玩家(6003, true)
		游戏活动类:强制清除玩家(6004, true)
		游戏活动类:强制清除玩家(6005, true)
		游戏活动类:强制清除玩家(6006, true)
	elseif t == "@bpwh" then
		if 帮派数据 ~= nil then
			for i = 1, #帮派数据 do
				if 帮派数据[i] ~= nil then
					if 帮派数据[i].帮派资金.当前 <= 帮派数据[i].帮派资金.上限 * 0.2 then
						广播帮派消息({
							频道 = "bp",
							内容 = "[整点维护]#R/本次维护由于帮派资金不足未获得国家相应补助,并且导致帮派繁荣度、安定度、人气度各下降50点"
						}, 帮派数据[i].帮派编号)

						帮派数据[i].繁荣度 = 帮派数据[i].繁荣度 - 50
						帮派数据[i].安定度 = 帮派数据[i].安定度 - 50
						帮派数据[i].人气度 = 帮派数据[i].人气度 - 50

						if 帮派数据[i].繁荣度 <= 100 then
							帮派数据[i].繁荣度 = 100
						end

						if 帮派数据[i].安定度 <= 50 then
							帮派数据[i].安定度 = 50
						end

						if 帮派数据[i].人气度 <= 50 then
							帮派数据[i].人气度 = 50
						end
					else
						帮派处理类:维护处理(i)
					end
				end
			end
		end
	elseif t == "下线更新" then
		服务器关闭 = {
			计时 = 60,
			开关 = true,
			起始 = os.time()
		}

		发送公告("#R各位玩家请注意，服务器将在1分钟后进行更新,届时服务器将临时关闭，请所有玩家注意提前下线。")
		广播消息({
			频道 = "xt",
			内容 = format("#R各位玩家请注意，服务器将在1分钟后进行更新,届时服务器将临时关闭,，请所有玩家提前下线。")
		})
		保存所有玩家数据()
		保存系统数据()
	end
end

取帮派建筑数量 = function(等级)
	if 等级 == 1 then
		return 2
	elseif 等级 == 2 then
		return 4
	elseif 等级 == 3 then
		return 8
	elseif 等级 == 4 then
		return 12
	elseif 等级 == 5 then
		return 16
	end
end

xsjc = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	if 玩家数据[id].角色.数据.剧情.初入桃源村 ~= true and 玩家数据[id].角色.数据.剧情.初入桃源村 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.初入桃源村 = 进程
	else
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(999)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		常规提示(id, "#Y任务剧情赠予的物品在#R超级行囊#Y中、#SCTRL+D#Y打开看看吧！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(1000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(3000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc1 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(998)

	if 玩家数据[id].角色.数据.剧情.商人的鬼魂 ~= true and 玩家数据[id].角色.数据.剧情.商人的鬼魂 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.商人的鬼魂 = 进程
	else
		return
	end

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		常规提示(id, "#Y任务剧情赠予的物品在#R超级行囊#Y中、#SCTRL+D#Y打开看看吧！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(3000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(6000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc2 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(997)

	if 玩家数据[id].角色.数据.剧情.玄奘的身世 ~= true and 玩家数据[id].角色.数据.剧情.玄奘的身世 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.玄奘的身世 = 进程
	else
		return
	end

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(10000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(15000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc3 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	if 玩家数据[id].角色.数据.剧情.大战心魔 ~= true and 玩家数据[id].角色.数据.剧情.大战心魔 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.大战心魔 = 进程
	else
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(996)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(30000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(50000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc4 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	if 玩家数据[id].角色.数据.剧情.含冤小白龙 ~= true and 玩家数据[id].角色.数据.剧情.含冤小白龙 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.含冤小白龙 = 进程
	else
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(995)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(100000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(100000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc5 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	if 玩家数据[id].角色.数据.剧情.女娲神迹 ~= true and 玩家数据[id].角色.数据.剧情.女娲神迹 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.女娲神迹 = 进程
	else
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(994)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(150000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(150000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc6 = function(id, 进程)
	if 进程 > 58 then
		玩家数据[id].角色.数据.剧情.八戒悟空 = true

		玩家数据[id].角色:添加经验(200000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(200000 * (进程 + 1), "不加倍", 1)

		return
	end

	if 玩家数据[id] == nil then
		return
	end

	if 玩家数据[id].角色.数据.剧情.八戒悟空 ~= true and 玩家数据[id].角色.数据.剧情.八戒悟空 == 进程 - 1 then
		玩家数据[id].角色.数据.剧情.八戒悟空 = 进程
	else
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(993)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(200000 * (进程 + 1), "剧情", 1)
		玩家数据[id].角色:添加储备(100000 * (进程 + 1), "不加倍", 1)
	end
end

xsjc11 = function(id, 进程)
	if 玩家数据[id] == nil then
		return
	end

	local 任务id = 玩家数据[id].角色:取任务(898)

	if 任务数据[任务id] ~= nil then
		任务数据[任务id].进程 = 进程

		常规提示(id, "#Y您的剧情任务已经更新，请注意及时查看！")
		玩家数据[id].角色:刷新任务跟踪()
		玩家数据[id].角色:添加经验(10000 * (进程 + 1), "支线", 1)
		玩家数据[id].角色:添加储备(15000 * (进程 + 1), "不加倍", 1)
	end
end

银子检查 = function(id, 数额)
	if 数额 <= 玩家数据[id].角色.数据.银子 then
		return true
	end

	return false
end

退出函数 = function()
	保存所有玩家数据()
	保存系统数据()
end

任务处理类:加载首席单位()

if VIP定制 ~= nil and VIP定制 then
	帮派缴纳情况 = table.loadstring(读入文件("tysj/帮派缴纳情况.txt"))
	月卡数据 = table.loadstring(读入文件("tysj/月卡数据.txt"))
	一键师门 = table.loadstring(读入文件("tysj/一键师门.txt"))
	一键抓鬼 = table.loadstring(读入文件("tysj/一键抓鬼.txt"))
	一键封妖 = table.loadstring(读入文件("tysj/一键封妖.txt"))
	一键官职 = table.loadstring(读入文件("tysj/一键官职.txt"))
	成就数据 = table.loadstring(读入文件("tysj/成就数据.txt"))
	比武奖励 = table.loadstring(读入文件("tysj/比武奖励.txt"))
	交易中心 = table.loadstring(读入文件("tysj/交易中心.txt"))
	VIP数据 = table.loadstring(读入文件("tysj/VIP数据.txt"))
end

if 内充开关 == true then
	if 初始化充值() == "1" then
		内充开启 = true

		__S服务:输出("初始化内充成功")
	else
		内充开启 = false

		__S服务:输出("初始化内充失败")
	end
end

玩家全部下线 = function()
	保存所有玩家数据()
	保存系统数据()

	for n, v in pairs(玩家数据) do
		if 玩家数据[n] ~= nil then
			发送数据(玩家数据[n].连接id, 998, "您的账号已被强制下线，更新完毕时间咨询群管理~！")
		end
	end
end

潜能果经验 = {
	10000000,
	10150000,
	10300000,
	10450000,
	10600000,
	10750000,
	10900000,
	11050000,
	11200000,
	11350000,
	11500000,
	11650000,
	11800000,
	11950000,
	12100000,
	12250000,
	12400000,
	12550000,
	12700000,
	12850000,
	13000000,
	13150000,
	13300000,
	13450000,
	13600000,
	13750000,
	13900000,
	14050000,
	14200000,
	14350000,
	14500000,
	14650000,
	14800000,
	14950000,
	15100000,
	15250000,
	15400000,
	15550000,
	15700000,
	15850000,
	16000000,
	16150000,
	16300000,
	16450000,
	16600000,
	16750000,
	16900000,
	17050000,
	17200000,
	17350000,
	17500000,
	17650000,
	17800000,
	17950000,
	18100000,
	18250000,
	18400000,
	18550000,
	18700000,
	18850000,
	19000000,
	19150000,
	19300000,
	19450000,
	19600000,
	19750000,
	19900000,
	20050000,
	20200000,
	20350000,
	20500000,
	20650000,
	20800000,
	20950000,
	21100000,
	21250000,
	21400000,
	21550000,
	21700000,
	21850000,
	22000000,
	22150000,
	22300000,
	22450000,
	22600000,
	22750000,
	22900000,
	23050000,
	23200000,
	23350000,
	23500000,
	23650000,
	23800000,
	23950000,
	24100000,
	24250000,
	24400000,
	24550000,
	24700000,
	24850000,
	25000000,
	25150000,
	25300000,
	25450000,
	25600000,
	25750000,
	25900000,
	26050000,
	26200000,
	26350000,
	26500000,
	26650000,
	26800000,
	26950000,
	27100000,
	27250000,
	27400000,
	27550000,
	27700000,
	27850000,
	28000000,
	28150000,
	28300000,
	28450000,
	28600000,
	28750000,
	28900000,
	29050000,
	29200000,
	29350000,
	29500000,
	29650000,
	29800000,
	29950000,
	30100000,
	30250000,
	30400000,
	30550000,
	30700000,
	30850000,
	31000000,
	31150000,
	31300000,
	31450000,
	31600000,
	31750000,
	31900000,
	32050000,
	32200000,
	32350000,
	32500000,
	32650000,
	32800000,
	32950000,
	33100000,
	33250000,
	33400000,
	33550000,
	33700000,
	33850000,
	34000000,
	34150000,
	34300000,
	34450000,
	34600000,
	34750000,
	34900000,
	35050000,
	35200000,
	35350000,
	35500000,
	35650000,
	35800000,
	35950000,
	36100000,
	36250000,
	36400000,
	36550000,
	36700000,
	36850000,
	37000000,
	37150000,
	37300000,
	37450000,
	37600000,
	37750000,
	37900000,
	38050000,
	38200000,
	38350000,
	38500000,
	38650000,
	38800000,
	38950000,
	39100000,
	39250000,
	39400000,
	39550000,
	39700000,
	39850000,
	0
}
道具排序表 = {}

读取背包排序表 = function()
	道具排序表.百炼精铁 = 100
	道具排序表.制造指南书 = 101
	道具排序表.灵饰指南书 = 102
	道具排序表.元灵晶石 = 103
	道具排序表.炼妖石 = 104
	道具排序表.上古锻造图策 = 105
	道具排序表.魔兽要诀 = 106
	道具排序表.高级魔兽要诀 = 107
	道具排序表.召唤兽内丹 = 108
	道具排序表.高级召唤兽内丹 = 109
	道具排序表.藏宝图 = 110
	道具排序表.高级藏宝图 = 111
	道具排序表.金银锦盒 = 112
	道具排序表.特赦令牌 = 113
	道具排序表.金柳露 = 114
	道具排序表.超级金柳露 = 115
	道具排序表.元宵 = 116
	道具排序表.炼兽真经 = 117
	道具排序表.摄妖香 = 118
	道具排序表.洞冥草 = 119
	道具排序表.飞行符 = 120
	道具排序表.天眼通符 = 121
	道具排序表.秘制红罗羹 = 122
	道具排序表.秘制绿罗羹 = 123
	道具排序表.红色合成旗 = 124
	道具排序表.黄色合成旗 = 125
	道具排序表.蓝色合成旗 = 126
	道具排序表.绿色合成旗 = 127
	道具排序表.白色合成旗 = 128
	道具排序表.红色导标旗 = 129
	道具排序表.绿色导标旗 = 130
	道具排序表.蓝色导标旗 = 131
	道具排序表.白色导标旗 = 132
	道具排序表.黄色导标旗 = 133
	道具排序表.海马 = 134
	道具排序表.吸附石 = 135
	道具排序表.圣兽丹 = 136
	道具排序表.月华露 = 137
	道具排序表.易经丹 = 138
	道具排序表.玉葫灵髓 = 139
	道具排序表.清灵净瓶 = 140
	道具排序表.神兵图鉴 = 141
	道具排序表.神兵图鉴 = 142
	道具排序表.强化符 = 143
	道具排序表.分解符 = 144
	道具排序表.灵箓 = 145
	道具排序表.碎星锤 = 146
	道具排序表.超级碎星锤 = 147
	道具排序表.天眼珠 = 154
	道具排序表.珍珠 = 155
	道具排序表.初级清灵仙露 = 156
	道具排序表.中级清灵仙露 = 157
	道具排序表.高级清灵仙露 = 158
	道具排序表.青龙石 = 159
	道具排序表.白虎石 = 160
	道具排序表.朱雀石 = 161
	道具排序表.玄武石 = 162
	道具排序表.星辉石 = 163
	道具排序表.光芒石 = 164
	道具排序表.月亮石 = 165
	道具排序表.太阳石 = 166
	道具排序表.舍利子 = 167
	道具排序表.红玛瑙 = 168
	道具排序表.黑宝石 = 169
	道具排序表.神秘石 = 170
	道具排序表.未激活的符石1级 = 171
	道具排序表.未激活的符石2级 = 172
	道具排序表.未激活的符石3级 = 173
	道具排序表.未激活的星石 = 174
	道具排序表.符石卷轴 = 175
	道具排序表.神兜兜 = 176
	道具排序表.彩果 = 177
	道具排序表["2倍经验丹"] = 178
	道具排序表["3倍经验丹"] = 179
	道具排序表.坐骑内丹 = 180
	道具排序表.宠物饰品通用丹 = 181
	道具排序表.钟灵石 = 182
	道具排序表.点化石 = 183
	道具排序表.附魔宝珠 = 184
	道具排序表.钨金 = 185
	道具排序表.顺逆神针 = 186
	道具排序表.变身卡 = 187
	道具排序表.空白强化符 = 188
	道具排序表.三界悬赏令 = 189
	道具排序表.怪物卡片 = 190
end

读取背包排序表()
保存所有玩家数据()
保存系统数据()

刷新活动 = function()
	任务处理类:开启宝藏山()
	任务处理类:开启游戏比赛()
	任务处理类:开启门派闯关()
	任务处理类:开启皇宫飞贼()
	任务处理类:开启镖王活动()
	任务处理类:开启迷宫()
	任务处理类:刷出星宿()
	任务处理类:刷出星宿()
	任务处理类:刷出星宿()
	任务处理类:刷出星宿()
	任务处理类:刷出星宿()
	任务处理类:刷出星宿()
	任务处理类:刷出妖魔鬼怪()
	任务处理类:刷出知了王()
	任务处理类:开启地煞星任务()
	任务处理类:捣乱的水果(id)
	任务处理类:小鬼子(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:探路先锋(id)
	任务处理类:化圣六(id)
	任务处理类:化圣六(id)
	任务处理类:化圣六(id)
	任务处理类:化圣六(id)

	任务处理类:决战九黎城(id)
		任务处理类:决战九黎城(id)
	任务处理类:决战九黎城(id)
			 任务处理类:出其不意终结者(id)
			  任务处理类:出其不意终结者(id)
			   任务处理类:出其不意终结者后转(id)
			  任务处理类:出其不意终结者后转(id)
			任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
			任务处理类:血洗龙宫(id)
	任务处理类:设置天庭叛逆(id)
	任务处理类:设置建邺东海小活动(id)
	任务处理类:设置大雁塔怪(id)
	任务处理类:刷新世界BOSS()
	任务处理类:刷出新服福利BOSS()
	任务处理类:刷出散财童子()
	任务处理类:福利宝箱()
	任务处理类:修炼宝箱()
	任务处理类:开启天罡星任务()
	任务处理类:突厥探子()
	任务处理类:突厥精英()
	天降辰星:开启活动()
end

刷新活动()
刷新天气()
刷新特殊官职称谓()

if 开服时间1 == nil then
	开服时间1 = 时间转换3(开服时间)
end
