local 假人玩家处理类 = class()
local 玩家选项 = {
	"剑侠客",
	"逍遥生",
	"玄彩娥",
	"杀破狼",
	"飞燕女",
	"英女侠",
	"神天兵",
	"龙太子",
	"羽灵神",
	"舞天姬",
	"巨魔王",
	"虎头怪",
	"狐美人",
	"骨精灵",
	"巫蛮儿",
	"桃夭夭",
	"偃无师",
	"鬼潇潇"
}
local 玩家姓 = {
	"小黑",
	"小白",
	"无名",
	"专业打油酱",
	"酒到微醺",
	"北疆雨寒",
	"放慢心跳",
	"Θ内心d1.伤",
	"轻音柔体萌萝莉",
	"觅览少女",
	"愛遇良人",
	"余音未散",
	"别提",
	"爆菊无极限",
	"夜凉若水",
	"览觅少年",
	"一生傲娇",
	"欲望泯灭人性",
	"献给清明节",
	"青燈古酒",
	"花开似梦",
	"入戏太深",
	"不会撒谎",
	"年少不知米青仔贵",
	"执我之手",
	"白衣煮茶",
	"黑白棋局",
	"忘不了，她",
	"半夏白色枕头",
	"末世岛屿",
	"携我之心",
	"哼哈二将",
	"对面是二傻",
	"繁华宛似浮云",
	"風卷著沙",
	"纪年海泊",
	"沉鱼落雁",
	"Louise゛",
	"捣你菊花",
	"情深不寿",
	"淚順著雨",
	"封心锁爱",
	"暈“噠120",
	"苍天有井自然空",
	"命定浮沉",
	"慧极必伤",
	"刹那芳华",
	"路易絲",
	"灬情丶落轩",
	"清酒暖心",
	"与情无染",
	"情难自控",
	"X凄凉菂羙",
	"有飘影更自信",
	"南巷孤貓",
	"烈酒醉人",
	"沦陷的痛",
	"夜的第七章",
	"星逝破晓",
	"一尾流莺",
	"北城孤人",
	"若如初见",
	"简单",
	"风恋绝尘",
	"特别的人η",
	"一指流砂",
	"温柔散尽",
	"彻底完败",
	"揍跪了丶好么",
	"月寒影对",
	"特别的梦η",
	"烟花寂凉",
	"ˉ罗密欧",
	"沟沟有深度",
	"绽放情花",
	"梦暖情双",
	"新不了情",
	"Θ“肮脏_矜持”",
	"你的菊花真美",
	"墨染诗水",
	"刺痛命脉",
	"野性难改",
	"內傷無法治愈",
	"最短不过善变",
	"青絲繞手",
	"樱花年华",
	"十夏之风",
	"负心人",
	"举杯邀月",
	"已然情深",
	"情字繞口",
	"徒增伤悲",
	"ㄨ雨℡逝ㄚ",
	"床单一片红",
	"清歡相伴",
	"何惧缘浅",
	"一拉拉",
	"扭曲旳黑暗”",
	"转角遇到墙",
	"竖萧而奏",
	"溫酒相隨",
	"似水柔情",
	"贱人·滚之",
	"细雨微醺",
	"北軌陽葵",
	"抚琴而唱",
	"旧事重提",
	"ω带刺╮男淫",
	"紫丶星河",
	"烟过是云",
	"南岸青梔",
	"撕心裂肺",
	"伸手难辨",
	"中指的邂逅",
	"萧暗寒剑",
	"雨过你在",
	"忠贞罘渝",
	"极速ω堕落",
	"眼兮的温柔",
	"北港初晴",
	"青梅落影",
	"落荒而逃",
	"不服来嘛",
	"双手成就你的梦",
	"寡人寡巷",
	"南岸末阴",
	"从不服输",
	"１切都昰命▂",
	"吟唱寒荒",
	"凉城以北",
	"孤人孤街",
	"半夏时光",
	"説不岀旳疼╮",
	"撸自身哥哥",
	"南館瀟湘",
	"空城旧梦",
	"黑白年代",
	"∑幼稚鬼",
	"信基哥原地复活",
	"鱼忘七秒#",
	"壹席青城",
	"十言九妄",
	"不在乎的在乎ゝ",
	"溪舔取精",
	"南人旧心",
	"人忘七年#",
	"独守空城",
	"撕裂的天堂",
	"今天干我儿",
	"灯为谁点",
	"北人久情",
	"事与愿违",
	"初见钟情",
	"潇潇暮雨",
	"彼此相爱゛",
	"脂为谁添",
	"南熙寒笙",
	"師傅.別念了",
	"蝶梦恋花",
	"发酵的恋",
	"っ遮遮掩掩゛",
	"夏末染殇",
	"地心侵略者",
	"风泊天",
	"琴瑟在御",
	"茹梦初醒",
	"沐风朝朝",
	"炫。枫少",
	"寒风笑雪夜",
	"葬我以风",
	"凤凰于飞",
	"鱼巷猫归",
	"抱你到天亮.",
	"浅唱呐忧伤",
	"闹市海港",
	"赐你以梦",
	"深秋无痕",
	"╮麻辣",
	"百合大队长",
	"人走茶凉",
	"旧城窄巷",
	"回眸的笑",
	"ε择日",
	"一寸光阴",
	"北葵向暖",
	"曲终人散",
	"少钩鈏我",
	"为了你",
	"一寸精",
	"暖阳今夏",
	"南栀倾寒",
	"满城灯火",
	"烈酒i",
	"夜凉如水",
	"这季悲凉",
	"冷月昨秋",
	"醉生梦死",
	"极度深寒",
	"淡丿子枫",
	"深如大海i",
	"|回身诉说",
	"葑鈊ご独爱",
	"各自生欢",
	"梦冥光",
	"追忆年华",
	"深海溺心 i",
	"复制回忆",
	"在为止的路上狂奔",
	"苏秋辰",
	"听一首歌丶",
	"笑叹如梦",
	"时光不复",
	"ω永别",
	"碎泪",
	"任憑風吹",
	"念一个人丶",
	"人亦已歌",
	"咎由自取",
	"幹杯清茶",
	"不準妳走",
	"初衷是你",
	"阴月下的墓碑",
	"渔舟唱晚",
	"續杯烈酒",
	"邀月对影",
	"风吹屁丫爽",
	"夜寒影对",
	"彼岸灯火",
	"今夕何夕",
	"沦陷′2009",
	"刻晴",
	"月寒",
	"全功仔",
	"哒总",
	"菊花",
	"曲终人散",
	"季珪",
	"御风神行",
	"风清柒、",
	"阿饼",
	"江湖小虾米",
	"踏月夜归人",
	"风度翩翩",
	"书生",
	"扳手",
	"神器制造者",
	"六一大侠",
	"大鱼海棠",
	"微夏青花",
	"吊顶天",
	"阴阳人拱火王",
	"纯粹",
	"初出茅庐",
	"月寒",
	"(りyi人",
	"乘风儿",
	"张不凡",
	"黎明前的黑暗"
}
local remove = table.remove

function 假人玩家处理类:打造公式(a, b, c)
	local c = {}

	if a == nil or b == nil then
		return false
	end

	local 双加概率 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "打造双加概率")
	local 双加概率1 = f函数.读配置(程序目录 .. "配置文件.ini", "主要配置", "打造单加概率")

	if tonumber(双加概率) == nil then
		双加概率 = 10
	end

	if tonumber(双加概率1) == nil then
		双加概率1 = 30
	end

	双加概率 = 双加概率 + 0
	双加概率1 = 双加概率1 + 0

	if b < 19 then
		if a <= 60 then
			c[1] = 取随机数(a * 3.7 + 10, a * 4.7 + 15)
			c[2] = 取随机数(a * 3.2 + 10, a * 4.05 + 14)

			if 取随机数(1, 100) <= 双加概率 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(-8, 20)
				c[x2] = 取随机数(-8, 20)
			elseif 取随机数(1, 100) <= 双加概率1 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * 0.2, a * 0.4)
			end
		elseif a > 60 then
			c[1] = 取随机数(a * 3.7 + 10, a * 4.7 + 15)
			c[2] = 取随机数(a * 3.2 + 10, a * 4.05 + 14)

			if 取随机数(1, 100) <= 双加概率 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * -0.05, a * 0.3)
				c[x2] = 取随机数(a * -0.05, a * 0.3)
			elseif 取随机数(1, 100) <= 双加概率1 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * 0.2, a * 0.3)
			end
		end
	elseif b == 19 then
		if a <= 60 then
			c[3] = 取随机数(a * 0.51 + 5, a * 0.65 + 7)
			c[4] = 取随机数(a * 1.05 + 5, a * 1.35 + 7)
		elseif a > 60 then
			c[3] = 取随机数(a * 0.51 + 6, a * 0.77)
			c[4] = 取随机数(a * 1.05 + 5, a * 1.35 + 8)
		end
	elseif b == 20 then
		if a <= 60 then
			c[5] = 取随机数(a * 1.25 + 5, a * 1.63 + 6)
		elseif a > 60 then
			c[5] = 取随机数(a * 1.25 + 6, a * 1.63 + 7)
		end
	elseif b == 21 then
		if a <= 70 then
			c[3] = 取随机数(a * 1.57 + 10, a * 2.04 + 13)

			if 取随机数(1, 100) <= 双加概率 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(-8, 20)
				c[x2] = 取随机数(-8, 20)
			elseif 取随机数(1, 100) <= 双加概率1 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * 0.2, a * 0.4)
			end
		elseif a > 70 then
			c[3] = 取随机数(a * 1.57 + 10, a * 2.045 + 13)

			if 取随机数(1, 100) <= 双加概率 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * -0.05, a * 0.3 + 3)
				c[x2] = 取随机数(a * -0.05, a * 0.3 + 3)
			elseif 取随机数(1, 100) <= 双加概率1 then
				local sxs = {
					7,
					8,
					9,
					10,
					11
				}
				local sx1 = 取随机数(1, #sxs)
				local x1 = sxs[sx1]

				remove(sxs, sx1)

				sx1 = 取随机数(1, #sxs)
				local x2 = sxs[sx1]
				c[x1] = 取随机数(a * 0.2, a * 0.3)
			end
		end
	elseif b == 22 then
		if a <= 60 then
			c[3] = 取随机数(a * 0.51 + 5, a * 0.65 + 7)
		elseif a > 60 then
			c[3] = 取随机数(a * 0.51 + 6, a * 0.77)
		end

		c[6] = 取随机数(a * 2.1 + 10, a * 2.7 + 17)
	elseif b == 23 then
		if a <= 60 then
			c[3] = 取随机数(a * 0.51 + 5, a * 0.65 + 7)
		elseif a > 60 then
			c[3] = 取随机数(a * 0.51 + 6, a * 0.77)
		end

		if a <= 40 then
			c[7] = 取随机数(a * 0.3 + 5, a * 0.4 + 6)
		elseif a > 40 then
			c[7] = 取随机数(a * 0.3 + 7, a * 0.4 + 7)
		end
	end

	local tx = 取随机数(1, 100)
	local txgl = 1

	if tx <= txgl + 0 then
		c[12] = 1
	end

	if tx <= txgl + 0 then
		c[13] = 1
	end

	return c
end

function 假人玩家处理类:生成指定装备(名称, 序列)
	local 道具 = 物品类()

	道具:置对象(名称)

	if not 道具.级别限制 then
		return
	end

	local dz = self:打造公式(道具.级别限制, 序列)

	if dz[1] ~= nil then
		道具.命中 = dz[1]
	end

	if dz[2] ~= nil then
		道具.伤害 = dz[2]
	end

	if dz[3] ~= nil then
		道具.防御 = dz[3]
	end

	if dz[4] ~= nil then
		道具.魔法 = dz[4]
	end

	if dz[5] ~= nil then
		道具.灵力 = dz[5]
	end

	if dz[6] ~= nil then
		道具.气血 = dz[6]
	end

	if dz[7] ~= nil then
		道具.敏捷 = dz[7]
	end

	if dz[8] ~= nil then
		道具.体质 = dz[8]
	end

	if dz[9] ~= nil then
		道具.力量 = dz[9]
	end

	if dz[10] ~= nil then
		道具.耐力 = dz[10]
	end

	if dz[11] ~= nil then
		道具.魔力 = dz[11]
	end

	if 序列 < 19 or 序列 == 21 then
		道具.五行 = 取五行()
	end

	if dz[12] ~= nil then
		local 通用特效 = {
			"无级别限制",
			"神佑",
			"珍宝",
			"必中",
			"神农",
			"简易",
			"绝杀",
			"专注",
			"精致",
			"再生"
		}

		if 道具.分类 == 5 then
			table.insert(通用特效, "愤怒")
			table.insert(通用特效, "暴怒")
		end

		道具.特效 = {
			通用特效[取随机数(1, #通用特效)]
		}

		if 取随机数() <= 10 then
			道具.特效[2] = 通用特效[取随机数(1, #通用特效)]
		end
	end

	if dz[13] ~= nil then
		道具.特技 = 通用特技[取随机数(1, #通用特技)]
	end

	道具.耐久 = 取随机数(500, 700)
	道具.识别码 = "999998" .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列

	return 道具
end

function 假人玩家处理类:功能开关(open)
	self.open = open
end

function 假人玩家处理类:ltop(id, mapid, sendFunc, mapBoothNpcs)
	for i = 1, #mapBoothNpcs do
		ndata = mapBoothNpcs[i]
		local ctx = {
			玩家类型 = "假人玩家",
			x = ndata[2] * 20,
			y = ndata[3] * 20,
			id = ndata[4],
			名称 = ndata[5],
			摊位名称 = ndata[6],
			模型 = ndata[7]
		}

		发送数据(id, 1006, ctx)
	end
end

function 假人玩家处理类:malltop(玩家的ID, 连接id, id, 数据)
	self:购买摊位商品(玩家的ID, 连接id, id, 数据)
end

function 假人玩家处理类:mall(摊主名称, 名称, botId, id)
	local ctx = {
		bb = {},
		摊主名称 = 摊主名称,
		物品 = {},
		名称 = 名称,
		id = botId
	}

	if 摆摊假人处理类.npcUserList["" .. botId] ~= nil and 摆摊假人处理类.npcUserList["" .. botId][8] ~= nil and 摆摊假人处理类.npcUserList["" .. botId][8].物品 ~= nil then
		ctx.物品 = 摆摊假人处理类.npcUserList["" .. botId][8].物品
		ctx.bb = 摆摊假人处理类.npcUserList["" .. botId][8].bb
	end

	发送数据(id, 3521, ctx)
end

取摆摊伪随机 = function(物品, 记录表, 最大数)
	记录表.判定 = false

	if (记录表[物品] or 0) < (最大数 or 1) then
		记录表[物品] = (记录表[物品] or 0) + 1
		记录表.判定 = true

		return 记录表
	end

	return 记录表
end

function 假人玩家处理类:mmmmwq(botId, 摊位名称, ret)
	local ctx = {
		物品 = {}
	}
	local x临时物品 = {}

	if 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "无级") ~= nil or string.find(摊位名称, "装备") ~= nil or string.find(摊位名称, "军火") ~= nil or string.find(摊位名称, "变强") ~= nil or string.find(摊位名称, "买到就是赚") ~= nil or string.find(摊位名称, "赌鉴定啦") ~= nil or string.find(摊位名称, "环装") ~= nil) then
		local 指定等级 = nil
		local 指定摊位名称 = {
			["60级环装"] = 7,
			["50级环装"] = 6,
			["80级环装"] = 9,
			["70级环装"] = 8
		}

		if 指定摊位名称[摊位名称] ~= nil then
			指定等级 = 指定摊位名称[摊位名称]
		end

		local x取物品 = 绑定等级物品80()
		local zz = 0
		local 记录表 = {}

		for i = 1, 取随机数(40, 80) do
			local 开始 = true
			local 装备名称 = nil

			while 开始 or not 记录表.判定 do
				开始 = false
				zz = ygsj(23)

				if zz >= 19 and zz <= 22 then
					装备名称 = x取物品[zz][指定等级 or 取随机数(6, #x取物品[zz])][取随机数(1, 2)]
				else
					装备名称 = x取物品[zz][指定等级 or 取随机数(6, #x取物品[zz])]
				end

				记录表 = 取摆摊伪随机(装备名称, 记录表, 4)
			end

			local xwzp品 = self:生成指定装备(装备名称, zz)

			if xwzp品 ~= nil and xwzp品.级别限制 ~= nil then
				local xwzp = #x临时物品 + 1
				x临时物品[xwzp] = xwzp品
				x临时物品[xwzp].数量 = 1

				if xwzp品.级别限制 <= 30 then
					x临时物品[xwzp].鉴定 = true
				else
					x临时物品[xwzp].鉴定 = false
				end

				x临时物品[xwzp].制造者 = "摆摊商品"
				x临时物品[xwzp].价格 = 取随机数(1000, 2000)

				if x临时物品[xwzp].级别限制 >= 10 and x临时物品[xwzp].级别限制 <= 19 then
					x临时物品[xwzp].价格 = 取随机数(30000, 50000)
				elseif x临时物品[xwzp].级别限制 >= 20 and x临时物品[xwzp].级别限制 <= 29 then
					x临时物品[xwzp].价格 = 取随机数(50000, 80000)
				elseif x临时物品[xwzp].级别限制 >= 30 and x临时物品[xwzp].级别限制 <= 39 then
					x临时物品[xwzp].价格 = 取随机数(60000, 100000)
				elseif x临时物品[xwzp].级别限制 >= 40 and x临时物品[xwzp].级别限制 <= 49 then
					x临时物品[xwzp].价格 = 取随机数(100000, 15000)
				elseif x临时物品[xwzp].级别限制 >= 50 and x临时物品[xwzp].级别限制 <= 59 then
					x临时物品[xwzp].价格 = 取随机数(300000, 500000)
				elseif x临时物品[xwzp].级别限制 >= 60 and x临时物品[xwzp].级别限制 <= 69 then
					x临时物品[xwzp].价格 = 取随机数(600000, 800000)
				elseif x临时物品[xwzp].级别限制 >= 70 and x临时物品[xwzp].级别限制 <= 79 then
					x临时物品[xwzp].价格 = 取随机数(800000, 1000000)
				elseif x临时物品[xwzp].级别限制 >= 80 and x临时物品[xwzp].级别限制 <= 89 then
					x临时物品[xwzp].价格 = 取随机数(1000000, 1200000)
				end
			end
		end
	end

	if 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "1、2级变身卡") ~= nil then
		local x一级变身卡 = {
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "野猪",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "感知",
				次数 = 8,
				正负 = 0,
				造型 = "野猪",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "巨蛙",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "大海龟",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "慧根",
				次数 = 8,
				正负 = 0,
				造型 = "大海龟",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "树怪",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "赌徒",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "夜战",
				次数 = 8,
				正负 = 0,
				造型 = "赌徒",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "大蝙蝠",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "强盗",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "山贼",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "海毛虫",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "偷袭",
				次数 = 8,
				正负 = 0,
				造型 = "海毛虫",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "护卫",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "驱鬼",
				次数 = 8,
				正负 = 0,
				造型 = "护卫",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "海星",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "章鱼",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 1,
				类型 = "",
				技能 = "",
				次数 = 8,
				正负 = 0,
				造型 = "狸",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(10000, 20000)
			},
			{
				等级 = 2,
				类型 = "气血",
				技能 = "夜战",
				次数 = 8,
				正负 = 2,
				造型 = "骷髅怪",
				名称 = "怪物卡片",
				属性 = 20,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "气血",
				技能 = "幸运",
				次数 = 8,
				正负 = 2,
				造型 = "羊头怪",
				名称 = "怪物卡片",
				属性 = 10,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "灵力",
				技能 = "防御",
				次数 = 8,
				正负 = 2,
				造型 = "黑熊",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "灵力",
				技能 = "迟钝",
				次数 = 8,
				正负 = 2,
				造型 = "黑熊",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "防御",
				技能 = "毒",
				次数 = 8,
				正负 = 2,
				造型 = "蛤蟆精",
				名称 = "怪物卡片",
				属性 = 15,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "速度",
				技能 = "强力",
				次数 = 8,
				正负 = 2,
				造型 = "老虎",
				名称 = "怪物卡片",
				属性 = 10,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "",
				技能 = "慧根",
				次数 = 8,
				正负 = 0,
				造型 = "花妖",
				名称 = "怪物卡片",
				属性 = 0,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "气血",
				技能 = "感知",
				次数 = 8,
				正负 = 2,
				造型 = "狐狸精",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			},
			{
				等级 = 2,
				类型 = "气血",
				技能 = "法术穿透",
				次数 = 8,
				正负 = 2,
				造型 = "狐狸精",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(20000, 30000)
			}
		}
		local zz = 0
		local 记录表 = {}
		local 变身卡 = {
			{
				30000,
				80000
			},
			{
				80000,
				200000
			},
			{
				200000,
				500000
			},
			{
				500000,
				1000000
			},
			{
				1000000,
				2000000
			},
			{
				2000000,
				4000000
			}
		}

		for i = 1, 取随机数(60, 80) do
			local 开始 = true

			while 开始 or not 记录表.判定 do
				开始 = false
				zz = ygsj(#x一级变身卡)
				记录表 = 取摆摊伪随机(x一级变身卡[zz].造型, 记录表, 5)
			end

			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x一级变身卡[zz]))
			x临时物品[#x临时物品].价格 = 取随机数(变身卡[x临时物品[#x临时物品].等级][1], 变身卡[x临时物品[#x临时物品].等级][2])
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "3、4级变身卡") ~= nil then
		local x二级变身卡 = {
			{
				等级 = 3,
				类型 = "防御",
				技能 = "反击",
				次数 = 8,
				正负 = 2,
				造型 = "牛妖",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "伤害",
				技能 = "驱鬼",
				次数 = 8,
				正负 = 2,
				造型 = "小龙女",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "灵力",
				技能 = "夜战",
				次数 = 8,
				正负 = 2,
				造型 = "野鬼",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "灵力",
				技能 = "魔法反击",
				次数 = 8,
				正负 = 2,
				造型 = "野鬼",
				名称 = "怪物卡片",
				属性 = 5,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "气血",
				技能 = "偷袭",
				次数 = 8,
				正负 = 2,
				造型 = "狼",
				名称 = "怪物卡片",
				属性 = 10,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "伤害",
				技能 = "必杀",
				次数 = 8,
				正负 = 2,
				造型 = "虾兵",
				名称 = "怪物卡片",
				属性 = 10,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "速度",
				技能 = "连击",
				次数 = 8,
				正负 = 2,
				造型 = "蟹将",
				名称 = "怪物卡片",
				属性 = 12,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				等级 = 3,
				类型 = "速度",
				技能 = "进击必杀",
				次数 = 8,
				正负 = 2,
				造型 = "蟹将",
				名称 = "怪物卡片",
				属性 = 12,
				可叠加 = false,
				价格 = 取随机数(30000, 40000)
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "敏捷",
				次数 = 10,
				正负 = 2,
				造型 = "兔子怪",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "毒",
				次数 = 10,
				正负 = 2,
				造型 = "蜘蛛精",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "弱点雷",
				次数 = 10,
				正负 = 1,
				造型 = "僵尸",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "反震",
				次数 = 10,
				正负 = 2,
				造型 = "黑熊精",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "强力",
				次数 = 10,
				正负 = 2,
				造型 = "黑熊精",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "",
				次数 = 10,
				正负 = 1,
				造型 = "龟丞相",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "法术连击",
				次数 = 10,
				正负 = 1,
				造型 = "龟丞相",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "招架",
				次数 = 10,
				正负 = 0,
				造型 = "牛头",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "蛮劲",
				次数 = 10,
				正负 = 0,
				造型 = "牛头",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 4,
				价格 = 1000,
				技能 = "必杀",
				次数 = 10,
				正负 = 2,
				造型 = "马面",
				类型 = "伤害",
				属性 = 8,
				可叠加 = false
			}
		}
		local zz = 0
		local 记录表 = {}
		local 变身卡 = {
			{
				30000,
				80000
			},
			{
				80000,
				200000
			},
			{
				200000,
				500000
			},
			{
				500000,
				1000000
			},
			{
				1000000,
				2000000
			},
			{
				2000000,
				4000000
			}
		}

		for i = 1, 取随机数(60, 80) do
			local 开始 = true

			while 开始 or not 记录表.判定 do
				开始 = false
				zz = ygsj(#x二级变身卡)
				记录表 = 取摆摊伪随机(x二级变身卡[zz].造型, 记录表, 8)
			end

			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x二级变身卡[zz]))
			x临时物品[#x临时物品].价格 = 取随机数(变身卡[x临时物品[#x临时物品].等级][1], 变身卡[x临时物品[#x临时物品].等级][2])
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "5、6级变身卡") ~= nil then
		local x三级变身卡 = {
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "反震",
				次数 = 10,
				正负 = 2,
				造型 = "古代瑞兽",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "飞行",
				次数 = 10,
				正负 = 2,
				造型 = "雷鸟人",
				类型 = "气血",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "魔之心",
				次数 = 10,
				正负 = 2,
				造型 = "蝴蝶仙子",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "迟钝",
				次数 = 10,
				正负 = 0,
				造型 = "白熊",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "偷袭",
				次数 = 10,
				正负 = 2,
				造型 = "黑山老妖",
				类型 = "速度",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "反震",
				次数 = 10,
				正负 = 2,
				造型 = "进阶古代瑞兽",
				类型 = "气血",
				属性 = 9,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "魔法反击",
				次数 = 10,
				正负 = 2,
				造型 = "进阶古代瑞兽",
				类型 = "气血",
				属性 = 9,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "飞行",
				次数 = 10,
				正负 = 2,
				造型 = "进阶雷鸟人",
				类型 = "气血",
				属性 = 9,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "魔之心",
				次数 = 10,
				正负 = 2,
				造型 = "进阶蝴蝶仙子",
				类型 = "防御",
				属性 = 9,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 5,
				技能 = "迟钝",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶白熊",
				类型 = "气血",
				属性 = 20,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 5,
				技能 = "高级迟钝",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶白熊",
				类型 = "气血",
				属性 = 20,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 5,
				价格 = 1000,
				技能 = "偷袭",
				次数 = 10,
				正负 = 2,
				造型 = "进阶黑山老妖",
				类型 = "速度",
				属性 = 9,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "防御",
				次数 = 10,
				正负 = 0,
				造型 = "天兵",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "必杀",
				次数 = 10,
				正负 = 0,
				造型 = "天兵",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "强力",
				次数 = 10,
				正负 = 2,
				造型 = "天将",
				类型 = "灵力",
				属性 = 8,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "连击",
				次数 = 10,
				正负 = 2,
				造型 = "地狱战神",
				类型 = "气血",
				属性 = 5,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "敏捷",
				次数 = 10,
				正负 = 2,
				造型 = "风伯",
				类型 = "防御",
				属性 = 5,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "飞行",
				次数 = 10,
				正负 = 0,
				造型 = "凤凰",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "高级再生",
				次数 = 10,
				正负 = 0,
				造型 = "凤凰",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "反震",
				次数 = 10,
				正负 = 0,
				造型 = "碧水夜叉",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "雨师",
				类型 = "灵力",
				属性 = 20,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "蚌精",
				类型 = "防御",
				属性 = 30,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "慧根",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "蚌精",
				类型 = "防御",
				属性 = 30,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "鲛人",
				类型 = "伤害",
				属性 = 20,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "永恒",
				次数 = 10,
				正负 = 0,
				造型 = "蛟龙",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "感知",
				次数 = 10,
				正负 = 0,
				造型 = "蛟龙",
				类型 = "",
				属性 = 0,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "防御",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶天兵",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "助攻",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶天兵",
				类型 = "防御",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "强力",
				次数 = 10,
				正负 = 2,
				造型 = "进阶天将",
				类型 = "灵力",
				属性 = 7,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "连击",
				次数 = 10,
				正负 = 2,
				造型 = "进阶地狱战神",
				类型 = "气血",
				属性 = 4,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				等级 = 6,
				价格 = 1000,
				技能 = "敏捷",
				次数 = 10,
				正负 = 2,
				造型 = "进阶风伯",
				类型 = "防御",
				属性 = 4,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "飞行",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶凤凰",
				类型 = "速度",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "健壮",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶凤凰",
				类型 = "速度",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "反震",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶碧水夜叉",
				类型 = "气血",
				属性 = 20,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶雨师",
				类型 = "灵力",
				属性 = 30,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "魔之心",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶雨师",
				类型 = "灵力",
				属性 = 30,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶蚌精",
				类型 = "防御",
				属性 = 40,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "高级慧根",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶蚌精",
				类型 = "防御",
				属性 = 40,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶鲛人",
				类型 = "伤害",
				属性 = 30,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "高级永恒",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶蛟龙",
				类型 = "速度",
				属性 = 10,
				可叠加 = false
			},
			{
				名称 = "怪物卡片",
				单独 = 1,
				等级 = 6,
				技能 = "高级感知",
				价格 = 1000,
				次数 = 10,
				正负 = 1,
				造型 = "进阶蛟龙",
				类型 = "速度",
				属性 = 10,
				可叠加 = false
			}
		}
		local zz = 0
		local 记录表 = {}
		local 变身卡 = {
			{
				30000,
				80000
			},
			{
				80000,
				200000
			},
			{
				200000,
				500000
			},
			{
				500000,
				1000000
			},
			{
				1000000,
				2000000
			},
			{
				2000000,
				4000000
			}
		}

		for i = 1, 取随机数(60, 100) do
			local 开始 = true

			while 开始 or not 记录表.判定 do
				开始 = false
				zz = ygsj(#x三级变身卡)
				记录表 = 取摆摊伪随机(x三级变身卡[zz].造型, 记录表, 4)
			end

			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x三级变身卡[zz]))
			x临时物品[#x临时物品].价格 = 取随机数(变身卡[x临时物品[#x临时物品].等级][1], 变身卡[x临时物品[#x临时物品].等级][2])
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "强化符") ~= nil then
		local 等级 = 180
		local x强化符 = {
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "嗜血",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "莲华妙法",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "轻如鸿毛",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "神木呓语",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "拈花妙指",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "盘丝舞",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "一气化三清",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "浩然正气",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "龙附",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "穿云破空",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "神兵护法",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "魔王护持",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "元阳护体",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "神力无穷",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "尸气漫天",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			},
			{
				名称 = "强化符",
				总类 = 101,
				子类 = 0,
				类型 = "担山赶月",
				可叠加 = false,
				等级 = 等级,
				价格 = 取随机数(200000, 300000)
			}
		}
		local aa = 0

		for i = 1, 80 do
			aa = aa == #x强化符 and 1 or aa + 1
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x强化符[aa]))
			x临时物品[#x临时物品].价格 = 取随机数(1000000, 1500000)
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "杂货") ~= nil or string.find(摊位名称, "不卖神兜兜") ~= nil or string.find(摊位名称, "乱七八糟") ~= nil or string.find(摊位名称, "专卖假货") ~= nil) then
		local x杂货摆摊 = {
			{
				名称 = "通灵重置丹",
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 50)
			},
			{
				名称 = "高级通灵重置丹",
				可叠加 = true,
				价格 = 取随机数(1500000, 2000000),
				数量 = 取随机数(5, 30)
			},
			{
				名称 = "超级通灵重置丹",
				可叠加 = true,
				价格 = 取随机数(4000000, 5000000),
				数量 = 取随机数(3, 5)
			},
			{
				名称 = "属性转换符",
				价格 = 1000000,
				可叠加 = true,
				数量 = 取随机数(5, 30)
			},
			{
				名称 = "玄武石",
				可叠加 = true,
				价格 = 取随机数(200000, 300000),
				数量 = 取随机数(15, 99)
			},
			{
				名称 = "青龙石",
				可叠加 = true,
				价格 = 取随机数(200000, 300000),
				数量 = 取随机数(15, 99)
			},
			{
				名称 = "朱雀石",
				可叠加 = true,
				价格 = 取随机数(200000, 300000),
				数量 = 取随机数(15, 99)
			},
			{
				名称 = "白虎石",
				可叠加 = true,
				价格 = 取随机数(200000, 300000),
				数量 = 取随机数(15, 99)
			},
			{
				名称 = "吸附石",
				可叠加 = true,
				价格 = 取随机数(500000, 1000000),
				数量 = 取随机数(10, 50)
			},
			{
				名称 = "圣兽丹",
				可叠加 = true,
				价格 = 取随机数(800000, 1300000),
				数量 = 取随机数(10, 50)
			},
			{
				级别限制 = 160,
				分类 = 6,
				名称 = "珍珠",
				总类 = 5,
				可叠加 = true,
				价格 = 取随机数(5000000, 10000000),
				数量 = 取随机数(1, 5)
			},
			{
				子类 = 1,
				分类 = 2,
				名称 = "超级金柳露",
				总类 = 3,
				可叠加 = true,
				价格 = 取随机数(500000, 1000000),
				数量 = 取随机数(5, 30)
			},
			{
				子类 = 0,
				分类 = 2,
				名称 = "金柳露",
				总类 = 3,
				可叠加 = true,
				价格 = 取随机数(100000, 300000),
				数量 = 取随机数(5, 50)
			},
			{
				阶品 = 100,
				名称 = "月华露",
				可叠加 = true,
				价格 = 取随机数(200000, 300000),
				数量 = 取随机数(5, 99)
			},
			{
				阶品 = 300,
				名称 = "九转金丹",
				可叠加 = true,
				价格 = 取随机数(500000, 800000),
				数量 = 取随机数(5, 20)
			},
			{
				阶品 = 300,
				名称 = "修炼果",
				可叠加 = true,
				价格 = 取随机数(500000, 800000),
				数量 = 取随机数(5, 20)
			},
			{
				名称 = "清灵净瓶",
				可叠加 = true,
				价格 = 取随机数(2000000, 3000000),
				数量 = 取随机数(5, 30)
			},
			{
				名称 = "彩果",
				可叠加 = true,
				价格 = 取随机数(200000, 500000),
				数量 = 取随机数(10, 50)
			},
			{
				名称 = "神兜兜",
				可叠加 = true,
				价格 = 取随机数(1000000, 2000000),
				数量 = 取随机数(2, 20)
			},
			{
				名称 = "灵饰洗练石",
				可叠加 = true,
				价格 = 取随机数(10000, 50000),
				数量 = 取随机数(1, 10)
			}
		}
		local 价格表 = {
			通灵重置丹 = {
				300000,
				500000
			},
			高级通灵重置丹 = {
				150000,
				2000000
			},
			超级通灵重置丹 = {
				3500000,
				5000000
			},
			属性转换符 = {
				2000000,
				2000000
			},
			玄武石 = {
				200000,
				300000
			},
			青龙石 = {
				200000,
				300000
			},
			朱雀石 = {
				200000,
				300000
			},
			白虎石 = {
				200000,
				300000
			},
			吸附石 = {
				500000,
				1000000
			},
			圣兽丹 = {
				500000,
				1000000
			},
			珍珠160 = {
				5000000,
				8000000
			},
			珍珠130 = {
				3000000,
				4500000
			},
			珍珠100 = {
				1500000,
				2800000
			},
			超级金柳露 = {
				500000,
				800000
			},
			金柳露 = {
				100000,
				200000
			},
			月华露 = {
				200000,
				300000
			},
			九转金丹 = {
				1000000,
				2000000
			},
			修炼果 = {
				1000000,
				2000000
			},
			清灵净瓶 = {
				2000000,
				3000000
			},
			彩果 = {
				500000,
				1000000
			},
			神兜兜 = {
				1800000,
				2600000
			},
			灵饰洗练石 = {
				10000,
				50000
			}
		}

		for i = 1, 取随机数(1, 20) do
			if 取随机数(1, 100) <= 30 then
				local xwzp品 = self:摆摊数据库输出(botId, "点化石", 1, nil, nil, nil)

				if xwzp品 ~= nil then
					x临时物品[#x临时物品 + 1] = xwzp品
					x临时物品[#x临时物品].价格 = 取随机数(3000000, 5000000)
				end
			end
		end

		local zz = 0
		local 记录表 = {}

		for i = 1, 取随机数(40, 60) do
			local 开始 = true

			while 开始 or not 记录表.判定 do
				开始 = false
				zz = ygsj(#x杂货摆摊)
				记录表 = 取摆摊伪随机(x杂货摆摊[zz].名称, 记录表, 5)
			end

			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x杂货摆摊[zz]))

			if x临时物品[#x临时物品].可叠加 == true and x临时物品[#x临时物品].名称 ~= "珍珠" then
				x临时物品[#x临时物品].数量 = 取随机数(50, 99)
			end

			if x临时物品[#x临时物品].名称 == "珍珠" then
				x临时物品[#x临时物品].价格 = 取随机数(价格表[x临时物品[#x临时物品].名称 .. x临时物品[#x临时物品].级别限制][1], 价格表[x临时物品[#x临时物品].名称 .. x临时物品[#x临时物品].级别限制][2])
			else
				x临时物品[#x临时物品].价格 = 取随机数(价格表[x临时物品[#x临时物品].名称][1], 价格表[x临时物品[#x临时物品].名称][2])
			end
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "旗子") ~= nil or string.find(摊位名称, "777") ~= nil or string.find(摊位名称, "飞来飞去") ~= nil or string.find(摊位名称, "五颜六色") ~= nil or string.find(摊位名称, "瞬间移动") ~= nil) then
		local x旗子 = {
			{
				x = 312,
				y = 7,
				分类 = 2,
				次数 = 50,
				名称 = "红色合成旗",
				子类 = 50,
				地图 = 1001,
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 312,
						y = 7
					},
					[2] = {
						x = 495,
						y = 11
					},
					[5] = {
						x = 12,
						y = 273
					},
					[3] = {
						x = 457,
						y = 117
					},
					[7] = {
						x = 192,
						y = 105
					},
					[4] = {
						x = 362,
						y = 167
					},
					[6] = {
						x = 277,
						y = 240
					},
					[8] = {
						x = 527,
						y = 276
					},
					[9] = {
						x = 288,
						y = 85
					}
				},
				价格 = 取随机数(55000, 75000)
			},
			{
				x = 312,
				y = 7,
				分类 = 2,
				次数 = 50,
				名称 = "黄色合成旗",
				子类 = 50,
				地图 = 1092,
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 13,
						y = 13
					},
					{
						x = 29,
						y = 55
					},
					{
						x = 55,
						y = 120
					},
					{
						x = 167,
						y = 133
					},
					{
						x = 209,
						y = 13
					},
					{
						x = 122,
						y = 54
					}
				},
				价格 = 取随机数(55000, 75000)
			},
			{
				x = 312,
				y = 7,
				分类 = 2,
				次数 = 50,
				名称 = "蓝色合成旗",
				子类 = 50,
				地图 = 1070,
				总类 = 11,
				可叠加 = false,
				xy = {
					{
						x = 141,
						y = 203
					},
					{
						x = 33,
						y = 183
					},
					{
						x = 52,
						y = 74
					},
					{
						x = 107,
						y = 14
					},
					{
						x = 106,
						y = 158
					},
					{
						x = 125,
						y = 100
					}
				},
				价格 = 取随机数(55000, 75000)
			},
			{
				分类 = 1,
				名称 = "红色导标旗",
				总类 = 11,
				可叠加 = false,
				价格 = 取随机数(5000, 8000)
			},
			{
				分类 = 1,
				名称 = "绿色导标旗",
				总类 = 11,
				可叠加 = false,
				价格 = 取随机数(5000, 8000)
			},
			{
				分类 = 1,
				名称 = "蓝色导标旗",
				总类 = 11,
				可叠加 = false,
				价格 = 取随机数(5000, 8000)
			},
			{
				分类 = 1,
				名称 = "白色导标旗",
				总类 = 11,
				可叠加 = false,
				价格 = 取随机数(5000, 8000)
			},
			{
				分类 = 1,
				名称 = "黄色导标旗",
				总类 = 11,
				可叠加 = false,
				价格 = 取随机数(5000, 8000)
			}
		}

		for i = 1, 取随机数(15, 20) do
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x旗子[取随机数(1, #x旗子)]))
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "一级药") ~= nil then
		local x一级药 = {
			{
				名称 = "鬼切草",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "旋复花",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "龙须草",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "灵脂",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "七叶莲",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "百色花",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "紫丹罗",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "天青地白",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "白玉骨头",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "曼陀罗花",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "佛手",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "香叶",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "草果",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "九香虫",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "水黄莲",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "山药",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "八角莲叶",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "人参",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			},
			{
				名称 = "四叶花",
				可叠加 = true,
				价格 = 取随机数(50, 500),
				数量 = 取随机数(50, 999)
			}
		}
		local x临物品 = 0

		for i = 1, 19 do
			x临物品 = x临物品 + 1
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x一级药[x临物品]))
			x临时物品[#x临时物品].价格 = 取随机数(50, 500)
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "二级药") ~= nil then
		local x二级药 = {
			{
				名称 = "六道轮回",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "天不老",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "紫石英",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "血色茶花",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "熊胆",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "凤凰尾",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "天龙水",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "地狱灵芝",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "餐风饮露",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "白露为霜",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "硫磺草",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "龙之心屑",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "月星子",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "丁香水",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "麝香",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "血珊瑚",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "火凤之睛",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "孔雀红",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "鹿茸",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			},
			{
				名称 = "仙狐涎",
				可叠加 = true,
				价格 = 取随机数(1000, 5000),
				数量 = 取随机数(50, 99)
			}
		}
		local x临物品 = 0

		for i = 1, 取随机数(20, 20) do
			x临物品 = x临物品 + 1
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x二级药[x临物品]))
			x临时物品[#x临时物品].价格 = 取随机数(1000, 5000)
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "菊花的三级药") ~= nil then
		local x三级药 = {}
		local 随机药性 = {
			nil,
			"益疗",
			nil,
			"守魂",
			nil,
			"提气",
			nil,
			"藏神",
			nil,
			"倍愈"
		}
		x三级药[1] = {
			1,
			名称 = "十香返生丸",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[2] = {
			名称 = "小还丹",
			数量 = 1,
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[3] = {
			1,
			名称 = "千年保心丹",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[4] = {
			1,
			名称 = "蛇蝎美人",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[5] = {
			1,
			名称 = "金香玉",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[6] = {
			1,
			名称 = "九转回魂丹",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[7] = {
			1,
			名称 = "风水混元丹",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[8] = {
			1,
			名称 = "定神香",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[9] = {
			1,
			名称 = "五龙丹",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		x三级药[10] = {
			1,
			名称 = "佛光舍利子",
			可叠加 = true,
			数量 = 取随机数(5, 20),
			价格 = 取随机数(30000, 80000),
			阶品 = 取随机数(100, 250),
			药性 = 随机药性[取随机数(1, #随机药性)]
		}
		local aa = 0

		for i = 1, 取随机数(20, 20) do
			aa = aa % 10 + 1
			x三级药[aa].价格 = 取随机数(100000, 300000)
			x三级药[aa].阶品 = 取随机数(200, 350)
			x三级药[aa].数量 = 取随机数(5, 20)
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x三级药[aa]))
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "三级药") ~= nil then
		local x三级药 = {
			{
				名称 = "十香返生丸",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "小还丹",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "千年保心丹",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "蛇蝎美人",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "金香玉",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "九转回魂丹",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "风水混元丹",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "定神香",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "五龙丹",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "佛光舍利子",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			}
		}
		local aa = 0

		for i = 1, 取随机数(20, 20) do
			aa = aa % 10 + 1
			x三级药[aa].价格 = 取随机数(50000, 100000)
			x三级药[aa].阶品 = 取随机数(10, 100)
			x三级药[aa].数量 = 取随机数(5, 20)
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x三级药[aa]))
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "烹饪") ~= nil or string.find(摊位名称, "香喷喷") ~= nil or string.find(摊位名称, "食物") ~= nil or string.find(摊位名称, "吃货") ~= nil or string.find(摊位名称, "酒") ~= nil) then
		local aa = true

		if string.find(摊位名称, "酒") ~= nil then
			aa = false
		end

		local x烹饪 = {}
		local x烹饪1 = {
			{
				名称 = "醉生梦死",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "珍露酒",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "女儿红",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20)
			},
			{
				名称 = "虎骨酒",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "梅花酒",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "百味酒",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			},
			{
				名称 = "蛇胆酒",
				可叠加 = true,
				价格 = 取随机数(5000, 25000),
				数量 = 取随机数(5, 20),
				阶品 = 取随机数(10, 100)
			}
		}
		x烹饪[1] = {
			名称 = "佛跳墙",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[2] = {
			名称 = "烤鸭",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[3] = {
			名称 = "豆斋果",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[4] = {
			名称 = "臭豆腐",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[5] = {
			名称 = "烤肉",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[6] = {
			名称 = "桂花丸",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[7] = {
			名称 = "翡翠豆腐",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		x烹饪[8] = {
			名称 = "长寿面",
			可叠加 = true,
			价格 = 取随机数(5000, 25000),
			数量 = 取随机数(5, 20),
			阶品 = 取随机数(10, 100)
		}
		local zz = 0
		local 记录表 = {}

		for i = 1, 取随机数(40, 40) do
			if aa then
				local 开始 = true

				while 开始 or not 记录表.判定 do
					开始 = false
					zz = ygsj(#x烹饪)
					记录表 = 取摆摊伪随机(x烹饪[zz].名称, 记录表, 7)
				end

				x烹饪[zz].价格 = 取随机数(20000, 100000)
				x烹饪[zz].阶品 = 取随机数(10, 100)
				x烹饪[zz].数量 = 取随机数(5, 20)
				x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x烹饪[zz]))
			else
				local 开始 = true

				while 开始 or not 记录表.判定 do
					开始 = false
					zz = ygsj(#x烹饪1)
					记录表 = 取摆摊伪随机(x烹饪1[zz].名称, 记录表, 6)
				end

				x烹饪1[zz].价格 = 取随机数(20000, 100000)
				x烹饪1[zz].阶品 = 取随机数(10, 100)
				x烹饪1[zz].数量 = 取随机数(5, 20)
				x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x烹饪1[zz]))
			end
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "鉴定") ~= nil then
		local x鉴定 = {
			{
				子类 = 100,
				名称 = "神兵图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(40000, 50000)
			},
			{
				子类 = 100,
				名称 = "灵宝图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(40000, 50000)
			},
			{
				子类 = 120,
				名称 = "神兵图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(60000, 70000)
			},
			{
				子类 = 120,
				名称 = "灵宝图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(60000, 70000)
			},
			{
				子类 = 130,
				名称 = "神兵图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(70000, 80000)
			},
			{
				子类 = 130,
				名称 = "灵宝图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(70000, 80000)
			},
			{
				子类 = 140,
				名称 = "神兵图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(80000, 90000)
			},
			{
				子类 = 140,
				名称 = "灵宝图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(80000, 90000)
			},
			{
				子类 = 150,
				名称 = "神兵图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(90000, 100000)
			},
			{
				子类 = 150,
				名称 = "灵宝图鉴",
				数量 = 1,
				可叠加 = true,
				价格 = 取随机数(90000, 100000)
			}
		}
		local 鉴定符价格 = {
			[100] = {
				40000,
				50000
			},
			[120] = {
				60000,
				70000
			},
			[130] = {
				70000,
				80000
			},
			[140] = {
				80000,
				90000
			},
			[150] = {
				90000,
				100000
			}
		}

		for i = 1, 取随机数(40, 80) do
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x鉴定[ygsj(#x鉴定)]))
			x临时物品[#x临时物品].价格 = 取随机数(鉴定符价格[x临时物品[#x临时物品].子类][1], 鉴定符价格[x临时物品[#x临时物品].子类][2])
			x临时物品[#x临时物品].数量 = 取随机数(1, 5)
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "打造符") ~= nil then
		local x鉴定 = {
			{
				名称 = "打造符",
				玩家名称 = "假人摆摊",
				级别限制 = 70,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "裁缝符",
				玩家名称 = "假人摆摊",
				级别限制 = 70,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "炼金符",
				玩家名称 = "假人摆摊",
				级别限制 = 70,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "打造符",
				玩家名称 = "假人摆摊",
				级别限制 = 90,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "裁缝符",
				玩家名称 = "假人摆摊",
				级别限制 = 90,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "炼金符",
				玩家名称 = "假人摆摊",
				级别限制 = 90,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "打造符",
				玩家名称 = "假人摆摊",
				级别限制 = 110,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "裁缝符",
				玩家名称 = "假人摆摊",
				级别限制 = 110,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "炼金符",
				玩家名称 = "假人摆摊",
				级别限制 = 110,
				可叠加 = true,
				价格 = 取随机数(300000, 500000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "打造符",
				玩家名称 = "假人摆摊",
				级别限制 = 130,
				可叠加 = true,
				价格 = 取随机数(500000, 800000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "裁缝符",
				玩家名称 = "假人摆摊",
				级别限制 = 130,
				可叠加 = true,
				价格 = 取随机数(500000, 800000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "炼金符",
				玩家名称 = "假人摆摊",
				级别限制 = 130,
				可叠加 = true,
				价格 = 取随机数(500000, 800000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "打造符",
				玩家名称 = "假人摆摊",
				级别限制 = 150,
				可叠加 = true,
				价格 = 取随机数(1000000, 1300000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "裁缝符",
				玩家名称 = "假人摆摊",
				级别限制 = 150,
				可叠加 = true,
				价格 = 取随机数(1000000, 1300000),
				数量 = 取随机数(5, 10)
			},
			{
				名称 = "炼金符",
				玩家名称 = "假人摆摊",
				级别限制 = 150,
				可叠加 = true,
				价格 = 取随机数(1000000, 1300000),
				数量 = 取随机数(5, 10)
			}
		}
		local 打造符价格 = {
			[70] = {
				200000,
				400000
			},
			[90] = {
				400000,
				600000
			},
			[110] = {
				600000,
				800000
			},
			[130] = {
				1000000,
				1500000
			},
			[150] = {
				1500000,
				2000000
			}
		}

		for i = 1, 取随机数(40, 80) do
			x临时物品[#x临时物品 + 1] = table.loadstring(table.tostring(x鉴定[ygsj(#x鉴定)]))
			x临时物品[#x临时物品].价格 = 取随机数(打造符价格[x临时物品[#x临时物品].级别限制][1], 打造符价格[x临时物品[#x临时物品].级别限制][2])
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "书") ~= nil or string.find(摊位名称, "铁") ~= nil) then
		for i = 1, 取随机数(10, 17) do
			local x临物品 = #x临时物品 + 1
			x临时物品[x临物品] = self:给予书铁(botId, {
				3,
				4
			})
			x临时物品[x临物品].价格 = 取随机数(x临时物品[x临物品].子类 * 500, x临时物品[x临物品].子类 * 800)
		end

		for i = 1, 取随机数(1, 3) do
			if 取随机数(1, 100) <= 5 then
				local x临物品 = #x临时物品 + 1
				x临时物品[x临物品] = self:给予书铁(botId, {
					5,
					5
				})
				x临时物品[x临物品].价格 = 取随机数(x临时物品[x临物品].子类 * 1000, x临时物品[x临物品].子类 * 3000)
			end
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "兽决") ~= nil then
		for i = 1, 取随机数(3, 17) do
			local x临物品 = #x临时物品 + 1
			x临时物品[x临物品] = self:摆摊数据库输出(botId, "魔兽要诀", 1, nil, nil, nil)
			x临时物品[x临物品].价格 = 取随机数(300000, 500000)
		end

		for i = 1, 取随机数(1, 3) do
			if 取随机数(1, 100) <= 5 then
				local x临物品 = #x临时物品 + 1
				x临时物品[x临物品] = self:摆摊数据库输出(botId, "高级魔兽要诀", 1, nil, nil, nil)
				x临时物品[x临物品].价格 = 取随机数(3000000, 10000000)
			end
		end
	elseif 摊位名称 ~= nil and 摊位名称 ~= "" and string.find(摊位名称, "藏宝图") ~= nil then
		for i = 1, 取随机数(20, 20) do
			local x临物品 = #x临时物品 + 1
			x临时物品[x临物品] = self:摆摊数据库输出(botId, "藏宝图", 1, nil, nil, nil)
			x临时物品[x临物品].价格 = 取随机数(150000, 250000)
		end

		for i = 1, 取随机数(1, 10) do
			if 取随机数(1, 100) <= 5 then
				local x临物品 = #x临时物品 + 1
				x临时物品[x临物品] = self:摆摊数据库输出(botId, "高级藏宝图", 1, nil, nil, nil)
				x临时物品[x临物品].价格 = 取随机数(1500000, 25000000)
			end
		end
	end

	ctx.物品 = x临时物品
	x临时物品 = {}
	ctx.bb = {}

	if 摊位名称 ~= nil and 摊位名称 ~= "" and (string.find(摊位名称, "宝宝") ~= nil or string.find(摊位名称, "召唤") ~= nil or string.find(摊位名称, "技能") ~= nil or string.find(摊位名称, "bb") ~= nil or string.find(摊位名称, "神兽") ~= nil) then
		for n = 1, 取随机数(10, 30) do
			local 模型 = self:取随机怪(0, 155)
			local xwz = #ctx.bb + 1
			ctx.bb[xwz] = self:添加召唤兽(模型[2], 模型[2], "宝宝", 属性, 0, 染色方案, nil, 资质组, 成长, 参战等级, 属性表, 转换, 是否神兽物法, botId)

			if ctx.bb[xwz].参战等级 >= 0 and ctx.bb[xwz].参战等级 <= 55 then
				ctx.bb[xwz].价格 = 取随机数(ctx.bb[xwz].参战等级 * 1000, ctx.bb[xwz].参战等级 * 2000)
			elseif ctx.bb[xwz].参战等级 > 55 and ctx.bb[xwz].参战等级 <= 95 then
				ctx.bb[xwz].价格 = 取随机数(ctx.bb[xwz].参战等级 * 1000, ctx.bb[xwz].参战等级 * 5000)
			elseif ctx.bb[xwz].参战等级 > 95 and ctx.bb[xwz].参战等级 <= 135 then
				ctx.bb[xwz].价格 = 取随机数(ctx.bb[xwz].参战等级 * 5000, ctx.bb[xwz].参战等级 * 8000)
			elseif ctx.bb[xwz].参战等级 > 135 and ctx.bb[xwz].参战等级 <= 175 then
				ctx.bb[xwz].价格 = 取随机数(ctx.bb[xwz].参战等级 * 10000, ctx.bb[xwz].参战等级 * 20000)
			end
		end
	end

	if ret then
		return ctx
	end

	local key = "" .. botId
	摆摊假人处理类.npcUserList[key][5] = 玩家姓[取随机数(1, #玩家姓)]
	local x角色 = 玩家选项[取随机数(1, #玩家选项)]
	摆摊假人处理类.npcUserList[key][7] = x角色
	摆摊假人处理类.npcUserList[key][8] = ctx
end

function 假人玩家处理类:取随机怪(a, b)
	local 临时信息 = 取等级怪(取随机数(a, b))
	local 临时模型 = 取敌人信息(临时信息[取随机数(1, #临时信息)])

	return 临时模型
end

function 假人玩家处理类:添加召唤兽(模型, 名称, 类型, 属性, 等级, 染色方案, 技能组, 资质组, 成长, 参战等级, 属性表, 转换, 是否神兽物法, 假人id)
	local 召唤兽数据 = 宝宝类.创建()

	召唤兽数据:置新对象(模型, 名称, 类型, 属性, 等级, 染色方案, 技能组, 资质组, 成长, 参战等级, 属性表, 转换, 是否神兽物法)

	召唤兽数据.认证码 = 假人id .. "_" .. os.time() .. "_" .. 取随机数(20, 10000) .. "_" .. 取随机数(111111111111.0, 999999999999.0)
	召唤兽数据.转换 = 转换
	召唤兽数据.内丹 = {
		可用内丹 = 6,
		内丹上限 = 6
	}
	召唤兽数据.灵性 = 0
	召唤兽数据.进阶 = false
	召唤兽数据.仙露上限 = 7
	召唤兽数据.特性 = "无"
	召唤兽数据.特性几率 = 0
	召唤兽数据.进阶属性 = {
		体质 = 0,
		力量 = 0,
		敏捷 = 0,
		耐力 = 0,
		魔力 = 0
	}
	召唤兽数据.统御属性 = {
		体质 = 0,
		力量 = 0,
		敏捷 = 0,
		耐力 = 0,
		魔力 = 0
	}

	if 等级 ~= nil and 等级 ~= 0 then
		召唤兽数据:重置等级(等级)
	end

	return 召唤兽数据
end

function 假人玩家处理类:购买摊位商品(玩家的ID, 连接id, id, 数据)
	local 对方did = 摆摊假人处理类.npcUserList["" .. 玩家的ID]

	if 对方did == nil or 对方did ~= nil and 对方did[8] == nil then
		常规提示(id, "#Y/这个摊位并不存在")

		return
	end

	对方id = 摆摊假人处理类.npcUserList["" .. 玩家的ID][8]

	if 玩家数据[id].摊位查看 < 对方did.更新 then
		常规提示(id, "#Y/这个摊位的数据已经发生了变化，请重新打开该摊位")

		return
	end

	if ctx ~= ctx then
		常规提示(id, "#Y/这个摊位的数据已经发生了变化，请重新打开该摊位")

		return
	end

	local 名称1 = 玩家数据[id].角色.名称
	local 账号1 = 玩家数据[id].账号

	if 数据.bb == nil then
		if 对方id.物品[数据.道具] == nil then
			常规提示(id, "#Y/这个商品并不存在1")

			return
		end

		if 数据.数量 ~= nil then
			数据.数量 = 数据.数量 + 0
		end

		if 数据.数量 == nil or 数据.数量 ~= nil and 数据.数量 < 1 or 对方id.物品[数据.道具].数量 == nil then
			数据.数量 = 1
		end

		if 数据.数量 ~= nil and 对方id.物品[数据.道具].数量 ~= nil and 对方id.物品[数据.道具].数量 < 数据.数量 then
			数据.数量 = 对方id.物品[数据.道具].数量
		end

		local 价格 = 对方id.物品[数据.道具].价格 * 数据.数量

		if 玩家数据[id].角色.数据.银子 < 价格 then
			常规提示(id, "#Y/你没有那么多的银子")

			return
		end

		local 临时格子 = 玩家数据[id].角色:取道具格子()

		if 临时格子 == 0 then
			常规提示(id, "#Y/请先整理下包裹吧！")

			return
		end

		玩家数据[id].角色:扣除银子(价格, 0, 0, "摊位购买", 1)

		local 道具名称 = 对方id.物品[数据.道具].名称
		local 道具识别码 = 对方id.物品[数据.道具].识别码

		玩家数据[id].角色:日志记录(format("[摊位系统-购买]购买道具[%s][%s]，花费%s两银子,出售者信息：[%s][%s][%s]", 道具名称, 道具识别码, 价格, 账号, 玩家的ID, 名称))
		常规提示(id, "#W/购买#R/" .. 道具名称 .. "#W/成功！")

		if 玩家数据[id].道具:摊位物品转移(id, 对方id.物品[数据.道具], 数据.数量) == false then
			local 道具编号 = 玩家数据[id].道具:取新编号()
			对方id.物品[数据.道具].识别码 = id .. "_" .. os.time() .. "_" .. 取随机数(20, 10000) .. "_" .. 取随机数(111111111111.0, 999999999999.0)
			玩家数据[id].道具.数据[道具编号] = table.loadstring(table.tostring(对方id.物品[数据.道具]))
			玩家数据[id].道具.数据[道具编号].数量 = 数据.数量
			玩家数据[id].角色.数据.道具[临时格子] = 道具编号

			刷新道具行囊单格(id, "道具", 临时格子, 道具编号)
		end

		if 对方id.物品[数据.道具].可叠加 == false or 对方id.物品[数据.道具].数量 == nil then
			对方id.物品[数据.道具] = nil
		else
			对方id.物品[数据.道具].数量 = 对方id.物品[数据.道具].数量 - 数据.数量

			if 对方id.物品[数据.道具].数量 < 1 then
				对方id.物品[数据.道具] = nil
			end
		end
	elseif 数据.道具 == nil then
		if 对方id.bb == nil or 对方id.bb ~= nil and 对方id.bb[数据.bb] == nil then
			常规提示(id, "#Y/这只召唤兽不存在1")

			return
		elseif 玩家数据[id].角色:取新增宝宝数量() == false then
			常规提示(id, "#Y/你当前可携带的召唤兽数量已达上限！")

			return
		end

		local 价格 = 对方id.bb[数据.bb].价格

		if 玩家数据[id].角色.数据.银子 < 价格 then
			常规提示(id, "#Y/你没有那么多的银子")

			return
		end

		local 道具名称 = 对方id.bb[数据.bb].名称
		local 道具等级 = 对方id.bb[数据.bb].等级
		local 道具模型 = 对方id.bb[数据.bb].模型
		local 道具技能 = #对方id.bb[数据.bb].技能
		local 道具识别码 = 对方id.bb[数据.bb].认证码

		玩家数据[id].角色:扣除银子(价格, 0, 0, "摊位购买", 1)
		玩家数据[id].角色:日志记录(format("[摊位系统-购买]购买召唤兽[%s][%s][%s][%s][%s]，花费%s两银子,出售者信息：[%s][%s][%s]", 道具名称, 道具模型, 道具等级, 道具技能, 道具识别码, 价格, 账号, 对方id, 名称))
		常规提示(id, "#W/购买#R/" .. 道具名称 .. "#W/成功！")

		玩家数据[id].召唤兽.数据[#玩家数据[id].召唤兽.数据 + 1] = table.loadstring(table.tostring(对方id.bb[数据.bb]))

		玩家数据[id].召唤兽:刷新信息(#玩家数据[id].召唤兽.数据)

		local 宝宝 = 宝宝类.创建()

		宝宝:加载数据(玩家数据[id].召唤兽.数据[#玩家数据[id].召唤兽.数据])

		玩家数据[id].召唤兽.数据[#玩家数据[id].召唤兽.数据] = 宝宝

		table.remove(对方id.bb, 数据.bb)
		发送数据(玩家数据[id].连接id, 3512, 玩家数据[id].召唤兽.数据)
	end

	发送数据(玩家数据[id].连接id, 3520, 玩家数据[id].角色.数据.银子)

	摆摊假人处理类.npcUserList["" .. 玩家的ID].更新 = os.time()
	玩家数据[id].摊位查看 = os.time()
	玩家数据[id].摊位id = 玩家的ID

	摆摊假人处理类:索要摊位(玩家数据[id].连接id, 玩家的ID)
end

function 假人玩家处理类:给予书铁(id, 等级)
	local 临时随机 = 取随机数()
	local 书铁名称 = "百炼精铁"

	if 临时随机 <= 50 then
		书铁名称 = "制造指南书"
	end

	local 书铁等级 = 取随机数(等级[1] * 10, 等级[2] * 10)
	local 书铁种类 = 取随机数(1, #书铁范围)
	书铁等级 = math.floor(书铁等级 / 10) * 10

	return self:摆摊数据库输出(id, 书铁名称, 书铁等级, 书铁种类)
end

function 假人玩家处理类:摆摊数据库输出(假人id, 名称, 数量, 参数, 附加, 专用)
	local 识别码 = 假人id .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列
	随机序列 = 随机序列 + 1
	local 摆摊数据 = nil
	摆摊数据 = 物品类()

	摆摊数据:置对象(名称)

	临时道具 = 取物品数据(名称)
	临时道具.总类 = 临时道具[2]
	临时道具.子类 = 临时道具[4]
	临时道具.分类 = 临时道具[3]

	if 名称 == "点化石" then
		if 取随机数(1, 100) <= 1 then
			摆摊数据.附带技能 = "剑荡四方"
		elseif 取随机数(1, 100) <= 5 then
			摆摊数据.附带技能 = 取高级要诀()
		else
			摆摊数据.附带技能 = 取低级要诀()
		end
	elseif 名称 == "藏宝图" or 名称 == "高级藏宝图" then
		local 随机地图 = {
			1501,
			1506,
			1092,
			1091,
			1110,
			1142,
			1514,
			1174,
			1173,
			1146,
			1208
		}
		local 临时地图 = 随机地图[取随机数(1, #随机地图)]
		摆摊数据.地图名称 = 取地图名称(临时地图)
		摆摊数据.地图编号 = 临时地图
		local xy = 地图处理类.地图坐标[临时地图]:取随机点()
		摆摊数据.x = xy.x
		摆摊数据.y = xy.y
	elseif 名称 == "神兜兜" then
		摆摊数据.数量 = 数量
	elseif 名称 == "珍珠" then
		摆摊数据.级别限制 = 数量
	elseif 名称 == "清灵净瓶" then
		摆摊数据.数量 = 数量
	elseif 名称 == "魔兽要诀" then
		摆摊数据.附带技能 = 取低级要诀()
	elseif 名称 == "高级魔兽要诀" then
		if 参数 == nil then
			摆摊数据.附带技能 = 取高级要诀()
		else
			摆摊数据.附带技能 = 参数
		end
	elseif 名称 == "百炼精铁" then
		摆摊数据.子类 = 数量
	elseif 名称 == "制造指南书" then
		摆摊数据.子类 = 数量
		摆摊数据.特效 = 参数
	elseif 临时道具.总类 == 5 and 临时道具.分类 == 4 then
		摆摊数据.级别限制 = 数量
	elseif 临时道具.总类 == 5 and 临时道具.分类 == 6 then
		摆摊数据.级别限制 = 数量
	elseif 临时道具.总类 == 1 and 临时道具.子类 == 1 and 临时道具.分类 == 4 then
		摆摊数据.阶品 = 参数
	end

	if 摆摊数据.可叠加 then
		摆摊数据.数量 = 数量
	end

	摆摊数据.识别码 = 识别码

	return 摆摊数据
end

return 假人玩家处理类
