大额日志内容 = "日志创建\n"
大额额度 = 100000000
单机设置 = true
临时限制 = false
内充开关 = false
畅通无阻 = {}
经验丹加储备 = false
刷新交易中心 = true
更新交易中心 = "2024年01月01日 15:34b:31"
刷新坐骑召唤兽统御 = 1
开服时间 = os.time({
	hour = 10,
	month = 4,
	year = 2024,
	second = 0,
	minute = 0,
	day = 15
})
开放抽奖 = true
注册数量限制 = 5
创建角色限制 = 20
合宠技能概率基数 = 6
合宠技能重复判断 = false
cbg费率 = 0.05
管理升级无限制 = true
BB技能削弱 = true
灵饰最低副词条数 = 1
灵饰强化打造加成 = 1.2
全局奖励倍率 = 1
扣除银子列表 = {
	防多次 = 2,
	[10424.0] = 5759360,
	[10426.0] = 4319520,
	[10423.0] = 6119320,
	[10425.0] = 1799800,
	[10398.0] = 19725808
}
最大战斗速度 = 3
双倍可领 = 6
三倍可领 = 4
商城版本 = 0.1
系统角色自动保护概率 = 15
战斗自动保护开关 = true
自动任务找人概率 = 50
自动挂机同地图模式 = 1
自动挂机暂停时间 = 300
自动挂机间隔标准 = 1
自动挂机间隔 = 2
自动挂机战斗后停顿 = 0
自动挂机类型列表 = {
	"师门任务",
	"青龙任务",
	"玄武任务",
	"捉鬼",
	"鬼王任务",
	"门派闯关",
	"初出江湖",
	"宝图任务",
	"降妖伏魔",
	"皇宫飞贼",
	"飞贼贼王",
	"福利BOSS",
	"散财童子",
	"妖魔鬼怪",
	"捣乱的水果",

	"天庭叛逆",
	"突厥探子",
	"地煞1星",
	"地煞2星",
	"地煞3星",
	"地煞4星",
	"地煞5星",
	"地煞6星",
	"地煞7星",
	"地煞8星",
	"地煞9星",
	"地煞10星",
	"地煞11星",
	"地煞12星",
		"地煞13星",
		"地煞14星",
			"地煞15星",
		"天罡星",
	"突厥精英",
	"知了王",
	"小鬼子"

}
限制电脑登陆 = 35
客户端登陆列表 = {}
聚宝盆上限 = 0.1
通灵宝玉上限 = 0.2
自动挂机类型列表1 = {
	天庭叛逆 = 2,
	鬼王任务 = 1,
	地煞5星 = 2,
	降妖伏魔 = 1,
	知了王 = 2,
	捉鬼 = 1,
	捣乱的水果 = 2,
		小鬼子 = 2,
	突厥探子 = 2,
	突厥精英 = 2,
	飞贼贼王 = 1,
	玄武任务 = 1,
	初出江湖 = 1,
	地煞1星 = 2,
	宝图任务 = 1,
	天罡星 = 2,
	地煞4星 = 2,
	福利BOSS = 2,
	师门任务 = 1,
	散财童子 = 2,
	地煞2星 = 2,
	地煞3星 = 2,
	地煞4星 = 2,
	地煞5星 = 2,
		地煞6星 = 2,
			地煞7星 = 2,
				地煞8星 = 2,
					地煞9星 = 2,
						地煞10星 = 2,
						地煞11星 = 2,
						地煞12星 = 2,
						地煞13星 = 2,
						地煞14星 = 2,
						地煞15星 = 2,
						天罡星 = 2,

	妖魔鬼怪 = 2,
	二十八星宿 = 2,
	门派闯关 = 1,
	青龙任务 = 1,
	皇宫飞贼 = 1
}
自动挂机 = {}
自动挂机列表 = {}

for i = 1, #自动挂机类型列表 do
	自动挂机列表[自动挂机类型列表[i]] = {}
end

毁灭之光测试通杀 = false

if 单机设置 then
	装备全部位绿字 = true
else
	装备全部位绿字 = false
end

钟灵石数量 = {}
变异多技能概率 = 10
洗宠技能概率 = 33
洗宠阶段概率 = {
	25,
	20,
	18,
	15,
	13
}
洗宠特殊技能概率 = {
	奋勇当先 = 洗宠技能概率 - 洗宠阶段概率[1],
	观照万象 = 洗宠技能概率 - 洗宠阶段概率[1],
	出其不意 = 洗宠技能概率 - 洗宠阶段概率[2],
	大快朵颐 = 洗宠技能概率 - 洗宠阶段概率[2],
	净台妙谛 = 洗宠技能概率 - 洗宠阶段概率[2],
	诸天正法 = 洗宠技能概率 - 洗宠阶段概率[2],
	须弥真言 = 洗宠技能概率 - 洗宠阶段概率[2],
	力劈华山 = 洗宠技能概率 - 洗宠阶段概率[2],
	风起龙游 = 洗宠技能概率 - 洗宠阶段概率[2],
	舍身一搏 = 洗宠技能概率 - 洗宠阶段概率[2],
	天狐之舞 = 洗宠技能概率 - 洗宠阶段概率[2],
	欣欣向荣 = 洗宠技能概率 - 洗宠阶段概率[2],
	顾盼生姿 = 洗宠技能概率 - 洗宠阶段概率[2],
	驱怪 = 洗宠技能概率 - 洗宠阶段概率[2],
	灵能激发 = 洗宠技能概率 - 洗宠阶段概率[2],
	荒古破击 = 洗宠技能概率 - 洗宠阶段概率[3],
	剑气四射 = 洗宠技能概率 - 洗宠阶段概率[3],
	雨润丰泽 = 洗宠技能概率 - 洗宠阶段概率[3],
	翻江倒海 = 洗宠技能概率 - 洗宠阶段概率[3],
	死亡召唤 = 洗宠技能概率 - 洗宠阶段概率[4],
	壁垒击破 = 洗宠技能概率 - 洗宠阶段概率[4],
	剑荡四方 = 洗宠技能概率 - 洗宠阶段概率[4],
	善恶有报 = 洗宠技能概率 - 洗宠阶段概率[4],
	惊心一剑 = 洗宠技能概率 - 洗宠阶段概率[4],
	嗜血追击 = 洗宠技能概率 - 洗宠阶段概率[4],
	夜舞倾城 = 洗宠技能概率 - 洗宠阶段概率[4],
	无畏布施 = 洗宠技能概率 - 洗宠阶段概率[4],
	上古灵符 = 洗宠技能概率 - 洗宠阶段概率[4],
	战斗号角 = 洗宠技能概率 - 洗宠阶段概率[4],
	上善若水 = 洗宠技能概率 - 洗宠阶段概率[4],
	法术防御 = 洗宠技能概率 - 洗宠阶段概率[4],
	生命守护 = 洗宠技能概率 - 洗宠阶段概率[4],
	灵山禅语 = 洗宠技能概率 - 洗宠阶段概率[4],
	凝光炼彩 = 洗宠技能概率 - 洗宠阶段概率[4],
	移花接木 = 洗宠技能概率 - 洗宠阶段概率[4],
	赶尽杀绝 = 洗宠技能概率 - 洗宠阶段概率[4],
	烈焰斩 = 洗宠技能概率 - 洗宠阶段概率[4],
	双星闪 = 洗宠技能概率 - 洗宠阶段概率[4],
	影袭 = 洗宠技能概率 - 洗宠阶段概率[4],
	龙魂 = 洗宠技能概率 - 洗宠阶段概率[4],
	独行 = 洗宠技能概率 - 洗宠阶段概率[4],
	花好月圆 = 洗宠技能概率 - 洗宠阶段概率[5],
	映雪棱镜 = 洗宠技能概率 - 洗宠阶段概率[5],
	风沙之盾 = 洗宠技能概率 - 洗宠阶段概率[5],
	薪火相传 = 洗宠技能概率 - 洗宠阶段概率[5],
	刀背打 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级必杀 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级连击 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级吸血 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级偷袭 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级夜战 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级法术暴击 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级法术连击 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级魔之心 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级神佑复生 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级蛮劲 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级法术穿透 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级物理穿透 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级健壮 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级勇敢 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级气势 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级震摄 = 洗宠技能概率 - 洗宠阶段概率[5],
	高级审判 = 洗宠技能概率 - 洗宠阶段概率[5]
}
合宠保底技能数量 = 5
一键顶书概率比例 = 0.8
打书模式 = 1
打书必上技能数 = 4
打书最大格子数 = 8
打书概率列表 = {
	[0] = 10000,
	7500,
	6000,
	4500,
	3000,
	1000,
	500,
	250,
	100,
	80,
	60,
	50,
	45,
	40,
	35,
	30,
	25,
	20,
	15,
	10,
	5,
	3,
	2,
	1
}
首回合增益技能 = {
	金刚护体 = 1,
	金刚护法 = 1,
	灵动九天 = 1,
	一苇渡江 = 1,
	韦陀护法 = 1
}
结束战斗限制 = 60
超级行囊格子数 = 1200

客户端版本 = 0
副本减负 = {
	齐天大圣开启 = true,
	大闹天宫开启 = true,
	黑风山开启 = true,
	乌鸡国 = {
		5,
		5,
		3
	},
	车迟斗法 = {
		[1.0] = 3,
		[2.0] = 5
	},
	水陆大会 = {
		3,
		3,
		5,
		2,
		2
	},
	通天河 = {
		[1.0] = 5,
		[2.0] = 10
	},
	齐天大圣 = {
		[1.0] = 5,
		[2.0] = 10
	},
	大闹天宫 = {
		3,
		3,
		3,
		5,
		5,
		10
	},
	黑风山 = {
		2,
		2,
		2,
		10,
		5,
		10
	}
}
掉率模式 = 1
辅助强化技能最高等级 = 180
师门技能上限等级 = 180
强化技能消耗倍率 = 5
官职任务奖励 = 5
官职加成数 = 3
官职级别验证 = 1
昨日特殊称谓列表 = {}
今日特殊称谓列表 = {}
退出战斗列表 = {}
经脉限制开关 = true
三经脉开关 = true
治疗加成模式 = 1
聚气生效法术 = {
	推拿 = 1,
	推气过宫 = 1,
	舍身取义 = 1,
	妙手回春 = 1,
	救死扶伤 = 1,
	醍醐灌顶 = 1,
	活血 = 1,
	妙悟 = 1,
	我佛慈悲 = 1
}
五行法术列表 = {
	"巨岩破",
	"靛沧海",
	"日光华",
	"地裂火",
	"苍茫树"
}
四系法术列表 = {
	"泰山压顶",
	"奔雷咒",
	"地狱烈火",
	"水漫金山",
	"水攻",
	"烈火",
	"雷击",
	"落岩"
}
五行物攻法术 = {
	靛沧啸 = "水",
	日光耀 = "金",
	苍茫刺 = "木",
	巨岩击 = "土",
	地裂焚 = "火"
}
克制所有五行法术 = {
	相灭相生 = 1,
	剑意莲心 = 1
}
五行固伤法术 = {
	靛沧海 = "水",
	苍茫树 = "木",
	巨岩破 = "土",
	地裂火 = "火",
	日光华 = "金"
}
雷法技能 = {
	["雷法·坤伏"] = 1,
	五雷正法 = 1,
	["雷法·轰天"] = 1,
	["雷法·崩裂"] = 1,
	["雷法·震煞"] = 1,
	["雷法·翻天"] = 1,
	["雷法·倒海"] = 1
}
门派封印法术 = {
	方寸山 = {
		失魂符 = 1,
		失心符 = 1,
		定身符 = 1,
		顺势而为 = 1,
		失忆符 = 1,
		落魄符 = 1,
		催眠符 = 1,
		追魂符 = 1,
		离魂符 = 1
	}
}
神通技能列表 = {
	铜头铁臂 = 1,
	泼天乱棒 = 1,
	云暗天昏 = 1,
	杀威铁棒 = 1,
	棍打诸神 = 1,
	棒掀北斗 = 1,
	意马心猿 = 1,
	当头一棒 = 1,
	棒打雄风 = 1,
	兴风作浪 = 1,
	九幽除名 = 1,
	无所遁形 = 1,
	神针撼海 = 1
}
不受反震反击技能 = {
	三荒尽灭 = 1,
	魔神之刃 = 1,
	力辟苍穹 = 1
}
龍骇最高层数 = 5
流派额外能力属性 = {
	虎贲上将 = {
		速度 = 30
	},
	无双战神 = {
		最大气血 = 280,
		气血 = 280
	},
	浴血豪侠 = {
		伤害 = 40
	},
	沧海潜龙 = {
		法术暴击等级 = 40
	},
	云龙真身 = {
		防御 = 80
	},
	海中蛟虬 = {
		法伤 = 40
	},
	风火妖王 = {
		法术暴击等级 = 40
	},
	盖世魔君 = {
		防御 = 80
	},
	平天大圣 = {
		法伤 = 40
	},
	清心羽客 = {
		速度 = 30
	},
	万兽之王 = {
		物理暴击等级 = 40
	},
	狂怒斗兽 = {
		伤害 = 40
	},
	嗜血狂魔 = {
		速度 = 30
	},
	万寿真仙 = {
		物理暴击等级 = 40
	},
	乾坤力士 = {
		伤害 = 40
	},
	杏林妙手 = {
		治疗能力 = 40
	},
	护法金刚 = {
		法防 = 80
	},
	无量尊者 = {
		法伤 = 40
	},
	落伽神女 = {
		伤害 = 40
	},
	莲台仙子 = {
		法防 = 80
	},
	五行咒师 = {
		速度 = 30
	},
	踏雷天尊 = {
		法伤 = 40
	},
	霹雳真君 = {
		伤害 = 40
	},
	镇妖神使 = {
		封印命中等级 = 40
	},
	花雨伊人 = {
		抵抗封印等级 = 80
	},
	妙舞佳人 = {
		伤害 = 40
	},
	绝代妖娆 = {
		封印命中等级 = 40
	},
	五雷正宗 = {
		法术暴击等级 = 40
	},
	伏魔天师 = {
		法伤 = 40
	},
	拘灵散修 = {
		速度 = 30
	},
	诛刑毒师 = {
		物理暴击等级 = 40
	},
	六道魍魉 = {
		伤害 = 40
	},
	勾魂阎罗 = {
		速度 = 30
	},
	百媚魔姝 = {
		抵抗封印等级 = 80
	},
	迷情妖姬 = {
		速度 = 30
	},
	风华舞圣 = {
		法防 = 80
	},
	九天武圣 = {
		伤害 = 40
	},
	风云战将 = {
		伤害 = 40
	},
	灵霄斗士 = {
		速度 = 30
	},
	妙谛金莲 = {
		法防 = 80
	},
	摄魂迷影 = {
		封印命中等级 = 40
	},
	幽冥巫煞 = {
		防御 = 80
	},
	巫影祭司 = {
		气血 = 280
	},
	通天法王 = {
		法伤 = 40
	},
	灵木药宗 = {
		抵抗封印等级 = 80
	},
	齐天武圣 = {
		伤害 = 40
	},
	通天行者 = {
		法伤 = 40
	},
	斗战真神 = {
		速度 = 30
	},
	铁火战魔 = {
		速度 = 30
	}
}
技能前置冷却 = {
	生杀予夺 = 4,
	钟馗论道 = 2,
	观照万象 = 0,
	绝命毒牙 = 4,
	幸运一击 = 2,
	天神怒斩 = 3,
	风卷残云 = 2,
	魔神之刃 = 2,
	绝处逢生 = 3,
	日月同辉 = 3,
	风云变色 = 2,
	秘传飞砂走石 = 2,
	风云再现 = 3,
	秘传三昧真火 = 2
}
技能冷却列表 = {
	披挂上阵 = 10,
	妙悟 = 2,
	同舟共济 = 4,
	摧枯拉朽 = 15,
	天命剑法 = 4,
	天神怒斩 = 10,
	观照万象 = 0,
	其疾如风 = 16,
	绝处逢生 = 10,
	亢龙归海 = 6,
	诸天看护 = 8,
	最佳搭档 = 8,
	罗汉悟道 = 8,
	妖风四起 = 4,
	烈焰真诀 = 8,
	魔焰滔天 = 6,
	飞花 = 8,
	煞气诀 = 5,
	噬毒 = 8,
	超级永恒 = 150,
	翩鸿一击 = 6,
	碎玉弄影 = 5,
	顺势而为 = 6,
	长驱直入 = 4,
	化瘀 = 8,
	天眼神通 = 8,
	牵魂蛛丝 = 8,
	秘传飞砂走石 = 8,
	真君显灵 = 8,
	风卷残云 = 6,
	魔神之刃 = 8,
	钟馗论道 = 8,
	幸运一击 = 15,
	魍魉追魂 = 4,
	无敌牛妖 = 999,
	碎甲经脉 = 6,
	判官令 = 0,
	雷浪穿云 = 10,
	凋零之歌 = 8,
	心韧 = 8,
	生杀予夺 = 32,
	相灭相生 = 8,
	不动如山 = 16,
	鸿渐于陆 = 4,
	其徐如林 = 16,
	风云再现 = 20,
	谆谆教诲 = 8,
	幻变 = 8,
	侵掠如火 = 16,
	画地为牢 = 5,
	偷龙转凤 = 8,
	绝命毒牙 = 10,
	清风望月 = 4,
	无敌牛虱 = 999,
	绝媚 = 8,
	五行制化 = 8,
	齐天神通 = 8,
	渡劫金身 = 4,
	风云变色 = 8,
	日月乾坤 = 0,
	飞符炼魂 = 5,
	日月同辉 = 12,
	秘传三昧真火 = 8
}
冷却技能减回合 = {
	"观照万象",
	"幸运一击",
	"超级永恒",
	"渡劫金身",
	"碎玉弄影",
	"摧枯拉朽",
	"披挂上阵",
	"天神怒斩",
	"风卷残云",
	"凋零之歌",
	"其疾如风",
	"其徐如林",
	"侵掠如火",
	"不动如山",
	"秘传三昧真火",
	"秘传飞砂走石",
	"风云变色",
	"同舟共济",
	"日月同辉",
	"雷浪穿云",
	"凋零之歌",
	"诸天看护",
	"妙悟",
	"相灭相生",
	"噬毒",
	"绝命毒牙",
	"牵魂蛛丝",
	"偷龙转凤",
	"绝处逢生",
	"煞气诀",
	"清风望月",
	"魔焰滔天",
	"亢龙归海",
	"天命剑法",
	"最佳搭档",
	"谆谆教诲",
	"罗汉悟道",
	"妖风四起",
	"烈焰真诀",
	"魔神之刃",
	"画地为牢",
	"鸿渐于陆",
	"钟馗论道",
	"顺势而为",
	"魍魉追魂",
	"生杀予夺",
	"风云再现",
	"天眼神通",
	"真君显灵",
	"翩鸿一击",
	"长驱直入",
	"扶摇万里",
	"顺势而为",
	"波澜不惊",
	"齐天神通",
	"魑魅缠身",
	"无敌牛妖",
	"无敌牛虱",
	"心韧",
	"化瘀",
	"飞花",
	"幻变",
	"碎甲经脉",
	"绝媚",
	"日月乾坤",
	"判官令",
	"五行制化",
	"飞符炼魂"
}
道具购买价格列表 = {}
道具出售价格列表 = {}
临时仙玉列表 = {}
召唤兽资质涉及成长 = false
群法最高数量 = 3
自动战斗不更新指令 = true
光武拓印仙玉 = 5000
倍率模式 = 0
管理账号列表 = {}
商城变身卡次数 = 20
助战升级技能是否消耗 = 0
一键附魔金钱 = 500
退出门派消耗银两 = 100
退出门派返还比例 = 70
初始召唤兽携带数量 = 10
最大召唤兽携带数量 = 50
初始坐骑携带数量 = 5
最大坐骑携带数量 = 50
初始助战携带数量 = 10
最大助战携带数量 = 30
整理间隔 = 5
传说遇变异几率 = 3
传说物品几率 = 5
道具行囊页数 = 5
宝图保底 = 3
通用特效上限 = 2
系统装备最多特效数 = 3
特效叠加概率限制 = 70
打造最大特效数量 = 5
修炼宝箱消耗 = 10
符石属性倍率 = 5
突破等级 = 99
化圣等级 = 165
转生等级 = 180
飞升开关 = true
抽奖点数 = 20
仓库价格 = 1000
补偿领取 = {}
补偿列表 = {
	银两 = 1000000,
	仙玉 = 500
}
补偿开关 = false
野外地图列表 = {
	1110,
	1173,
	1091,
	1514,
	1174,
	1114,
	1223,
	1041,
	1235,
	1042,
	1210,
	1201,
	1211,
	1218,
	1221,
	1203,
	1228,
	1207,
	2001,
	1233,
	1229,
	1231,
	1232,
	1920,
	2004,
	2007,
	1242,
	1258
}
新增活动类型 = {
	[1314.0] = 1,
	[100863.0] = 1,
	[100862.0] = 1,
	[100861.0] = 1,
	[1312.0] = 1,
	[15.0] = 1,
	[1313.0] = 1,
	[100864.0] = 1,
	[199.0] = 1
}
分灵系数 = {
	0.75,
	0.6,
	0.9,
	门派单法系数 = 1.8,
	群法系数 = 0.95,
	门派群法系数 = 1.1,
	单法系数 = 1.5
}
活动限制列表 = {
	突厥探子 = {
		等级 = 40,
		人数 = 3
	},
	突厥精英 = {
		等级 = 40,
		人数 = 3
	}
}
快捷对话模版 = {}
修炼宝箱加成个数 = 15

取修炼宝箱经验 = function()
	local gl = ygsj(1000)

	if gl <= 350 then
		return 20
	elseif gl <= 550 then
		return 50
	elseif gl <= 700 then
		return 80
	elseif gl <= 780 then
		return 120
	elseif gl <= 850 then
		return 150
	elseif gl <= 900 then
		return 180
	elseif gl <= 940 then
		return 200
	elseif gl <= 970 then
		return 240
	elseif gl <= 990 then
		return 260
	else
		return 300
	end
end

泡泡相伴是否触发嗜血追击 = false
特殊兽决重随数量 = 3
烹饪列表 = {
	翡翠豆腐 = 1,
	珍露酒 = 1,
	蛇胆酒 = 1,
	桂花丸 = 1,
	醉生梦死 = 1,
	佛跳墙 = 1,
	百味酒 = 1,
	长寿面 = 1,
	豆斋果 = 1,
	烤肉 = 1,
	臭豆腐 = 1,
	梅花酒 = 1,
	烤鸭 = 1
}
当前抽奖类型 = {}
任务标识列表 = {}
上交物品位置 = {}
经验倍数银两生效 = 0
获取道具模式 = {}
助战附魔 = false
打工报酬 = 10000
师门门贡 = 3
金银锦盒帮贡 = 10
金银锦盒资金 = 10000
青龙玄武帮贡 = 30
跑商帮贡奖励 = 500
跑商是否限制飞行 = false
跑商最大金额 = 9999999
跑商模式 = 0
副本名称 = {}
副本传送坐标 = {
	天蓬娶亲 = {
		34470,
		287,
		33
	},
	白龙闹海 = {
		34471,
		38,
		9
	},
	黑风山 = {
		34480,
		70,
		76
	}
}
副本序言 = {
	天蓬娶亲 = "#Y【平行世界的故事】#W话说那天蓬元帅的转世在高老庄附近悠悠哉哉的当起了山大王，将嫦娥与取经的事全部抛之脑后，欺男霸女，横行乡里。就在天蓬转世准备强行迎娶高老庄的小姐这天，我们的英雄来到了高老庄……",
	黑风山 = [[
#W一队朋友真开心，整日在梦幻中游山玩水。
这天一行五人在大唐国境游玩时，偶尔听到小二正在讲当地的趣事：
“话说那镇山太保刘伯钦，怒喝一声，手举钢叉刺向恶虎。但见怒气纷纷，狂风滚滚，人虎斗做一团，只吓得白面和尚缩在草堆瑟瑟发抖.......”
“刘猎户将那玄奘法师救了回去，好生款待。今晚要在刘宅办灵堂，为刘父的亡魂超度。”

不难猜到，那和尚正是来到国境的玄装，大伙决定去看看热闹……]],
	白龙闹海 = "#Y【平行世界的故事】#W话说这小白龙本应被囚鹰愁涧，如今却在东海龙宫与万圣公主重归于好，英雄们深感其中蹊跷，历经几番周折终于使得小白龙恢复记忆。恢复了记忆的小白龙立刻要赶去找万圣公主与九头虫算账，几位英雄应邀随小白龙一同前去……"
}
门派师傅 = {
	"程咬金",
	"巫奎虎",
	"菩提祖师",
	"空度禅师",
	"孙婆婆",
	"李靖",
	"观音姐姐",
	"镇元大仙",
	"二郎神",
	"东海龙王",
	"牛魔王",
	"大大王",
	"白晶晶",
	"地涌夫人",
	"地藏王",
	"刑天",
	"齐天大圣"
}
门派师傅1 = {
	白晶晶 = 13,
	程咬金 = 1,
	李靖 = 6,
	菩提祖师 = 3,
	观音姐姐 = 7,
	二郎神 = 9,
	东海龙王 = 10,
	镇元大仙 = 8,
	地藏王 = 15,
	大大王 = 12,
	齐天大圣 = 17,
	牛魔王 = 11,
	地涌夫人 = 14,
	空度禅师 = 4,
	巫奎虎 = 2,
	刑天 = 16,
	孙婆婆 = 5
}
门派名称 = {
	"大唐官府",
	"神木林",
	"方寸山",
	"化生寺",
	"女儿村",
	"天宫",
	"普陀山",
	"五庄观",
	"凌波城",
	"龙宫",
	"魔王寨",
	"狮驼岭",
	"盘丝洞",
	"无底洞",
	"阴曹地府",
	"九黎城",
	"花果山"
}
门派名称1 = {
	盘丝洞 = 13,
	阴曹地府 = 15,
	方寸山 = 3,
	花果山 = 17,
	天宫 = 6,
	无底洞 = 14,
	大唐官府 = 1,
	五庄观 = 8,
	龙宫 = 10,
	普陀山 = 7,
	女儿村 = 5,
	凌波城 = 9,
	九黎城 = 16,
	魔王寨 = 11,
	狮驼岭 = 12,
	化生寺 = 4,
	神木林 = 2
}
物理门派 = {
	"大唐官府",
	"天宫",
	"五庄观",
	"凌波城",
	"狮驼岭"
}
法术门派 = {
	"龙宫",
	"魔王寨"
}
孩子技能书数量 = 2
属性石数量 = 10
中秋炮数量 = 10
资质丸数量 = 50
大力神丸数量 = 50
资质上限 = {
	速度资质 = 1800,
	躲闪资质 = 2000,
	体力资质 = 6850,
	法力资质 = 4500,
	攻击资质 = 1800,
	防御资质 = 1800,
	成长 = 1.5
}
神兽资质上限 = {
	速度资质 = 2000,
	躲闪资质 = 2500,
	体力资质 = 7600,
	法力资质 = 5000,
	攻击资质 = 2000,
	防御资质 = 2000,
	成长 = 1.65
}
法宝最大携带数量 = 4
场景法宝灵气增加数 = 2
法宝列表 = {
	{
		"定风珠",
		"雷兽",
		"迷魂灯",
		"幽灵珠",
		"缚妖索",
		"碧玉葫芦",
		"五色旗盒",
		"飞剑",
		"拭剑石",
		"金甲仙衣",
		"惊魂铃",
		"嗜血幡",
		"风袋",
		"九黎战鼓",
		"盘龙壁",
		"神行飞剑",
		"汇灵盏",
		"天师符",
		"织女扇",
		"清心咒"
	},
	{
		"发瘟匣",
		"五彩娃娃",
		"金刚杵",
		"兽王令",
		"摄魂",
		"附灵玉",
		"降魔斗篷",
		"捆仙绳",
		"罗汉珠",
		"番天印",
		"断线木偶",
		"赤焰",
		"天煞",
		"宝烛",
		"分水",
		"七杀",
		"神木宝鼎",
		"铸兵锤",
		"驱风宝诰",
		"止风神剑",
		"琉璃灯"
	},
	{
		"失心钹",
		"五火神焰印",
		"九幽",
		"普渡",
		"月光宝盒",
		"混元伞",
		"苍白纸人",
		"无魂傀儡",
		"聚宝盆",
		"通灵宝玉",
		"乾坤玄火塔",
		"无尘扇",
		"干将莫邪",
		"慈悲",
		"救命毫毛",
		"伏魔天书",
		"镇海珠",
		"奇门五行令",
		"月影",
		"鬼泣",
		"七宝玲珑灯",
		"驭魔笼",
		"斩魔",
		"金蟾",
		"金箍棒"
	},
	{
		"流影云笛",
		"宿幕星河",
		"蟠龙玉璧",
		"落星飞鸿",
		"归元圣印",
		"千斗金樽",
		"狂飙天爪",
		"澄空净铃",
		"初诞春芽",
		"九霄灵息",
		"万古坚冰",
		"重明战鼓",
		"梦云幻甲",
		"河图洛书",
		"炽焰丹珠",
		"翡翠芝兰",
		"太虚玉液",
		"九梵清莲",
		"苍灵雪羽",
		"烽火狼烟",
		"舞雪冰蝶",
		"紫火如意",
		"凌波仙符",
		"软烟罗锦",
		"谷玄星盘",
		"北冥巨鳞",
		"血魄元幡",
		"翠碧玉箫",
		"冷龙石磐",
		"琉璃云罩",
		"璞玉灵钵"
	}
}
阵法名称 = {
	"普通",
	"风扬阵",
	"虎翼阵",
	"天覆阵",
	"云垂阵",
	"鸟翔阵",
	"地载阵",
	"龙飞阵",
	"蛇蟠阵",
	"鹰啸阵",
	"雷绝阵"
}
奖励名称 = {}
奖励次数 = {}
打造技能高于等级 = 0
通用坐骑 = {
	"宝贝葫芦",
	"神气小龟"
}
强化石列表 = {
	"青龙石",
	"朱雀石",
	"玄武石",
	"白虎石"
}
强化石列表1 = {
	玄武石 = 1,
	朱雀石 = 1,
	白虎石 = 1,
	青龙石 = 1
}
五宝列表 = {
	"金刚石",
	"夜光珠",
	"定魂珠",
	"避水珠",
	"龙鳞"
}
五宝列表1 = {
	定魂珠 = 1,
	龙鳞 = 1,
	夜光珠 = 1,
	避水珠 = 1,
	金刚石 = 1
}
中秋列表 = {
	"中",
	"秋",
	"节",
	"快",
	"乐"
}
中秋列表1 = {
	中 = 1,
	秋 = 1,
	节 = 1,
	快 = 1,
	乐 = 1
}
一级药列表 = {
	"鬼切草",
	"旋复花",
	"龙须草",
	"灵脂",
	"七叶莲",
	"百色花",
	"紫丹罗",
	"天青地白",
	"白玉骨头",
	"曼陀罗花",
	"佛手",
	"香叶",
	"草果",
	"九香虫",
	"水黄莲",
	"山药",
	"八角莲叶",
	"人参",
	"四叶花"
}
一级药列表1 = {
	曼陀罗花 = 1,
	七叶莲 = 1,
	水黄莲 = 1,
	天青地白 = 1,
	龙须草 = 1,
	九香虫 = 1,
	鬼切草 = 1,
	人参 = 1,
	紫丹罗 = 1,
	旋复花 = 1,
	四叶花 = 1,
	白玉骨头 = 1,
	灵脂 = 1,
	山药 = 1,
	百色花 = 1,
	香叶 = 1,
	八角莲叶 = 1,
	草果 = 1,
	佛手 = 1
}
二级药列表 = {
	"六道轮回",
	"天不老",
	"紫石英",
	"血色茶花",
	"熊胆",
	"凤凰尾",
	"天龙水",
	"地狱灵芝",
	"餐风饮露",
	"白露为霜",
	"硫磺草",
	"龙之心屑",
	"月星子",
	"丁香水",
	"麝香",
	"血珊瑚",
	"火凤之睛",
	"孔雀红",
	"鹿茸",
	"仙狐涎"
}
二级药列表1 = {
	龙之心屑 = 1,
	熊胆 = 1,
	血色茶花 = 1,
	凤凰尾 = 1,
	地狱灵芝 = 1,
	丁香水 = 1,
	火凤之睛 = 1,
	麝香 = 1,
	孔雀红 = 1,
	月星子 = 1,
	仙狐涎 = 1,
	天不老 = 1,
	紫石英 = 1,
	餐风饮露 = 1,
	天龙水 = 1,
	六道轮回 = 1,
	白露为霜 = 1,
	鹿茸 = 1,
	血珊瑚 = 1,
	硫磺草 = 1
}
三级药列表 = {
	"金创药",
	"小还丹",
	"千年保心丹",
	"金香玉",
	"风水混元丹",
	"蛇蝎美人",
	"定神香",
	"佛光舍利子",
	"九转回魂丹",
	"五龙丹",
	"十香返生丸"
}
三级药列表1 = {
	九转回魂丹 = 1,
	金创药 = 1,
	千年保心丹 = 1,
	十香返生丸 = 1,
	小还丹 = 1,
	定神香 = 1,
	五龙丹 = 1,
	佛光舍利子 = 1,
	金香玉 = 1,
	蛇蝎美人 = 1,
	风水混元丹 = 1
}
加血三药 = {
	"小还丹",
	"千年保心丹",
	"金香玉",
	"佛光舍利子",
	"九转回魂丹",
	"五龙丹"
}
加血三药1 = {
	千年保心丹 = 1,
	五龙丹 = 1,
	佛光舍利子 = 1,
	金香玉 = 1,
	小还丹 = 1,
	九转回魂丹 = 1
}
加蓝三药 = {
	"风水混元丹",
	"蛇蝎美人",
	"定神香",
	"十香返生丸"
}
加蓝三药1 = {
	定神香 = 1,
	蛇蝎美人 = 1,
	十香返生丸 = 1,
	风水混元丹 = 1
}
六艺技能列表 = {
	"赴汤蹈火",
	"千锤百炼",
	"开门见山",
	"张弛有道",
	"峰回路转",
	"四面埋伏",
	"仙人指路"
}
孩子书列表 = {
	黄帝内经 = 3,
	还魂秘术 = 1,
	蚩尤武诀 = 2,
	六艺修行书 = 4
}
孩子书籍列表 = {
	"还魂秘术",
	"蚩尤武诀",
	"黄帝内经"
}
孩子书技能 = {
	"还魂咒",
	"蚩尤之搏",
	"治疗"
}
坐骑转换 = 0
坐骑转换模型 = {
	"黄金狮子",
	"蓝色狐狸",
	"七彩祥云",
	"粉红火鸡",
	"彩虹毛驴",
	"粉嫩小猪",
	"水晶芭蕉",
	"深海狂鲨",
	"雷霆黑豹",
	"炫彩灵鹿",
	"福气珍牛",
	"神奇狐狸",
	"晶角仙羊",
	"宝贝葫芦·蓝",
	"巨角黑羊",
	"九尾妖狐",
	"砖石小马",
	"吾皇",
	"神奇狐狸",
	"神奇霜狼",
	"神奇鲸鱼",
	"神奇坐狮",
	"神奇飞镜",
	"神奇泳鸭",
	"麒麟",
	"水嘟嘟",
	"四不相",
	"非你莫鼠",
	"吞云腾蛇",
	"浑火魔精",
	"黄金狮子",
	"蓝色狐狸",
	"七彩祥云",
	"粉红火鸡",
	"彩虹毛驴",
	"粉嫩小猪",
	"水晶芭蕉",
	"深海狂鲨",
	"雷霆黑豹",
	"炫彩灵鹿",
	"福气珍牛",
	"神奇狐狸",
	"晶角仙羊",
	"宝贝葫芦·蓝",
	"巨角黑羊",
	"九尾妖狐"
}
坐骑转换模型1 = {
	"砖石小马",
	"神奇刺猬",
	"神奇狐狸",
	"神奇霜狼",
	"神奇鲸鱼",
	"神奇坐狮",
	"神奇飞镜",
	"神奇泳鸭",
	"福气珍牛",
	"吾皇",
	"麒麟",
	"水嘟嘟",
	"四不相",
	"非你莫鼠",
	"吞云腾蛇",
	"浑火魔精"
}
特殊坐骑列表 = {
	百变坐骑 = 1,
	神行百变 = 1
}
可选坐骑列表 = {
	水晶芭蕉 = 1,
	炫彩灵鹿 = 1,
	["宝贝葫芦·蓝"] = 1,
	彩虹毛驴 = 1,
	砖石小马 = 1,
	七彩祥云 = 1,
	吾皇 = 1,
	粉嫩小猪 = 1,
	神奇泳鸭 = 1,
	蓝色狐狸 = 1,
	神奇刺猬 = 1,
	巨角黑羊 = 1,
	百变坐骑 = 1,
	浑火魔精 = 1,
	深海狂鲨 = 1,
	神奇鲸鱼 = 1,
	神奇坐狮 = 1,
	九尾妖狐 = 1,
	麒麟 = 1,
	水嘟嘟 = 1,
	四不相 = 1,
	神奇霜狼 = 1,
	非你莫鼠 = 1,
	福气珍牛 = 1,
	粉红火鸡 = 1,
	吞云腾蛇 = 1,
	神奇飞镜 = 1,
	晶角仙羊 = 1,
	神奇狐狸 = 1,
	黄金狮子 = 1,
	神行百变 = 1,
	雷霆黑豹 = 1
}
可更改造型 = {
	"超级腾蛇",
	"超级赤焰兽",
	"超级神鸡",
	"超级人参娃娃",
	"超级土地公公",
	"超级筋斗云",
	"超级大鹏",
	"超级麒麟",
	"超级孔雀",
	"超级灵狐",
	"超级大熊猫",
	"超级神马",
	"超级六耳猕猴",
	"超级神龙",
	"超级大象",
	"超级金猴",
	"超级泡泡",
	"超级神羊",
	"超级神虎",
	"超级青鸾",
	"超级赤焰兽",
	"超级白泽",
	"超级神蛇",
	"超级海豚",
	"超级神兔",
	"超级灵鹿",
	"超级神牛",
	"超级神猴",
	"超级腾蛇",
	"超级玉兔",
	"超级神狗",
	"超级神鼠",
	"超级神猪",
	"超级小白龙",
	"超级猪小戒",
	"二大王",
	"红孩儿",
	"春十三娘",
	"白骨精",
	"广目天王",
	"新猪八戒",
	"紫霞",
	"新孙悟空",
	"飞天",
	"谛听",
	"狐不归",
	"花铃",
	"涂山雪",
	"月魅",
	"云游火",
	"鲲鹏",
	"老夫子",
	"琴瑟仙女",
	"逍遥神牛",
	"龙仙",
	"龙鲤",
	"涂山瞳",
	"武罗仙子",
	"月影仙",
	"暗黑龙",
	"剑灵双子",
	"太极捶童子",
	"暗雷豹",
	"黑灵猫",
	"红衣战锤使",
	"美猴王",
	"火熔石",
	"三尾火狐",
	"骏天马",
	"鲛人鱼",
	"狗头人",
	"巨灵狼",
	"黑翼弓使",
	"无名上仙",
	"光辉女神",
	"四翼上仙",
	"大象精",
	"四臂魔神",
	"老鹰精",
	"氪金大佬",
	"超级三眼娃",
	"太极真君",
	"托塔娃",
	"巨斧猛男",
	"齐天大圣",
	"酷炫佬",
	"酷炫老逼登",
	"风火轮器灵",
	"蚩尤武魂",
	"神武风伯",
	"幽灵虎",
	"龙虾骑士",
	"战神罗成",
	"死亡骑士",
	"贪狼",
	"仙兽翼龙",
	"小肥羊",
	"神兽小龙人",
	"神兽雪精灵",
	"月影兔",
	"神兽时光叽",
	"玄武",
	"金钱龟",
	"金麟鹿",
	"吉祥",
	"嵩鼠",
	"龙须豹",
	"熊猫大侠",
	"白无常",
	"拽王",
	"神兽百灵羊",
	"齐天小圣",
	"萌狗",
	"小红孩儿",
	"月仙",
	"狮仙",
	"剑仙",
	"判官",
	"龙羽",
	"罗汉",
	"龙王",
	"天师",
	"战将",
	"狂狮",
	"佛子",
	"葫仙",
	"法僧",
	"金衣仙",
	"龙剑士",
	"龙剑女",
	"水龙",
	"画仙",
	"天帝",
	"镇元",
	"鬼君",
	"鹿君",
	"火女",
	"福禄仙",
	"天后",
	"太极老君",
	"天兵统领",
	"阎王爷",
	"赵云",
	"紫霞仙子",
	"阿朱",
	"白子画",
	"貂蝉",
	"凤九",
	"关羽",
	"Q版魔化毗舍童子",
	"花无缺",
	"剑圣",
	"巨灵神",
	"李蓉蓉",
	"雷龙",
	"怜星",
	"光明战神",
	"执音",
	"洛神",
	"赤炎战神",
	"神僧",
	"青霞仙子",
	"火龙骑士",
	"杀阡陌",
	"通臂猿猴",
	"白龙骑士",
	"尉迟恭",
	"蓝人龙",
	"邀月",
	"太极神君",
	"赵敏",
	"大蛇丸",
	"干柿鬼鲛",
	"佩恩",
	"李洛克",
	"小南",
	"春野樱",
	"宇智波带土",
	"宇智波鼬",
	"宇智波佐助",
	"女仙",
	"斧魂",
	"剑魂",
	"枪魂",
	"魔化毗舍童子",
	"暗黑谛听",
	"暗黑毗舍童子",
	"黑白狂豹人形",
	"妙华天女",
	"月皇",
	"巨石守卫(昼)",
	"日游神",
	"鬼妃",
	"无常鬼差(白)",
	"无常鬼差(黑)",
	"玄珠灵仙",
	"夜游神",
	"月灵",
	"独角鬼王",
	"琴鹤",
	"晶怪",
	"魂女猫",
	"金凤凰",
	"砍刀猴",
	"金长毛猪",
	"蓝衣剑魂",
	"鸟妖仙",
	"龙魂仙女",
	"黑悟空",
	"孙行者",
	"白衣剑客",
	"猫女",
	"莲女",
	"绿衣女神",
	"五彩神女",
	"红衣仙女",
	"葫芦小金刚",
	"路飞",
	"六道带土",
	"大筒木辉夜",
	"鼬",
	"佐助",
	"小佐助",
	"旗木卡卡西",
	"鸣人",
	"小鸣人",
	"带土",
	"我爱罗",
	"六道斑"
}
神兽列表 = {
	"超级神龙",
	"超级孔雀",
	"超级灵狐",
	"超级麒麟",
	"超级大鹏",
	"超级赤焰兽",
	"超级白泽",
	"超级灵鹿",
	"超级大象",
	"超级金猴",
	"超级大熊猫",
	"超级泡泡",
	"超级神兔",
	"超级神虎",
	"超级神牛",
	"超级海豚",
	"超级人参娃娃",
	"超级青鸾",
	"超级腾蛇",
	"超级六耳猕猴",
	"超级神羊",
	"超级土地公公",
	"超级神猴",
	"超级玉兔",
	"超级神鸡",
	"超级筋斗云",
	"超级神蛇",
	"超级神鼠",
	"超级小白龙",
	"超级猪小戒",
	"鲲鹏",
	"神兽小龙人",
	"神兽雪精灵",
	"仙兽翼龙",
	"神兽时光叽",
	"神兽百灵羊",
	"神兽孙小圣",
	"兔乖乖",
	"齐天小圣",
	"壬寅神虎",
	"超级红孩儿",
	"超级飞廉",
	"辛丑神牛",
	"超级离火兽",
	"癸卯神兔",
	"逍遥神牛",
	"超级神柚",
	"超级有熊",
	"甲辰神龙",
	"食铁兽"
}
神兽列表1 = {
	超级土地公公 = 1,
	超级神羊 = 1,
	超级赤焰兽 = 1,
	超级大象 = 1,
	超级白泽 = 1,
	超级神猴 = 1,
	逍遥神牛 = 1,
	超级泡泡 = 1,
	超级神蛇 = 1,
	超级神鸡 = 1,
	超级红孩儿 = 1,
	神兽小龙人 = 1,
	兔乖乖 = 1,
	超级神牛 = 1,
	齐天小圣 = 1,
	超级金猴 = 1,
	神兽孙小圣 = 1,
	超级小白龙 = 1,
	超级玉兔 = 1,
	辛丑神牛 = 1,
	超级大熊猫 = 1,
	超级神虎 = 1,
	仙兽翼龙 = 1,
	超级离火兽 = 1,
	癸卯神兔 = 1,
	超级大鹏 = 1,
	超级孔雀 = 1,
	超级神兔 = 1,
	神兽时光叽 = 1,
	超级飞廉 = 1,
	超级猪小戒 = 1,
	超级神柚 = 1,
	神兽百灵羊 = 1,
	食铁兽 = 1,
	超级筋斗云 = 1,
	超级腾蛇 = 1,
	超级有熊 = 1,
	壬寅神虎 = 1,
	超级神鼠 = 1,
	鲲鹏 = 1,
	神兽雪精灵 = 1,
	超级神龙 = 1,
	超级海豚 = 1,
	超级青鸾 = 1,
	超级灵狐 = 1,
	甲辰神龙 = 1,
	超级麒麟 = 1,
	超级人参娃娃 = 1,
	超级灵鹿 = 1,
	超级六耳猕猴 = 1
}
不耗蓝法术 = {
	魔息术 = 1,
	移魂化骨 = 1,
	乾坤妙法 = 1,
	炼气化神 = 1,
	剑荡四方 = 1,
	横扫千军 = 1,
	背水 = 1,
	三花聚顶 = 1,
	镇魂诀 = 1,
	乾天罡气 = 1,
	破釜沉舟 = 1,
	移星换斗 = 1,
	后发制人 = 1
}
法术认证列表 = {
	剑荡四方 = 1,
	扶摇万里 = 1,
	力劈华山 = 1,
	超级壁垒击破 = 1,
	食指大动 = 1,
	饕餮盛宴 = 1,
	灵能激发 = 1,
	翻江倒海 = 1,
	死亡召唤 = 1,
	地狱烈火 = 1,
	荒古破击 = 1,
	超级泰山压顶 = 1,
	壁垒击破 = 1,
	上古灵符 = 1,
	双星闪 = 1,
	蚩尤之搏 = 1,
	叱咤风云 = 1,
	超级三昧真火 = 1,
	八凶法阵 = 1,
	泰山压顶 = 1,
	迅风出击 = 1,
	剑气四射 = 1,
	惊心一剑 = 1,
	夜舞倾城 = 1,
	["剑气四射·觉醒"] = 1,
	超级地狱烈火 = 1,
	天降灵葫 = 1,
	落岩 = 1,
	刀背打 = 1,
	舍身一搏 = 1,
	水击三千 = 1,
	雷击 = 1,
	["饕餮盛宴·觉醒"] = 1,
	治疗 = 1,
	超级水漫金山 = 1,
	奔雷咒 = 1,
	水攻 = 1,
	水漫金山 = 1,
	月光 = 1,
	雨润丰泽 = 1,
	还魂咒 = 1,
	烈火 = 1,
	善恶有报 = 1,
	超级奔雷咒 = 1,
	流沙轻音 = 1
}
追加法术技能表 = {
	剑荡四方 = 10,
	扶摇万里 = 15,
	超级泰山压顶 = 15,
	超级壁垒击破 = 10,
	食指大动 = 15,
	死亡召唤 = 10,
	月光 = 15,
	上古灵符 = 15,
	力劈华山 = 10,
	地狱烈火 = 20,
	荒古破击 = 10,
	["剑气四射·觉醒"] = 10,
	壁垒击破 = 10,
	叱咤风云 = 15,
	双星闪 = 10,
	蚩尤之搏 = 10,
	超级三昧真火 = 15,
	迅风出击 = 10,
	八凶法阵 = 15,
	泰山压顶 = 20,
	剑气四射 = 10,
	惊心一剑 = 10,
	夜舞倾城 = 10,
	饕餮盛宴 = 10,
	超级地狱烈火 = 15,
	天降灵葫 = 15,
	落岩 = 20,
	刀背打 = 10,
	舍身一搏 = 10,
	水击三千 = 10,
	雷击 = 20,
	["饕餮盛宴·觉醒"] = 10,
	超级水漫金山 = 15,
	奔雷咒 = 20,
	水攻 = 20,
	水漫金山 = 20,
	翻江倒海 = 15,
	烈火 = 20,
	善恶有报 = 10,
	超级奔雷咒 = 15,
	流沙轻音 = 15
}
通用特技 = {
	"修罗咒",
	"天衣无缝",
	"气疗术",
	"心疗术",
	"命疗术",
	"凝气诀",
	"凝神诀",
	"气归术",
	"命归术",
	"四海升平",
	"回魂咒",
	"起死回生",
	"水清诀",
	"冰清诀",
	"玉清诀",
	"晶清诀",
	"弱点击破",
	"冥王爆杀",
	"放下屠刀",
	"河东狮吼",
	"碎甲术",
	"破甲术",
	"破血狂攻",
	"罗汉金钟",
	"慈航普渡",
	"太极护法",
	"光辉之甲",
	"圣灵之甲",
	"野兽之力",
	"魔兽之印",
	"流云诀",
	"啸风诀",
	"笑里藏刀",
	"绝幻魔音",
	"凝滞术",
	"停陷术",
	"破碎无双",
	"琴音三叠",
	"金刚怒目",
	"菩提心佑"
}
通用特技1 = {
	菩提心佑 = 1,
	冰清诀 = 1,
	光辉之甲 = 1,
	冥王爆杀 = 1,
	命归术 = 1,
	气疗术 = 1,
	河东狮吼 = 1,
	水清诀 = 1,
	四海升平 = 1,
	野兽之力 = 1,
	破碎无双 = 1,
	凝气诀 = 1,
	金刚怒目 = 1,
	凝滞术 = 1,
	魔兽之印 = 1,
	破甲术 = 1,
	碎甲术 = 1,
	慈航普渡 = 1,
	停陷术 = 1,
	命疗术 = 1,
	修罗咒 = 1,
	笑里藏刀 = 1,
	天衣无缝 = 1,
	玉清诀 = 1,
	心疗术 = 1,
	晶清诀 = 1,
	弱点击破 = 1,
	回魂咒 = 1,
	啸风诀 = 1,
	琴音三叠 = 1,
	放下屠刀 = 1,
	气归术 = 1,
	罗汉金钟 = 1,
	凝神诀 = 1,
	起死回生 = 1,
	太极护法 = 1,
	圣灵之甲 = 1,
	破血狂攻 = 1,
	流云诀 = 1,
	绝幻魔音 = 1
}
全部特效 = {
	"无级别限制",
	"神佑",
	"必中",
	"神农",
	"简易",
	"超级简易",
	"绝杀",
	"专注",
	"精致",
	"再生",
	"永不磨损",
	"会心",
	"猛击",
	"神速",
	"抗封",
	"聚怒",
	"物理防护",
	"法术防护",
	"指挥",
	"吸血",
	"封印",
	"法连",
	"物理穿透",
	"法术穿透"
}
全部特效1 = {
	猛击 = 1,
	无级别限制 = 1,
	神速 = 1,
	必中 = 1,
	神农 = 1,
	法术防护 = 1,
	专注 = 1,
	精致 = 1,
	永不磨损 = 1,
	简易 = 1,
	吸血 = 1,
	封印 = 1,
	绝杀 = 1,
	法连 = 1,
	聚怒 = 1,
	神佑 = 1,
	物理穿透 = 1,
	法术穿透 = 1,
	祝福 = 1,
	超级简易 = 1,
	再生 = 1,
	抗封 = 1,
	会心 = 1,
	物理防护 = 1,
	指挥 = 1
}
矛盾特效 = {
	超级简易 = 2,
	简易 = 1,
	无级别限制 = 3
}
通用特效 = {
	"无级别限制",
	"神佑",
	"必中",
	"神农",
	"简易",
	"超级简易",
	"绝杀",
	"专注",
	"精致",
	"再生",
	"永不磨损"
}
通用特效1 = {
	必中 = 1,
	再生 = 1,
	无级别限制 = 1,
	愤怒 = 1,
	神农 = 1,
	超级简易 = 1,
	专注 = 1,
	精致 = 1,
	永不磨损 = 1,
	简易 = 1,
	超级暴怒 = 1,
	暴怒 = 1,
	绝杀 = 1,
	超级愤怒 = 1,
	神佑 = 1
}
通用新特效 = {
	"会心",
	"猛击",
	"神速",
	"抗封",
	"聚怒",
	"物理防护",
	"法术防护",
	"指挥",
	"吸血",
	"封印",
	"法连",
	"物理穿透",
	"法术穿透"
}
通用新特效1 = {
	猛击 = 30,
	物理防护 = 10,
	神速 = 5,
	法术穿透 = 10,
	法连 = 15,
	物理穿透 = 10,
	吸血 = 0.05,
	法术防护 = 10,
	抗封 = 8,
	封印 = 8,
	会心 = 10,
	聚怒 = 40,
	指挥 = 10
}
新特效叠加 = {
	猛击 = 1,
	物理防护 = 4,
	神速 = 1,
	法术穿透 = 1,
	法连 = 1,
	物理穿透 = 1,
	吸血 = 1,
	法术防护 = 4,
	抗封 = 1,
	封印 = 1,
	会心 = 1,
	聚怒 = 1,
	指挥 = 1
}
愤怒效果 = 0.8
暴怒效果 = 0.25
超级暴怒效果 = 1
超级愤怒效果 = 0.4
百炼词条高数值 = false
百炼词条叠加 = false
百炼词条 = {
	"治愈",
	"固伤",
	"削金",
	"断玉",
	"固防",
	"金汤",
	"铁骨",
	"御气",
	"厚德",
	"纳敏",
	"淬力",
	"聚灵",
	"益气",
	"开碑",
	"破空",
	"急速",
	"固本",
	"天命之子"
}
百炼1 = {
	厚德 = 9,
	益气 = 13,
	金汤 = 6,
	淬力 = 11,
	铁骨 = 7,
	纳敏 = 10,
	断玉 = 4,
	急速 = 16,
	治愈 = 1,
	聚灵 = 12,
	御气 = 8,
	开碑 = 14,
	固本 = 17,
	削金 = 3,
	固防 = 5,
	固伤 = 2,
	破空 = 15,
	培元 = 18,
	天命之子 = 19
}
百炼2 = {
	"治疗能力",
	"固定伤害",
	"伤害",
	"物伤加成",
	"防御",
	"法防",
	"物理减少",
	"法术减少",
	"体质",
	"敏捷",
	"力量",
	"魔力",
	"耐力",
	"法伤",
	"法伤加成",
	"速度",
	"气血",
	"魔法",
	"基础属性"
}
百炼3 = {
	体质 = 1,
	力量 = 3,
	敏捷 = 5,
	耐力 = 4,
	魔力 = 2
}
百炼4 = {
	"伤害",
	"防御",
	"法伤",
	"法防",
	"速度",
	"气血",
	"魔法",
	"基础属性"
}
五维列表 = {
	"力量",
	"魔力",
	"体质",
	"敏捷",
	"耐力"
}
五维列表1 = {
	体质 = 1,
	力量 = 1,
	敏捷 = 1,
	耐力 = 1,
	魔力 = 1
}
附魔属性列表 = {
	"伤害",
	"力量",
	"命中",
	"体质",
	"速度",
	"耐力",
	"愤怒",
	"防御",
	"魔力",
	"气血",
	"魔法",
	"法防",
	"法伤",
	"躲避",
	"治疗能力",
	"固定伤害",
	"物理伤害结果",
	"法术伤害结果",
	"气血回复效果",
	"封印命中等级",
	"抵抗封印等级"
}
附魔技能列表 = {
	嗜血 = {
		"体质",
		0.1,
		0.2,
		2
	},
	一气化三清 = {
		"魔力",
		0.1,
		0.2,
		4
	},
	尸气漫天 = {
		"耐力",
		0.1,
		0.2,
		1
	},
	担山赶月 = {
		"力量",
		0.1,
		0.2,
		2
	},
	拈花妙指 = {
		"速度",
		0.15,
		0.3,
		6
	},
	元阳护体 = {
		"气血回复效果",
		0.15,
		0.3,
		3
	},
	神木呓语 = {
		"法术伤害结果",
		0.15,
		0.3,
		6
	},
	穿云破空 = {
		"物理伤害结果",
		0.15,
		0.3,
		5
	},
	神力无穷 = {
		"愤怒",
		0.16,
		0.32,
		5
	},
	浩然正气 = {
		"法防",
		0.2,
		0.4,
		4
	},
	莲华妙法 = {
		"法伤",
		0.2,
		0.4,
		2
	},
	神兵护法 = {
		"命中",
		0.45,
		0.9,
		1
	},
	龙附 = {
		"伤害",
		0.5,
		1,
		3
	},
	盘丝舞 = {
		"防御",
		0.5,
		1,
		3
	},
	魔王护持 = {
		"气血",
		1,
		2,
		3
	},
	轻如鸿毛 = {
		"魔法",
		1,
		2,
		3
	}
}
装备基础属性列表 = {
	"气血",
	"魔法",
	"命中",
	"伤害",
	"灵力",
	"防御",
	"速度",
	"躲避",
	"力量",
	"体质",
	"耐力",
	"魔力",
	"敏捷",
	"法防",
	"法伤",
	"治疗能力",
	"固定伤害",
	"气血回复效果"
}
角色辅助技能列表 = {
	"强身术",
	"强壮",
	"冥想",
	"神速",
	"暗器技巧",
	"打造技巧",
	"裁缝技巧",
	"炼金术",
	"养生之道",
	"健身术",
	"中药医理",
	"烹饪技巧",
	"巧匠之术"
}
助战辅助技能 = {
	"冥想",
	"暗器技巧",
	"强壮",
	"强身术",
	"神速",
	"气血上限",
	"魔法上限",
	"伤害",
	"法伤",
	"固定伤害",
	"物理防御",
	"法防",
	"治疗能力",
	"封印命中等级",
	"抵抗封印等级"
}
助战辅助技能数量 = 5
强壮神速最高等级 = 40
强化技能开关 = true
角色强化技能列表 = {
	"强化气血上限",
	"强化魔法上限",
	"强化伤害",
	"强化法伤",
	"强化物理防御",
	"强化法防",
	"强化固定伤害",
	"强化封印命中等级",
	"强化抵抗封印等级",
	"强化治疗能力"
}
角色强化技能列表1 = {
	强化抵抗封印等级 = 9,
	强化固定伤害 = 7,
	强化法防 = 6,
	强化法伤 = 4,
	强化气血上限 = 1,
	强化治疗能力 = 10,
	强化封印命中等级 = 8,
	强化魔法上限 = 2,
	强化物理防御 = 5,
	强化伤害 = 3
}
角色强化技能列表2 = {
	强化抵抗封印等级 = 1,
	强化固定伤害 = 2,
	强化法防 = 1.5,
	强化法伤 = 1.5,
	强化气血上限 = 15,
	强化治疗能力 = 1,
	强化封印命中等级 = 1,
	强化魔法上限 = 15,
	强化物理防御 = 2,
	强化伤害 = 2
}
打造符列表 = {
	炼金符 = 1,
	裁缝符 = 1,
	打造符 = 1
}
书铁兑换熟练度 = {
	5,
	5,
	10,
	10,
	15,
	20,
	25,
	30,
	35,
	40,
	60,
	80,
	100,
	120,
	150,
	200
}
普通打造熟练度 = 5
强化打造熟练度 = 15
强化打造160熟练度 = 30
灵饰特效 = {
	"无级别限制",
	"简易",
	"超级简易",
	"永不磨损"
}
宝石列表 = {
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉",
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉",
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉",
	"星辉石",
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉",
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉",
	"红玛瑙",
	"太阳石",
	"舍利子",
	"黑宝石",
	"月亮石",
	"光芒石",
	"神秘石",
	"昆仑玉"
}
宝石列表1 = {
	星辉石 = 1,
	红玛瑙 = {
		命中 = 25
	},
	太阳石 = {
		伤害 = 8
	},
	舍利子 = {
		灵力 = 6,
		法伤 = 6,
		法防 = 6
	},
	黑宝石 = {
		速度 = 8
	},
	月亮石 = {
		防御 = 12
	},
	光芒石 = {
		气血 = 40
	},
	神秘石 = {
		气血回复效果 = 12
	},
	昆仑玉 = {
		治疗能力 = 8
	}
}
混元伞反弹比例 = 0.03
法宝列表1 = {
	鬼脸面具 = 2,
	紫火如意 = 0,
	苍白纸人 = 0,
	千斗金樽 = 2,
	断线木偶 = 0,
	神行飞剑 = 2,
	雷兽 = 2,
	缩地尺 = 2,
	缚妖索 = 0,
	斩魔 = 1,
	澄空净铃 = 1,
	拭剑石 = 2,
	五色旗盒 = 0,
	北冥巨鳞 = 1,
	金刚杵 = 1,
	金甲仙衣 = 2,
	降魔斗篷 = 1,
	镇海珠 = 1,
	奇门五行令 = 1,
	落星飞鸿 = 2,
	流影云笛 = 2,
	迷魂灯 = 2,
	神木宝鼎 = 0,
	混元伞 = 0,
	风袋 = 2,
	翠碧玉箫 = 1,
	梦云幻甲 = 2,
	谷玄星盘 = 2,
	附灵玉 = 1,
	铸兵锤 = 0,
	河图洛书 = 1,
	宝烛 = 2,
	苍灵雪羽 = 0,
	止风神剑 = 1,
	五火神焰印 = 1,
	琉璃灯 = 1,
	驱风宝诰 = 1,
	金钱镖 = 0,
	鬼泣 = 0,
	碧玉葫芦 = 2,
	赤焰 = 0,
	捆仙绳 = 0,
	救命毫毛 = 1,
	普渡 = 2,
	九幽 = 1,
	归元圣印 = 2,
	血魄元幡 = 1,
	金蟾 = 0,
	发瘟匣 = 0,
	九霄灵息 = 1,
	织女扇 = 2,
	定风珠 = 2,
	番天印 = 2,
	七杀 = 1,
	摄魂 = 0,
	乾坤玄火塔 = 0,
	幽灵珠 = 2,
	月影 = 1,
	驭魔笼 = 1,
	月光宝盒 = 0,
	嗜血幡 = 2,
	汇灵盏 = 2,
	五彩娃娃 = 0,
	凌波仙符 = 2,
	翡翠芝兰 = 1,
	玄冰面具 = 2,
	九黎战鼓 = 2,
	软烟罗锦 = 2,
	琉璃云罩 = 1,
	烽火狼烟 = 0,
	太虚玉液 = 1,
	失心钹 = 1,
	干将莫邪 = 0,
	无尘扇 = 0,
	无字经 = 0,
	慈悲 = 1,
	曼陀罗 = 1,
	冷龙石磐 = 1,
	金箍棒 = 1,
	舞雪冰蝶 = 0,
	炽焰丹珠 = 1,
	惊魂铃 = 0,
	天师符 = 2,
	重明战鼓 = 2,
	初诞春芽 = 1,
	蟠龙玉璧 = 2,
	现形符 = 2,
	聚妖铃 = 2,
	七宝玲珑灯 = 2,
	宿幕星河 = 1,
	清心咒 = 0,
	通灵宝玉 = 2,
	盘龙壁 = 2,
	九梵清莲 = 0,
	伏魔天书 = 1,
	万鬼幡 = 2,
	分水 = 1,
	璞玉灵钵 = 0,
	飞剑 = 2,
	无魂傀儡 = 0,
	兽王令 = 1,
	天煞 = 0,
	罗汉珠 = 0,
	狂飙天爪 = 1,
	聚宝盆 = 2,
	万古坚冰 = 1
}
法宝矛盾列表 = {
	蟠龙玉璧 = {
		降魔斗篷 = 1,
		澄空净铃 = 1,
		金甲仙衣 = 1
	},
	金甲仙衣 = {
		蟠龙玉璧 = 1
	},
	降魔斗篷 = {
		蟠龙玉璧 = 1
	},
	澄空净铃 = {
		蟠龙玉璧 = 1
	}
}
四级法宝列表 = {
	翡翠芝兰 = 1,
	紫火如意 = 1,
	狂飙天爪 = 1,
	千斗金樽 = 1,
	琉璃云罩 = 1,
	烽火狼烟 = 1,
	落星飞鸿 = 1,
	九梵清莲 = 1,
	苍灵雪羽 = 1,
	太虚玉液 = 1,
	舞雪冰蝶 = 1,
	河图洛书 = 1,
	凌波仙符 = 1,
	北冥巨鳞 = 1,
	谷玄星盘 = 1,
	软烟罗锦 = 1,
	炽焰丹珠 = 1,
	九霄灵息 = 1,
	澄空净铃 = 1,
	翠碧玉箫 = 1,
	血魄元幡 = 1,
	冷龙石磐 = 1,
	重明战鼓 = 1,
	初诞春芽 = 1,
	蟠龙玉璧 = 1,
	归元圣印 = 1,
	梦云幻甲 = 1,
	璞玉灵钵 = 1,
	万古坚冰 = 1,
	流影云笛 = 1,
	宿幕星河 = 1
}
攻击法宝列表 = {
	苍灵雪羽 = 1,
	紫火如意 = 1,
	九黎战鼓 = 2,
	千斗金樽 = 2,
	五火神焰印 = 2,
	烽火狼烟 = 1,
	金钱镖 = 2,
	凌波仙符 = 1,
	干将莫邪 = 2,
	斩魔 = 1,
	伏魔天书 = 1,
	琉璃灯 = 1,
	万古坚冰 = 1,
	金箍棒 = 1,
	金刚杵 = 1,
	镇海珠 = 1,
	兽王令 = 2,
	月影 = 2,
	嗜血幡 = 2,
	铸兵锤 = 1,
	宿幕星河 = 2
}
防御法宝列表 = {
	无魂傀儡 = 2,
	奇门五行令 = 2,
	苍白纸人 = 2,
	盘龙壁 = 2,
	琉璃云罩 = 1,
	翠碧玉箫 = 1,
	九梵清莲 = 1,
	失心钹 = 2,
	蟠龙玉璧 = 2,
	降魔斗篷 = 1,
	璞玉灵钵 = 1,
	澄空净铃 = 1,
	断线木偶 = 2,
	冷龙石磐 = 1,
	五彩娃娃 = 2,
	金甲仙衣 = 2
}
辅助法宝列表 = {
	鬼脸面具 = 2,
	五色旗盒 = 2,
	雷兽 = 2,
	软烟罗锦 = 1,
	缩地尺 = 2,
	神行飞剑 = 2,
	鬼泣 = 2,
	流影云笛 = 2,
	风袋 = 2,
	玄冰面具 = 2,
	月光宝盒 = 2,
	混元伞 = 2,
	河图洛书 = 1,
	北冥巨鳞 = 1,
	拭剑石 = 2,
	聚宝盆 = 2,
	血魄元幡 = 1,
	惊魂铃 = 2,
	止风神剑 = 1,
	驱风宝诰 = 1,
	天师符 = 2,
	迷魂灯 = 2,
	重明战鼓 = 1,
	缚妖索 = 2,
	梦云幻甲 = 1,
	聚妖铃 = 2,
	七宝玲珑灯 = 1,
	清心咒 = 2,
	通灵宝玉 = 2,
	落星飞鸿 = 2,
	捆仙绳 = 2,
	万鬼幡 = 2,
	谷玄星盘 = 1,
	飞剑 = 2,
	附灵玉 = 2,
	九霄灵息 = 1,
	织女扇 = 2,
	定风珠 = 2,
	天煞 = 2,
	罗汉珠 = 2,
	幽灵珠 = 2,
	狂飙天爪 = 1,
	驭魔笼 = 1,
	神木宝鼎 = 2,
	汇灵盏 = 2
}
恢复法宝列表 = {
	炽焰丹珠 = 1,
	金蟾 = 0,
	普渡 = 2,
	赤焰 = 2,
	翡翠芝兰 = 1,
	碧玉葫芦 = 2,
	太虚玉液 = 1,
	初诞春芽 = 1,
	九幽 = 1,
	归元圣印 = 2,
	慈悲 = 2,
	分水 = 2,
	救命毫毛 = 1,
	宝烛 = 2
}
诅咒法宝列表 = {
	番天印 = 2,
	摄魂 = 2,
	乾坤玄火塔 = 2,
	现形符 = 2,
	舞雪冰蝶 = 1,
	发瘟匣 = 2,
	无字经 = 2,
	无尘扇 = 2,
	曼陀罗 = 2,
	七杀 = 2
}
法宝五行加成 = {
	{
		金 = 1
	},
	{
		木 = 1
	},
	{
		水 = 1
	},
	{
		土 = 1
	},
	{
		火 = 1
	}
}

取法宝类型 = function(名称)
	if 攻击法宝列表[名称] ~= nil then
		return 1
	elseif 防御法宝列表[名称] ~= nil then
		return 2
	elseif 辅助法宝列表[名称] ~= nil then
		return 3
	elseif 恢复法宝列表[名称] ~= nil then
		return 4
	elseif 诅咒法宝列表[名称] ~= nil then
		return 5
	end

	return nil
end

半数取整 = function(数值)
	数值 = tonumber(数值) + 0

	return math.floor(数值 + 0.5)
end

qz = math.floor
qz1 = 半数取整
qz2 = math.ceil
召唤兽门派技能减伤 = 1
野怪初始潜力 = 10
宝宝初始潜力 = 20
变异初始潜力 = 25
孩子初始潜力 = 30
神兽初始潜力 = 40
天生神兽初始潜力 = 50
转生五维 = 5
召唤兽转生次数 = 2
神兽类型转换神兜兜数量 = 50
更改模型神兜兜数量 = 50
生命升华神兜兜数量 = 399
技能觉醒神兜兜数量 = 299
超级技能神兜兜数量 = 199
超级技能数量限制 = 2
超级技能列表 = {
	"超级必杀",
	"超级进击必杀",
	"超级连击",
	"超级吸血",
	"超级偷袭",
	"超级夜战",


	"超级毒",
	"超级反击",
	"超级合纵",
	"超级强力",
	"超级隐身",
	"超级感知",
	"超级招架",
	"超级驱鬼",
	"超级反震",
	"超级防御",
	"超级盾气",
	"超级法术抵抗",
	"超级幸运",
	"超级否定信仰",
	"超级精神集中",
	"超级飞行",
	"超级慧根",
	"超级再生",
	"超级冥思",
	"超级神迹",
	"超级永恒",
	"超级法术暴击",
	"超级进击法爆",
	"超级法术连击",
	"超级魔之心",
	"超级法术波动",
	"超级敏捷",
	"超级水属性吸收",
	"超级雷属性吸收",
	"超级土属性吸收",
	"超级火属性吸收",
	"超级壁垒击破",
	"超级泰山压顶",
	"超级地狱烈火",
	"超级水漫金山",
	"超级奔雷咒",
	"超级遗志",
	高级雷属性吸收 = 35,
	高级法术连击 = 30,
	高级合纵 = 9,
	高级神迹 = 26,
	高级强力 = 10,
	高级魔之心 = 31,
	高级永恒 = 27,
	高级火属性吸收 = 37,
	高级否定信仰 = 20,
	高级敏捷 = 33,
	地狱烈火 = 40,
	高级隐身 = 11,
	高级再生 = 24,
	高级偷袭 = 5,
	高级反震 = 15,
	高级法术暴击 = 28,
	高级法术抵抗 = 18,
	高级土属性吸收 = 36,
	高级水属性吸收 = 34,
	泰山压顶 = 39,
	高级毒 = 7,
	壁垒击破 = 38,
	高级进击必杀 = 2,
	高级进击法爆 = 29,
	高级必杀 = 1,
	高级遗志 = 43,
	高级精神集中 = 21,
	高级夜战 = 6,
	高级招架 = 13,
	高级感知 = 12,
	高级盾气 = 17,
	高级防御 = 16,
	高级反击 = 8,
	高级法术波动 = 32,
	高级连击 = 3,
	高级飞行 = 22,
	奔雷咒 = 42,
	高级幸运 = 19,
	水漫金山 = 41,
	高级慧根 = 23,
	高级吸血 = 4,
	高级驱鬼 = 14,
	高级冥思 = 25
}
超级技能列表1 = {
	"高级必杀",
	"高级进击必杀",
	"高级连击",
	"高级吸血",
	"高级偷袭",
	"高级夜战",
	"高级毒",
	"高级反击",

	"高级合纵",
	"高级强力",
	"高级隐身",
	"高级感知",
	"高级招架",
	"高级驱鬼",
	"高级反震",
	"高级防御",
	"高级盾气",
	"高级法术抵抗",
	"高级幸运",
	"高级否定信仰",
	"高级精神集中",
	"高级飞行",
	"高级慧根",
	"高级再生",
	"高级冥思",
	"高级神迹",
	"高级永恒",
	"高级法术暴击",
	"高级进击法爆",
	"高级法术连击",
	"高级魔之心",
	"高级法术波动",
	"高级敏捷",
	"高级水属性吸收",
	"高级雷属性吸收",
	"高级土属性吸收",
	"高级火属性吸收",
	"壁垒击破",
	"泰山压顶",
	"地狱烈火",
	"水漫金山",
	"奔雷咒",
	"高级遗志",
	超级吸血 = 4,
	超级地狱烈火 = 40,
	超级必杀 = 1,
	超级飞行 = 22,
	超级法术波动 = 32,
	超级法术抵抗 = 18,
	超级水属性吸收 = 34,
	超级火属性吸收 = 37,
	超级幸运 = 19,
	超级连击 = 3,
	超级感知 = 12,
	超级雷属性吸收 = 35,
	超级壁垒击破 = 38,
	超级合纵 = 9,
	超级遗志 = 43,
	超级偷袭 = 5,
	超级毒 = 7,
	超级进击必杀 = 2,
	超级魔之心 = 31,
	超级永恒 = 27,
	超级水漫金山 = 41,
	超级精神集中 = 21,
	超级强力 = 10,
	超级法术暴击 = 28,
	超级反震 = 15,
	超级驱鬼 = 14,
	超级土属性吸收 = 36,
	超级夜战 = 6,
	超级再生 = 24,
	超级法术连击 = 30,
	超级进击法爆 = 29,
	超级泰山压顶 = 39,
	超级招架 = 13,
	超级防御 = 16,
	超级隐身 = 11,
	超级慧根 = 23,
	超级否定信仰 = 20,
	超级敏捷 = 33,
	超级冥思 = 25,
	超级盾气 = 17,
	超级神迹 = 26,
	超级奔雷咒 = 42,
	超级反击 = 8
}
战斗升超级技能数量 = 1
战斗升超级技能概率 = 2
随机超级技能列表 = {
	"超级毒",
	"超级反击",
	"超级隐身",
	"超级感知",
	"超级驱鬼",
	"超级反震",
	"超级防御",
	"超级盾气",
	"超级否定信仰",
	"超级精神集中",
	"超级慧根",
	"超级冥思",
	"超级水属性吸收",
	"超级雷属性吸收",
	"超级土属性吸收",
	"超级火属性吸收",
	"超级遗志",
	"超级壁垒击破",
	"超级泰山压顶",
	"超级地狱烈火",
	"超级水漫金山",
	"超级奔雷咒",
	高级冥思 = 12,
	高级防御 = 7,
	高级慧根 = 11,
	高级反击 = 2,
	高级否定信仰 = 9,
	水漫金山 = 21,
	高级毒 = 1,
	高级火属性吸收 = 16,
	高级水属性吸收 = 13,
	地狱烈火 = 20,
	壁垒击破 = 18,
	高级隐身 = 3,
	奔雷咒 = 22,
	高级反震 = 6,
	高级遗志 = 17,
	高级土属性吸收 = 15,
	泰山压顶 = 19,
	高级雷属性吸收 = 14,
	高级精神集中 = 10,
	高级驱鬼 = 5,
	高级感知 = 4,
	高级盾气 = 8
}
超级技能群法列表 = {
	超级奔雷咒 = "弱点雷",
	超级地狱烈火 = "弱点火",
	超级水漫金山 = "弱点水",
	超级泰山压顶 = "弱点土"
}
合宠必带天生技能 = false
合宠保底资质开关 = false
合宠资质最低梯度 = 0.85
合宠资质最高梯度 = 1.1
合宠资质梯度 = 0.02
合宠成长最低梯度 = 0.96
合宠成长最高梯度 = 1.02
合宠成长梯度 = 0.02
资质梯度 = {}
local i = 合宠资质最低梯度

while i <= 合宠资质最高梯度 do
	资质梯度[#资质梯度 + 1] = i + 0
	i = i + 合宠资质梯度
end

伤害叠加模式 = 1
五行系数1 = 1.1
五行系数2 = 0.9
五行影响 = {
	木 = "体质",
	金 = "力量",
	火 = "魔力",
	水 = "敏捷",
	土 = "耐力"
}
战斗五行克制 = {
	金 = {
		木 = 五行系数1,
		火 = 五行系数2
	},
	木 = {
		土 = 五行系数1,
		金 = 五行系数2
	},
	水 = {
		火 = 五行系数1,
		土 = 五行系数2
	},
	火 = {
		金 = 五行系数1,
		水 = 五行系数2
	},
	土 = {
		水 = 五行系数1,
		木 = 五行系数2
	}
}
战斗五行相生 = {
	金 = {
		水 = 五行系数1,
		火 = 五行系数2
	},
	木 = {
		火 = 五行系数1,
		金 = 五行系数2
	},
	水 = {
		木 = 五行系数1,
		土 = 五行系数2
	},
	火 = {
		土 = 五行系数1,
		水 = 五行系数2
	},
	土 = {
		金 = 五行系数1,
		木 = 五行系数2
	}
}
五行固定召唤兽 = {
	["五行山神(土)"] = "土",
	["五行山神(火)"] = "火",
	["五行山神(木)"] = "木",
	["五行山神(水)"] = "水",
	["五行山神(金)"] = "金"
}
召唤兽最高等级 = 185
召唤兽参战高于等级 = 10
召唤兽经验高于等级 = 10
飞升高于等级 = 6
超级简易等级数 = 21
简易等级数 = 5
祝福特效概率 = 5
祝福特效 = {}
通灵双技能保底 = 10
通灵装备特殊技能概率 = 30
通灵装备合成更高级别概率 = 30
通灵装备双技能概率 = 100
一加一减概率 = 30
特效不限制部位 = 1
新特效概率2 = 3
新特效概率3 = 10
属性吸收无限制 = 1
属性吸收类型 = {
	"雷",
	"土",
	"水",
	"火"
}
日月乾坤结束战斗 = true
日月乾坤封印减少值 = 15
坐骑内丹最低技能数 = 1
坐骑内丹最高技能数 = 8
坐骑内丹技能数概率 = {
	100,
	80,
	70,
	60,
	50,
	40,
	30,
	20
}
坐骑内丹特殊技能概率 = 150
特效石成功几率 = 10000
特效石保底次数 = 5
五行石模式 = 1
五行石成功几率 = 2000
五行石保底次数 = 5
七彩石成功几率 = 10000
七彩石保底次数 = 5
钟灵石合成跳级 = 20
出售宝石等级 = 0
角色套装a = 3
角色套装b = 5
bb套装生效件数 = 1
追加法术是否添加主动技能 = false
追加法术模式 = 0
披坚执锐模式 = 1
书铁列表 = {
	"灵饰指南书",
	"制造指南书",
	"元灵晶石",
	"百炼精铁"
}
书铁列表1 = {
	元灵晶石 = 3,
	灵饰指南书 = 1,
	制造指南书 = 2,
	百炼精铁 = 4
}
书铁范围 = {
	"枪矛",
	"斧钺",
	"剑",
	"双短剑",
	"飘带",
	"爪刺",
	"扇",
	"魔棒",
	"锤",
	"鞭",
	"环圈",
	"刀",
	"法杖",
	"弓弩",
	"宝珠",
	"巨剑",
	"伞",
	"灯笼",
	"头盔",
	"发钗",
	"项链",
	"女衣",
	"男衣",
	"腰带",
	"鞋子"
}
书铁范围1 = {
	魔棒 = 8,
	法杖 = 13,
	枪矛 = 1,
	鞭 = 10,
	锤 = 9,
	弓弩 = 14,
	鞋子 = 25,
	项链 = 21,
	发钗 = 20,
	男衣 = 23,
	灯笼 = 18,
	爪刺 = 6,
	腰带 = 24,
	巨剑 = 16,
	头盔 = 19,
	扇 = 7,
	斧钺 = 2,
	环圈 = 11,
	女衣 = 22,
	剑 = 3,
	双短剑 = 4,
	伞 = 17,
	飘带 = 5,
	宝珠 = 15,
	刀 = 12
}
通灵装备 = {
	"通灵神臂",
	"通灵神符",
	"通灵神戒"
}
通灵装备1 = {
	通灵神臂 = 1,
	通灵神戒 = 3,
	通灵神符 = 2
}
召唤兽装备种类 = {
	"护腕",
	"项圈",
	"铠甲"
}
重置丹列表 = {
	"通灵重置丹",
	"高级通灵重置丹",
	"超级通灵重置丹"
}
重置丹列表1 = {
	高级通灵重置丹 = 2,
	通灵重置丹 = 1,
	超级通灵重置丹 = 3
}
吸附石几率 = 5
吸附兽决几率 = 20
召唤兽转生加成 = {
	速度资质 = 50,
	躲闪资质 = 50,
	体力资质 = 100,
	法力资质 = 100,
	攻击资质 = 50,
	防御资质 = 50,
	成长 = 0.05
}
召唤兽转生技能 = {
	{
		通用 = "高级强壮"
	},
	{
		进阶超级泡泡 = "泡泡相伴",
		超级泡泡 = "泡泡相伴",
		通用 = "风起龙游",
		超级神虎 = "虎虎生风",
		进阶超级神虎 = "虎虎生风"
	}
}
合宠等级 = 0
金柳露变异概率 = 25
超级金柳露变异概率 = 50
洗宝宝变异保底次数 = 300
野外宝宝概率 = 200
野外变异概率 = 15
野外特殊宝宝概率 = 15
暗雷遇神兽几率 = 10
野外神兽绑定 = true
捕捉概率 = 20
忠诚度开启 = true
经验丹时间 = 3600
洗通灵装备模式 = 0
奋勇当先回合数 = 2
移花接木减伤 = 0.85
法波上限 = 130
法波下限 = 50
高法波上限 = 150
高法波下限 = 65
超法波上限 = 300
超法波下限 = 75
基础暴击率 = 5
基础法暴率 = 0
低级法连倍率 = 0.5
高级法连倍率 = 0.5
超级法连倍率 = 1
毒状态列表 = {
	"毒",
	"猛毒",
	"尸腐毒 ",
	"尸腐毒",
	"雾杀"
}
毒状态列表1 = {
	雾杀 = 1,
	["尸腐毒 "] = 1,
	毒 = 1,
	尸腐毒 = 1,
	机巧 = 1,
	轻霜 = 1,
	猛毒 = 1
}
毒概率基数 = 100
保命概率基数 = 100
冲击概率基数 = 100
恐怖概率基数 = 100
恐吓概率基数 = 1000
低级物穿 = 10
高级物穿 = 15
低级法穿 = 10
高级法穿 = 15
赶尽杀绝概率 = 20
毒概率 = 15
高级毒概率 = 20
超级毒概率 = 20
每回合助攻次数限制 = 2
每回合法术助攻次数限制 = 2
助攻概率 = 2
高级助攻概率 = 5
法术助攻概率 = 2
高级法术助攻概率 = 5
保命概率 = 30
保命气血 = 3
高级保命概率 = 40
高级保命气血 = 5
神佑概率 = 20
神佑气血 = 0.6
高级神佑概率 = 30
高级神佑气血 = 1
冲击概率 = 4
高级冲击概率 = 8
恐怖概率 = 2
高级恐怖概率 = 5
恐吓最低概率 = 10
恐吓最高概率 = 25
高级恐吓最低概率 = 20
高级恐吓最高概率 = 35
八凶法阵最低概率 = 5
八凶法阵最高概率 = 20
大快朵颐参数 = {
	15,
	10
}
大快朵颐暴击参数 = {
	10,
	10
}
理直气壮攻击系数 = 0.8
超级连击攻击系数 = 0.8
高级连击攻击系数 = 0.8
连击攻击系数 = 0.8
反震概率 = 30
反击概率 = 30
超级反击概率 = 35
魔反概率 = 30
魔法反击小法列表 = {
	"水攻",
	"烈火",
	"雷击",
	"落岩"
}
复活技能 = {
	回魂咒 = 1,
	还阳术 = 1,
	慈航普渡 = 1,
	杨柳甘露 = 1,
	起死回生 = 1,
	驯兽重生 = 1,
	还魂咒 = 1,
	莲花心音 = 1,
	由己渡人 = 1,
	我佛慈悲 = 1
}
识物特性生效技能列表 = {
	水漫金山 = 1,
	上古灵符 = 1,
	落岩 = 1,
	泰山压顶 = 1,
	烈火 = 1,
	超级泰山压顶 = 1,
	超级地狱烈火 = 1,
	雷击 = 1,
	超级奔雷咒 = 1,
	地狱烈火 = 1,
	超级水漫金山 = 1,
	奔雷咒 = 1,
	水攻 = 1
}
玉砥柱技能列表 = {
	善恶有报 = 1,
	剑荡四方 = 1,
	刀背打 = 1,
	舍身一搏 = 1,
	水击三千 = 1,
	惊心一剑 = 1,
	力劈华山 = 1,
	荒古破击 = 1,
	壁垒击破 = 1,
	双星闪 = 1,
	蚩尤之搏 = 1
}
法术只给自己列表 = {
	钟馗论道 = 1,
	烈焰真诀 = 1,
	无所遁形 = 1,
	不动如山 = 1,
	干将莫邪 = 1,
	灵能激发 = 1,
	法术防御 = 1,
	炎护 = 1,
	绝处逢生 = 1,
	雨润丰泽 = 1,
	天魔解体 = 1,
	推拿 = 1,
	呼子唤孙 = 1,
	齐天神通 = 1,
	狂怒 = 1,
	三花聚顶 = 1,
	气慑天军 = 1,
	魔王回首 = 1,
	极度疯狂 = 1,
	牛劲 = 1,
	变身 = 1,
	神龙摆尾 = 1,
	炎魂 = 1,
	灵刃 = 1,
	移星换斗 = 1,
	铜头铁臂 = 1,
	["五雷·挪移"] = 1,
	楚楚可怜 = 1,
	顺势而为 = 1,
	分身术 = 1,
	混元伞 = 1,
	九幽除名 = 1,
	幻镜术 = 1,
	五彩娃娃 = 1,
	凝神术 = 1
}
星宿银子倍率 = 2.5
助战奖励开关 = true
助战经验银子开关 = true
助战奖励换算人数 = 2
门派减伤开关 = true
同门派减伤列表 = {
	0,
	0,
	0.15,
	0.3,
	0.45
}
资质丸消耗寿命 = 1000
额外奖励概率 = 10
符石技能等级 = {
	1,
	2,
	4,
	6
}
门贡兑换 = {
	{
		五宝 = 100
	},
	{
		属性转换符 = 100
	},
	{
		超级通灵重置丹 = 100
	},
	{
		特赦令牌 = 100
	},
	{
		特技石 = 20
	},
	{
		七彩石 = 30
	},
	{
		五行石 = 20
	},
	{
		特效石碎片 = 30
	},
	{
		超级通灵重置丹 = 100
	},
	{
		通灵神符 = 100
	},
	{
		通灵神戒 = 20
	},
	{
		资质丸 = 20
	},
	{
		属性石 = 20
	},
	{
		元宵 = 50
	},
	{
		元宵 = 50
	},
	{
		宝石 = 104
	},
	{
		宝石 = 103
	},
	{
		宝石 = 105
	},
	{
		神兜兜 = 100
	},
	{
		法宝级1 = 100
	},
	{
		法宝级2 = 50
	},
	{
		高级魔兽要诀 = 100
	},
	{
		特殊魔兽要诀 = 20
	},
	{
		六艺修行书 = 10
	}
}
通常奖励 = {
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		属性转换符 = 50
	},
	{
		七彩石 = 50
	},
	{
		通灵重置丹 = 100
	},
	{
		高级通灵重置丹 = 80
	},
	{
		超级通灵重置丹 = 50
	},
	{
		五行石 = 20
	},
	{
		特效石碎片 = 20
	},
	{
		坐骑内丹 = 50
	},
	{
		通灵神臂 = 100
	},
	{
		通灵神符 = 30
	},
	{
		通灵神戒 = 10
	},
	{
		还魂秘术 = 1
	},
	{
		蚩尤武诀 = 1
	},
	{
		黄帝内经 = 1
	},
	{
		魔兽要诀 = 100
	},
	{
		高级魔兽要诀 = 5
	},
	{
		彩果 = 100
	},
	{
		彩果 = 100
	},
	{
		神兜兜 = 50
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		召唤兽内丹 = 100
	},
	{
		高级召唤兽内丹 = 20
	},
	{
		易经丹 = 100
	},
	{
		炼兽真经 = 100
	},
	{
		资质丸 = 1
	},
	{
		属性石 = 1
	},
	{
		高品桂花丸 = 10000
	},
	{
		高品珍露酒 = 350
	},
	{
		高品九转回魂丹 = 1980
	},
	{
		高品五龙丹 = 3333
	},
	{
		高品金香玉 = 821
	},
	{
		高品蛇蝎美人 = 1980
	},
	{
		高品桂花丸 = 10000
	},
	{
		高品珍露酒 = 350
	},
	{
		高品九转回魂丹 = 1980
	},
	{
		高品五龙丹 = 3333
	},
	{
		高品金香玉 = 821
	},
	{
		高品蛇蝎美人 = 1980
	},
	{
		高品桂花丸 = 10000
	},
	{
		高品珍露酒 = 350
	},
	{
		高品九转回魂丹 = 1980
	},
	{
		高品五龙丹 = 3333
	},
	{
		高品金香玉 = 821
	},
	{
		高品蛇蝎美人 = 1980
	},
	{
		清灵净瓶 = 50
	},
	{
		吸附石 = 102
	},
	{
		分解符 = 115
	},
	{
		符石卷轴 = 100
	},
	{
		青龙石 = 110
	},
	{
		白虎石 = 110
	},
	{
		朱雀石 = 110
	},
	{
		玄武石 = 110
	},
	{
		青龙石 = 110
	},
	{
		白虎石 = 110
	},
	{
		朱雀石 = 110
	},
	{
		玄武石 = 110
	},
	{
		青龙石 = 110
	},
	{
		白虎石 = 110
	},
	{
		朱雀石 = 110
	},
	{
		玄武石 = 110
	},
	{
		元宵 = 50
	},
	{
		宝石 = 101
	},
	{
		宝石 = 101
	},
	{
		超级金柳露 = 103
	},
	{
		超级金柳露 = 103
	},
	{
		超级金柳露 = 103
	},
	{
		超级金柳露 = 103
	},
	{
		金柳露 = 110
	},
	{
		金柳露 = 110
	},
	{
		金柳露 = 110
	},
	{
		金柳露 = 110
	},
	{
		百炼晶石碎片 = 10
	},
	{
		炼兽真经 = 100
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		月华露 = 100
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		月华露 = 100
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		月华露 = 100
	},
	{
		法宝级1 = 50
	},
	{
		特技石 = 50
	},
	{
		法宝级1 = 50
	},
	{
		孤儿名册 = 20
	},
	{
		驾驭宝典 = 20
	},
	{
		经脉秘籍 = 3
	},
	{
		拜师卷轴 = 5
	},
	{
		魔兽残卷 = 50
	},
	{
		魔兽残卷 = 50
	},
	{
		灵饰洗练石 = 10
	}
}
副本奖励50 = {
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		通灵神臂 = 100
	},
	{
		通灵神符 = 30
	},
	{
		属性转换符 = 100
	},
	{
		通灵重置丹 = 100
	},
	{
		高级通灵重置丹 = 50
	},
	{
		还魂秘术 = 1
	},
	{
		蚩尤武诀 = 1
	},
	{
		黄帝内经 = 1
	},
	{
		吸附石 = 100
	},
	{
		七彩石 = 20
	},
	{
		五行石 = 20
	},
	{
		特效石碎片 = 30
	},
	{
		特技石 = 50
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		月华露 = 100
	},
	{
		百炼晶石碎片 = 5
	},
	{
		超级金柳露 = 103
	},
	{
		金柳露 = 110
	},
	{
		金柳露 = 110
	},
	{
		宝石 = 101
	},
	{
		宝石 = 101
	},
	{
		宝石 = 201
	},
	{
		钟灵石级1 = 30
	},
	{
		召唤兽内丹 = 100
	},
	{
		高级召唤兽内丹 = 20
	},
	{
		易经丹 = 100
	},
	{
		炼兽真经 = 100
	},
	{
		彩果 = 100
	},
	{
		彩果 = 100
	},
	{
		神兜兜 = 50
	},
	{
		神兜兜 = 50
	},
	{
		法宝级1 = 50
	},
	{
		孤儿名册 = 30
	},
	{
		驾驭宝典 = 30
	},
	{
		经脉秘籍 = 5
	},
	{
		拜师卷轴 = 10
	},
	{
		魔兽残卷 = 40
	},
	{
		魔兽残卷 = 40
	},
	{
		魔兽要诀 = 100
	},
	{
		灵饰洗练石 = 10
	}
}
副本奖励60 = {
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		通灵神臂 = 100
	},
	{
		通灵神符 = 40
	},
	{
		属性转换符 = 100
	},
	{
		通灵重置丹 = 100
	},
	{
		高级通灵重置丹 = 60
	},
	{
		还魂秘术 = 3
	},
	{
		蚩尤武诀 = 3
	},
	{
		黄帝内经 = 3
	},
	{
		吸附石 = 100
	},
	{
		七彩石 = 30
	},
	{
		五行石 = 30
	},
	{
		特效石碎片 = 30
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		月华露 = 100
	},
	{
		百炼晶石碎片 = 10
	},
	{
		超级金柳露 = 103
	},
	{
		金柳露 = 110
	},
	{
		金柳露 = 110
	},
	{
		宝石 = 101
	},
	{
		宝石 = 201
	},
	{
		宝石 = 201
	},
	{
		宝石 = 301
	},
	{
		钟灵石级1 = 50
	},
	{
		钟灵石级2 = 30
	},
	{
		召唤兽内丹 = 100
	},
	{
		高级召唤兽内丹 = 30
	},
	{
		易经丹 = 100
	},
	{
		炼兽真经 = 100
	},
	{
		彩果 = 100
	},
	{
		彩果 = 100
	},
	{
		神兜兜 = 50
	},
	{
		神兜兜 = 50
	},
	{
		法宝级1 = 50
	},
	{
		法宝级2 = 50
	},
	{
		特技石 = 50
	},
	{
		孤儿名册 = 35
	},
	{
		驾驭宝典 = 35
	},
	{
		经脉秘籍 = 5
	},
	{
		拜师卷轴 = 10
	},
	{
		魔兽残卷 = 50
	},
	{
		魔兽残卷 = 50
	},
	{
		魔兽要诀 = 100
	},
	{
		灵饰洗练石 = 15
	}
}
突厥精英奖励 = {
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		五宝 = 100
	},
	{
		通灵神臂 = 100
	},
	{
		通灵神符 = 50
	},
	{
		通灵神戒 = 30
	},
	{
		属性转换符 = 100
	},
	{
		通灵重置丹 = 100
	},
	{
		高级通灵重置丹 = 100
	},
	{
		超级通灵重置丹 = 50
	},
	{
		还魂秘术 = 5
	},
	{
		蚩尤武诀 = 5
	},
	{
		黄帝内经 = 5
	},
	{
		吸附石 = 100
	},
	{
		七彩石 = 40
	},
	{
		五行石 = 30
	},
	{
		特效石碎片 = 40
	},
	{
		修炼果 = 100
	},
	{
		九转金丹 = 100
	},
	{
		百炼晶石碎片 = 15
	},
	{
		超级金柳露 = 105
	},
	{
		金柳露 = 120
	},
	{
		金柳露 = 120
	},
	{
		宝石 = 201
	},
	{
		宝石 = 301
	},
	{
		宝石 = 301
	},
	{
		宝石 = 401
	},
	{
		钟灵石级1 = 100
	},
	{
		钟灵石级2 = 50
	},
	{
		召唤兽内丹 = 100
	},
	{
		高级召唤兽内丹 = 80
	},
	{
		易经丹 = 100
	},
	{
		炼兽真经 = 100
	},
	{
		彩果 = 100
	},
	{
		彩果 = 100
	},
	{
		神兜兜 = 80
	},
	{
		神兜兜 = 80
	},
	{
		法宝级1 = 100
	},
	{
		法宝级2 = 70
	},
	{
		法宝级3 = 30
	},
	{
		特技石 = 70
	},
	{
		孤儿名册 = 40
	},
	{
		驾驭宝典 = 50
	},
	{
		经脉秘籍 = 10
	},
	{
		拜师卷轴 = 20
	},
	{
		魔兽残卷 = 70
	},
	{
		魔兽残卷 = 70
	},
	{
		魔兽要诀 = 100
	},
	{
		灵饰洗练石 = 15
	}
}
测试奖励 = {
	{
		法宝级1 = 50
	},
	{
		法宝级2 = 50
	}
}

取快捷奖励 = function(id, 奖励列表, 额外系数, 空车概率)
	if 空车概率 ~= nil and ygsj() <= 空车概率 then
		return nil
	end

	while true do
		local wz = ygsj(#奖励列表)

		for i, v in pairs(奖励列表[wz]) do
			local gl = v

			if v < 100 and 额外系数 ~= nil then
				gl = v * 额外系数
			end

			if ygsj(10000) < gl * 100 then
				if i == "宝石" then
					return 快捷给道具(id, 宝石列表[ygsj(#宝石列表)], math.floor(v / 100))
				elseif i == "经脉秘籍" then
					return 快捷给道具(id, 门派名称[ygsj(#门派名称 - 1)] .. "经脉秘籍", 1)
				elseif 书铁列表1[i] ~= nil then
					if v > 100 then
						return 快捷给道具(id, i, qz(v - 100))
					else
						return 快捷给道具(id, i, 10)
					end
				elseif string.find(i, "钟灵石") then
					local a = 分割文本(i, "级")

					return 快捷给道具(id, "钟灵石", tonumber(a[2]))
				elseif string.find(i, "法宝") then
					local a = 分割文本(i, "级")

					return 快捷给道具(id, "法宝", tonumber(a[2]))
				elseif string.find(i, "高品") then
					return 快捷给道具(id, i, 1, v)
				elseif v > 100 then
					local aa = v - 100

					return 快捷给道具(id, i, ygsj(aa))
				else
					return 快捷给道具(id, i, 1)
				end
			end
		end
	end
end

取新快捷奖励 = function(id, 奖励列表)
	local 奖励参数 = qsj(1, 10000)
	local 获得 = 0
	local 序号 = 0

	for i = 1, #奖励列表 do
		获得 = 获得 + 奖励列表[i][2]

		if 奖励参数 <= 获得 then
			序号 = i

			break
		end
	end

	if 序号 > 0 then
		local i = 奖励列表[序号][1]
		local 数量 = qsj(奖励列表[序号][4][1], 奖励列表[序号][4][2] or 奖励列表[序号][4][1])
		local 通知 = 奖励列表[序号][3]

		if i == "宝石" then
			return {
				通知,
				快捷给道具(id, 宝石列表[ygsj(#宝石列表)], 数量)
			}
		elseif i == "经脉秘籍" then
			return {
				通知,
				快捷给道具(id, 门派名称[ygsj(#门派名称 - 1)] .. "经脉秘籍", 1)
			}
		elseif 书铁列表1[i] ~= nil then
			return {
				通知,
				快捷给道具(id, i, 数量)
			}
		elseif string.find(i, "高品") then
			return {
				通知,
				快捷给道具(id, i, 1, 数量)
			}
		else
			return {
				通知,
				快捷给道具(id, i, 数量)
			}
		end
	else
		return {
			false
		}
	end
end

超级行囊类型列表 = {
	"杂货",
	"宝石",
	"兽决",
	"高兽决",
	"特兽决",
	"打造",
	"装备",
	"法宝",
	"宝图",
	"卡片"
}
超级行囊类型列表1 = {
	打造 = 6,
	兽决 = 3,
	杂货 = 1,
	特兽决 = 5,
	高兽决 = 4,
	宝图 = 9,
	装备 = 7,
	法宝 = 8,
	宝石 = 2,
	卡片 = 10
}

取超级行囊类型 = function(参数)
	return 超级行囊类型列表[参数] or "杂货"
end

超级行囊类别 = function(名称, 总类)
	if 总类 == 2 then
		return "装备"
	elseif 总类 == 1000 then
		return "法宝"
	elseif 名称 == "怪物卡片" then
		return "卡片"
	elseif 名称 == "藏宝图" or 名称 == "高级藏宝图" then
		return "宝图"
	elseif 名称 == "魔兽要诀" then
		return "兽决"
	elseif 名称 == "高级魔兽要诀" then
		return "高兽决"
	elseif 名称 == "特殊魔兽要诀" or 名称 == "神兽兽决" then
		return "特兽决"
	elseif 名称 == "灵饰指南书" or 名称 == "制造指南书" or 名称 == "元灵晶石" or 名称 == "百炼精铁" or 名称 == "炼妖石" or 名称 == "上古锻造图策" or 名称 == "天眼珠" or 名称 == "三眼天珠" or 名称 == "九眼天珠" or 名称 == "青龙石" or 名称 == "朱雀石" or 名称 == "玄武石" or 名称 == "白虎石" or 名称 == "陨铁" or 名称 == "战魄" or 打造符列表[名称] ~= nil then
		return "打造"
	elseif 名称 == "钟灵石" or 名称 == "属性石" or 名称 == "五行石" or 名称 == "特效石" or 名称 == "特效石碎片" or 名称 == "特技石" or 名称 == "七彩石" or 名称 == "百炼晶石" or 名称 == "百炼晶石碎片" or 宝石列表1[名称] ~= nil then
		return "宝石"
	else
		return "杂货"
	end
end

列表2加入到列表1 = function(列表1, 列表2, 不复制列表1, 去除列表元素)
	local 列表 = {}

	if 不复制列表1 ~= nil then
		列表 = 列表1
	else
		for i = 1, #列表1 do
			列表[#列表 + 1] = 列表1[i]
		end
	end

	for i = 1, #列表2 do
		if 去除列表元素 == nil or 去除列表元素 ~= nil and type(列表2[i]) ~= "table" then
			列表[#列表 + 1] = 列表2[i]
		end
	end

	return 列表
end

列表模式转换 = function(列表1)
	local 列表 = {}

	if type(列表1) ~= "table" then
		print(tostring(列表1))
	end

	for i = 1, #列表1 do
		列表[列表1[i]] = i
	end

	return 列表
end

角色辅助技能列表1 = 列表模式转换(角色辅助技能列表)

取列表最大值 = function(列表)
	if #列表 > 0 then
		local n = 列表[1]

		for i = 1, #列表 do
			if n <= 列表[i] then
				n = 列表[i]
			end
		end

		return n
	end
end

取列表中是否存在内容 = function(列表, 内容)
	for i = 1, #列表 do
		if 内容 == 列表[i] then
			return true
		end
	end

	return false
end

列表打乱重组 = function(列表)
	local 列表0 = {}

	for n = 1, #列表 do
		列表0[n] = {
			名称 = 列表[n],
			排列 = ygsj(10000)
		}
	end

	table.sort(列表0, function (a, b)
		return b.排列 < a.排列
	end)

	local 列表1 = {}

	for i = 1, #列表0 do
		列表1[i] = 列表0[i].名称
	end

	return 列表1
end

无错误删除列表多个元素 = function(列表, 删除组)
	if type(删除组) ~= "table" or type(列表) ~= "table" or #删除组 < 1 or #列表 < 1 then
		return 列表
	end

	local 删除列表 = DeepCopy(删除组)

	if #删除列表 > 0 then
		table.sort(删除列表, function (a, b)
			return a < b
		end)

		local 已删 = 0

		for i = 1, #删除列表 do
			if 删除列表[i] - 已删 <= #列表 then
				table.remove(列表, 删除列表[i] - 已删)

				已删 = 已删 + 1
			end
		end
	end

	return 列表
end

最终抗性结果 = function(数值)
	local 最终数值 = 数值 + 0

	if 数值 < 0 then
		最终数值 = 0.1
	end

	return 最终数值
end

取自动上交物品背包位置 = function(id, 事件文本)
	if 事件文本 ~= nil and 上交物品位置[id] ~= nil and #上交物品位置[id] > 0 then
		for i = 1, #上交物品位置[id] do
			if 上交物品位置[id][i].对话内容 == 事件文本 then
				local aa = 上交物品位置[id][i].背包位置 + 0
				上交物品位置[id] = {}

				return aa
			end
		end
	end

	上交物品位置[id] = {}

	return nil
end

去模型进阶 = function(模型名称)
	if string.find(模型名称, "进阶") then
		模型名称 = string.gsub(模型名称, "进阶", "")
	end

	return 模型名称
end

取等级标准 = function(id)
	local aa = math.min(取队伍平均等级(玩家数据[id].队伍, id), 玩家数据[id].角色.数据.等级)

	if 单机设置 then
		aa = 160
	end

	local bb = 1

	if 助战经验银子开关 and 奖励次数[id] > 1 then
		bb = 奖励次数[id] * 全局奖励倍率
	end

	local cc = 160

	if aa > 80 then
		cc = 180
	end

	return {
		qz1(aa),
		math.min(qz1(aa / cc * 1000) / 1000, 1),
		bb
	}
end

固定活动奖励列表 = {}

取文本是否存在列表中的内容 = function(列表, 内容)
	for i = 1, #列表 do
		if string.find(内容, 列表[i]) then
			return true
		end
	end

	return false
end

快捷广播 = function(id, 首标题, 副标题, 奖励)
	广播消息({
		频道 = "xt",
		内容 = format("#P(%s)#R/%s#Y在#S%s#Y中表现优异，获得了奖励：#G/%s", 首标题, 玩家数据[id].角色.数据.名称, 副标题, 奖励)
	})
end

清灵仙露列表 = {
	高级清灵仙露 = 3,
	初级清灵仙露 = 1,
	中级清灵仙露 = 2
}

快捷给道具 = function(id, 名称, 数量, 阶品, 专用, 入包)
	local 类别 = ""

	if 入包 ~= nil and 获取道具模式[id] == nil then
		获取道具模式[id] = 1
	end

	if 数量 == nil then
		数量 = 1
	end

	if 名称 ~= "怪物卡片" then
		数量 = qz(数量)
	end

	if 名称 == "驾驭宝典" and 获取道具模式[id] ~= 1 then
		local aa = ygsj()

		if aa <= 30 then
			名称 = "御行宝典"
		elseif aa <= 60 then
			名称 = "契约之书"
		end
	end

	if string.find(名称, "高品") then
		玩家数据[id].道具:给予道具(id, string.gsub(名称, "高品", ""), 数量, 阶品, nil, 专用)
	elseif 名称 == "仙玉" then
		添加仙玉(数量, 玩家数据[id].账号, id, "奖励仙玉1")

		名称 = 数字转简(数量) .. "点" .. 名称
	elseif 名称 == "银子" then
		玩家数据[id].角色:添加银子(数量, "奖励银子出售")

		名称 = 数字转简(数量) .. "两" .. 名称
	elseif 名称 == "经验" then
		玩家数据[id].角色:添加经验(数量, "不加倍")

		名称 = 数字转简(数量) .. "点" .. 名称
	elseif 名称 == "储备" then
		玩家数据[id].角色:添加储备(数量, "不加倍")

		名称 = 数字转简(数量) .. "点" .. 名称
	elseif 名称 == "召唤兽装备" then
		local 装备种类 = 召唤兽装备种类[ygsj(300) % 3 + 1]
		local dj = math.max(math.min(数量, 16), 1)

		玩家数据[id].装备:生成指定召唤兽装备(id, dj, 装备种类)

		名称 = dj * 10 - 5 .. "级" .. 装备种类
	elseif 名称 == "牵魂香" then
		玩家数据[id].道具:给予道具(id, 名称, 1)

		名称 = "超度法事中使用的牵魂香"
	elseif 名称 == "无级别装备" then
		local dj = qz1(数量 / 10) * 10

		礼包奖励类:随机装备(id, dj, "无级别限制")

		名称 = dj .. "级" .. 名称
	elseif 名称 == "制造指南书" then
		阶品 = tonumber(阶品 or 1)

		玩家数据[id].道具:给予书铁(id, {
			数量,
			数量
		}, "指南书", 阶品)

		名称 = tostring(数量 * 10) .. "级" .. 名称 .. "*" .. 阶品
	elseif 名称 == "百炼精铁" then
		阶品 = tonumber(阶品 or 1)

		玩家数据[id].道具:给予书铁(id, {
			数量,
			数量
		}, "精铁", 阶品)

		名称 = tostring(数量 * 10) .. "级" .. 名称 .. "*" .. 阶品
	elseif 打造符列表[名称] ~= nil then
		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = tostring(数量) .. "张" .. tostring(阶品) .. "级" .. 名称
	elseif 名称 == "灵饰指南书" or 名称 == "元灵晶石" then
		阶品 = tonumber(阶品 or 1)

		玩家数据[id].道具:给予道具(id, 名称, {
			数量,
			数量
		}, nil, 阶品, 专用)

		if 数量 >= 16 then
			数量 = 16
		elseif 数量 >= 14 then
			数量 = 14
		elseif 数量 >= 12 then
			数量 = 12
		elseif 数量 >= 10 then
			数量 = 10
		elseif 数量 >= 8 then
			数量 = 8
		elseif 数量 >= 6 then
			数量 = 6
		else
			数量 = 6
		end

		名称 = tostring(数量 * 10) .. "级" .. 名称 .. "*" .. 阶品
	elseif 名称 == "孩子书" then
		名称 = 孩子书籍列表[ygsj(#孩子书籍列表)]

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = 数量 .. "本" .. 名称
	elseif 名称 == "五宝" then
		名称 = 玩家数据[id].道具:取五宝()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = 数量 .. "个" .. 名称
	elseif 清灵仙露列表[名称] ~= nil then
		if 阶品 == nil then
			local aa = 清灵仙露列表[名称]

			if aa == 1 then
				阶品 = 取随机数(2, 4)
			elseif aa == 2 then
				阶品 = 取随机数(4, 6)
			else
				阶品 = 取随机数(6, 8)
			end
		end

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = 数量 .. "个" .. 名称
	elseif 名称 == "强化石" then
		名称 = 强化石列表[math.ceil(取随机数(1, #强化石列表 * 100) / 100)]

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = 数量 .. "个" .. 名称
	elseif 名称 == "资质丸" then
		类别 = 阶品 or 取资质丸()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "大力神丸" then
		类别 = 阶品 or 取大力神丸()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "属性石" then
		类别 = 阶品 or 取属性石()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "中秋炮" then
		类别 = 阶品 or 取中秋炮()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "召唤兽内丹" then
		类别 = 阶品 or 取内丹()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "高级召唤兽内丹" then
		类别 = 阶品 or 取内丹("高级")

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "魔兽要诀" then
		类别 = 阶品 or 取低级要诀()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "高级魔兽要诀" then
		类别 = 阶品 or 取全部高级要诀()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "特殊魔兽要诀" then
		类别 = 阶品 or 取特殊要诀()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "神兽兽诀" then
		类别 = 阶品 or 神兽要诀()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "六艺修行书" then
		类别 = 阶品 or 取六艺技能()

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "未激活的符石" then
		数量 = math.min(qz(数量), 3)

		if tonumber(阶品) ~= nil then
			阶品 = math.max(qz(tonumber(阶品)), 1)
			名称 = tostring(数量) .. "级" .. 名称 .. "*" .. 阶品 .. "个"
		else
			名称 = tostring(数量) .. "级" .. 名称
		end

		玩家数据[id].道具:给予道具(id, "未激活的符石", 数量, 阶品, nil, 专用)
	elseif 名称 == "炼妖石" or 名称 == "上古锻造图策" then
		玩家数据[id].道具:给予道具(id, 名称, {
			数量,
			数量
		}, 阶品, nil, 专用)

		名称 = tostring(数量) .. "级" .. 名称
	elseif 名称 == "特效石" or 名称 == "特效石碎片" or 名称 == "特技石" then
		if 名称 == "特效石" or 名称 == "特效石碎片" then
			类别 = 阶品 or 取特效()
		else
			类别 = 阶品 or 取特技()
		end

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "鬼谷子" then
		if 阶品 ~= nil then
			类别 = 阶品
		else
			类别 = 阵法名称[取随机数(2, #阵法名称)]
		end

		玩家数据[id].道具:给予道具(id, 名称, 数量, 类别, nil, 专用)

		名称 = 名称 .. "(" .. 类别 .. ")"
	elseif 名称 == "通灵神戒" or 名称 == "通灵神符" or 名称 == "通灵神臂" then
		玩家数据[id].道具:给予道具(id, 名称, 1, 阶品, 数量, 专用)

		if 数量 == 2 then
			名称 = 名称 .. "(双技能)"
		elseif 数量 > 2 then
			名称 = 名称 .. "(多技能)"
		end
	elseif 名称 == "修炼果" or 名称 == "九转金丹" or 名称 == "月华露" then
		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品 or 300, nil, 专用)
	elseif 名称 == "召唤兽蛋" or 名称 == "源生之灵" then
		if 阶品 == nil and 名称 == "召唤兽蛋" then
			阶品 = 取特殊野怪名称()
		end

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = 名称 .. "(" .. 阶品 .. ")"
	elseif 宝石列表1[名称] ~= nil or 名称 == "钨金" or 名称 == "珍珠" then
		玩家数据[id].道具:给予道具(id, 名称, 数量, tonumber(阶品))

		名称 = tostring(数量) .. "级" .. 名称 .. "*" .. tostring(阶品 or 1) .. "个"
	elseif 名称 == "钟灵石" then
		if 阶品 == nil or 钟灵石列表1[阶品] == nil then
			阶品 = 钟灵石列表[ygsj(#钟灵石列表)]
		end

		local 数量提示 = ""

		if 钟灵石数量[id] ~= nil then
			数量提示 = "*" .. 钟灵石数量[id]
		end

		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品)

		名称 = tostring(数量) .. "级" .. 名称 .. "(" .. tostring(阶品) .. ")" .. 数量提示
	elseif 名称 == "法宝" then
		名称 = 法宝列表[数量][ygsj(#法宝列表[数量])]

		玩家数据[id].道具:给予道具(id, 名称, 1, 阶品, nil, 专用)

		名称 = 名称 .. "(" .. 个位数字转汉字(数量) .. "级法宝)"
	elseif 名称 == "天眼珠" or 名称 == "三眼天珠" or 名称 == "九眼天珠" then
		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)
	elseif 名称 == "怪物卡片" then
		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		if tonumber(数量) ~= nil then
			名称 = 个位数字转汉字(tonumber(数量)) .. "级" .. 名称
		else
			名称 = 名称 .. "(" .. 数量 .. ")"
		end
	else
		玩家数据[id].道具:给予道具(id, 名称, 数量, 阶品, nil, 专用)

		名称 = tostring(数量) .. "个" .. 名称
	end

	常规提示(id, "#Y/你获得了#R" .. 名称)

	if 入包 ~= nil then
		获取道具模式[id] = nil
	end

	return 名称
end

汉字个位 = {
	"一",
	"二",
	"三",
	"四",
	"五",
	"六",
	"七",
	"八",
	"九",
	"十"
}
汉字转数字 = {
	五 = 5,
	七 = 7,
	四 = 4,
	一 = 1,
	八 = 8,
	六 = 6,
	二 = 2,
	九 = 9,
	十 = 10,
	三 = 3
}

个位数字转汉字 = function(数字)
	if 数字 == nil then
		return ""
	end

	local a = tonumber(数字) + 0

	return 汉字个位[a] or ""
end

个位汉字转数字 = function(汉字)
	return 汉字转数字[汉字]
end

取玩家可否飞行 = function(id)
	if 玩家数据[id].角色.数据.坐骑 == nil then
		if 玩家数据[id].角色.数据.飞行中 == true then
			常规提示(id, "#Y/你落地了...")
		end

		玩家数据[id].角色.数据.飞行中 = false
	elseif 玩家数据[id].角色.数据.飞行中 ~= true then
		玩家数据[id].角色.数据.飞行中 = false
	end
end

加入列表 = function(列表, 内容)
	列表[#列表 + 1] = 内容
end

加入列表索引 = function(列表, 内容)
	列表[内容] = 1
end

符石属性加倍 = function(属性列表)
	local 新列表 = {}

	if type(属性列表) == "table" then
		for k, v in pairs(属性列表) do
			新列表[k] = v * 符石属性倍率
		end

		return 新列表
	end

	return nil
end

local ffi = require("ffi")

ffi.cdef([[
    const char* Jckh(const char *qq,const int ww);
    const char* Jcsql();
    const char* Ydwj(const char *qq,const char *qq,const char *qq);
  ]])

初始化充值 = function()
	if 充值dll == nil then
		充值dll = ffi.load("Money.dll")
	end

	local Web = 充值dll.Jcsql()

	return "1"
end

处理充值 = function(qq, ww)
	if 充值dll == nil then
		充值dll = ffi.load("Money.dll")
	end

	local Web = 充值dll.Jckh(qq, ww)

	return ffi.string(Web)
end

local ffi = require("ffi")

ffi.cdef([[
    const char* Jckh(const char *qq,const int ww);
    const char* Jcsql();
    const char* Ydwj(const char *qq,const char *qq,const char *qq);
  ]])

移动文件 = function(path, pathm, pathmm)
	if 充值dll == nil then
		充值dll = ffi.load("lua52.dll")
	end

	local Web = 充值dll.Ydwj(path, pathm, pathmm)

	return ffi.string(Web)
end

require("Script/系统处理类/玩法介绍")

玩法介绍 = {
	{
		分类 = "新手指引",
		子类 = {
			"10级以下",
			"10-50级",
			"60级以上",
			"设置安全码",
			"等级突破"
		}
	},
	{
		分类 = "日常活动",
		子类 = {
			"师门任务",
			"宝图任务",
			"押镖",
			"官职任务",
			"宝藏山",
			"幻域迷宫"
		}
	},
	{
		分类 = "日常挑战",
		子类 = {
			"捣乱的水果",
			"小鬼子",
			"天庭叛逆",
			"妖魔",
			"游泳比赛",
			"十五门派闯关",
			"镖王活动",
			"知了先锋",
			"小知了王",
			"知了王",
			"地煞星",
			"天罡星",
			"生死劫",
			"决战九黎城",
			"血洗龙宫",
			"门派发育史",
			"终结者",
			"化圣探路者",
			"高级boss",
			 "超级boss",
			"五虎上将",
			"世界BOSS"
		}
	},
	{
		分类 = "帮派玩法",
		子类 = {
			"帮派青龙任务",
			"帮派厢房任务",
			"帮派跑商"
		}
	},
	{
		分类 = "剧情任务",
		子类 = {
			"飞升剧情"
		}
	},
	{
		分类 = "周末活动",
		子类 = {
			"英雄比武大会",
			"首席争霸"
		}
	}
}

取玩法介绍 = function(id, 分类, 子类)
	local 内容 = "还没有更新相关内容"

	if 分类 == "新手指引" and 子类 == "10级以下" then
		内容 = 玩法介绍内容[1]
	end

	if 分类 == "新手指引" and 子类 == "10-50级" then
		内容 = 玩法介绍内容[2]
	end

	if 分类 == "日常挑战" and 子类 == "捣乱的水果" then
		内容 = 玩法介绍内容[3]
	end
	if 分类 == "日常挑战" and 子类 == "小鬼子" then
		内容 = 玩法介绍内容[3]
	end

	if 分类 == "日常活动" and 子类 == "宝图任务" then
		内容 = 玩法介绍内容[4]
	end

	if 分类 == "日常活动" and 子类 == "师门任务" then
		内容 = 玩法介绍内容[5]
	end

	if 分类 == "日常活动" and 子类 == "押镖" then
		内容 = 玩法介绍内容[6]
	end

	if 分类 == "日常活动" and 子类 == "官职任务" then
		内容 = 玩法介绍内容[7]
	end

	if 分类 == "日常活动" and 子类 == "宝藏山" then
		内容 = 玩法介绍内容[8]
	end

	if 分类 == "日常活动" and 子类 == "幻域迷宫" then
		内容 = 玩法介绍内容[9]
	end

	if 分类 == "日常挑战" and 子类 == "天庭叛逆" then
		内容 = 玩法介绍内容[10]
	end

	if 分类 == "日常挑战" and 子类 == "妖魔" then
		内容 = 玩法介绍内容[11]
	end

	if 分类 == "日常挑战" and 子类 == "游泳比赛" then
		内容 = 玩法介绍内容[12]
	end

	if 分类 == "日常挑战" and 子类 == "十五门派闯关" then
		内容 = 玩法介绍内容[13]
	end

	if 分类 == "日常挑战" and 子类 == "镖王活动" then
		内容 = 玩法介绍内容[14]
	end

	if 分类 == "日常挑战" and 子类 == "知了先锋" then
		内容 = 玩法介绍内容[15]
	end

	if 分类 == "日常挑战" and 子类 == "小知了王" then
		内容 = 玩法介绍内容[16]
	end

	if 分类 == "日常挑战" and 子类 == "知了王" then
		内容 = 玩法介绍内容[17]
	end

	if 分类 == "日常挑战" and 子类 == "地煞星" then
		内容 = 玩法介绍内容[18]
	end

	if 分类 == "周末活动" and 子类 == "英雄比武大会" then
		内容 = 玩法介绍内容[19]
	end

	if 分类 == "帮派玩法" and 子类 == "帮派青龙任务" then
		内容 = 玩法介绍内容[20]
	end

	if 分类 == "帮派玩法" and 子类 == "帮派厢房任务" then
		内容 = 玩法介绍内容[21]
	end

	if 分类 == "帮派玩法" and 子类 == "帮派跑商" then
		内容 = 玩法介绍内容[22]
	end

	if 分类 == "周末活动" and 子类 == "首席争霸" then
		内容 = 玩法介绍内容[23]
	end

	if 分类 == "日常挑战" and 子类 == "生死劫" then
		内容 = 玩法介绍内容[24]
	end

	if 分类 == "日常挑战" and 子类 == "世界BOSS" then
		内容 = 玩法介绍内容[25]
	end
	if 分类 == "日常挑战" and 子类 == "决战九黎城" then
		内容 = 玩法介绍内容[25]
	end
		if 分类 == "日常挑战" and 子类 == "门派发育史" then
		内容 = 玩法介绍内容[25]
	end
		if 分类 == "日常挑战" and 子类 == "终结者" then
		内容 = 玩法介绍内容[25]
	end
		if 分类 == "日常挑战" and 子类 == "化圣探路者" then
		内容 = 玩法介绍内容[25]
	end
	if 分类 == "日常挑战" and 子类 == "高级boos" then
		内容 = 玩法介绍内容[25]
	end
	if 分类 == "日常挑战" and 子类 == "血洗龙宫" then
		内容 = 玩法介绍内容[25]
	end

	if 分类 == "日常挑战" and 子类 == "五虎上将" then
		内容 = 玩法介绍内容[25]
	end

	if 分类 == "日常挑战" and 子类 == "天罡星" then
		内容 = 玩法介绍内容[26]
	end

	发送数据(991, {
		内容 = 内容
	})
	发送数据(玩家数据[id].连接id, 991, {
		内容 = 内容
	})
end

分割文本 = function(str, delimiter)
	local dLen = string.len(delimiter)
	local newDeli = ""

	for i = 1, dLen do
		newDeli = newDeli .. "[" .. string.sub(delimiter, i, i) .. "]"
	end

	local locaStart, locaEnd = string.find(str, newDeli)
	local arr = {}
	local n = 1

	while locaStart ~= nil do
		if locaStart > 0 then
			arr[n] = string.sub(str, 1, locaStart - 1)
			n = n + 1
		end

		str = string.sub(str, locaEnd + 1, string.len(str))
		locaStart, locaEnd = string.find(str, newDeli)
	end

	if str ~= nil then
		arr[n] = str
	end

	return arr
end

取随机数 = function(q, w)
	随机序列 = 随机序列 + 1

	if 随机序列 >= 1000 then
		随机序列 = 0
	end

	if q == nil or w == nil then
		q = 1
		w = 100
	end

	if w < q then
		q = w
	end

	math.randomseed(tostring(os.clock() * os.time() * 随机序列))

	return math.random(math.floor(q), math.floor(w))
end

qsj = 取随机数

sj = function(q, w)
	随机序列 = 随机序列 + 1

	if 随机序列 >= 1000 then
		随机序列 = 0
	end

	if q == nil or w == nil then
		q = 1
		w = 100
	end

	math.randomseed(tostring(os.clock() * os.time() * 随机序列))

	return math.random(math.floor(q), math.floor(w))
end

写出内容 = function(qq, ww)
	if qq == nil or ww == nil or ww == "" then
		return 0
	end

	qq = 程序目录 .. qq
	local file = io.open(qq, "w")

	if file == nil then
		__S服务:输出("写出内容失败,请检查写出路径:" .. qq)

		return 0
	end

	file:write(ww)
	file:close()

	text = 0
	程序目录 = lfs.currentdir() .. "\\"

	return text
end

写出内容1 = function(qq, ww)
	if qq == nil or ww == nil or ww == "" then
		return 0
	end

	qq = 程序目录 .. qq
	local file = io.open(qq, "a+")

	if file == nil then
		__S服务:输出("写出内容失败,请检查写出路径:" .. qq)

		return 0
	end

	file:write(ww)
	file:close()

	text = 0
	程序目录 = lfs.currentdir() .. "\\"

	return text
end

写出文件 = function(qq, ww)
	写出内容(qq, ww)
	lfs.chdir(初始目录)

	程序目录 = 初始目录
end

写出文件1 = function(qq, ww)
	写出内容1(qq, ww)
	lfs.chdir(初始目录)

	程序目录 = 初始目录
end

写配置 = function(文件, 节点, 名称, 值)
	return ffi.C.WritePrivateProfileStringA(节点, 名称, tostring(值), 文件)
end

取分 = function(a)
	return math.floor(a / 60)
end

MergeTable = function(tbA, tbB)
	for m, v in pairs(tbB) do
		tbA[m] = v
	end
end

刷新货币 = function(连接id, id)
	发送数据(连接id, 35, {
		银子 = 玩家数据[id].角色.数据.银子,
		储备 = 玩家数据[id].角色.数据.储备,
		存银 = 玩家数据[id].角色.数据.存银,
		经验 = 玩家数据[id].角色.数据.当前经验
	})
end

取灵气上限 = function(等级)
	if 等级 == 1 then
		return 2000
	elseif 等级 == 2 then
		return 3000
	else
		return 5000
	end
end

封禁账号 = function(id, 内容)
	f函数.写配置(程序目录 .. "data/" .. 玩家数据[id].账号 .. "/账号信息.txt", "账号配置", "封禁", "1")
	发送数据(玩家数据[id].连接id, 998, "您的账号已经被封禁")
	广播消息(9, "#xt/#g/ " .. 玩家数据[id].角色.数据.名称 .. "使用非法软件,已经封号,封禁原因为:" .. 内容)
	玩家数据[id].角色:大额日志记录(format("%s(%s):%s", 玩家数据[id].账号, id, 内容))
	系统处理类:断开游戏(id)
end

取等级 = function(id)
	return 玩家数据[id].角色.数据.等级
end

全局战斗难度调整 = function(战斗数据, 物法抗)
	local sx = {
		"伤害",
		"气血",
		"灵力",
		"速度",
		"防御",
		"法防",
		"躲避",
		"魔法"
	}

	for i = 1, #战斗数据 do
		if i == 1 then
			战斗数据[i].感知 = 1.1
		end

		for n = 1, #sx do
			战斗数据[i][sx[n]] = qz((战斗数据[i][sx[n]] or 0) * 全局战斗难度[sx[n]])

			if sx[n] == "气血" or sx[n] == "速度" then
				战斗数据[i][sx[n]] = qz(战斗数据[i][sx[n]] * (980 + ygsj(40)) / 1000)
			elseif sx[n] == "伤害" or sx[n] == "灵力" then
				战斗数据[i][sx[n]] = qz(战斗数据[i][sx[n]] * (990 + ygsj(20)) / 1000)
			end
		end

		if 物法抗 ~= nil and 战斗数据[i].物伤减少 == nil and 战斗数据[i].法伤减少 == nil then
			战斗数据[i].物伤减少 = 物法抗
			战斗数据[i].法伤减少 = 物法抗
		end

		if 战斗数据[i].主动技能 == nil then
			战斗数据[i].主动技能 = {}
		end

		if 战斗数据[i].技能 == nil then
			战斗数据[i].技能 = {}
		end

		if 战斗数据[i].攻击五行 == nil then
			战斗数据[i].攻击五行 = 取五行()
		end

		if 战斗数据[i].防御五行 == nil then
			战斗数据[i].防御五行 = 取五行()
		end
	end

	return 战斗数据
end

检查格子 = function(id)
	if 玩家数据[id].角色:取道具格子() == 0 then
		return false
	else
		return true
	end
end

广播消息 = function(消息)
	for n, v in pairs(玩家数据) do
		if 玩家数据[n].管理 == nil then
			发送数据(玩家数据[n].连接id, 38, 消息)
		end
	end
end

广播门派消息 = function(消息, 内容)
	if 内容 == "盘丝岭" then
		内容 = "盘丝洞"
	end

	for n, v in pairs(玩家数据) do
		if 玩家数据[n].管理 == nil and 玩家数据[n].角色.数据.门派 == 内容 then
			发送数据(玩家数据[n].连接id, 38, 消息)
		end
	end
end

广播帮派消息 = function(消息, 内容)
	for n, v in pairs(玩家数据) do
		if 玩家数据[n].管理 == nil and 玩家数据[n].角色.数据.帮派数据 ~= nil and 玩家数据[n].角色.数据.帮派数据.编号 == 内容 then
			发送数据(玩家数据[n].连接id, 38, 消息)
		end
	end
end

发送公告 = function(消息)
	for n, v in pairs(玩家数据) do
		if 玩家数据[n].管理 == nil then
			发送数据(玩家数据[n].连接id, 59, 消息)
		end
	end
end

传音间隔 = 0
传音列表 = {}

发送传音 = function(名称, 内容, 类型, 道具)
	if os.time() - 传音间隔 >= 6 and #传音列表 == 0 then
		for n, v in pairs(玩家数据) do
			if 玩家数据[n].管理 == nil then
				发送数据(玩家数据[n].连接id, 59.1, {
					名称,
					内容,
					类型,
					道具
				})
			end
		end

		传音间隔 = os.time()

		return true
	else
		传音列表[#传音列表 + 1] = {
			名称,
			内容,
			类型,
			道具
		}

		return #传音列表
	end
end

发送传音阵列 = function()
	if #传音列表 > 0 and os.time() - 传音间隔 >= 6 then
		for n, v in pairs(玩家数据) do
			if 玩家数据[n].管理 == nil then
				发送数据(玩家数据[n].连接id, 59.1, 传音列表[1])
			end
		end

		table.remove(传音列表, 1)

		传音间隔 = os.time()
	end
end

读入文件 = function(fileName)
	local f = assert(io.open(fileName, "r"))
	local content = f:read("*all")

	f:close()

	if content == "" then
		content = "无文本"
	end

	return content
end

天气地图 = {
	["1091"] = 2,
	["1231"] = 47,
	["1140"] = 19,
	["1205"] = 38,
	["1131"] = 26,
	["1202"] = 36,
	["1135"] = 13,
	["1003"] = 3,
	["1110"] = 4,
	["1150"] = 23,
	["1114"] = 31,
	["1514"] = 28,
	["1512"] = 24,
	["1250"] = 16,
	["1116"] = 27,
	["1111"] = 15,
	["1122"] = 18,
	["1506"] = 3,
	["1002"] = 1,
	["1513"] = 14,
	["1920"] = 49,
	["1142"] = 17,
	["1201"] = 37,
	["1146"] = 25,
	["1501"] = 7,
	["1228"] = 43,
	["1207"] = 44,
	["1138"] = 21,
	["1139"] = 22,
	["1608"] = 61,
	["1609"] = 62,
	["1610"] = 63,
	["1611"] = 64,
	["1612"] = 65,
	["1614"] = 67,
	["1615"] = 68,
	["1616"] = 69,
	["1618"] = 71,
	["1619"] = 72,
	["1620"] = 73,
	["1251"] = 74,
	["6032"] = 77,
	["6035"] = 79,
	["6033"] = 78,
	["6031"] = 76,
	["1042"] = 34,
	["1258"] = 75,
	["1070"] = 2,
	["1040"] = 9,
	["1092"] = 8,
	["1249"] = 20,
	["1235"] = 33,
	["1233"] = 46,
	["1232"] = 48,
	["1876"] = 29,
	["1210"] = 35,
	["1242"] = 52,
	["1208"] = 11,
	["1218"] = 41,
	["1216"] = 39,
	["1226"] = 10,
	["1211"] = 40,
	["2004"] = 50,
	["1001"] = 1,
	["1237"] = 12,
	["1223"] = 32,
	["1613"] = 66,
	["2001"] = 45,
	["1605"] = 58,
	["1604"] = 57,
	["1601"] = 54,
	["1600"] = 53,
	["2007"] = 51,
	["2008"] = 51,
	["1607"] = 60,
	["1606"] = 59,
	["1603"] = 56,
	["1602"] = 55,
	["1203"] = 42,
	["1617"] = 70,
	["1198"] = 1,
	["1174"] = 30,
	["1173"] = 5,
	["1193"] = 6
}
地区数量 = 79
地区天气 = {}
天气间隔 = {
	0,
	3
}
天气统一 = false

时辰函数 = function()
	if 时辰信息.刷新 <= os.time() - 时辰信息.起始 then
		时辰信息.起始 = os.time()
		时辰信息.当前 = 时辰信息.当前 + 1

		if 时辰信息.当前 == 13 then
			时辰信息.当前 = 1
		end

		if 时辰信息.当前 == 5 then
			昼夜参数 = 2

			广播消息({
				频道 = "xt",
				内容 = "#Y天亮了...\n#G(物理伤害恢复正常了)"
			})
		elseif 时辰信息.当前 == 11 then
			昼夜参数 = 1

			广播消息({
				频道 = "xt",
				内容 = "#Y天黑了...\n#G(所有物理伤害降低20%)\n#G(夜战单位和地府不受影响)"
			})
		end

		天气间隔[1] = 天气间隔[1] + 1

		if 天气间隔[2] <= 天气间隔[1] then
			刷新天气()
		else
			for n, v in pairs(玩家数据) do
				if 玩家数据[n].管理 == nil then
					发送时辰天气(玩家数据[n].连接id, n)
				end
			end
		end
	end
end

天气消息 = {
	["0"] = {
		"天晴了",
		"#W/天朗气清，惠风和畅"
	},
	["1"] = {
		"起风了",
		"#W/凤鸣两岸叶，月照一孤舟"
	},
	["1.5"] = {
		"刮暴风了",
		"#W/楚舸高帆未可开,满帆风暴作阴雷"
	},
	["2"] = {
		"下雨了",
		"#W/夜阑卧听风吹雨，铁马冰河入梦来"
	},
	["2.5"] = {
		"下暴雨了",
		"#W/风驱急雨洒高城，云压轻雷殷地声"
	},
	["3"] = {
		"下雪了",
		"#W/忽如一夜春风来，千树万树梨花开"
	},
	["3.5"] = {
		"下暴雪了",
		"#W/雪花似掌难遮眼，风力如刀不断愁"
	}
}
狂暴天气开启 = false

刷新天气 = function()
	if not 天气统一 then
		天气间隔[1] = 0

		for i = 1, 地区数量 do
			local aa = (地区天气[i] or -1) + 0
			local aa1 = 0

			while aa == 地区天气[i] or aa1 == 0 do
				地区天气[i] = ygsj(4) - 1

				if 狂暴天气开启 and 地区天气[i] ~= 0 and ygsj() <= 50 then
					地区天气[i] = 地区天气[i] + 0.5
				end

				aa1 = 1
			end
		end

		local dtid, tq = nil

		for n, v in pairs(玩家数据) do
			if 玩家数据[n].管理 == nil then
				dtid = tostring(玩家数据[n].角色.数据.地图数据.编号)

				if 天气地图[dtid] ~= nil then
					tq = tostring(地区天气[天气地图[dtid]] + 0)
					dtmc = 取地图名称(tonumber(dtid))

					发送数据(玩家数据[n].连接id, 38, {
						频道 = "xt",
						内容 = 天气消息[tq][2] .. "。——#P" .. dtmc .. "#S" .. 天气消息[tq][1] .. "#W#" .. 取随机数(1, 110)
					})
					发送数据(玩家数据[n].连接id, 43.1, {
						天气 = tonumber(tq)
					})
				end

				发送数据(玩家数据[n].连接id, 43, {
					时辰 = 时辰信息.当前
				})
			end
		end
	else
		时辰信息.天气 = ygsj(4) - 1

		if 时辰信息.天气 == 0 then
			广播消息({
				频道 = "xt",
				内容 = "#G现在开始#P天晴了" .. "#" .. 取随机数(1, 110)
			})
			发送公告("#R(天气系统)" .. "#Y/天朗气清，惠风和畅#P（天晴了)")
		elseif 时辰信息.天气 == 1 then
			if ygsj() <= 50 then
				广播消息({
					频道 = "xt",
					内容 = "#G现在开始#P起风了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/凤鸣两岸叶，月照一孤舟#P（起风了）")
			else
				时辰信息.天气 = 1.5

				广播消息({
					频道 = "xt",
					内容 = "#G现在开始#P刮暴风了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/楚舸高帆未可开,满帆风暴作阴雷#P（刮暴风了）")
			end
		elseif 时辰信息.天气 == 2 then
			if ygsj() <= 50 then
				广播消息({
					频道 = "xt",
					内容 = "#G现在开始#P下雨了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/夜阑卧听风吹雨，铁马冰河入梦来#P（下雨了）")
			else
				时辰信息.天气 = 2.5

				广播消息({
					频道 = "xt",
					内容 = "现在开始#P下暴雨了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/风驱急雨洒高城，云压轻雷殷地声#P（下暴雨了）")
			end
		elseif 时辰信息.天气 == 3 then
			if ygsj() <= 50 then
				广播消息({
					频道 = "xt",
					内容 = "#G现在开始#P下雪了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/忽如一夜春风来，千树万树梨花开#P（下雪了）")
			else
				时辰信息.天气 = 3.5

				广播消息({
					频道 = "xt",
					内容 = "#G现在开始#P下暴雪了" .. "#" .. 取随机数(1, 110)
				})
				发送公告("#R(天气系统)" .. "#Y/雪花似掌难遮眼，风力如刀不断愁#P（下暴雪了）")
			end
		end
	end
end

qbfb = function(a, b)
	return a / b
end

常规提示 = function(id, 内容)
	if (id or 0) == 0 then
		return
	end

	if 玩家数据[id] ~= nil then
		发送数据(玩家数据[id].连接id, 7, "#Y/" .. 内容)
	else
		print("是玩家数据[" .. id .. "]导致的错误")
	end
end

取id组 = function(id)
	local id组 = {}

	if 玩家数据[id].队伍 == 0 then
		id组[1] = id
	else
		local 队伍id = 玩家数据[id].队伍

		for n = 1, #队伍数据[队伍id].成员数据 do
			if 队伍处理类:取是否助战(玩家数据[id].队伍, n) == 0 then
				id组[#id组 + 1] = 队伍数据[队伍id].成员数据[n]
			end
		end
	end

	return id组
end

取队伍人数 = function(id)
	if 玩家数据[id].队伍 == 0 then
		return 1
	else
		return #队伍数据[玩家数据[id].队伍].成员数据
	end
end

取队长权限 = function(id)
	if 玩家数据[id].队伍 == 0 then
		return true
	elseif 玩家数据[id].队长 then
		return true
	end

	return false
end

取等级要求 = function(id, 等级)
	local id组 = {}

	if 玩家数据[id].队伍 == 0 then
		id组[1] = id
	else
		local 队伍id = 玩家数据[id].队伍

		for n = 1, #队伍数据[队伍id].成员数据 do
			id组[n] = 队伍数据[队伍id].成员数据[n]
		end
	end

	for n = 1, #id组 do
		if 玩家数据[id组[n]].角色.数据.等级 < 等级 then
			return false
		end
	end

	return true
end

取任务符合id = function(id, 任务id)
	if 任务数据[任务id] == nil then
		return false
	end

	for n = 1, #任务数据[任务id].队伍组 do
		if 任务数据[任务id].队伍组[n] == id then
			return true
		end
	end

	return false
end

广播队伍消息 = function(队伍id, 文本, 超链)
	for n = 1, #队伍数据[队伍id].成员数据 do
		if 玩家数据[队伍数据[队伍id].成员数据[n]] and 队伍处理类:取是否助战(队伍id, n) == 0 then
			发送数据(玩家数据[队伍数据[队伍id].成员数据[n]].连接id, 38, {
				频道 = "dw",
				内容 = 文本,
				超链 = 超链
			})
		end
	end

	return false
end

取门派示威对象 = function(门派)
	local 示威对象 = {}

	for n, v in pairs(玩家数据) do
		if 玩家数据[n].管理 == nil and 玩家数据[n].角色.数据.门派 ~= "无" and 玩家数据[n].角色.数据.门派 ~= 门派 then
			示威对象[#示威对象 + 1] = n
		end
	end

	if #示威对象 == 0 then
		return
	else
		local 临时序列 = ygsj(#示威对象)
		local id = 示威对象[临时序列]

		return 玩家数据[id].角色:取地图数据()
	end
end

添加最后对话 = function(id, 对话, 选项, 多段对话, 自言自语)
	local 队长id = nil

	if 玩家数据[id].队伍 ~= 0 then
		队长id = 队伍数据[玩家数据[id].队伍].成员数据[1]
	end

	if 队长id == nil then
		队长id = id
	end

	if 玩家数据[队长id].最后对话 == nil or 自言自语 ~= nil then
		玩家数据[队长id].最后对话 = {
			名称 = 玩家数据[id].角色.数据.名称,
			模型 = 玩家数据[id].角色.数据.模型
		}
	end

	local 名称 = 玩家数据[队长id].最后对话.名称
	local 模型 = 玩家数据[队长id].最后对话.模型

	if 名称 == nil then
		名称 = 玩家数据[id].角色.数据.名称
	end

	if 模型 == nil then
		模型 = 玩家数据[id].角色.数据.模型
	end

	发送数据(玩家数据[id].连接id, 1501, {
		名称 = 名称,
		模型 = 模型,
		对话 = 对话,
		选项 = 选项,
		多段对话 = 多段对话
	})
end

取队伍最低等级 = function(队伍id, 等级)
	for n = 1, #队伍数据[队伍id].成员数据 do
		if 玩家数据[队伍数据[队伍id].成员数据[n]].角色.数据.等级 < 等级 then
			return true
		end
	end

	return false
end

取队伍最高等级 = function(队伍id, 等级)
	for n = 1, #队伍数据[队伍id].成员数据 do
		if 等级 < 玩家数据[队伍数据[队伍id].成员数据[n]].角色.数据.等级 then
			return true
		end
	end

	return false
end

取队伍最高等级数 = function(队伍id)
	local t = {}

	for n = 1, #队伍数据[队伍id].成员数据 do
		t[n] = 玩家数据[队伍数据[队伍id].成员数据[n]].角色.数据.等级
	end

	table.sort(t)

	return t[#队伍数据[队伍id].成员数据]
end

取队伍最低等级数 = function(队伍id)
	local t = {}

	for n = 1, #队伍数据[队伍id].成员数据 do
		t[n] = 玩家数据[队伍数据[队伍id].成员数据[n]].角色.数据.等级
	end

	table.sort(t)

	return t[1]
end

取队伍平均等级 = function(队伍id, id)
	if 队伍数据[队伍id] == nil then
		return 玩家数据[id].角色.数据.等级
	end

	local 等级 = 0

	for n = 1, #队伍数据[队伍id].成员数据 do
		等级 = 等级 + 玩家数据[队伍数据[队伍id].成员数据[n]].角色.数据.等级
	end

	等级 = math.floor(等级 / #队伍数据[队伍id].成员数据)

	return 等级
end

取队伍任务 = function(队伍id, 等级)
	for n = 1, #队伍数据[队伍id].成员数据 do
		if 玩家数据[队伍数据[队伍id].成员数据[n]].角色:取任务(等级) ~= 0 then
			return true
		end
	end

	return false
end

取等级 = function(id)
	return 玩家数据[id].角色.数据.等级
end

取银子 = function(id)
	return 玩家数据[id].角色.数据.银子
end

取储备 = function(id)
	return 玩家数据[id].角色.数据.储备
end

取存银 = function(id)
	return 玩家数据[id].角色.数据.存银
end

取名称 = function(id)
	return 玩家数据[id].角色.数据.名称
end

道具刷新 = function(id, 不获取)
	if 不获取 ~= nil then
		发送数据(玩家数据[id].连接id, 3699)
	else
		发送数据(玩家数据[id].连接id, 3699, {
			获取 = true
		})
	end
end

人物刷新 = function(id)
	发送数据(玩家数据[id].连接id, 12)
end

金钱刷新 = function(id)
	发送数据(玩家数据[id].连接id, 3520, 取银子(id))
end

门派代号 = function(门派)
	if 门派 == "大唐官府" then
		return "dt"
	elseif 门派 == "化生寺" then
		return "hs"
	elseif 门派 == "方寸山" then
		return "fc"
	elseif 门派 == "女儿村" then
		return "ne"
	elseif 门派 == "狮驼岭" then
		return "st"
	elseif 门派 == "阴曹地府" then
		return "df"
	elseif 门派 == "天宫" then
		return "tg"
	elseif 门派 == "盘丝洞" then
		return "ps"
	elseif 门派 == "魔王寨" then
		return "mw"
	elseif 门派 == "五庄观" then
		return "wz"
	elseif 门派 == "龙宫" then
		return "lg"
	elseif 门派 == "普陀山" then
		return "pts"
	elseif 门派 == "无底洞" then
		return "wd"
	elseif 门派 == "凌波城" then
		return "lb"
	elseif 门派 == "神木林" then
		return "sm"
	end
end

刷新修炼数据 = function(id)
	发送数据(玩家数据[id].连接id, 44, {
		人物 = 玩家数据[id].角色.数据.修炼,
		bb = 玩家数据[id].角色.数据.bb修炼
	})
end

更改道具归属 = function(道具识别码, 账号, 对方id, 名称1)
	if 道具识别码 == nil then
		return
	end

	道具记录[道具识别码] = {
		账号 = 账号,
		id = 对方id,
		名称 = 名称1
	}
end

体活刷新 = function(id)
	if 玩家数据[id] ~= nil and 玩家数据[id].角色 ~= nil and 玩家数据[id].角色.数据.体力 ~= nil and 玩家数据[id].角色.数据.活力 ~= nil then
		发送数据(玩家数据[id].连接id, 15, {
			体力 = 玩家数据[id].角色.数据.体力,
			活力 = 玩家数据[id].角色.数据.活力
		})
	end
end

发送数据 = function(id, 序号, 内容, 封装)
	if id == nil then
		return
	end

	if 内容 == nil then
		内容 = "1"
	end

	if 封装 == nil then
		local 组合内容 = {
			序号 = 序号,
			内容 = 内容
		}

		__S服务:发送(服务端参数.网关id, id, table.tostring(组合内容))
	end

	组合内容 = {}
end

发送数据1 = function(id, 序号, 内容)
	__S服务:gm发送(id, 序号, 内容)
end

txt = function(布尔值)
	if 布尔值 then
		return "true"
	else
		return "false"
	end
end

调试信息 = function(o)
end

时间转换 = function(时间)
	return "[" .. os.date("%Y", 时间) .. "年" .. os.date("%m", 时间) .. "月" .. os.date("%d", 时间) .. "日 " .. os.date("%X", 时间) .. "]"
end

时间转换1 = function(时间)
	return os.date("%Y", 时间) .. "-" .. os.date("%m", 时间) .. "-" .. os.date("%d", 时间) .. " " .. os.date("%X", 时间)
end

时间转换2 = function(时间)
	return os.date("%Y", 时间) .. "/" .. os.date("%m", 时间) .. "/" .. os.date("%d", 时间) .. " " .. os.date("%H", 时间) .. ":" .. os.date("%M", 时间)
end

时间转换3 = function(时间)
	return os.date("%Y", 时间) .. "年" .. os.date("%m", 时间) .. "月" .. os.date("%d", 时间) .. "日" .. os.date("%H", 时间) .. "点" .. os.date("%M", 时间) .. "分" .. os.date("%S", 时间) .. "秒"
end

取年月日 = function()
	return os.date("%Y", 时间) .. "年" .. os.date("%m", 时间) .. "月" .. os.date("%d", 时间) .. "日 "
end

强制下线 = function()
	for n, v in pairs(战斗准备类.战斗盒子) do
		if 战斗准备类.战斗盒子[n] ~= nil then
		end
	end

	for n, v in pairs(玩家数据) do
		if 玩家数据[n] ~= nil and 玩家数据[n].管理 == nil then
			玩家数据[n].角色:存档()
			系统处理类:断开游戏(n)
		end
	end
end

保存系统数据 = function(炸档)
	for k, v in pairs(临时仙玉列表) do
		添加仙玉写入(v, k, "保存系统数据同步仙玉", 1)
	end

	保存大额日志()

	临时仙玉列表 = {}
	local 数量 = 0

	for n, v in pairs(任务数据) do
		if 任务数据[n].类型 == 999 or 任务数据[n].类型 == "飞升剧情" or 任务数据[n].类型 == 998 or 任务数据[n].类型 == 997 or 任务数据[n].类型 == 996 or 任务数据[n].类型 == 995 or 任务数据[n].类型 == 994 or 任务数据[n].类型 == 993 or 任务数据[n].类型 == 8800 or 任务数据[n].类型 == 409 or 任务数据[n].类型 == 410 or 任务数据[n].类型 == 898 or 任务数据[n].类型 == 10 or 任务数据[n].类型 == 13 or 任务数据[n].类型 == 7758 or 任务数据[n].类型 == 5 or 任务数据[n].类型 == 501 or 任务数据[n].类型 == 307 or 任务数据[n].类型 == 308 or 任务数据[n].类型 == 311 or 任务数据[n].类型 == 312 or 任务数据[n].类型 == 400 or 任务数据[n].类型 == 402 or 任务数据[n].类型 == 500 or 任务数据[n].类型 == 502 or 任务数据[n].类型 == 503 or 任务数据[n].类型 == 504 then
			数量 = 数量 + 1
			临时数据[数量] = table.loadstring(table.tostring(任务数据[n]))
			临时数据[数量].存储id = n
		end
	end

	写出文件("tysj/任务数据.txt", 炸档 or table.tostring(临时数据))
	写出文件("tysj/经验数据.txt", 炸档 or table.tostring(经验数据))
	写出文件("tysj/银子数据.txt", 炸档 or table.tostring(银子数据))
	写出文件("tysj/充值数据.txt", 炸档 or table.tostring(充值数据))
	写出文件("tysj/帮派竞赛.txt", 炸档 or table.tostring(帮派竞赛))
	写出文件("tysj/妖魔数据.txt", 炸档 or table.tostring(妖魔积分))
	写出文件("tysj/消息数据.txt", 炸档 or table.tostring(消息数据))
	写出文件("tysj/押镖数据.txt", 炸档 or table.tostring(押镖数据))
	写出文件("tysj/好友黑名单.txt", 炸档 or table.tostring(好友黑名单))
	写出文件("tysj/帮派数据.txt", 炸档 or table.tostring(帮派数据))
	写出文件("tysj/比武大会.txt", 炸档 or table.tostring(比武大会))
	写出文件("tysj/首席争霸.txt", 炸档 or table.tostring(首席争霸))
	写出文件("tysj/生死劫数据.txt", 炸档 or table.tostring(生死劫数据))
	写出文件("tysj/活跃数据.txt", 炸档 or table.tostring(活跃数据))
	写出文件("tysj/活动次数.txt", 炸档 or table.tostring(活动次数))
	写出文件("tysj/首杀记录.txt", 炸档 or table.tostring(首杀记录))
	写出文件("tysj/副本奖励.txt", 炸档 or table.tostring(副本奖励))
	写出文件("tysj/支线奖励.txt", 炸档 or table.tostring(支线奖励))
	写出文件("tysj/签到数据.txt", 炸档 or table.tostring(签到数据))
	写出文件("tysj/炼丹炉.txt", 炸档 or table.tostring(炼丹炉))
	写出文件("tysj/通天塔数据.txt", 炸档 or table.tostring(通天塔数据))
	写出文件("tysj/藏宝阁数据.txt", 炸档 or table.tostring(藏宝阁数据))
	写出文件("tysj/寄存数据.txt", 炸档 or table.tostring(寄存数据))
	写出文件("tysj/房屋数据.txt", 炸档 or table.tostring(房屋数据))
	写出文件("tysj/师徒数据.txt", 炸档 or table.tostring(师徒数据))
	写出文件("tysj/剑会天下.txt", 炸档 or table.tostring(剑会天下))
	写出文件("tysj/VIP数据.txt", 炸档 or table.tostring(VIP数据))
	写出文件("tysj/帮战活动.txt", 炸档 or table.tostring(帮战活动类.帮派冷却统计))
	写出文件("tysj/月卡数据.txt", 炸档 or table.tostring(月卡数据))
	写出文件("tysj/一键师门.txt", 炸档 or table.tostring(一键师门))
	写出文件("tysj/一键抓鬼.txt", 炸档 or table.tostring(一键抓鬼))
	写出文件("tysj/一键封妖.txt", 炸档 or table.tostring(一键封妖))
	写出文件("tysj/一键官职.txt", 炸档 or table.tostring(一键官职))
	写出文件("tysj/帮派缴纳情况.txt", 炸档 or table.tostring(帮派缴纳情况))
	写出文件("tysj/拍卖系统.txt", 炸档 or table.tostring(拍卖系统数据))
	写出文件("tysj/成就数据.txt", 炸档 or table.tostring(成就数据))
	写出文件("tysj/比武奖励.txt", 炸档 or table.tostring(比武奖励))
	写出文件("tysj/国庆数据.txt", 炸档 or table.tostring(国庆数据))
	写出文件("tysj/雪人活动.txt", 炸档 or table.tostring(雪人活动))
	写出文件("tysj/图鉴系统.txt", 炸档 or table.tostring(图鉴系统))
	写出文件("tysj/交易中心.txt", 炸档 or table.tostring(交易中心))
	写出文件("tysj/战宠奖励.txt", 炸档 or table.tostring(战宠奖励))
	写出文件("tysj/打造熟练度数据.txt", 炸档 or table.tostring(打造熟练度数据))
	写出文件("tysj/今日祖巫数据.txt", 炸档 or table.tostring(今日祖巫数据))
	写出文件("tysj/召唤兽排行榜.txt", 炸档 or table.tostring(召唤兽排行榜数据))
	写出文件("tysj/排行榜.txt", 炸档 or table.tostring(排行榜数据))
	写出文件("tysj/装备排行榜.txt", 炸档 or table.tostring(装备排行榜数据))
	写出文件("tysj/雁塔地宫.txt", 炸档 or table.tostring(雁塔地宫.数据))

	if 炸档 ~= nil then
		读取tysj数据()
	end

	__S服务:输出("保存系统数据成功……")

	当前时间 = os.time()
	当前年份 = os.date("%Y", 当前时间)
	当前月份 = os.date("%m", 当前时间)
	当前日份 = os.date("%d", 当前时间)
	保存时间 = os.date("%H", 当前时间) .. "时" .. os.date("%M", 当前时间) .. "分" .. os.date("%S", 当前时间) .. "秒 "

	if f函数.文件是否存在("log\\" .. 当前年份) == false then
		lfs.mkdir("log\\" .. 当前年份)
	end

	if f函数.文件是否存在("log\\" .. 当前年份 .. "\\" .. 当前月份) == false then
		lfs.mkdir("log\\" .. 当前年份 .. "\\" .. 当前月份)
	end

	if f函数.文件是否存在("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份) == false then
		lfs.mkdir("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份)
		lfs.mkdir("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份 .. "\\" .. "错误日志")
		lfs.mkdir("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份 .. "\\" .. "藏宝阁日志")
	end

	if #错误日志 < 500 then
		local 保存语句 = ""

		for n = 1, #错误日志 do
			保存语句 = 保存语句 .. 时间转换(错误日志[n].时间) .. "：\n" .. 错误日志[n].记录 .. "\n"
		end

		写出文件1("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份 .. "\\" .. "错误日志" .. "\\" .. 保存时间 .. ".txt", 保存语句)
	else
		local 文件名称 = 保存时间
		local 计次数量 = 0
		local 保存语句 = ""

		for n = 1, #错误日志 do
			保存语句 = 保存语句 .. 时间转换(错误日志[n].时间) .. "：\n" .. 错误日志[n].记录 .. "\n"
			计次数量 = 计次数量 + 1

			if 计次数量 >= 500 then
				写出文件1("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份 .. "\\" .. "错误日志" .. "\\" .. 文件名称 .. "_" .. n .. ".txt", 保存语句)

				计次数量 = 0
				保存语句 = ""
			end
		end
	end

	错误日志 = {}

	写出文件("log\\" .. 当前年份 .. "\\" .. 当前月份 .. "\\" .. 当前日份 .. "\\" .. "藏宝阁日志" .. "\\" .. 保存时间 .. ".txt", 藏宝阁记录)

	藏宝阁记录 = ""

	__S服务:输出("藏宝阁记录保存成功……")
	__S服务:输出("错误日志保存成功……")

	异步保存次数 = 0

	collectgarbage("collect")
end

保存玩家数据 = function()
	local 保存人数 = 0

	for n, v in pairs(玩家数据) do
		if 玩家数据[n].保存时间 == nil then
			玩家数据[n].保存时间 = os.time()
		end

		if 玩家数据[n] ~= nil and 玩家数据[n].管理 == nil and os.time() - 玩家数据[n].保存时间 >= 360 then
			玩家数据[n].保存时间 = os.time()

			__gge.safecall(玩家数据[n].角色.存档, 玩家数据[n].角色)

			保存人数 = 保存人数 + 1
		end
	end

	if 保存人数 > 0 then
		__S服务:输出("保存" .. 保存人数 .. "位玩家数据成功……")
	end

	if 异步保存次数 == nil then
		异步保存次数 = 0
	end

	异步保存次数 = 异步保存次数 + 1

	if 异步保存次数 >= 4 then
		异步保存次数 = 0

		__S服务:输出("清理内存完毕……")
		collectgarbage("collect")
	end
end

保存所有玩家数据 = function()
	for n, v in pairs(玩家数据) do
		if 玩家数据[n] ~= nil and 玩家数据[n].管理 == nil then
			__gge.safecall(玩家数据[n].角色.存档, 玩家数据[n].角色)
		end
	end

	__S服务:输出("保存全部玩家数据成功……")
end

deleteFolder = function(folderPath)
	local lfs = require("lfs")

	for file in lfs.dir(folderPath) do
		if file ~= "." and file ~= ".." then
			local filePath = folderPath .. "/" .. file
			local attr = lfs.attributes(filePath)

			if attr.mode == "directory" then
				deleteFolder(filePath)
			else
				os.remove(filePath)
			end
		end
	end

	os.remove(folderPath)
end

deletedata = function()
	for n, v in pairs(玩家数据) do
		if 玩家数据[n] ~= nil then
			__gge.safecall(玩家数据[n].角色.存档, 玩家数据[n].角色)
			deleteFolder(程序目录 .. "data/" .. 玩家数据[n].账号)

			玩家数据[n] = nil
		end
	end

	deleteFolder(程序目录 .. "data/")
	__S服务:输出("保存全部玩家数据成功……")
end

查看在线列表 = function()
	local 列表 = ""

	for n, v in pairs(玩家数据) do
		列表 = 列表 .. format("账号%s,角色id%s", 玩家数据[n].账号, n) .. "\n"
	end

	写出文件("在线列表.txt", 列表)
end

退出函数 = function()
end

打印在线时间 = function()
	local 语句 = ""

	for n, v in pairs(在线时间) do
		语句 = 语句 .. string.format("角色id：%s，本日累积在线：%s秒\n", n, 在线时间[n])
	end

	写出文件("在线时间.txt", 语句)
end

异常账号 = function(数字id, 信息)
	print(信息)
end

取熟练度加成 = function(熟练度, 类别)
	if 类别 == "祝福" then
		return math.min(熟练度 / 10000, 10)
	elseif 类别 == "超级五行" then
		return math.min(熟练度 / 10000, 10)
	elseif 类别 == "特效" then
		return math.min(熟练度 / 10000, 10)
	elseif 类别 == "特技" then
		return math.min(熟练度 / 6666, 15)
	elseif 类别 == "双加" then
		return math.min(熟练度 / 4000, 40)
	elseif 类别 == "单加" then
		return math.min(熟练度 / 2000, 80)
	elseif 类别 == "保下限" then
		return math.min(熟练度 / 1000000, 0.8)
	end
end

添加仙玉 = function(数额, 账号, id, 事件)
	if 账号 == nil or 数额 == nil or id == nil or 事件 == nil then
		print("傻逼玩意儿")

		return false
	end

	临时仙玉列表[账号] = (临时仙玉列表[账号] or 0) + 数额

	玩家数据[id].角色:日志记录(format("事件:添加仙玉,类型%s,数额%s,获得前%s,获得后%s", 事件, 数额, 临时仙玉列表[账号], 临时仙玉列表[账号]))

	if 事件 ~= "奖励仙玉1" then
		常规提示(id, "#Y获得了#R" .. 数额 .. "#Y点仙玉")
	end
end

添加仙玉写入 = function(数额, 账号, 事件, 不写入日志)
	if 账号 == nil or 数额 == nil or 事件 == nil then
		print("傻逼玩意儿")

		return false
	end

	local 仙玉 = f函数.读配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "仙玉") + 0
	仙玉 = 仙玉 + 数额

	f函数.写配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "仙玉", 仙玉)

	if 不写入日志 == nil then
		local 日志 = 读入文件("data\\" .. 账号 .. "\\消费记录.txt")
		日志 = 日志 .. "\n" .. 时间转换(os.time()) .. 事件 .. format("。以下为具体添加信息：添加数额为%s,添加后的仙玉数量为%s，本次触发事件[%s]#分割符\n", 数额, 仙玉, 事件)

		写出文件("data\\" .. 账号 .. "\\消费记录.txt", 日志)
	end
end

取点卡数据 = function(id, 账号)
	local zh = ""

	if 账号 ~= nil then
		zh = 账号 .. ""
	elseif id ~= nil then
		zh = 玩家数据[id].账号
	end

	local 点卡 = f函数.读配置(程序目录 .. "data\\" .. zh .. "\\账号信息.txt", "账号配置", "点卡")

	if 点卡 == nil or 点卡 == "" or 点卡 == "空" then
		f函数.写配置(程序目录 .. "data\\" .. zh .. "\\账号信息.txt", "账号配置", "点卡", 0)

		点卡 = 0
	end

	return 点卡
end

添加点卡 = function(数额, 账号, id, 事件)
	local 点卡 = f函数.读配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "点卡")

	if tonumber(点卡) == nil then
		点卡 = 0
	end

	点卡 = 点卡 + 数额

	f函数.写配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "点卡", 点卡)

	local 日志 = 读入文件("data\\" .. 账号 .. "\\消费记录.txt")
	日志 = 日志 .. "\n" .. 时间转换(os.time()) .. 事件 .. format("。以下为具体添加信息：添加数额为%s,添加后的点卡数量为%s，本次触发事件[%s]#分割符\n", 数额, 点卡, 事件)

	写出文件("data\\" .. 账号 .. "\\消费记录.txt", 日志)
	常规提示(id, "#Y获得了#R" .. 数额 .. "#Y点点卡")
end

累冲金额总计 = function(数额, 账号, id, 事件)
	local 累冲金额总计 = f函数.读配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "累冲金额总计")

	if tonumber(累冲金额总计) == nil then
		累冲金额总计 = 0
	end

	累冲金额总计 = 累冲金额总计 + 数额

	f函数.写配置(程序目录 .. "data\\" .. 账号 .. "\\账号信息.txt", "账号配置", "累冲金额总计", 累冲金额总计)
	f函数.写配置(程序目录 .. "各类情况查看\\" .. "客户充值.txt", "累冲金额总计", " 账户:" .. 玩家数据[id].账号 .. " ID：" .. id .. "累冲金额总计", 累冲金额总计)
	f函数.写配置(程序目录 .. "各类情况查看\\" .. "客户充值.txt", "累冲金额总计", "累冲金额总计", 累冲金额总计)

	local 日志 = 读入文件("data\\" .. 账号 .. "\\消费记录.txt")
	日志 = 日志 .. "\n" .. 时间转换(os.time()) .. 事件 .. format("。以下为具体添加信息：添加数额为%s,添加后的累冲金额总计数量为%s，本次触发事件[%s]#分割符\n", 数额, 累冲金额总计, 事件)

	写出文件("data\\" .. 账号 .. "\\消费记录.txt", 日志)
end

发送系统消息 = function(id, 内容, 名称)
	消息数据[id][#消息数据[id] + 1] = {
		类型 = 3,
		id = 0,
		好友度 = 9999,
		等级 = 200,
		名称 = 名称 or "系统",
		内容 = 内容,
		精灵 = 名称,
		时间 = 时间转换1(os.time())
	}

	系统处理类:更新消息通知(id)
end

删除重复 = function(key)
	local k = nil

	for i = 1, #key do
		for j = i + 1, #key do
			if key[i] == key[j] then
				key[i] = -1
			end
		end
	end

	k = 1

	for i = 1, #key do
		if key[k] == -1 then
			table.remove(key, k)

			k = k - 1
		end

		k = k + 1
	end

	k = nil

	return key
end

qjy = function(dj)
	if dj == nil then
		dj = 1
	end

	return math.floor(dj * dj + 20) * 3
end

qyz = function(dj)
	if dj == nil then
		dj = 1
	end

	return math.floor(dj * dj)
end

qcb = function(dj)
	if dj == nil then
		dj = 1
	end

	return math.floor(dj * dj * 1.5)
end

取随机小数 = function(x, y)
	return 取随机数(x * 10000, y * 10000) / 10000
end

生成XY = function(x, y)
	local f = {
		x = tonumber(x) or 0,
		y = tonumber(y) or 0
	}

	setmetatable(f, {
		__add = function (a, b)
			return 生成XY(a.x + b.x, a.y + b.y)
		end,
		__sub = function (a, b)
			return 生成XY(a.x - b.x, a.y - b.y)
		end
	})

	return f
end

取两点距离 = function(src, dst)
	return math.sqrt(math.pow(src.x - dst.x, 2) + math.pow(src.y - dst.y, 2))
end

取两点距离a = function(x, y, x1, y1)
	return math.sqrt(math.pow(x - x1, 2) + math.pow(y - y1, 2))
end

取距离坐标 = function(xy, r, a)
	local x1 = 0
	local y1 = 0
	x1 = r * math.cos(a) + xy.x + 取随机数(-2, 2)
	y1 = r * math.sin(a) + xy.y + 取随机数(-2, 2)

	return 生成XY(math.floor(x1), math.floor(y1))
end

取商品卖出价格 = function(spm)
	local dj = nil

	if spm == "商品武器" then
		dj = 取随机数(3600, 4500)
	elseif spm == "商品棉布" then
		dj = 取随机数(3200, 3800)
	elseif spm == "商品佛珠" then
		dj = 取随机数(6200, 8000)
	elseif spm == "商品扇子" then
		dj = 取随机数(3500, 4200)
	elseif spm == "商品纸钱" then
		dj = 取随机数(2600, 3400)
	elseif spm == "商品夜明珠" then
		dj = 取随机数(7600, 9000)
	elseif spm == "商品首饰" then
		dj = 取随机数(3600, 4800)
	elseif spm == "商品珍珠" then
		dj = 取随机数(5000, 6000)
	elseif spm == "商品帽子" then
		dj = 取随机数(3000, 4000)
	elseif spm == "商品盐" then
		dj = 取随机数(4800, 6000)
	elseif spm == "商品蜡烛" then
		dj = 取随机数(1500, 2500)
	elseif spm == "商品酒" then
		dj = 取随机数(3200, 4500)
	elseif spm == "商品木材" then
		dj = 取随机数(3200, 5000)
	elseif spm == "商品鹿茸" then
		dj = 取随机数(6800, 8500)
	elseif spm == "商品面粉" then
		dj = 取随机数(2500, 3500)
	elseif spm == "商品符" then
		dj = 取随机数(4500, 6000)
	elseif spm == "商品人参" then
		dj = 取随机数(6500, 9000)
	elseif spm == "商品铃铛" then
		dj = 取随机数(3200, 4800)
	elseif spm == "商品香油" then
		dj = 取随机数(3200, 5000)
	elseif spm == "商品麻线" then
		dj = 取随机数(2000, 3800)
	end

	return dj
end

跑商 = {
	商品棉布 = 取商品卖出价格("商品棉布"),
	商品佛珠 = 取商品卖出价格("商品佛珠"),
	商品扇子 = 取商品卖出价格("商品扇子"),
	商品武器 = 取商品卖出价格("商品武器"),
	商品纸钱 = 取商品卖出价格("商品纸钱"),
	商品帽子 = 取商品卖出价格("商品帽子"),
	商品木材 = 取商品卖出价格("商品木材"),
	商品人参 = 取商品卖出价格("商品人参"),
	商品夜明珠 = 取商品卖出价格("商品夜明珠"),
	商品盐 = 取商品卖出价格("商品盐"),
	商品鹿茸 = 取商品卖出价格("商品鹿茸"),
	商品铃铛 = 取商品卖出价格("商品铃铛"),
	商品首饰 = 取商品卖出价格("商品首饰"),
	商品蜡烛 = 取商品卖出价格("商品蜡烛"),
	商品面粉 = 取商品卖出价格("商品面粉"),
	商品香油 = 取商品卖出价格("商品香油"),
	商品珍珠 = 取商品卖出价格("商品珍珠"),
	商品酒 = 取商品卖出价格("商品酒"),
	商品符 = 取商品卖出价格("商品符"),
	商品麻线 = 取商品卖出价格("商品麻线")
}
帮派修炼 = {
	16,
	32,
	52,
	75,
	103,
	136,
	179,
	231,
	295,
	372,
	466,
	578,
	711,
	867,
	1049,
	1280,
	1503,
	1780,
	2096,
	2452,
	2854,
	3304,
	3807,
	4364,
	4983
}
帮派技能 = {
	16,
	32,
	52,
	75,
	103,
	136,
	179,
	231,
	295,
	372,
	466,
	578,
	711,
	867,
	1049,
	1260,
	1503,
	1780,
	2096,
	2452,
	2854,
	3304,
	3807,
	4364,
	4983,
	5664,
	6415,
	7238,
	8138,
	9120,
	10188,
	11347,
	12602,
	13959,
	15423,
	16998,
	18692,
	20508,
	22452,
	24532,
	26753,
	29121,
	31642,
	34323,
	37169,
	40188,
	43388,
	46773,
	50352,
	54132,
	58120,
	62324,
	66750,
	71407,
	76303,
	81444,
	86840,
	92500,
	98430,
	104640,
	111136,
	117931,
	125031,
	132444,
	140183,
	148253,
	156666,
	165430,
	174556,
	184052,
	193930,
	204198,
	214868,
	225948,
	237449,
	249383,
	261760,
	274589,
	287884,
	301652,
	315908,
	330662,
	345924,
	361708,
	378023,
	394882,
	412297,
	430280,
	448844,
	468000,
	487760,
	508137,
	529145,
	550796,
	573103,
	596078,
	619735,
	644088,
	669149,
	694932,
	721452,
	748722,
	776755,
	805566,
	835169,
	865579,
	896809,
	928876,
	961792,
	995572,
	1030234,
	1065190,
	1102256,
	1139649,
	1177983,
	1217273,
	1256104,
	1298787,
	1341043,
	1384320,
	1428632,
	1473999,
	1520435,
	1567957,
	1616583,
	1666328,
	1717211,
	1769248,
	1822456,
	1876852,
	1932456,
	1989284,
	2047353,
	2106682,
	2167289,
	2229192,
	2292410,
	2356960,
	2422861,
	2490132,
	2558792,
	2628860,
	2700356,
	2773296,
	2847703,
	2923593,
	3000989,
	3079908,
	3160372,
	3242400,
	6652022,
	6822452,
	6996132,
	7173104,
	7353406,
	11305620,
	11586254,
	11872072,
	12163140,
	12459518,
	15033471,
	15315219,
	15600468,
	15889236,
	16181550,
	16477425,
	16776885,
	17079954,
	17386650,
	17697000,
	24014692,
	24438308,
	24866880,
	25300432,
	25739000,
	32728255,
	33289095,
	33856310,
	34492930,
	40842000
}
帮派建筑升级经验 = {
	[0] = 1600,
	1600,
	3200,
	5200,
	7500,
	10300,
	13600,
	17900,
	23100,
	29500,
	37200,
	46600,
	57800,
	71100,
	86700,
	104900,
	128000
}

取人物修炼等级上限1 = function(等级)
	local 修炼上限 = (等级 - 20) / 5

	if 修炼上限 <= 0 then
		修炼上限 = 0
	end

	if 修炼上限 >= 20 then
		修炼上限 = 20
	end

	return 修炼上限
end

取人物修炼等级上限 = function(等级)
	local 修炼上限 = (等级 - 20) / 5

	if 修炼上限 <= 0 then
		修炼上限 = 0
	end

	if 修炼上限 >= 20 then
		修炼上限 = 20
	end

	return 修炼上限
end

飞升降级处理 = function(id)
	玩家数据[id].角色:飞升洗点操作(id)
end

飞升降修处理 = function(id)
	local as = {
		"攻击修炼",
		"防御修炼",
		"法术修炼",
		"抗法修炼",
		"猎术修炼"
	}
	local as1 = {
		"攻击控制力",
		"防御控制力",
		"法术控制力",
		"抗法控制力"
	}
	local 降修等级 = 7

	for n = 1, #as do
		if 降修等级 <= 玩家数据[id].角色.数据.修炼[as[n]][1] then
			玩家数据[id].角色.数据.修炼[as[n]][1] = 玩家数据[id].角色.数据.修炼[as[n]][1] - 降修等级
			玩家数据[id].角色.数据.修炼[as[n]][3] = 25
		elseif 玩家数据[id].角色.数据.修炼[as[n]][1] >= 0 then
			玩家数据[id].角色.数据.修炼[as[n]][1] = 0
			玩家数据[id].角色.数据.修炼[as[n]][3] = 25
		end
	end

	for i = 1, #as1 do
		if 降修等级 <= 玩家数据[id].角色.数据.bb修炼[as1[i]][1] then
			玩家数据[id].角色.数据.bb修炼[as1[i]][1] = 玩家数据[id].角色.数据.bb修炼[as1[i]][1] - 降修等级
			玩家数据[id].角色.数据.bb修炼[as1[i]][3] = 25
		elseif 玩家数据[id].角色.数据.bb修炼[as1[i]][1] >= 0 then
			玩家数据[id].角色.数据.bb修炼[as1[i]][1] = 0
			玩家数据[id].角色.数据.bb修炼[as1[i]][3] = 25
		end
	end
end

是否穿戴装备 = function(id)
	for n, v in pairs(玩家数据[id].角色.数据.装备) do
		if 玩家数据[id].角色.数据.装备[n] ~= nil then
			return true
		end
	end

	for n, v in pairs(玩家数据[id].角色.数据.灵饰) do
		if 玩家数据[id].角色.数据.灵饰[n] ~= nil then
			return true
		end
	end

	for n, v in pairs(玩家数据[id].角色.数据.锦衣) do
		if 玩家数据[id].角色.数据.锦衣[n] ~= nil then
			return true
		end
	end

	return false
end

取高级地煞星武器造型 = function(角色)
	local 武器 = {
		剑侠客 = {
			级别 = 140,
			武器 = "四法青云"
		},
		逍遥生 = {
			级别 = 140,
			武器 = "秋水人家"
		},
		飞燕女 = {
			级别 = 140,
			武器 = "九天金线"
		},
		英女侠 = {
			级别 = 140,
			武器 = "祖龙对剑"
		},
		巫蛮儿 = {
			级别 = 140,
			武器 = "紫金葫芦"
		},
		狐美人 = {
			级别 = 140,
			武器 = "游龙惊鸿"
		},
		巨魔王 = {
			级别 = 140,
			武器 = "护法灭魔"
		},
		虎头怪 = {
			级别 = 140,
			武器 = "元神禁锢"
		},
		骨精灵 = {
			级别 = 140,
			武器 = "九阴勾魂"
		},
		杀破狼 = {
			级别 = 140,
			武器 = "冥火薄天"
		},
		舞天姬 = {
			级别 = 140,
			武器 = "此最相思"
		},
		玄彩娥 = {
			级别 = 140,
			武器 = "青藤玉树"
		},
		羽灵神 = {
			级别 = 140,
			武器 = "庄周梦蝶"
		},
		神天兵 = {
			级别 = 140,
			武器 = "九瓣莲花"
		},
		龙太子 = {
			级别 = 140,
			武器 = "飞龙在天"
		},
		鬼潇潇 = {
			级别 = 140,
			武器 = "月影星痕"
		},
		桃夭夭 = {
			级别 = 140,
			武器 = "月露清愁"
		},
		偃无师 = {
			级别 = 140,
			武器 = "秋水澄流"
		},
		影精灵 = {
			级别 = 140,
			武器 = "贵霜之牙"
		}
	}

	return 武器[角色]
end

取天罡星武器造型 = function(角色)
	local 武器 = {
		剑侠客 = {
			级别 = 150,
			武器 = "霜冷九州"
		},
		逍遥生 = {
			级别 = 150,
			武器 = "浩气长舒"
		},
		飞燕女 = {
			级别 = 150,
			武器 = "无关风月"
		},
		英女侠 = {
			级别 = 150,
			武器 = "紫电青霜"
		},
		巫蛮儿 = {
			级别 = 150,
			武器 = "云雷万里"
		},
		狐美人 = {
			级别 = 150,
			武器 = "牧云清歌"
		},
		巨魔王 = {
			级别 = 150,
			武器 = "业火三灾"
		},
		虎头怪 = {
			级别 = 150,
			武器 = "碧血干戚"
		},
		骨精灵 = {
			级别 = 150,
			武器 = "忘川三途"
		},
		杀破狼 = {
			级别 = 150,
			武器 = "九霄风雷"
		},
		舞天姬 = {
			级别 = 150,
			武器 = "揽月摘星"
		},
		玄彩娥 = {
			级别 = 150,
			武器 = "丝萝乔木"
		},
		羽灵神 = {
			级别 = 150,
			武器 = "碧海潮生"
		},
		神天兵 = {
			级别 = 150,
			武器 = "狂澜碎岳"
		},
		龙太子 = {
			级别 = 150,
			武器 = "天龙破城"
		},
		鬼潇潇 = {
			级别 = 150,
			武器 = "浮生归梦"
		},
		桃夭夭 = {
			级别 = 150,
			武器 = "夭桃秾李"
		},
		偃无师 = {
			级别 = 150,
			武器 = "百辟镇魂"
		},
		影精灵 = {
			级别 = 150,
			武器 = "忘川三途"
		}
	}

	return 武器[角色]
end

Q_地煞星等级 = {
	"初出茅庐地煞星",
	"小有所成地煞星",
	"伏虎斩妖地煞星",
	"御风神行地煞星",
	"履水吐焰地煞星",
	"牛逼轰轰地煞星",
	"稀奇古怪地煞星",
	"无可匹敌地煞星",
	"东倒西歪地煞星",
	"十全十美地煞星",
		"十一星地煞星",
			"十二星地煞星",
				"十三星地煞星",
					"十四星地煞星",
						"十五星地煞星"

}
Q_天罡星名称 = {
	"天魁星",
	"天罡星",
	"天机星",
	"天闲星",
	"天勇星",
	"天雄星",
	"天猛星",
	"天威星",
	"天英星",
	"天贵星",
	"天富星",
	"天满星",
	"天孤星",
	"天伤星",
	"天立星",
	"天捷星",
	"天暗星",
	"天佑星",
	"天空星",
	"天速星",
	"天异星",
	"天杀星",
	"天微星",
	"天究星",
	"天退星",
	"天寿星",
	"天剑星",
	"天平星",
	"天罪星",
	"天损星",
	"天败星",
	"天牢星",
	"天慧星",
	"天暴星",
	"天哭星",
	"天巧星"
}
Q_取随机飞升武器 = {
	"鱼肠",
	"阴阳",
	"彩虹",
	"撕天",
	"太极",
	"沧海",
	"八卦",
	"龙筋",
	"如意",
	"冷月",
	"业焰",
	"离火",
	"非攻",
	"鸦九",
	"蟠龙",
	"鬼骨",
	"暗夜",
	"破魄",
	"倚天",
	"湛卢",
	"月光双环",
	"灵蛇",
	"流云",
	"碧波",
	"毒牙",
	"胭脂",
	"玉龙",
	"秋风",
	"碧波",
	"红莲",
	"盘龙",
	"鬼牙",
	"雷神",
	"百花",
	"吹雪",
	"乾坤",
	"月光",
	"屠龙",
	"血刃",
	"玉辉",
	"鹿鸣",
	"飞星",
	"月华",
	"幽篁",
	"百鬼",
	"月光双剑",
	"昆吾",
	"云鹤",
	"云梦",
	"梨花",
	"霹雳",
	"肃魂",
	"无敌"
}
Q_取随机渡劫武器 = {
	"刑天之逆",
	"五虎断魂",
	"飞龙在天",
	"五丁开山",
	"元神禁锢",
	"护法灭魔",
	"魏武青虹",
	"灵犀神剑",
	"四法青云",
	"金龙双剪",
	"连理双树",
	"祖龙对剑",
	"秋水落霞",
	"晃金仙绳",
	"此最相思",
	"九阴勾魂",
	"雪蚕之刺",
	"贵霜之牙",
	"画龙点睛",
	"秋水人家",
	"逍遥江湖",
	"降魔玉杵",
	"青藤玉树",
	"墨玉骷髅",
	"混元金锤",
	"九瓣莲花",
	"鬼王蚀日",
	"游龙惊鸿",
	"仙人指路",
	"血之刺藤",
	"别情离恨",
	"金玉双环",
	"九天金线",
	"偃月青龙",
	"晓风残月",
	"斩妖泣血",
	"庄周梦蝶",
	"凤翼流珠",
	"雪蟒霜寒",
	"回风舞雪",
	"紫金葫芦",
	"裂云啸日",
	"冥火薄天",
	"龙鸣寒水",
	"太极流光",
	"月光双剑",
	"墨骨枯麟",
	"腾蛇郁刃",
	"秋水澄流",
	"金风玉露",
	"凰火燎原",
	"月露清愁",
	"雪羽穿云",
	"月影星痕"
}

扣除打造符处理 = function(id, 道具格子, 熟练度)
	local 打造符主人, 打造符主人id = nil
	local 打造熟练度 = 0

	if 道具格子 ~= 0 then
		local dj = 玩家数据[id].角色.数据.道具[道具格子]
		打造符主人id = 玩家数据[id].道具.数据[dj].主人id
		打造符主人 = 玩家数据[id].道具.数据[dj].玩家名称
		玩家数据[id].道具.数据[dj].数量 = (玩家数据[id].道具.数据[dj].数量 or 0) - 1

		if 玩家数据[id].道具.数据[dj].数量 < 1 then
			玩家数据[id].道具.数据[dj] = nil
		end

		刷新道具行囊单格(id, "道具", 道具格子, dj)

		if 打造符主人id ~= nil and 打造符主人id > 0 then
			打造添加熟练度(id, 打造符主人id, 熟练度)

			打造熟练度 = 打造熟练度数据[打造符主人id].熟练度
		end
	else
		打造添加熟练度(id, id, 熟练度)

		打造熟练度 = 玩家数据[id].角色.数据.打造熟练度
	end

	return 打造熟练度
end

打造添加熟练度 = function(id, 添加id, 数额)
	数额 = 数额 or 0

	if 数额 <= 0 then
		return
	end

	if 玩家数据[添加id] ~= nil then
		玩家数据[添加id].角色.数据.打造熟练度 = (玩家数据[添加id].角色.数据.打造熟练度 or 0) + 数额
		打造熟练度数据[添加id].熟练度 = 玩家数据[添加id].角色.数据.打造熟练度 + 0

		if 添加id == id then
			常规提示(id, "#Y/恭喜你增加了#R/" .. 数额 .. "#Y/点打造熟练度、当前熟练度为#R/" .. 玩家数据[添加id].角色.数据.打造熟练度)
		else
			常规提示(添加id, "#P(打造符提示)#Y/恭喜你增加了#R/" .. 数额 .. "#Y/点打造熟练度、当前熟练度为#R/" .. 玩家数据[添加id].角色.数据.打造熟练度)
			常规提示(id, "#P(打造符提示)#Y/玩家#S/[" .. 添加id .. "]#R" .. 玩家数据[添加id].角色.数据.名称 .. "#Y/增加了#R" .. 数额 .. "点打造熟练度、当前熟练度为#R/" .. 玩家数据[添加id].角色.数据.打造熟练度)
		end
	else
		if 打造熟练度数据[添加id] == nil then
			打造熟练度数据[添加id] = {}
		end

		打造熟练度数据[添加id].熟练度 = (打造熟练度数据[添加id].熟练度 or 0) + 数额

		if 打造熟练度数据[添加id].玩家名称 ~= nil then
			常规提示(id, "#P(打造符提示)#Y/玩家#S/[" .. 添加id .. "]#R" .. 打造熟练度数据[添加id].玩家名称 .. "#Y/增加了#R" .. 数额 .. "#Y点打造熟练度、当前熟练度为#R/" .. 打造熟练度数据[添加id].熟练度)
		end
	end
end

定制装备礼包 = {
	["160级项链定制礼包"] = "项链",
	["160级腰带定制礼包"] = "腰带",
	["160级头盔定制礼包"] = "头盔",
	["160级衣服定制礼包"] = "衣服",
	["160级武器定制礼包"] = "武器",
	["160级鞋子定制礼包"] = "鞋子"
}
超级五行选择 = {
	"金、伤害",
	"木、治疗能力",
	"水、速度",
	"火、灵力",
	"土、防御"
}
超级五行选择1 = {
	["木、治疗能力"] = 2,
	["金、伤害"] = 1,
	["水、速度"] = 3,
	["火、灵力"] = 4,
	["土、防御"] = 5
}

取超级五行处理 = function(装备等级, 概率, 熟练度, 定制)
	熟练度 = (熟练度 or 0) + 0
	local 超级五行 = {}

	if 取随机数(1, 10000) <= (概率 + 取熟练度加成(熟练度, "超级五行")) * 100 or 定制 ~= nil then
		local 五行随机 = ygsj()

		if 定制 ~= nil and 超级五行选择1[定制.超级五行] ~= nil then
			五行随机 = 超级五行选择1[定制.超级五行] * 20
		end

		if 五行随机 <= 20 then
			超级五行.类型 = "金"
			超级五行.属性 = "伤害"
			超级五行.数值 = 装备等级 * 0.8
		elseif 五行随机 <= 40 then
			超级五行.类型 = "木"
			超级五行.属性 = "治疗能力"
			超级五行.数值 = 装备等级 * 0.8
		elseif 五行随机 <= 60 then
			超级五行.类型 = "水"
			超级五行.属性 = "速度"
			超级五行.数值 = 装备等级 * 0.6
		elseif 五行随机 <= 80 then
			超级五行.类型 = "火"
			超级五行.属性 = "灵力"
			超级五行.数值 = 装备等级 * 0.6
		else
			超级五行.类型 = "土"
			超级五行.属性 = "防御"
			超级五行.数值 = 装备等级 * 1.2
		end
	end

	return 超级五行
end

取多项数字列表 = function(起, 终, 个数)
	local lb = {}
	local aa = 终 - 起 + 1

	for i = 1, aa do
		lb[i] = 起 + i - 1
	end

	if 个数 <= aa then
		local bb = aa - 个数

		for i = 1, bb do
			table.remove(lb, ygsj(#lb))
		end

		return lb
	else
		return lb
	end
end

取列表多项 = function(列表, 数量, 起始)
	if 起始 == nil then
		起始 = 1
	end

	local 列表1 = 列表2加入到列表1({}, 列表)
	local jg = {}

	for i = 1, 数量 do
		if 起始 <= #列表1 then
			local n = 取随机数(起始, #列表1)
			jg[#jg + 1] = 列表1[n]

			table.remove(列表1, n)
		end
	end

	return jg
end

取百炼处理 = function(装备等级, 概率, 定制)
	if 概率 == nil then
		概率 = 30
	end

	local jg = {}

	if 单机设置 then
		local 词条 = 取列表多项(百炼词条, 2)

		if 定制 ~= nil and 定制.百炼 ~= nil then
			词条 = DeepCopy(定制.百炼)
		end

		if not 百炼词条高数值 then
			for i = 1, #词条 do
				local 数值 = ygsj(20)

				if 词条[i] == "削金" or 词条[i] == "断玉" or 词条[i] == "开碑" or 词条[i] == "破空" or 词条[i] == "急速" then
					数值 = ygsj(500, 800) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(700, 800) / 100)
					end
				elseif 词条[i] == "治愈" or 词条[i] == "固伤" or 词条[i] == "固本" or 词条[i] == "培元" then
					数值 = ygsj(600, 900) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(800, 900) / 100)
					end
				elseif 词条[i] == "固防" or 词条[i] == "金汤" then
					数值 = ygsj(600, 1000) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(900, 1000) / 100)
					end
				elseif 词条[i] == "铁骨" or 词条[i] == "御气" then
					数值 = ygsj(600, 900) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(800, 900) / 100)
					end
				elseif 词条[i] == "厚德" or 词条[i] == "纳敏" or 词条[i] == "淬力" or 词条[i] == "聚灵" or 词条[i] == "益气" then
					数值 = ygsj(600, 900) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(800, 900) / 100)
					end
				elseif 词条[i] == "天命之子" then
					数值 = ygsj(600, 800) / 100

					if 定制 ~= nil then
						数值 = math.max(数值, ygsj(750, 800) / 100)
					end
				end

				jg[i] = {
					类型 = 词条[i],
					数值 = 数值,
					类别 = 百炼2[百炼1[词条[i]]] .. "百分比"
				}
			end
		else
			for i = 1, #词条 do
				local 数值 = ygsj(20)

				if 词条[i] == "削金" or 词条[i] == "断玉" or 词条[i] == "开碑" or 词条[i] == "破空" or 词条[i] == "治愈" or 词条[i] == "固伤" or 词条[i] == "急速" or 词条[i] == "固本" or 词条[i] == "培元" then
					数值 = math.random(10, 16)

					if 定制 ~= nil then
						数值 = math.max(数值, math.random(13, 16))
					end
				elseif 词条[i] == "固防" or 词条[i] == "金汤" then
					数值 = math.random(8, 14)

					if 定制 ~= nil then
						数值 = math.max(数值, math.random(12, 14))
					end
				elseif 词条[i] == "铁骨" or 词条[i] == "御气" then
					数值 = math.random(9, 15)

					if 定制 ~= nil then
						数值 = math.max(数值, math.random(13, 15))
					end
				elseif 词条[i] == "厚德" or 词条[i] == "纳敏" or 词条[i] == "淬力" or 词条[i] == "聚灵" or 词条[i] == "益气" then
					数值 = math.random(6, 12)

					if 定制 ~= nil then
						数值 = math.max(数值, math.random(10, 12))
					end
				elseif 词条[i] == "天命之子" then
					数值 = math.random(10, 15)

					if 定制 ~= nil then
						数值 = math.max(数值, math.random(13, 15))
					end
				end

				jg[i] = {
					类型 = 词条[i],
					数值 = 数值,
					类别 = 百炼2[百炼1[词条[i]]] .. "百分比"
				}
			end
		end
	elseif 取随机数() <= 100 or 定制 ~= nil then
		local 词条 = 取列表多项(百炼词条, 2)

		if 定制 ~= nil and 定制.百炼 ~= nil then
			词条 = DeepCopy(定制.百炼)
		end

		for i = 1, #词条 do
			local 数值 = ygsj(20)

			if 词条[i] == "削金" or 词条[i] == "断玉" or 词条[i] == "开碑" or 词条[i] == "破空" or 词条[i] == "急速" then
				数值 = ygsj(500, 800) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(700, 800) / 100)
				end
			elseif 词条[i] == "治愈" or 词条[i] == "固伤" or 词条[i] == "固本" or 词条[i] == "培元" then
				数值 = ygsj(600, 900) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(800, 900) / 100)
				end
			elseif 词条[i] == "固防" or 词条[i] == "金汤" then
				数值 = ygsj(600, 1000) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(900, 1000) / 100)
				end
			elseif 词条[i] == "铁骨" or 词条[i] == "御气" then
				数值 = ygsj(600, 900) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(800, 900) / 100)
				end
			elseif 词条[i] == "厚德" or 词条[i] == "纳敏" or 词条[i] == "淬力" or 词条[i] == "聚灵" or 词条[i] == "益气" then
				数值 = ygsj(600, 900) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(800, 900) / 100)
				end
			elseif 词条[i] == "天命之子" then
				数值 = ygsj(600, 800) / 100

				if 定制 ~= nil then
					数值 = math.max(数值, ygsj(750, 800) / 100)
				end
			end

			jg[i] = {
				类型 = 词条[i],
				数值 = 数值,
				类别 = 百炼2[百炼1[词条[i]]] .. "百分比"
			}
		end
	else
		local 词条 = 取列表多项(百炼词条, 1)

		for i = 1, #词条 do
			local 数值 = ygsj(20)

			if 词条[i] == "削金" or 词条[i] == "断玉" or 词条[i] == "开碑" or 词条[i] == "破空" or 词条[i] == "急速" then
				数值 = ygsj(900, 1100) / 100
			elseif 词条[i] == "治愈" or 词条[i] == "固伤" or 词条[i] == "固本" or 词条[i] == "培元" then
				数值 = ygsj(1000, 1300) / 100
			elseif 词条[i] == "固防" or 词条[i] == "金汤" then
				数值 = ygsj(1100, 1400) / 100
			elseif 词条[i] == "铁骨" or 词条[i] == "御气" then
				数值 = ygsj(1000, 1300) / 100
			elseif 词条[i] == "厚德" or 词条[i] == "纳敏" or 词条[i] == "淬力" or 词条[i] == "聚灵" or 词条[i] == "益气" then
				数值 = ygsj(900, 1200) / 100
			elseif 词条[i] == "天命之子" then
				数值 = ygsj(850, 1100) / 100
			end

			jg[i] = {
				类型 = 词条[i],
				数值 = 数值,
				类别 = 百炼2[百炼1[词条[i]]] .. "百分比"
			}
		end
	end

	return jg
end

GetTrueRandom = function(min, max)
	local strTime = tostring(os.time())
	local strRev = string.reverse(strTime)
	local strRandomTime = string.sub(strRev, 1, 6)

	math.randomseed(strRandomTime)

	return math.random(min, max)
end

ygsj = function(数值, 数值1)
	数值 = 数值 or 100

	if 数值1 ~= nil then
		return qz2(math.random(数值 * 100, 数值1 * 100) / 100)
	else
		return qz2(math.random(1, 数值 * 100) / 100)
	end
end

野外掉落装备 = function(id, 地图等级)
	local 等级 = qz1(地图等级 / 10)

	if 等级 > 10 then
		等级 = 10
	end

	等级 = math.max(等级 - ygsj(4) + 1, 0)

	玩家数据[id].道具:取随机装备(id, 等级)
end

野外掉落二级药 = function(id, 地图等级)
	local 等级 = qz1(地图等级 / 10)

	if 等级 >= 2 then
		local 名称 = 二级药列表[ygsj(#二级药列表)]

		玩家数据[id].道具:给予道具(id, 名称, 1)
		常规提示(id, "#Y/你获得了" .. 名称)
	end
end

取乾元丹消耗 = function(等级)
	local cc = 0
	local vv = 0

	if 掉率模式 ~= 1 then
		if 等级 == 1 then
			cc = 223
		elseif 等级 == 2 then
			cc = 2785
		elseif 等级 == 3 then
			cc = 3453
		elseif 等级 == 4 then
			cc = 4252
		elseif 等级 == 5 then
			cc = 5192
		elseif 等级 == 6 then
			cc = 6285
		elseif 等级 == 7 then
			cc = 7542
		elseif 等级 == 8 then
			cc = 7598
		elseif 等级 == 9 then
			cc = 7720
		elseif 等级 >= 10 and 等级 <= 20 then
			cc = 7720 + (等级 - 9) * (1000 + 等级 * 等级)
		end

		if 等级 == 1 then
			vv = 1000000
		elseif 等级 == 2 then
			vv = 5570000
		elseif 等级 == 3 then
			vv = 6910000
		elseif 等级 == 4 then
			vv = 8500000
		elseif 等级 == 5 then
			vv = 10380000
		elseif 等级 == 6 then
			vv = 12570000
		elseif 等级 == 7 then
			vv = 15080000
		elseif 等级 == 8 then
			vv = 15200000
		elseif 等级 == 9 then
			vv = 19999999
		elseif 等级 >= 10 and 等级 <= 20 then
			vv = 19999999 + (等级 - 9) * 1000000
		end

		return {
			经验 = cc * 10000,
			金钱 = vv * 1
		}
	else
		if 等级 == 1 then
			cc = 2000
		elseif 等级 == 2 then
			cc = 5000
		elseif 等级 == 3 then
			cc = 10000
		elseif 等级 == 4 then
			cc = 20000
		elseif 等级 == 5 then
			cc = 35000
		elseif 等级 == 6 then
			cc = 50000
		elseif 等级 == 7 then
			cc = 70000
		elseif 等级 == 8 then
			cc = 100000
		elseif 等级 == 9 then
			cc = 100000
		elseif 等级 >= 10 and 等级 <= 20 then
			cc = 100000 + (等级 - 9) * 10000
		end

		if 等级 == 1 then
			vv = 500
		elseif 等级 == 2 then
			vv = 1000
		elseif 等级 == 3 then
			vv = 2000
		elseif 等级 == 4 then
			vv = 3500
		elseif 等级 == 5 then
			vv = 5000
		elseif 等级 == 6 then
			vv = 7000
		elseif 等级 == 7 then
			vv = 9000
		elseif 等级 == 8 then
			vv = 10000
		elseif 等级 == 9 then
			vv = 10000
		elseif 等级 >= 10 and 等级 <= 20 then
			vv = 10000
		end

		return {
			经验 = cc * 10000,
			金钱 = vv * 10000
		}
	end
end

设置任务bb = function(id, 任务id)
	local 等级 = 玩家数据[id].角色.数据.等级
	local 临时等级 = 等级 - 10

	if 临时等级 > 85 then
		临时等级 = 85
	end

	local 临时等级1 = 等级 - 50

	if 临时等级1 < 1 then
		临时等级1 = 1
	end

	local 类型 = 取等级怪(取随机数(临时等级1, 临时等级))
	类型 = 取敌人信息(类型[ygsj(#类型)])
	类型 = 类型[2]
	任务数据[任务id].bb = {
		{
			找到 = false,
			名称 = 类型
		}
	}
end

取飞升条件 = function(id)
	if 玩家数据[id].角色.数据.等级 < 135 then
		return false
	end

	local 满足条件 = 0

	for i = 1, #玩家数据[id].角色.数据.师门技能 do
		if 玩家数据[id].角色.数据.师门技能[i].等级 >= 130 then
			满足条件 = 满足条件 + 1
		end
	end

	if 满足条件 < 6 then
		return false
	end

	return true
end

取飞升条件1 = function(id)
	if 玩家数据[id].角色.数据.等级 < 109 then
		return false
	end

	local 满足条件 = 0

	for i = 1, #玩家数据[id].角色.数据.师门技能 do
		if 玩家数据[id].角色.数据.师门技能[i].等级 >= 119 then
			满足条件 = 满足条件 + 1
		end
	end

	if 满足条件 < 6 then
		return false
	end

	if 玩家数据[id].角色.数据.修炼.防御修炼[1] + 玩家数据[id].角色.数据.修炼.抗法修炼[1] + 玩家数据[id].角色.数据.修炼.法术修炼[1] + 玩家数据[id].角色.数据.修炼.攻击修炼[1] < 68 then
		return false
	end

	if 玩家数据[id].角色.数据.bb修炼.抗法控制力[1] + 玩家数据[id].角色.数据.bb修炼.法术控制力[1] + 玩家数据[id].角色.数据.bb修炼.防御控制力[1] + 玩家数据[id].角色.数据.bb修炼.攻击控制力[1] < 68 then
		return false
	end

	return true
end

取渡劫条件 = function(id)
	if 玩家数据[id].角色.数据.等级 < 155 then
		return false
	end

	local 满足技能条件 = 0

	for i = 1, #玩家数据[id].角色.数据.师门技能 do
		if 玩家数据[id].角色.数据.师门技能[i].等级 >= 150 then
			满足技能条件 = 满足技能条件 + 1
		end
	end

	if 满足技能条件 < 5 then
		return false
	end

	if 玩家数据[id].角色.数据.修炼.防御修炼[1] + 玩家数据[id].角色.数据.修炼.抗法修炼[1] + 玩家数据[id].角色.数据.修炼.法术修炼[1] + 玩家数据[id].角色.数据.修炼.攻击修炼[1] < 50 then
		return false
	end

	if 玩家数据[id].角色.数据.bb修炼.抗法控制力[1] + 玩家数据[id].角色.数据.bb修炼.法术控制力[1] + 玩家数据[id].角色.数据.bb修炼.防御控制力[1] + 玩家数据[id].角色.数据.bb修炼.攻击控制力[1] < 40 then
		return false
	end

	return true
end

读csv数据 = function(str, reps)
	local resultStrList = {}

	string.gsub(str, "[^" .. reps .. "]+", function (w)
		table.insert(resultStrList, w)
	end)

	return resultStrList
end

取csv数据 = function(filePath)
	local data = 读入文件(filePath)
	local lineStr = 读csv数据(data, "\n\r")
	local lm = {
		"仙玉商城",
		"银子商城",
		"法宝商城"
	}
	local titles = string.split(lineStr[2], ",")
	local ID = 1
	local arrs = {}
	local gg = 1
	arrs[lm[gg]] = {}
	local fillContent = nil

	for i = 3, #lineStr do
		local content = string.split(lineStr[i], ",")

		if content[1] == lm[gg + 1] and arrs[lm[gg + 1]] == nil then
			gg = gg + 1
			arrs[lm[gg]] = {}
			ID = 0
		end

		if ID ~= 0 then
			arrs[lm[gg]][ID] = {}
		end

		for j = 1, #titles do
			if content[j] ~= nil and content[j] ~= "" and content[j] ~= "银子商城" and content[j] ~= "法宝商城" then
				arrs[lm[gg]][ID][titles[j]] = tonumber(content[j]) or content[j]
			end
		end

		ID = ID + 1
	end

	return arrs
end

取比武分组 = function(等级)
	if 等级 < 70 then
		return "精锐组"
	elseif 等级 < 90 then
		return "勇武组"
	elseif 等级 < 110 then
		return "神威组"
	elseif 等级 < 130 then
		return "天科组"
	elseif 等级 < 160 then
		return "天启组"
	else
		return "天元组"
	end
end

开启首席争霸报名 = function()
	首席争霸报名开关 = true
	local 门派名称 = {
		"大唐官府",
		"神木林",
		"方寸山",
		"化生寺",
		"女儿村",
		"天宫",
		"普陀山",
		"五庄观",
		"凌波城",
		"龙宫",
		"魔王寨",
		"狮驼岭",
		"盘丝洞",
		"无底洞",
		"九黎城",
		"阴曹地府"
	}

	for n = 1, #门派名称 do
		if 首席争霸[门派名称[n]] ~= nil and 首席争霸[门派名称[n]].id ~= nil and 玩家数据[首席争霸[门派名称[n]].id] ~= nil then
			玩家数据[首席争霸[门派名称[n]].id].角色:删除称谓(首席争霸[门派名称[n]].id, 门派名称[n] .. "首席大弟子")
			常规提示(首席争霸[门派名称[n]].id, "你的首席称谓已回收！！！")
		end
	end

	发送公告("#G首席争霸赛报名已经开启，请需要参与比武大会的玩家找到#R首席争霸使者#G进行首席争霸赛报名！！！")
end

开启首席争霸进场 = function()
	首席争霸进场 = true
	首席争霸开启 = os.time()
	首席争霸报名开关 = false

	发送公告("#G首席争霸赛入场已经开启，请需要参与首席争霸赛的玩家找到#R首席争霸使者#G入场，首席争霸赛将于10分钟后正式开始！！！")
end

开启首席争霸 = function()
	首席争霸开关 = true
	首席争霸进场 = false

	地图处理类:重置首席争霸赛()
	发送公告("#G首席争霸赛正式开始！！！")
end

结束首席争霸 = function(类型, 门派)
	if 类型 == 1 then
		if 首席争霸数据[门派] ~= nil then
			for i, v in pairs(首席争霸数据[门派]) do
				if 玩家数据[i] ~= nil and 玩家数据[i].角色.数据.首席报名 then
					玩家数据[i].角色.数据.首席报名 = false
				end

				if 首席排名[门派] == nil then
					首席排名[门派] = {}
				end

				首席争霸数据[门派][i].奖励 = true
				首席排名[门派][#首席排名[门派] + 1] = 首席争霸数据[门派][i]
			end

			首席争霸数据[门派].统计 = true

			if #首席排名[门派] ~= nil and #首席排名[门派] ~= 0 then
				table.sort(首席排名[门派], function (a, b)
					return b.积分 < a.积分
				end)

				首席争霸[门派] = 首席排名[门派][1]

				玩家数据[首席争霸[门派].id].角色:添加称谓(首席争霸[门派].id, 门派 .. "首席大弟子")
				常规提示(首席争霸[门派].id, "恭喜你，获得了#R" .. 门派 .. "首席大弟子#Y称谓！！！")
				地图处理类:跳转地图(首席争霸[门派].id, 1001, 364, 36)
				地图处理类:删除单位(Q_首席弟子[门派].地图, 1000)
				保存系统数据()
				任务处理类:加载首席单位()
			end
		end
	elseif 类型 == 2 then
		首席争霸开关 = false

		for k, v in pairs(首席争霸数据) do
			if v.统计 == nil then
				for i, n in pairs(v) do
					if 玩家数据[i] ~= nil and 玩家数据[i].角色.数据.首席报名 then
						玩家数据[i].角色.数据.首席报名 = false
					end

					if 首席排名[k] == nil then
						首席排名[k] = {}
					end

					首席争霸数据[k][i].奖励 = true
					首席排名[k][#首席排名[k] + 1] = 首席争霸数据[k][i]
				end

				v.统计 = true

				if #首席排名[k] ~= nil and #首席排名[k] ~= 0 then
					table.sort(首席排名[k], function (a, b)
						return b.积分 < a.积分
					end)

					首席争霸[k] = 首席排名[k][1]

					玩家数据[首席争霸[k].id].角色:添加称谓(首席争霸[k].id, k .. "首席大弟子")
					常规提示(首席争霸[k].id, "恭喜你，获得了#R" .. k .. "首席大弟子#Y称谓！！！")
					地图处理类:删除单位(Q_首席弟子[k].地图, 1000)
				end
			end
		end

		地图处理类:清除地图玩家(6009, 1001, 313, 85)
		保存系统数据()
		任务处理类:加载首席单位()
		发送公告("#G首席争霸赛已经结束，参与首席争霸赛的玩家可找到首席争霸使者领取参与奖励！！！")
	end
end

Q_首席弟子 = {
	龙宫 = {
		y = 68,
		方向 = 1,
		x = 94,
		地图 = 1116
	},
	女儿村 = {
		y = 34,
		方向 = 0,
		x = 35,
		地图 = 1142
	},
	化生寺 = {
		y = 65,
		方向 = 1,
		x = 49,
		地图 = 1002
	},
	大唐官府 = {
		y = 65,
		方向 = 0,
		x = 94,
		地图 = 1198
	},
	普陀山 = {
		y = 21,
		方向 = 0,
		x = 22,
		地图 = 1140
	},
	五庄观 = {
		y = 49,
		方向 = 1,
		x = 36,
		地图 = 1146
	},
	盘丝洞 = {
		y = 48,
		方向 = 1,
		x = 24,
		地图 = 1144
	},
	魔王寨 = {
		y = 23,
		方向 = 0,
		x = 99,
		地图 = 1512
	},
	狮驼岭 = {
		y = 77,
		方向 = 1,
		x = 119,
		地图 = 1131
	},
	天宫 = {
		y = 113,
		方向 = 0,
		x = 160,
		地图 = 1111
	},
	方寸山 = {
		y = 66,
		方向 = 1,
		x = 67,
		地图 = 1135
	},
	阴曹地府 = {
		y = 63,
		方向 = 0,
		x = 41,
		地图 = 1122
	},
	凌波城 = {
		y = 68,
		方向 = 0,
		x = 34,
		地图 = 1150
	},
	神木林 = {
		y = 106,
		方向 = 0,
		x = 50,
		地图 = 1138
	},
	无底洞 = {
		y = 124,
		方向 = 1,
		x = 60,
		地图 = 1139
	},
	花果山 = {
		y = 31,
		方向 = 0,
		x = 62,
		地图 = 1251
	},
	九黎城 = {
		y = 67,
		方向 = 0,
		x = 69,
		地图 = 2008
	}
}

开启抓捕 = function()
	开启抓捕 = os.time()
	开启抓捕开关 = true
end

刷新队伍任务跟踪 = function(任务id)
	if 任务数据[任务id] ~= nil and 任务数据[任务id].队伍组 ~= nil then
		for i = 1, #任务数据[任务id].队伍组 do
			local id = 任务数据[任务id].队伍组[i]

			if 玩家数据[id] ~= nil then
				玩家数据[id].角色:刷新任务跟踪()
			end
		end
	end
end

取消队伍任务 = function(任务id, 类型)
	if 任务数据[任务id] ~= nil and 任务数据[任务id].队伍组 ~= nil then
		for i = 1, #任务数据[任务id].队伍组 do
			local id = 任务数据[任务id].队伍组[i]

			if 玩家数据[id] ~= nil then
				玩家数据[id].角色:取消任务(玩家数据[id].角色:取任务(类型))
			end
		end
	end
end

取随机神兽 = {
	"超级神龙",
	"超级土地公公",
	"超级六耳猕猴",
	"超级神鸡",
	"超级玉兔",
	"超级神猴",
	"超级神马",
	"超级神羊",
	"超级孔雀",
	"超级灵狐",
	"超级筋斗云",
	"超级麒麟",
	"超级大鹏",
	"超级赤焰兽",
	"超级白泽",
	"超级灵鹿",
	"超级大象",
	"超级金猴",
	"超级大熊猫",
	"超级泡泡",
	"超级神兔",
	"超级神虎",
	"超级神牛",
	"超级海豚",
	"超级人参娃娃",
	"超级青鸾",
	"超级腾蛇",
	"超级神蛇",
	"鲲鹏"
}
门派师傅坐标 = {
	凌波城 = {
		1150,
		65,
		35,
		"二郎神"
	},
	普陀山 = {
		1141,
		17,
		15,
		"观音姐姐"
	},
	阴曹地府 = {
		1124,
		34,
		25,
		"地藏王"
	},
	龙宫 = {
		1117,
		31,
		26,
		"东海龙王"
	},
	大唐官府 = {
		1054,
		24,
		23,
		"程咬金"
	},
	化生寺 = {
		1043,
		11,
		17,
		"空度禅师"
	},
	女儿村 = {
		1143,
		28,
		23,
		"孙婆婆"
	},
	方寸山 = {
		1137,
		41,
		33,
		"菩提祖师"
	},
	天宫 = {
		1112,
		32,
		43,
		"李靖"
	},
	魔王寨 = {
		1145,
		28,
		22,
		"牛魔王"
	},
	五庄观 = {
		1147,
		20,
		24,
		"镇元大仙"
	},
	狮驼岭 = {
		1134,
		32,
		21,
		"大大王"
	},
	神木林 = {
		1154,
		38,
		33,
		"巫奎虎"
	},
	无底洞 = {
		1156,
		44,
		29,
		"地涌夫人"
	},
	盘丝洞 = {
		1144,
		34,
		14,
		"白晶晶"
	},
	九黎城 = {
		2008,
		78,
		14,
		"刑天",
		"刑天"
	},
	花果山 = {
		1251,
		90,
		19,
		"齐天大圣",
		"孙悟空"
	}
}

取门派师傅名称 = function(门派)
	if 门派 == "大唐官府" then
		return "程咬金"
	elseif 门派 == "化生寺" then
		return "空度禅师"
	elseif 门派 == "女儿村" then
		return "孙婆婆"
	elseif 门派 == "方寸山" then
		return "菩提祖师"
	elseif 门派 == "神木林" then
		return "巫奎虎"
	elseif 门派 == "龙宫" then
		return "东海龙王"
	elseif 门派 == "天宫" then
		return "李靖"
	elseif 门派 == "普陀山" then
		return "观音姐姐"
	elseif 门派 == "五庄观" then
		return "镇元大仙"
	elseif 门派 == "凌波城" then
		return "二郎神"
	elseif 门派 == "狮驼岭" then
		return "大大王"
	elseif 门派 == "魔王寨" then
		return "牛魔王"
	elseif 门派 == "盘丝洞" then
		return "白晶晶"
	elseif 门派 == "无底洞" then
		return "地涌夫人"
	elseif 门派 == "阴曹地府" then
		return "地藏王"
	elseif 门派 == "九黎城" then
		return "刑天"
	elseif 门派 == "花果山" then
		return "齐天大圣"
	end
end

判断是否为空表 = function(t, 类型)
	return _G.next(t) == nil
end

取可佩带武器名称 = function(模型, 等级)
	local n = {}
	local 子类 = 角色武器类型[模型]
	local 佩戴 = 子类[ygsj(#子类)]
	local 序列 = 0

	if 等级 <= 99 then
		序列 = 9
	elseif 等级 <= 109 then
		序列 = 11
	elseif 等级 <= 119 then
		序列 = 12
	elseif 等级 <= 129 then
		序列 = 13
	elseif 等级 <= 139 then
		序列 = 14
	elseif 等级 <= 149 then
		序列 = 15
	elseif 等级 <= 159 then
		序列 = 16
	else
		序列 = 17
	end

	n[1] = {
		"红缨枪",
		"曲尖枪",
		"锯齿矛",
		"乌金三叉戟",
		"火焰枪",
		"墨杆金钩",
		"玄铁矛",
		"金蛇信",
		"丈八点钢矛",
		"暗夜",
		"梨花",
		"梨花",
		"刑天之逆",
		"五虎断魂",
		"飞龙在天",
		"天龙破城",
		"弑皇"
	}
	n[2] = {
		"青铜斧",
		"开山斧",
		"双面斧",
		"双弦钺",
		"精钢禅钺",
		"黄金钺",
		"乌金鬼头镰",
		"狂魔镰",
		"恶龙之齿",
		"破魄",
		"肃魂",
		"无敌",
		"五丁开山",
		"元神禁锢",
		"护法灭魔",
		"碧血干戚",
		"裂天"
	}
	n[3] = {
		"青铜短剑",
		"铁齿剑",
		"吴越剑",
		"青锋剑",
		"龙泉剑",
		"黄金剑",
		"游龙剑",
		"北斗七星剑",
		"碧玉剑",
		"鱼肠",
		"倚天",
		"湛卢",
		"魏武青虹",
		"灵犀神剑",
		"四法青云",
		"霜冷九州",
		"擒龙"
	}
	n[4] = {
		"双短剑",
		"镔铁双剑",
		"龙凤双剑",
		"竹节双剑",
		"狼牙双剑",
		"鱼骨双剑",
		"赤焰双剑",
		"墨玉双剑",
		"梅花双剑",
		"阴阳",
		"月光双剑",
		"灵蛇",
		"金龙双剪",
		"连理双树",
		"祖龙对剑",
		"紫电青霜",
		"浮犀"
	}
	n[5] = {
		"五色缎带",
		"幻彩银纱",
		"金丝彩带",
		"无极丝",
		"天蚕丝带",
		"云龙绸带",
		"七彩罗刹",
		"缚神绫",
		"九天仙绫",
		"彩虹",
		"流云",
		"碧波",
		"秋水落霞",
		"晃金仙绳",
		"此最相思",
		"揽月摘星",
		"九霄"
	}
	n[6] = {
		"铁爪",
		"天狼爪",
		"幽冥鬼爪",
		"青龙牙",
		"勾魂爪",
		"玄冰刺",
		"青刚刺",
		"华光刺",
		"龙鳞刺",
		"撕天",
		"毒牙",
		"胭脂",
		"九阴勾魂",
		"雪蚕之刺",
		"贵霜之牙",
		"忘川三途",
		"离钩"
	}
	n[7] = {
		"折扇",
		"铁骨扇",
		"精钢扇",
		"铁面扇",
		"百折扇",
		"劈水扇",
		"神火扇",
		"阴风扇",
		"风云雷电",
		"太极",
		"玉龙",
		"秋风",
		"画龙点睛",
		"秋水人家",
		"逍遥江湖",
		"浩气长舒",
		"星瀚"
	}
	n[8] = {
		"细木棒",
		"金丝魔棒",
		"玉如意",
		"点金棒",
		"云龙棒",
		"幽路引魂",
		"满天星",
		"水晶棒",
		"日月光华",
		"沧海",
		"红莲",
		"盘龙",
		"降魔玉杵",
		"青藤玉树",
		"墨玉骷髅",
		"丝萝乔木",
		"醍醐"
	}
	n[9] = {
		"松木锤",
		"镔铁锤",
		"八棱金瓜",
		"狼牙锤",
		"烈焰锤",
		"破甲战锤",
		"震天锤",
		"巨灵神锤",
		"天崩地裂",
		"八卦",
		"鬼牙",
		"雷神",
		"混元金锤",
		"九瓣莲花",
		"鬼王蚀日",
		"狂澜碎岳",
		"碎寂"
	}
	n[10] = {
		"牛皮鞭",
		"牛筋鞭",
		"乌龙鞭",
		"钢结鞭",
		"蛇骨鞭",
		"玉竹金铃",
		"青藤柳叶鞭",
		"雷鸣嗜血鞭",
		"混元金钩",
		"龙筋",
		"百花",
		"吹雪",
		"游龙惊鸿",
		"仙人指路",
		"血之刺藤",
		"牧云清歌",
		"霜陨"
	}
	n[11] = {
		"黄铜圈",
		"精钢日月圈",
		"离情环",
		"金刺轮",
		"风火圈",
		"赤炎环",
		"蛇形月",
		"子母双月",
		"斜月狼牙",
		"如意",
		"乾坤",
		"月光双环",
		"别情离恨",
		"金玉双环",
		"九天金线",
		"无关风月",
		"朝夕"
	}
	n[12] = {
		"柳叶刀",
		"苗刀",
		"夜魔弯刀",
		"金背大砍刀",
		"雁翅刀",
		"破天宝刀",
		"狼牙刀",
		"龙鳞宝刀",
		"黑炎魔刀",
		"冷月",
		"屠龙",
		"血刃",
		"偃月青龙",
		"晓风残月",
		"斩妖泣血",
		"业火三灾",
		"鸣鸿"
	}
	n[13] = {
		"曲柳杖",
		"红木杖",
		"白椴杖",
		"墨铁拐",
		"玄铁牛角杖",
		"鹰眼法杖",
		"腾云杖",
		"引魂杖",
		"碧玺杖",
		"业焰",
		"玉辉",
		"鹿鸣",
		"庄周梦蝶",
		"凤翼流珠",
		"雪蟒霜寒",
		"碧海潮生",
		"弦月"
	}
	n[14] = {
		"硬木弓",
		"铁胆弓",
		"紫檀弓",
		"宝雕长弓",
		"錾金宝弓",
		"玉腰弯弓",
		"连珠神弓",
		"游鱼戏珠",
		"灵犀望月",
		"非攻",
		"幽篁",
		"百鬼",
		"冥火薄天",
		"龙鸣寒水",
		"太极流光",
		"九霄风雷",
		"若木"
	}
	n[15] = {
		"琉璃珠",
		"水晶珠",
		"珍宝珠",
		"翡翠珠",
		"莲华珠",
		"夜灵珠",
		"如意宝珠",
		"沧海明珠",
		"无量玉璧",
		"离火",
		"飞星",
		"月华",
		"回风舞雪",
		"紫金葫芦",
		"裂云啸日",
		"云雷万里",
		"赤明"
	}
	n[16] = {
		"钝铁重剑",
		"桃印铁刃",
		"赭石巨剑",
		"壁玉长铗",
		"青铜古剑",
		"金错巨刃",
		"惊涛雪",
		"醉浮生",
		"沉戟天戊",
		"鸦九",
		"昆吾",
		"弦歌",
		"墨骨枯麟",
		"腾蛇郁刃",
		"秋水澄流",
		"百辟镇魂",
		"长息"
	}
	n[17] = {
		"油纸伞",
		"红罗伞",
		"紫竹伞",
		"锦绣椎",
		"幽兰帐",
		"琳琅盖",
		"孔雀羽",
		"金刚伞",
		"落梅伞",
		"鬼骨",
		"云梦",
		"枕霞",
		"碧火琉璃",
		"雪羽穿云",
		"月影星痕",
		"浮生归梦",
		"晴雪"
	}
	n[18] = {
		"素纸灯",
		"竹骨灯",
		"红灯笼",
		"鲤鱼灯",
		"芙蓉花灯",
		"如意宫灯",
		"玲珑盏",
		"玉兔盏",
		"冰心盏",
		"蟠龙",
		"云鹤",
		"风荷",
		"金风玉露",
		"凰火燎原",
		"月露清愁",
		"夭桃秾李",
		"荒尘"
	}
	n[910] = {
		"顽石双斧(乾)",
		"镔铁双斧(乾)",
		"黑曜双斧(乾)",
		"枭首双斧(乾)",
		"破军双斧(乾)",
		"隳城双戚(乾)",
		"飞头蛮(乾)",
		"竹叶青(乾)",
		"鲛煞(乾)",
		"啖月(乾)",
		"义战(乾)",
		"恶来(乾)",
		"烬世野火(乾)",
		"九州海沸(乾)",
		"八狱末劫(乾)",
		"罗喉计都(乾)",
		"非天(乾)"
	}
	n[911] = {
		"顽石双斧(坤)",
		"镔铁双斧(坤)",
		"黑曜双斧(坤)",
		"枭首双斧(坤)",
		"破军双斧(坤)",
		"隳城双戚(坤)",
		"飞头蛮(坤)",
		"竹叶青(坤)",
		"鲛煞(坤)",
		"啖月(坤)",
		"义战(坤)",
		"恶来(坤)",
		"烬世野火(坤)",
		"九州海沸(坤)",
		"八狱末劫(坤)",
		"罗喉计都(坤)",
		"非天(坤)"
	}

	return {
		n[佩戴][序列],
		(序列 - 1) * 10
	}
end

取可佩带武器名称1 = function(模型, 等级)
	local n = {}
	local 子类 = 角色武器类型[模型]
	local 佩戴 = 子类[ygsj(#子类)]
	local 序列 = 0
	local 奖励参数 = ygsj(30)

	if 等级 <= 175 then
		if 奖励参数 <= 10 then
			序列 = 13
		elseif 奖励参数 <= 20 then
			序列 = 14
		elseif 奖励参数 <= 30 then
			序列 = 15
		end
	end

	n[1] = {
		"红缨枪",
		"曲尖枪",
		"锯齿矛",
		"乌金三叉戟",
		"火焰枪",
		"墨杆金钩",
		"玄铁矛",
		"金蛇信",
		"丈八点钢矛",
		"暗夜",
		"梨花",
		"梨花",
		"刑天之逆",
		"五虎断魂",
		"飞龙在天",
		"天龙破城",
		"弑皇"
	}
	n[2] = {
		"青铜斧",
		"开山斧",
		"双面斧",
		"双弦钺",
		"精钢禅钺",
		"黄金钺",
		"乌金鬼头镰",
		"狂魔镰",
		"恶龙之齿",
		"破魄",
		"肃魂",
		"无敌",
		"五丁开山",
		"元神禁锢",
		"护法灭魔",
		"碧血干戚",
		"裂天"
	}
	n[3] = {
		"青铜短剑",
		"铁齿剑",
		"吴越剑",
		"青锋剑",
		"龙泉剑",
		"黄金剑",
		"游龙剑",
		"北斗七星剑",
		"碧玉剑",
		"鱼肠",
		"倚天",
		"湛卢",
		"魏武青虹",
		"灵犀神剑",
		"四法青云",
		"霜冷九州",
		"擒龙"
	}
	n[4] = {
		"双短剑",
		"镔铁双剑",
		"龙凤双剑",
		"竹节双剑",
		"狼牙双剑",
		"鱼骨双剑",
		"赤焰双剑",
		"墨玉双剑",
		"梅花双剑",
		"阴阳",
		"月光双剑",
		"灵蛇",
		"金龙双剪",
		"连理双树",
		"祖龙对剑",
		"紫电青霜",
		"浮犀"
	}
	n[5] = {
		"五色缎带",
		"幻彩银纱",
		"金丝彩带",
		"无极丝",
		"天蚕丝带",
		"云龙绸带",
		"七彩罗刹",
		"缚神绫",
		"九天仙绫",
		"彩虹",
		"流云",
		"碧波",
		"秋水落霞",
		"晃金仙绳",
		"此最相思",
		"揽月摘星",
		"九霄"
	}
	n[6] = {
		"铁爪",
		"天狼爪",
		"幽冥鬼爪",
		"青龙牙",
		"勾魂爪",
		"玄冰刺",
		"青刚刺",
		"华光刺",
		"龙鳞刺",
		"撕天",
		"毒牙",
		"胭脂",
		"九阴勾魂",
		"雪蚕之刺",
		"贵霜之牙",
		"忘川三途",
		"离钩"
	}
	n[7] = {
		"折扇",
		"铁骨扇",
		"精钢扇",
		"铁面扇",
		"百折扇",
		"劈水扇",
		"神火扇",
		"阴风扇",
		"风云雷电",
		"太极",
		"玉龙",
		"秋风",
		"画龙点睛",
		"秋水人家",
		"逍遥江湖",
		"浩气长舒",
		"星瀚"
	}
	n[8] = {
		"细木棒",
		"金丝魔棒",
		"玉如意",
		"点金棒",
		"云龙棒",
		"幽路引魂",
		"满天星",
		"水晶棒",
		"日月光华",
		"沧海",
		"红莲",
		"盘龙",
		"降魔玉杵",
		"青藤玉树",
		"墨玉骷髅",
		"丝萝乔木",
		"醍醐"
	}
	n[9] = {
		"松木锤",
		"镔铁锤",
		"八棱金瓜",
		"狼牙锤",
		"烈焰锤",
		"破甲战锤",
		"震天锤",
		"巨灵神锤",
		"天崩地裂",
		"八卦",
		"鬼牙",
		"雷神",
		"混元金锤",
		"九瓣莲花",
		"鬼王蚀日",
		"狂澜碎岳",
		"碎寂"
	}
	n[10] = {
		"牛皮鞭",
		"牛筋鞭",
		"乌龙鞭",
		"钢结鞭",
		"蛇骨鞭",
		"玉竹金铃",
		"青藤柳叶鞭",
		"雷鸣嗜血鞭",
		"混元金钩",
		"龙筋",
		"百花",
		"吹雪",
		"游龙惊鸿",
		"仙人指路",
		"血之刺藤",
		"牧云清歌",
		"霜陨"
	}
	n[11] = {
		"黄铜圈",
		"精钢日月圈",
		"离情环",
		"金刺轮",
		"风火圈",
		"赤炎环",
		"蛇形月",
		"子母双月",
		"斜月狼牙",
		"如意",
		"乾坤",
		"月光双环",
		"别情离恨",
		"金玉双环",
		"九天金线",
		"无关风月",
		"朝夕"
	}
	n[12] = {
		"柳叶刀",
		"苗刀",
		"夜魔弯刀",
		"金背大砍刀",
		"雁翅刀",
		"破天宝刀",
		"狼牙刀",
		"龙鳞宝刀",
		"黑炎魔刀",
		"冷月",
		"屠龙",
		"血刃",
		"偃月青龙",
		"晓风残月",
		"斩妖泣血",
		"业火三灾",
		"鸣鸿"
	}
	n[13] = {
		"曲柳杖",
		"红木杖",
		"白椴杖",
		"墨铁拐",
		"玄铁牛角杖",
		"鹰眼法杖",
		"腾云杖",
		"引魂杖",
		"碧玺杖",
		"业焰",
		"玉辉",
		"鹿鸣",
		"庄周梦蝶",
		"凤翼流珠",
		"雪蟒霜寒",
		"碧海潮生",
		"弦月"
	}
	n[14] = {
		"硬木弓",
		"铁胆弓",
		"紫檀弓",
		"宝雕长弓",
		"錾金宝弓",
		"玉腰弯弓",
		"连珠神弓",
		"游鱼戏珠",
		"灵犀望月",
		"非攻",
		"幽篁",
		"百鬼",
		"冥火薄天",
		"龙鸣寒水",
		"太极流光",
		"九霄风雷",
		"若木"
	}
	n[15] = {
		"琉璃珠",
		"水晶珠",
		"珍宝珠",
		"翡翠珠",
		"莲华珠",
		"夜灵珠",
		"如意宝珠",
		"沧海明珠",
		"无量玉璧",
		"离火",
		"飞星",
		"月华",
		"回风舞雪",
		"紫金葫芦",
		"裂云啸日",
		"云雷万里",
		"赤明"
	}
	n[16] = {
		"钝铁重剑",
		"桃印铁刃",
		"赭石巨剑",
		"壁玉长铗",
		"青铜古剑",
		"金错巨刃",
		"惊涛雪",
		"醉浮生",
		"沉戟天戊",
		"鸦九",
		"昆吾",
		"弦歌",
		"墨骨枯麟",
		"腾蛇郁刃",
		"秋水澄流",
		"百辟镇魂",
		"长息"
	}
	n[17] = {
		"油纸伞",
		"红罗伞",
		"紫竹伞",
		"锦绣椎",
		"幽兰帐",
		"琳琅盖",
		"孔雀羽",
		"金刚伞",
		"落梅伞",
		"鬼骨",
		"云梦",
		"枕霞",
		"碧火琉璃",
		"雪羽穿云",
		"月影星痕",
		"浮生归梦",
		"晴雪"
	}
	n[18] = {
		"素纸灯",
		"竹骨灯",
		"红灯笼",
		"鲤鱼灯",
		"芙蓉花灯",
		"如意宫灯",
		"玲珑盏",
		"玉兔盏",
		"冰心盏",
		"蟠龙",
		"云鹤",
		"风荷",
		"金风玉露",
		"凰火燎原",
		"月露清愁",
		"夭桃秾李",
		"荒尘"
	}
	n[910] = {
		"顽石双斧(乾)",
		"镔铁双斧(乾)",
		"黑曜双斧(乾)",
		"枭首双斧(乾)",
		"破军双斧(乾)",
		"隳城双戚(乾)",
		"飞头蛮(乾)",
		"竹叶青(乾)",
		"鲛煞(乾)",
		"啖月(乾)",
		"义战(乾)",
		"恶来(乾)",
		"烬世野火(乾)",
		"九州海沸(乾)",
		"八狱末劫(乾)",
		"罗喉计都(乾)",
		"非天(乾)"
	}
	n[911] = {
		"顽石双斧(坤)",
		"镔铁双斧(坤)",
		"黑曜双斧(坤)",
		"枭首双斧(坤)",
		"破军双斧(坤)",
		"隳城双戚(坤)",
		"飞头蛮(坤)",
		"竹叶青(坤)",
		"鲛煞(坤)",
		"啖月(坤)",
		"义战(坤)",
		"恶来(坤)",
		"烬世野火(坤)",
		"九州海沸(坤)",
		"八狱末劫(坤)",
		"罗喉计都(坤)",
		"非天(坤)"
	}

	return {
		n[佩戴][序列],
		(序列 - 1) * 10
	}
end

取剑会天下数据 = function(id)
	if 剑会天下[id] == nil then
		剑会天下[id] = {
			连胜 = 0,
			当前积分 = 1200,
			名称 = 玩家数据[id].角色.名称,
			等级 = 玩家数据[id].角色.等级,
			id = id,
			门派 = 玩家数据[id].角色.门派
		}
	end
end

取随机中文姓名 = function(num)
	local 字库 = "闻霁充娅思邸硕司马凝远哀元绿端元瑶褚曜灿堂涵忍摘大郝奥翦含莲罗小瑜查冷雪乐正玉琲田正平钟之玉赵斯令狐昆明檄春燕范振海夙元龙赫嘉玉子车舒兰蛮谧登谷雪夔毅秋锁鸿媳赖温瑜折靖之集晓曼甲文思妫巧凡酒擅邗雁卉帛小蕊左春兰节书双应卿陶骏中望舒驹建修禚又儿似修远百令雪占嘉悦谢刚毅银青梦苏波涛鲍慕诗敖弘伟贯语儿姬寄波澄正信蒉鹤梦琦银河鞠春祁秋翠开智渊东郭雅素闵妮子辟雨雪勾红螺张廖元勋隐弘量晋紫雪洛冰慎贤淑嬴天音续之桃唐涵意招正平归梦云束新苗喜逸明史语林后同光青安青接凝芙洋庄雅位英范危芳茵及谷槐郗访曼逯雨珍信昊苍慕驰月诸白萱臧彤彤畅阳曦仉傲雪守易云运思彤漆雕韫玉空歌闪梦菡赫连翰采督代珊姓蕾宝洛妃建诗霜米海菡颛孙瀚昂贲仕壬雅云禽文康后漾漾藩驰丽卿瑜江欣悦杞傲冬阿含之卢雅丹悟远碧如波糜雨信南家欣窦冬卉贝启颜水子美辉高兴喻荷紫黎和通辛问萍纳本眭晗日滕月天赏鹏涛历乃丰家伍心曾沙摩凌兰熊昭昭出文景康卫睢痴凝闾清润修骊英莫向晨愧采萱九驰不听然稽安珊库燕妮伯巧夏营欢问音愚晶灵亓官馨欣竹晓蕾拓跋琨瑜盖问萍阎捷揭元槐纵兴运斐闲丽舜赐迟欣崇书萱宗政夜蓉丁易梦宇梦香郁静柏戏飞薇裔音韵云彩萱牵芊候一嘉求慕悦贰馨香伊白云淳于春英亢三载半兰能清逸蒲千亦检夜梅李寄瑶余盼翠张简琨燕佩杉端木诗珊万心菱台浩宕恽平婉终阳阳岳藏栾鸿飞巴云飞狂新梅郏凌兰衷平母子芸卜静舷萨任真太史天薇蹉宛妙房飞文宋乐游边佩蓟天罡纳喇和裕贵立人呼延素昕薛明熙考飒理丹烟封静慧线叡费慕山谷蔓官梦华谌初夏成芦冠英韶饶颖初枚浩波全从筠风闲公新蕾春山兰拱晨欣宇文思萱鹿寒天邢清涵牧心语双寒介平心抄幼荷图门沛首堂却强严景澄绍曦之纪德昌剧沛容和新筠奕白卉翠问兰校以丹禹骏英强靓影沙银弭海颖告博简段干庄葛雨真支怜双褒静枫巫慕思屠建柏汝燕珺缪斯雅松秋英刚星河勤昆峰宛宜阮凡雁楼和洽卯友安善宏阔裘鸿彩柳乐章华倩秀说暮芸长秋玉师飞兰蔺以彤宿曼寒凭雨伯山幼仪钞怀玉汉华晖幸宏大广洋洋树隽美进乐容芒倚本天巧隽文光完颜亦凝乔冷萱用晴虹温芦雪夏侯飞昂书映秋马佳云逸英听芹辜厚荆书艺亓若淑芮惠然羊英苌明珠穰西生雨石但梓璐岑睿范完湘所代梅清翰学答陶秘以彤融菡梅蒋曼凡帖雅彤向绮梅恭昶良语燕豆涤咎凝罕幼柏聊敏达愈曼岚波晴照那拉翠芙桥映冬倪柔妙夏空牢元绿蒯春晓皮迎丝拜烨华红吉玉马惠君敛半香那含巧陀嘉祥骑访文禾润魏向秋桑驰海卯阳旭邬凌春福听安连醉波原浩然扶施诗邵靖颜寻双车子蕙垄醉巧第悟蓬白曼律楚庞颖秀势文惠仝安宜谈晶滢满梦竹瞿丝劳乐然元浩气有浩淼司徒嘉致玉颖颖竭袖公冶兰英让森丽蹇清淑泉思美佴昊东潘鹏池宓霞雰浦桂芝同斯伯种向晨厚娜周舟邛采绿前香桃祢春梳溥云亭绪水彤兆阳蓉秦腾逸舒魄羽家美令和硕永慕蕊由亦梅仇依辰柏甜恬仲孙俊捷功映秋笪昕昕麦平萱化清绮酆易容尹姗寿山芙段证百里浩岚碧鲁清怡仁俊爽花香莲太叔欣悦冉山蝶呼晗玥少骊蓉司嘉议轩援又青宾若骞鄂永贞邰新知谷梁又槐公西学义业绿蕊肥荌牛含香仪智勇尤噬汪伟志甫紫云奚觅风于家美栗庆音童半雪野翰藻丑礼骞路半青肇同方漆暖梦世幼枫峪景龙硕寄松弥丹萱箕岚风谯志行朱玉树费莫阳晖象翠茵东方震繁梓云公良凌蝶綦凡灵资夏旋潜高义冀香旋伺醉柳祈海白焉文斌俎赞乌雅丽华植乐双犹诗桃乌孙弘壮勇婷婷力三姗夷阳舒大凌春毓敏智普巍然包文昌希之仆鸿运宣用才唁红泥俨虞璞性元正甄水风卑耘豪蔡清雅尉初雪曲琛雍经业高知荀涵涤吉通随思远苗凝海诺纯战承安夹谷霞梳左丘南琴称之卉瑞古代唱月兴香岚佼兴德茹昊硕杨谷之侯沛槐况瑜英军丹寒蓉希慕慕容涵蕾貊凯唱养福濯茂学郦彰明朗丽刘阳火骆轩秀智春柏石浩广泰嘉平虢芝兰鄢秋寒市饮月镇寒梦易鹏飞鲜安楚易真卫瑛瑶齐博涛函秀竹茂楠楠謇济彤玛丽屈丹山顿复孟又菡利廷剑作人度暄莹危元嘉庚雅琴之虹彩门念双虎朝池灵珊望和同延映寒廖博瀚娄钰诸葛茂唁布幻天文晓枫笃凝珍东门兴昌闳虹颖奈碧春俟楠乙音华达灵安威夏月公羊羡寻才捷棺玉轩蒙溪隋琪睿柯宜然以惜芹刀晴曦汗健尉迟雅琴皇甲钱豫暴雨莲时秋露北访冬速盼易樊思怡缑哲思斛熙星伦建武鸿达宦惜香寇代巧上官半凡竺赫尔夜雪改清懿通从凝源雨琴焦晴波析芳茵穆梳美麴依白郁旻骞巩宁税谷槐祝鸿卓始淳静井映雪籍辰皓钮白梅保若芳睦初蝶昔虹雨章佳浚乐嘉熙佘令锋肖运洁励阳曜京英豪郸元甲吴雅美于夏菡詹依秋阴绍辉雪春雪管骊霞闫晖素婉静奇笛韵僪问柳捷瑛承英才刁采白郑惜玉城澍钭若翠买任习春翠椅灵雨施叶春侨采苟绿海耿萄萄毕秋华檀程单于凌丝犁新儿璩嘉树鲁建安区巧荷老颜骏初倩鱼南琴惠蕴和枝丽泽士运菱佛靖儿欧梦露祖晶滢盈修文扬玲逄伦六湘君顾博雅塔尚庹尔阳昌水之摇碧琴莘浩涆伟佁然微生玥逮愉东望雅沃爵殳欣悦陆半脱向卉在驰媛丙莱言思义侍涵蕾朴宇邴慧颖敬迎南冯兴盛丹秋仰寅果迎曼次芃孙明凝多月灵廉怿昂丹彤公孙问凝霜为郎翊君紫冷之歧彤可念烟千依云索友灵庾瑜然漫友安镜涵菱蔚怜烟申高峰丛庄静实问薇薄简藏梅梅范姜锐意蓝豪纤情文森易天寄灵雀和昶刑洋公叔慈农嘉良靳向南嘉艳蕊疏玑单雪羽哈高格字静安嵇凯旋都苑项映寒乾芳荃牟云水矫昊宇渠奕俞水洪腾骏澹台书兰巫马南晴潭陶然行俊艾匡雅韵淦志明琴元青家甘盍念珍孝弘大雷丰茂亥绮烟益河灵真胤运司寇梦桃宁茵禄萦党明德荤羡丽敏怿梅思美聂德运局涵韵宫柔蔓游乐邝怀梦干鸣革德华黄从蕾戴卓然曹昊天腾经零惜儿湛骊颖香含云阳子帆胡吉星藤晓曼国德厉丝柳别俊晤皋荷止曼蔓卷骄无念梦环嘉珍钟离飞语晁安萱仵平绿声宏硕麻初彤戢清漪寸方凤素昕吕华翰频琴贾凌覃采梦苑雅逸操又夏浑柔惠章运诚诗文君乌以蕊礼鸿才慈听枫错惜狄溥心韶博裕独湛芳戊曜曦柔存郯迎真居扬僧羲过琛丽锐惠心须卿月堵曼衍展香萱其和悌昝修雅班和雅冒诗蕊崔雅素仍采南旗曼冬墨毅梅磨雯华圣冬梅潭觅露纵智系玉瑾尾修永相半双典琅翁韵萧和悌兰妙芙赤勇毅何浩慨杜胤富察丽文王谷菱示坚壁赛醉柳梁丘阳兰依安翔允曼寒沉秀雅邓端敏么梓馨浮安易龚芸若彭雄掌秀媚己伶俐请南霜暨芝戚飞光第五凝莲步夏瑶星元基郜傲之祭瑞芝储海超抗畅然念慧秀钊香梅忻笛濮阳春华练毅文户和美铣小夏粟晓曼栋听枫壤驷访文毋舒兰隆迎丝是南露留严和林紫雪权涵煦戎智敏涂若云方尔柳季以柳逢凝安侍阳煦夕涵育将芳馨乘友槐白雪曼袁半芹茅夜玉经禹巢春柔邶逸思厍鸿哲晏灵卉莱广符天蓝宜永嘉绳昕解弼宏宜修龙文德吾秀美卞振国戈冰冰谬梓露信凝绿赧晓山南门浦泽孛鸿祯裴心语陈证琪类昊然朋尾府运珹帅寻云道虹影贸驰逸程幻巧学醉柳秋觅柔针启寒秋珊怀玉龙闽星爵塞艳卉殷曼容甘紫萱尚新美淡秀妮席飞双斯丽窃碧灵衣灵波潮冰真丘春海汤语彤从谷翠叶素欣光晴曦伏湉湉印从霜傅彩严许迎天佟佳壮羿海凡徐语蓉偶乐松越凌晓柴妙晴衡中旁学民古芳商芸芸阙沛白锺离从蓉盘婉柔欧阳晨辰杭初之平云蔚飞雅静濮云金乐巧冷春雪宰永宁靖光耀迮昭君爱若雁卓高达乜语梦闭小翠休娟严合全夫怡悦万俟书琴德欣然贺念云苍笑柳粘证蝶长孙半兰姜天和鄞孤萍简晋鹏铁毅远董沛凝司空清韵贡志文来暄和桓凡桃宗梦寒悉丽梳阚弘济叔自霍怀曼汲平卉撒白秋旅依琴仙依心翟乐天宰父幼荷郭国源常浦泽翁语弓红叶委依云梁新雅张筠溪安嘉祯苦子珍闾丘俊美沐幼霜义子骞皇甫谷玉遇儿五又松南宫涵映孔平卉锺昊空计翰飞申屠阔定白凝谏允晨凌田絮沛白员雅柔訾慕凝表元凯巨书萱机景明桐醉蝶艾锐锋关渺仲子萱丹正卿奉浩思任暄闻人曼梅蒿皓月景芮丽富宜庄艳芳务蕙兰法景明扈紫丝玄宛曼鲜于岑巧善和滑安和铎珠轩海同韩飞雪召宇烟昊天桂绮晴容惜灵年芬芬邱芳蔼徭佳惠西门思莹佟白翠姚远骞旷天骄毛青友芝宇坚建元板松月泣乐蕊羊舌新洁圭湘云弘以蕊受霞文回兴贤忻证烟寒辰龙错远悦郏怜雪本羡丽巫俊民虢辰钊陶绮波危兴请从鹏云书湘云师朗权华美侯翠梅謇惠君濮采萱繁素昕公西暮芸令紫南欧阳悦媛皇甫珍丽段干冠宇僧梳全苗边萦心揭翰采辛嘉禾睦碧螺阿静粟凡白梁光熙昂玄静钮小蕊锺离易绿碧向槐抗宏壮戊依白羽小蕾莘宏博单迎南逄高兴古新林战灵槐萨曦悟梓珊孛晓星请宛卓芊芊中宜嘉字蓓蕾喻清芬焦书云劳彤犁英睿光暖聂以蕊钟离芸芸锐凌香真寒梅郁龙皇香天乌雅烨磊郜阳司空翠岚九山菡皮静秀嵇昭懿薛雨泽伍瑞渊单于梦露纪润亓绮玉区经亘甫冷萱藏妙晴练志学宗萄貊伟兆罗绿凝秘康成左丘婉丽邝小星乜乐安谷梁梦桐覃春柏恽耘涛傅贤淑伺光辉谈星驰载易巧理陶宁革涵涵在梓萱伊奇文独寒香合静婉苦安国枚涵阳越含说艳丽阮月悦函安娜郸飞跃赫连俊雅诗婉静善运凯应惜筠环君浩翠白竹矫文昌窃冬梅丹思雅武菡操毅君富润丽姜清婉斛雅容仰琬义弘光詹志行庾方方晁英华班雅韵慕鸿祯干若纳宏峻铎湛英铣雅宁褒浦和乔毅秋东方香洁喜怡和于千山养雅容车珠玉荆证若茹胜撒晨轩富察静雅东郭刚毅解夏寒袁芙受承安禾盼丹孝凡儿鄂冰安蹉秉漆雕香波宇文楚天长星强毅灵须秋芸通宛丝蒯顺慈同若英戎成侍山槐郭雅惠夕怀山封谷尤山雁示俊力阴暄美桥元菱斯鸿信瞿沛雯拓跋采枫翦雪兰庄雅舷都毅安潭秀雅类淑华蛮冰表晓彤似香卉节丽华汪问风燕苑杰法鸿远苟天韵纵高朗罕云溪机梦琪倪思义帛诗翠伦迎夏丁巧云宇文曜晏天真甘高原代绮云圣以晴沉绿兰巢桂华第运鹏贝智辰垄思博空振锐顾月杉玉骊萍陀昭祝灵松威韶翁静枫楚秀颖家婷美辟和煦奚广君毛莞然宗政笑严阎向雪姚雍雅哈尔阳申语蕊尉冰双佴新翰钞问梅厍依柔委和正多堂庚又柔纤绿竹元蔓儿资妙音亓官静芙尚运珹钭证文随宏义白浩阔犹安安邛宏爽施尔槐驹姗姗贺代梅逮浩然栗景彰仙和悦峪雅艳支语丝波绿蕊候国兴章钧接凌青上官雅艳祭依美云严严伟新月贸凡灵酒霈周夏柳笪妙芙叔鸿云以乐家玄春华刀梓柔昔毅梅象寒烟念冷荷端华晖郁泽雨蓟阳兰百里以晴路宜欣闳蕴秀公冶昌勋甄兴德曹采文暨小春严本林曲静锁冷雪硕和洽司徒白秋桑巧春董元忠巴和玉乙远航前含秀竭雄禚醉芙涂艳芳唐夏柳金如曼青年茅翠阳虎微澜范姜雅达卿清怡彤心香闾尔柳京素昕邓丹丹敏天青励星华巧悦爱壤驷流如慎安祯端木凝芙薄齐心蓝念文士灵慧延鸿晖宏韵磬雪丽芳堵馨欣麻智敏北蔼贾乐成嘉玲珑廖曼珠种文敏毕诗珊石慕卉江山蝶仲绮玉旁安荷佟佳金玉让慧婕旷谷兰松悦宜考幼怡卢扬滕佩杉军觅双藤正平侨晴岚刚平良危凝静孙宏阔戚魁将沛凝郑良骏始今敖雅安宿恬畅潜初雪是陶然晋瑶岑睢静竹衷寒梅银琪告景福宣若云化曼冬惠曼婉眭亦褚毅南稽夏瑶呼延姣严张简新知温水丹植永昌红毅彤闵灵波公宏貌向平宁隽代双赛筱贲星文花念念摘景明钟子珍仝谷蕊寿雨琴捷起壬昊昊东门山雁赤沛春储腾骏枝慧月毓觅晴哀宁徐梦之湛苒苒卫慧牛迎南亥忻欢熊英叡过优悠问允建乐圣郎安娜万俟飞翔买秀隽梁丘振宇徭云飞有荷珠速浚伯冰海愚慧君英静竹俞幻玉琦米冀元行访烟凤阳夏泥寄柔敬凝竹王博擅公叔兰英赏婉娜闾丘星火藩初柳佘靖巧庞靖易辉元冬充晓莉老流乌皓轩刘雅辰城韵诗鄞学名才绿旋频代秋树巧夏卯宇臧奇伟弘阳炎畅书文改危杨夜蓉沙念桃厚灵溪令狐双玉修琰淳于毅霜户中闽溶溶赵浦势小蕊鲍香雪佟南琴芮玉成凭浩渺姬桂诸葛如馨澹台正德尹笑容冉才俊尔梓敏辜臻五穰仵夜梅逯冰凡高锦欣盘君丽典懿勤云逸僪莹洁耿鹤骞况华池杞哲圣赖欣畅利博学张晶滢程冬灵池志泽汤绮南刑白安竹听安丙盼旋门怿逢迎梅信悠素鲜雁露杜项明展元旋麦水荷吴元彤塔高貌掌沛白万幼旋实丽文长孙其雨板涵韵亢飇丑利谢瀚海鄢毅成林楠普芳茵剧心宜声伟唁溥洁玉析宵雨吾高旻华之桃梅岑招寅骏靖衍易向卉司寇悦项莺莺务赞莱梓琬腾向阳贰姿夷旭炎鲜于齐濯蕴涵常寄春蒙淳美岳梦寒蒲志用蒿春翠迮秀穆听所舞苍初阳用清润管赫别小凝力晖扈义桂半梅赧蕴和烟天骄后雅蕊春芮佳伏和悌文南栾映雪仁凌春清青柏疏清俊麴傲薇帖慕山融玉泉祈思语旗令羽冷文滨茂泰华桐逸秀盛朔谯烨烨厉和平巩阳禽飞柏连胤文许觅丹夔芳洲保梅风位红雪泣凡桃召惜珊宋晨辰裴傲云谏伟祺祢英卫祁飞捷脱佳文奇青香尾白山暴晤市翰飞缑浩广容证雪休承教登松南门博雅求思菱段唁杉妫听筠宦彤霞方思烟卞掣楼慕蕊邱明旭么依白国宛秋赫恩霈淦子楠阙秀越那拉清华乐正寻梅粘光启聊依琴艾意智允欣美饶心箕清馨庹含桃奉宏恺律翰初田田陈雁风检子石微生致远叶又绿零羽霜古兰贯证文绪锦诗翟平凡季永思羿慈心凌曼彤印歌阑寇钰洪慕凝阳紫文年易梦南馨香守弘新崔隽洁鞠全巫马诗柳张廖皓月费乐邦次萍韵答梦秋达娟闻人嘉佑香毅秋棺幻玉谷忻慕匡茜双琴雪邶雪儿己茗弓昊磊苗书雁智听南呼阳飇敛恨桃焉谷槐蔺静云戏惜珊綦绮美系博文漫雅韶第五沛凝剑冰枫望语雪佼夏雪隐访波依清漪乌孙怀魏永丰肖展景古香斐壤巨煜游烨然丘迎彤党璞称宕舒问凝殷凡灵虞玲折蒙黎斯乔秦季雅完晓习绮兰功向秋朱鹤源娜娜束端敏马鹏举相华灿澄柔丽屠秀媛不丁进吟柔阳朔宰父可可舜雪曼邗尔阳司天工洛智宇碧鲁昕昕盍景龙堂子民步宣朗冠家骏占刚捷莫尔蓉章佳桃雨席琪睿羊睿好隋千叶汝莹华浑雅逸曾化籍馨兰闭问萍甲英朗柳奇水镜晨萱母谧辰友莺语李振博韶丹蝶祖雪卉史白云谬之岑舒昌紫萱笃元容蓬恨真羊舌暄莹浦竹雨荀胤水兴邦竺绮琴由志诚盖白飞惜寒俎天玉康欢欣来元武狂冬灵大新文桓芸若扶纳禹亦竹夹谷野雪任羲鱼毅雪朋蕴美台甘潘雅丹遇宏放太史晴波朴飞掣钊俊智仇晓凡符蔚然吕谨度卿云卜依凝益绿柏闫玉书星笑南韩冰洁圭采萱商芳蕤龙雅丽宓鸿运海静枫柯正文宁游彭书白漆代桃布建白檄维诸欣愉糜朋兴苑丽君历材于韶华檀茵却秋寒禄温文明洛灵拜寒凝完颜沙羽言怡畅房作幸建木介鸿振礼鸿朗希采梦汗恬时芳荃曲尔蝶卑荡蔡清逸鲁雅彤邢俊茂肇晓闻一嘉雀溥心宰健和忻然窦依薇兆芳茵靳兴贤愈冬萱卷念巧翁雅宁迟雅逸针卿月颛孙曜坤局春岚仍飞飙闪品诺清绮泉皓廉才英摇新美乐幼珊咎玉树勾坚白霍驰海包水冬之松崇清涵坚茹云豆觅珍骆巍然戈谷芹居秀兰郗盼晴汲半蕾良以宫暄文戴司辰弥可佳陆绿夏郦启绍畴璩冷松夏侯高岑承坚诚世坚秉绳妙芙蹇正思司马元良悉媛汉之卉欧唁君絮从筠柏绮彤官清淑沃凝心塞鹤梦酆书兰邴琨瑜栋飞双秋英华南宫心菱蒋之槐蒉清卓嬴昊天衡惜筠贵良奥其雪羽风方雅永怜烟线虹星缪格格邵念巧宾气生涵柳磨嘉良抄青梦殳晏然首梅花定怡然续聪慧山骊茹侍灵波纵善静镇尔风锺修洁阚代灵米伶伶安人公良畅畅公羊秀越千琳冒书兰丛半兰芒沛柔仪凝芙计芳林苏正平贡央田鸿博集博无雨歧涵忍仉危井鸿煊关歌阑爱晶辉何舒畅钱永新宜茂才索月渠依萱怀文止高驰盈澍雷霞梳墨学林森思云胡梦蕊刁驰颖愧飞翰百曼衍琴建柏葛晶辉骑云岚寻飞羽野蒙雨顿清淑铁玉韵督蝶梦颜弘济德恨之运天睿开仙仪姓芮帅子真滑毅南留高明范君昊信银柳仆元枫六昂杰龚颖馨出君雅乾逸丽经秋双弭莉莉戢玮琪勇一南图门静槐平若骞旅慕雁偶珠佩果冰之郯依珊夏自珍裘慧语宛飞薇能辰危苌甜恬简菀西门向晨衣和硕佛雪松童良翰长静柏尉迟友易归超子车朝雨邰夏兰恭代蓝回雁菱娄听云牵晗摩婵娟及鹏鲸齐语柔道毅然原卓逸鹿言文广吹屈歆然紫端邬平灵素霞月雍小珍穰怜晴兴素欣员仪文"
	local 字数 = string.len(字库) / 2
	local 昵称 = ""

	for i = 1, num do
		local 随机文字 = math.random(2, 字数) * 2
		昵称 = 昵称 .. string.sub(字库, 随机文字 - 1, 随机文字)
	end

	return 昵称
end

取宝宝 = function(bb)
	local bbs = {}

	if bb == "老虎" or bb == "老虎x" then
		bbs[1] = 15
		bbs[2] = 1380
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 1380
		bbs[6] = 1200
		bbs[7] = 1080
		bbs[8] = {
			1.004,
			1.014,
			1.025,
			1.135,
			1.145
		}
		bbs[9] = {
			"连击",
			"驱鬼",
			"幸运",
			"强力"
		}
	elseif bb == "白熊" or bb == "白熊x" then
		bbs[1] = 45
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 5280
		bbs[5] = 1800
		bbs[6] = 960
		bbs[7] = 1380
		bbs[8] = {
			1.097,
			1.108,
			1.12,
			1.131,
			1.142
		}
		bbs[9] = {
			"迟钝",
			"强力",
			"防御",
			"高级反击",
			"高级必杀"
		}
	elseif bb == "虾兵" or bb == "虾兵x" then
		bbs[1] = 25
		bbs[2] = 1200
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[6] = 1080
		bbs[7] = 1440
		bbs[8] = {
			1.014,
			1.024,
			1.035,
			1.045,
			1.055
		}
		bbs[9] = {
			"高级反击",
			"高级必杀",
			"驱鬼",
			"水属性吸收"
		}
	elseif bb == "狼" or bb == "狼x" then
		bbs[1] = 25
		bbs[2] = 1440
		bbs[3] = 960
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[6] = 1500
		bbs[7] = 1464
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"高级连击",
			"驱鬼",
			"连击",
			"偷袭",
			"夜战"
		}
	elseif bb == "噬天虎" or bb == "噬天虎x" then
		bbs[1] = 125
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[6] = 1500
		bbs[7] = 1560
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级连击",
			"驱鬼",
			"幸运",
			"高级强力"
		}
	elseif bb == "雨师" or bb == "雨师x" then
		bbs[1] = 65
		bbs[2] = 1200
		bbs[3] = 1380
		bbs[4] = 4200
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1620
		bbs[8] = {
			1.156,
			1.168,
			1.18,
			1.191,
			1.203
		}
		bbs[9] = {
			"水攻",
			"高级雷属性吸收",
			"高级水属性吸收",
			"高级土属性吸收",
			"高级火属性吸收"
		}
	elseif bb == "牛头" or bb == "牛头x" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 1800
		bbs[6] = 1440
		bbs[7] = 1200
		bbs[8] = {
			1.058,
			1.069,
			1.08,
			1.09,
			1.101
		}
		bbs[9] = {
			"驱鬼",
			"高级必杀",
			"招架",
			"高级鬼魂术",
			"夜战"
		}
	elseif bb == "骷髅怪" or bb == "骷髅怪x" then
		bbs[1] = 15
		bbs[2] = 1200
		bbs[3] = 1200
		bbs[4] = 3000
		bbs[5] = 1200
		bbs[6] = 1200
		bbs[7] = 1500
		bbs[8] = {
			1.009,
			1.019,
			1.03,
			1.04,
			1.05
		}
		bbs[9] = {
			"土属性吸收",
			"弱点雷",
			"鬼魂术",
			"夜战"
		}
	elseif bb == "祥瑞腾蛇" then
		bbs[1] = 0
		bbs[2] = 1400
		bbs[3] = 1400
		bbs[4] = 4500
		bbs[5] = 2500
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			1.25,
			1.25,
			1.25,
			1.25,
			1.25
		}
		bbs[9] = {}
	elseif bb == "修罗傀儡鬼" then
		bbs[1] = 155
		bbs[2] = 1524
		bbs[3] = 1380
		bbs[4] = 5040
		bbs[5] = 2400
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级夜战",
			"反震",
			"高级必杀",
			"强力",
			"嗜血追击"
		}
	elseif bb == "树怪" then
		bbs[1] = 5
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 3300
		bbs[5] = 1320
		bbs[6] = 900
		bbs[7] = 960
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"反击",
			"感知",
			"驱鬼",
			"再生",
			"弱点火",
			"迟钝"
		}
	elseif bb == "羊头怪" or bb == "羊头怪x" then
		bbs[1] = 15
		bbs[2] = 1260
		bbs[3] = 1380
		bbs[4] = 3360
		bbs[5] = 1320
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			1.004,
			1.014,
			1.025,
			1.035,
			1.045
		}
		bbs[9] = {
			"连击",
			"必杀",
			"幸运",
			"永恒"
		}
	elseif bb == "海毛虫" then
		bbs[1] = 5
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[6] = 1320
		bbs[7] = 1200
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"毒",
			"高级反震",
			"必杀",
			"夜战",
			"弱点火"
		}
	elseif bb == "野猪" or bb == "野猪x" then
		bbs[1] = 5
		bbs[2] = 1140
		bbs[3] = 1140
		bbs[4] = 3840
		bbs[5] = 1260
		bbs[6] = 1140
		bbs[7] = 1200
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"感知",
			"高级感知",
			"高级幸运",
			"强力",
			"弱点土",
			"弱点火"
		}
	elseif bb == "天兵" or bb == "天兵x" then
		bbs[1] = 55
		bbs[2] = 1320
		bbs[3] = 1500
		bbs[4] = 5100
		bbs[5] = 2220
		bbs[6] = 1320
		bbs[7] = 1320
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.173
		}
		bbs[9] = {
			"高级防御",
			"高级感知",
			"必杀",
			"高级驱鬼"
		}
	elseif bb == "野猪精" then
		bbs[1] = 85
		bbs[2] = 1464
		bbs[3] = 1560
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"反击",
			"感知",
			"弱点水",
			"高级强力"
		}
	elseif bb == "灵灯侍者" then
		bbs[1] = 175
		bbs[2] = 1404
		bbs[3] = 1524
		bbs[4] = 5760
		bbs[5] = 2760
		bbs[6] = 1536
		bbs[7] = 1440
		bbs[8] = {
			1.264,
			1.277,
			1.29,
			1.3,
			1.31
		}
		bbs[9] = {
			"无畏布施",
			"防御",
			"雷击",
			"高级慧根",
			"高级雷属性吸收"
		}
	elseif bb == "赌徒" or bb == "赌徒x" then
		bbs[1] = 5
		bbs[2] = 1020
		bbs[3] = 1140
		bbs[4] = 3000
		bbs[5] = 1440
		bbs[6] = 1440
		bbs[7] = 1380
		bbs[8] = {
			0.931,
			0.94,
			0.95,
			0.959,
			0.969
		}
		bbs[9] = {}
	elseif bb == "野鬼" or bb == "野鬼x" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 4200
		bbs[5] = 1200
		bbs[6] = 1140
		bbs[7] = 1260
		bbs[8] = {
			0.994,
			1.004,
			1.015,
			1.025,
			1.035
		}
		bbs[9] = {
			"落岩",
			"土属性吸收",
			"鬼魂术",
			"夜战"
		}
	elseif bb == "修罗傀儡妖" then
		bbs[1] = 165
		bbs[2] = 1536
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[6] = 1500
		bbs[7] = 1440
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"合纵",
			"感知",
			"高级幸运",
			"高级连击"
		}
	elseif bb == "连弩车" then
		bbs[1] = 145
		bbs[2] = 1500
		bbs[3] = 1560
		bbs[4] = 5400
		bbs[5] = 2400
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级强力",
			"防御",
			"连击",
			"迟钝"
		}
	elseif bb == "黑熊精" or bb == "黑熊精x" then
		bbs[1] = 35
		bbs[2] = 1380
		bbs[3] = 1260
		bbs[4] = 5040
		bbs[5] = 2160
		bbs[6] = 1020
		bbs[7] = 1320
		bbs[8] = {
			1.024,
			1.034,
			1.045,
			1.055,
			1.065
		}
		bbs[9] = {
			"反震",
			"必杀",
			"刀背打",
			"高级强力",
			"弱点雷"
		}
	elseif bb == "金身罗汉" then
		bbs[1] = 165
		bbs[2] = 1380
		bbs[3] = 1500
		bbs[4] = 5400
		bbs[5] = 2400
		bbs[6] = 1560
		bbs[7] = 1440
		bbs[8] = {
			1.244,
			1.257,
			1.27,
			1.282,
			1.295
		}
		bbs[9] = {
			"永恒",
			"高级反震",
			"神佑复生",
			"盾气",
			"高级敏捷"
		}
	elseif bb == "犀牛将军人形" then
		bbs[1] = 75
		bbs[2] = 1440
		bbs[3] = 1464
		bbs[4] = 4800
		bbs[5] = 2520
		bbs[6] = 1200
		bbs[7] = 1140
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"高级强力",
			"高级幸运",
			"剑荡四方",
			"再生"
		}
	elseif bb == "大海龟" then
		bbs[1] = 0
		bbs[2] = 960
		bbs[3] = 960
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[6] = 840
		bbs[7] = 1320
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"反震",
			"慧根",
			"幸运",
			"水属性吸收",
			"防御"
		}
	elseif bb == "曼珠沙华" then
		bbs[1] = 165
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2640
		bbs[6] = 1500
		bbs[7] = 1440
		bbs[8] = {
			1.244,
			1.257,
			1.27,
			1.282,
			1.295
		}
		bbs[9] = {
			"高级招架",
			"招架",
			"反震",
			"高级法术抵抗",
			"高级再生"
		}
	elseif bb == "长眉灵猴" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 5640
		bbs[5] = 3240
		bbs[6] = 1200
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"奔雷咒",
			"高级法术暴击",
			"冥思",
			"高级再生"
		}
	elseif bb == "护卫" then
		bbs[1] = 0
		bbs[2] = 1140
		bbs[3] = 1020
		bbs[4] = 2700
		bbs[5] = 1800
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			0.931,
			0.94,
			0.95,
			0.959,
			0.969
		}
		bbs[9] = {
			"反击",
			"必杀",
			"强力"
		}
	elseif bb == "巨力神猿" then
		bbs[1] = 155
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 2640
		bbs[6] = 1500
		bbs[7] = 1560
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"敏捷",
			"高级盾气",
			"高级连击",
			"强力",
			"高级驱鬼"
		}
	elseif bb == "章鱼" then
		bbs[1] = 0
		bbs[2] = 1440
		bbs[3] = 840
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[6] = 1320
		bbs[7] = 1200
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"连击",
			"毒",
			"吸血",
			"水属性吸收",
			"弱点火"
		}
	elseif bb == "藤蔓妖花" then
		bbs[1] = 155
		bbs[2] = 1464
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 3120
		bbs[6] = 1200
		bbs[7] = 1440
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"灵能激发",
			"落岩",
			"高级招架",
			"高级法术连击"
		}
	elseif bb == "金铙僧" then
		bbs[1] = 125
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 5040
		bbs[5] = 2280
		bbs[6] = 1440
		bbs[7] = 1560
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"再生",
			"必杀",
			"招架",
			"偷袭",
			"高级雷属性吸收"
		}
	elseif bb == "大力金刚" or bb == "大力金刚x" then
		bbs[1] = 125
		bbs[2] = 1548
		bbs[3] = 1334
		bbs[4] = 6000
		bbs[5] = 2640
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级强力",
			"泰山压顶",
			"力劈华山",
			"高级永恒"
		}
	elseif bb == "花妖" or bb == "花妖x" then
		bbs[1] = 15
		bbs[2] = 1020
		bbs[3] = 1440
		bbs[4] = 3780
		bbs[5] = 1440
		bbs[6] = 1140
		bbs[7] = 1140
		bbs[8] = {
			1.029,
			1.039,
			1.05,
			1.06,
			1.071
		}
		bbs[9] = {
			"感知",
			"慧根",
			"落岩",
			"防御",
			"水属性吸收"
		}
	elseif bb == "蜃气妖" then
		bbs[1] = 155
		bbs[2] = 1464
		bbs[3] = 1440
		bbs[4] = 5040
		bbs[5] = 3240
		bbs[6] = 1320
		bbs[7] = 1440
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级法术连击",
			"雷击",
			"法术暴击",
			"上古灵符"
		}
	elseif bb == "猫灵人形" then
		bbs[1] = 155
		bbs[2] = 1524
		bbs[3] = 1464
		bbs[4] = 4560
		bbs[5] = 2640
		bbs[6] = 1500
		bbs[7] = 1680
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"必杀",
			"高级幸运",
			"高级偷袭",
			"反击",
			"敏捷"
		}
	elseif bb == "蚌精" then
		bbs[1] = 65
		bbs[2] = 1200
		bbs[3] = 1500
		bbs[4] = 3840
		bbs[5] = 2880
		bbs[6] = 1200
		bbs[7] = 1140
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"水攻",
			"慧根",
			"高级水属性吸收",
			"神迹",
			"冥思"
		}
	elseif bb == "机关兽" then
		bbs[1] = 145
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 5280
		bbs[5] = 2880
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"魔之心",
			"高级法术连击",
			"土属性吸收",
			"烈火"
		}
	elseif bb == "阴阳伞" then
		bbs[1] = 95
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"上古灵符",
			"驱鬼",
			"剑荡四方",
			"高级飞行"
		}
	elseif bb == "混沌兽" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1476
		bbs[4] = 5400
		bbs[5] = 3240
		bbs[6] = 1320
		bbs[7] = 1560
		bbs[8] = {
			1.244,
			1.257,
			1.27,
			1.282,
			1.295
		}
		bbs[9] = {
			"再生",
			"高级慧根",
			"高级永恒",
			"高级魔之心",
			"奔雷咒"
		}
	elseif bb == "古代瑞兽" or bb == "古代瑞兽x" then
		bbs[1] = 45
		bbs[2] = 1140
		bbs[3] = 1260
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[6] = 1380
		bbs[7] = 1200
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.173
		}
		bbs[9] = {
			"高级神迹",
			"高级反震",
			"泰山压顶",
			"高级驱鬼"
		}
	elseif bb == "蛟龙" or bb == "蛟龙x" then
		bbs[1] = 65
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 3000
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"水漫金山",
			"感知",
			"高级永恒",
			"高级水属性吸收"
		}
	elseif bb == "葫芦宝贝" then
		bbs[1] = 135
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 4800
		bbs[5] = 2760
		bbs[6] = 1320
		bbs[7] = 1800
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级冥思",
			"上古灵符",
			"反震",
			"魔之心"
		}
	elseif bb == "踏云兽" then
		bbs[1] = 135
		bbs[2] = 1524
		bbs[3] = 1440
		bbs[4] = 5400
		bbs[5] = 1800
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级招架",
			"高级必杀",
			"高级强力",
			"弱点土"
		}
	elseif bb == "鬼将" or bb == "鬼将x" then
		bbs[1] = 105
		bbs[2] = 1524
		bbs[3] = 1380
		bbs[4] = 5040
		bbs[5] = 1440
		bbs[6] = 1320
		bbs[7] = 1320
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"惊心一剑",
			"高级必杀",
			"冥思",
			"鬼魂术"
		}
	elseif bb == "狸" then
		bbs[1] = 5
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2880
		bbs[5] = 1200
		bbs[6] = 1380
		bbs[7] = 1320
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"招架",
			"土属性吸收",
			"幸运",
			"敏捷"
		}
	elseif bb == "狐狸精" or bb == "狐狸精x" then
		bbs[1] = 15
		bbs[2] = 1320
		bbs[3] = 1260
		bbs[4] = 3000
		bbs[5] = 1440
		bbs[6] = 1320
		bbs[7] = 1200
		bbs[8] = {
			1.009,
			1.019,
			1.03,
			1.04,
			1.05
		}
		bbs[9] = {
			"夜战",
			"高级感知",
			"慧根",
			"高级慧根",
			"弱点雷"
		}
	elseif bb == "巨蛙" then
		bbs[1] = 0
		bbs[2] = 1080
		bbs[3] = 840
		bbs[4] = 2700
		bbs[5] = 1200
		bbs[6] = 1320
		bbs[7] = 1020
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"慧根",
			"幸运",
			"水攻",
			"弱点火"
		}
	elseif bb == "山贼" or bb == "山贼x" then
		bbs[1] = 5
		bbs[2] = 1080
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			0.994,
			1.004,
			1.01,
			1.025,
			1.035
		}
		bbs[9] = {
			"招架",
			"偷袭",
			"强力",
			"高级否定信仰"
		}
	elseif bb == "海星" then
		bbs[1] = 0
		bbs[2] = 1080
		bbs[3] = 1140
		bbs[4] = 2400
		bbs[5] = 1440
		bbs[6] = 1200
		bbs[7] = 1020
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"水属性吸收",
			"弱点火",
			"慧根",
			"高级反震",
			"水攻"
		}
	elseif bb == "小龙女" or bb == "小龙女x" then
		bbs[1] = 25
		bbs[2] = 1140
		bbs[3] = 1380
		bbs[4] = 3840
		bbs[5] = 1800
		bbs[6] = 1440
		bbs[7] = 1080
		bbs[8] = {
			1.043,
			1.054,
			1.065,
			1.075,
			1.086
		}
		bbs[9] = {
			"神佑复生",
			"高级驱鬼",
			"慧根",
			"水攻",
			"高级水属性吸收"
		}
	elseif bb == "红萼仙子" then
		bbs[1] = 135
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5400
		bbs[5] = 3000
		bbs[6] = 960
		bbs[7] = 1800
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"上古灵符",
			"高级飞行",
			"高级冥思",
			"奔雷咒"
		}
	elseif bb == "狸" then
		bbs[1] = 5
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2880
		bbs[5] = 1200
		bbs[6] = 1380
		bbs[7] = 1320
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"幸运",
			"偷袭",
			"必杀",
			"招架"
		}
	elseif bb == "风伯" or bb == "风伯x" then
		bbs[1] = 55
		bbs[2] = 1380
		bbs[3] = 1392
		bbs[4] = 4200
		bbs[5] = 2220
		bbs[6] = 1500
		bbs[7] = 1440
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.173
		}
		bbs[9] = {
			"高级敏捷",
			"奔雷咒",
			"高级雷属性吸收",
			"高级飞行"
		}
	elseif bb == "大蝙蝠" then
		bbs[1] = 5
		bbs[2] = 1080
		bbs[3] = 1140
		bbs[4] = 2520
		bbs[5] = 1800
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.058,
			1.069,
			1.08,
			1.09,
			1.101
		}
		bbs[9] = {
			"吸血",
			"高级感知",
			"高级驱鬼",
			"飞行",
			"高级夜战",
			"弱点水"
		}
	elseif bb == "幽萤娃娃" then
		bbs[1] = 105
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4200
		bbs[5] = 2640
		bbs[6] = 1536
		bbs[7] = 1560
		bbs[8] = {
			1.216,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级鬼魂术",
			"高级防御",
			"敏捷",
			"高级法术抵抗"
		}
	elseif bb == "强盗" or bb == "强盗x" then
		bbs[1] = 5
		bbs[2] = 1260
		bbs[3] = 1260
		bbs[4] = 3300
		bbs[5] = 1380
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"连击",
			"烈火",
			"强力",
			"否定信仰"
		}
	elseif bb == "巴蛇" then
		bbs[1] = 145
		bbs[2] = 1524
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 1560
		bbs[6] = 1560
		bbs[7] = 1560
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.273,
			1.285
		}
		bbs[9] = {
			"敏捷",
			"嗜血追击",
			"感知",
			"毒",
			"再生"
		}
	elseif bb == "机关鸟" then
		bbs[1] = 145
		bbs[2] = 1500
		bbs[3] = 1344
		bbs[4] = 4800
		bbs[5] = 2520
		bbs[6] = 1560
		bbs[7] = 1560
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级偷袭",
			"驱怪",
			"高级再生",
			"否定信仰",
			"飞行"
		}
	elseif bb == "律法女娲" then
		bbs[1] = 95
		bbs[2] = 1440
		bbs[3] = 1560
		bbs[4] = 4400
		bbs[5] = 2400
		bbs[6] = 1440
		bbs[7] = 1800
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"善恶有报",
			"敏捷",
			"再生",
			"高级反击"
		}
	elseif bb == "猫灵兽形" then
		bbs[1] = 135
		bbs[2] = 1464
		bbs[3] = 1464
		bbs[4] = 4080
		bbs[5] = 2400
		bbs[6] = 1560
		bbs[7] = 1680
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"必杀",
			"敏捷",
			"高级偷袭",
			"弱点水"
		}
	elseif bb == "镜妖" then
		bbs[1] = 85
		bbs[2] = 1460
		bbs[3] = 1320
		bbs[4] = 3840
		bbs[5] = 2400
		bbs[6] = 1560
		bbs[7] = 1440
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"反震",
			"高级感知",
			"鬼魂术",
			"雷击"
		}
	elseif bb == "龙龟" then
		bbs[1] = 135
		bbs[2] = 1440
		bbs[3] = 1560
		bbs[4] = 5760
		bbs[5] = 3000
		bbs[6] = 1200
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"水属性吸收",
			"反震",
			"高级防御",
			"法术防御",
			"水攻"
		}
	elseif bb == "机关人" then
		bbs[1] = 135
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5400
		bbs[5] = 1680
		bbs[6] = 1320
		bbs[7] = 1440
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"壁垒击破",
			"弱点火",
			"必杀",
			"高级招架"
		}
	elseif bb == "吸血鬼" or bb == "吸血鬼x" then
		bbs[1] = 95
		bbs[2] = 1440
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[6] = 1320
		bbs[7] = 1800
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"偷袭",
			"吸血",
			"鬼魂术",
			"驱鬼",
			"弱点水"
		}
	elseif bb == "地狱战神" or bb == "地狱战神x" then
		bbs[1] = 55
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4500
		bbs[5] = 1800
		bbs[6] = 1080
		bbs[7] = 1500
		bbs[8] = {
			1.107,
			1.118,
			1.13,
			1.141,
			1.152
		}
		bbs[9] = {
			"泰山压顶",
			"高级连击",
			"高级魔之心",
			"高级反震"
		}
	elseif bb == "琴仙" then
		bbs[1] = 125
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 3240
		bbs[6] = 1380
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"泰山压顶",
			"感知",
			"神佑复生",
			"再生",
			"敏捷"
		}
	elseif bb == "蛤蟆精" or bb == "蛤蟆精x" then
		bbs[1] = 15
		bbs[2] = 1380
		bbs[3] = 1140
		bbs[4] = 3300
		bbs[5] = 1200
		bbs[6] = 1320
		bbs[7] = 1320
		bbs[8] = {
			1.009,
			1.019,
			1.03,
			1.04,
			1.05
		}
		bbs[9] = {
			"毒",
			"必杀"
		}
	elseif bb == "如意仙子" or bb == "如意仙子x" then
		bbs[1] = 75
		bbs[2] = 1200
		bbs[3] = 1416
		bbs[4] = 4378
		bbs[5] = 2700
		bbs[6] = 1400
		bbs[7] = 1380
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"奔雷咒",
			"地狱烈火",
			"泰山压顶",
			"烈火",
			"弱点水"
		}
	elseif bb == "锦毛貂精" then
		bbs[1] = 75
		bbs[2] = 1200
		bbs[3] = 1260
		bbs[4] = 4200
		bbs[5] = 2711
		bbs[6] = 1560
		bbs[7] = 1680
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"冥思",
			"泰山压顶",
			"法术连击",
			"敏捷"
		}
	elseif bb == "雾中仙" or bb == "雾中仙x" then
		bbs[1] = 125
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 5400
		bbs[5] = 3000
		bbs[6] = 1320
		bbs[7] = 1800
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级神佑复生",
			"高级感知",
			"法术连击",
			"敏捷"
		}
	elseif bb == "灵鹤" or bb == "灵鹤x" then
		bbs[1] = 125
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 2760
		bbs[6] = 1560
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级永恒",
			"高级驱鬼",
			"高级再生",
			"高级慧根",
			"飞行"
		}
	elseif bb == "百足将军" then
		bbs[1] = 85
		bbs[2] = 1440
		bbs[3] = 1320
		bbs[4] = 4560
		bbs[5] = 2640
		bbs[6] = 1560
		bbs[7] = 1320
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"毒",
			"落岩",
			"高级夜战",
			"弱点水"
		}
	elseif bb == "牛妖" or bb == "牛妖x" then
		bbs[1] = 25
		bbs[2] = 1500
		bbs[3] = 1020
		bbs[4] = 3000
		bbs[5] = 1140
		bbs[6] = 1320
		bbs[7] = 960
		bbs[8] = {
			1.078,
			1.089,
			1.1,
			1.111,
			1.122
		}
		bbs[9] = {
			"高级反击",
			"高级慧根",
			"高级防御",
			"烈火"
		}
	elseif bb == "黑山老妖" or bb == "黑山老妖x" then
		bbs[1] = 45
		bbs[2] = 1140
		bbs[3] = 1440
		bbs[4] = 6000
		bbs[5] = 2400
		bbs[6] = 960
		bbs[7] = 1320
		bbs[8] = {
			1.107,
			1.118,
			1.13,
			1.141,
			1.152
		}
		bbs[9] = {
			"高级偷袭",
			"高级吸血",
			"高级精神集中"
		}
	elseif bb == "雷鸟人" or bb == "雷鸟人x" then
		bbs[1] = 45
		bbs[2] = 1200
		bbs[3] = 1200
		bbs[4] = 4200
		bbs[5] = 1920
		bbs[6] = 1440
		bbs[7] = 1140
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.173
		}
		bbs[9] = {
			"高级雷属性吸收",
			"奔雷咒",
			"飞行",
			"弱点土",
			"雷击"
		}
	elseif bb == "芙蓉仙子" or bb == "芙蓉仙子x" then
		bbs[1] = 75
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 2400
		bbs[6] = 1380
		bbs[7] = 1440
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"高级再生",
			"高级飞行",
			"高级幸运",
			"雨润丰泽"
		}
	elseif bb == "凤凰" or bb == "凤凰x" then
		bbs[1] = 65
		bbs[2] = 1200
		bbs[3] = 1440
		bbs[4] = 4200
		bbs[5] = 2400
		bbs[6] = 1560
		bbs[7] = 1320
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"地狱烈火",
			"高级神佑复生",
			"高级火属性吸收",
			"飞行",
			"薪火相传",
			"雨润丰泽"
		}
	elseif bb == "千年蛇魅" then
		bbs[1] = 75
		bbs[2] = 1380
		bbs[3] = 1320
		bbs[4] = 4380
		bbs[5] = 2640
		bbs[6] = 1440
		bbs[7] = 1500
		bbs[8] = {
			1.195,
			1.207,
			1.22,
			1.232,
			1.244
		}
		bbs[9] = {
			"敏捷",
			"毒",
			"偷袭",
			"高级吸血"
		}
	elseif bb == "巡游天神" or bb == "巡游天神x" then
		bbs[1] = 75
		bbs[2] = 1380
		bbs[3] = 1380
		bbs[4] = 5400
		bbs[5] = 2640
		bbs[6] = 1200
		bbs[7] = 1680
		bbs[8] = {
			1.195,
			1.207,
			1.22,
			1.232,
			1.244
		}
		bbs[9] = {
			"泰山压顶",
			"地狱烈火",
			"高级招架",
			"高级必杀"
		}
	elseif bb == "兔子怪" or bb == "兔子怪x" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1140
		bbs[4] = 4200
		bbs[5] = 2400
		bbs[6] = 1440
		bbs[7] = 1140
		bbs[8] = {
			1.097,
			1.108,
			1.12,
			1.131,
			1.142
		}
		bbs[9] = {
			"高级感知",
			"高级冥思",
			"高级驱鬼",
			"高级幸运",
			"高级永恒",
			"高级敏捷",
			"弱点土"
		}
	elseif bb == "黑熊" or bb == "黑熊x" then
		bbs[1] = 15
		bbs[2] = 1140
		bbs[3] = 1320
		bbs[4] = 4200
		bbs[5] = 1320
		bbs[6] = 1080
		bbs[7] = 1320
		bbs[8] = {
			1.004,
			1.014,
			1.025,
			1.135,
			1.045
		}
		bbs[9] = {
			"反击",
			"必杀",
			"强力",
			"防御",
			"迟钝"
		}
	elseif bb == "狂豹兽形" then
		bbs[1] = 135
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 2160
		bbs[6] = 1320
		bbs[7] = 1560
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级强力",
			"夜战",
			"高级飞行",
			"偷袭"
		}
	elseif bb == "灵符女娲" then
		bbs[1] = 95
		bbs[2] = 1320
		bbs[3] = 1560
		bbs[4] = 4800
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"上古灵符",
			"高级冥思",
			"地狱烈火",
			"落岩",
			"雨润丰泽"
		}
	elseif bb == "泡泡" then
		bbs[1] = 0
		bbs[2] = 1320
		bbs[3] = 1380
		bbs[4] = 4200
		bbs[5] = 2160
		bbs[6] = 1320
		bbs[7] = 1320
		bbs[8] = {
			1.078,
			1.089,
			1.1,
			1.111,
			1.122
		}
		bbs[9] = {
			"高级防御",
			"高级幸运",
			"连击",
			"精神集中",
			"再生"
		}
	elseif bb == "幽灵" or bb == "幽灵x" then
		bbs[1] = 95
		bbs[2] = 1476
		bbs[3] = 1440
		bbs[4] = 4200
		bbs[5] = 2640
		bbs[6] = 1320
		bbs[7] = 1680
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"高级反击",
			"高级飞行",
			"死亡召唤",
			"鬼魂术"
		}
	elseif bb == "泪妖" then
		bbs[1] = 85
		bbs[2] = 1200
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[6] = 1200
		bbs[7] = 1560
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"冥思",
			"高级魔之心",
			"法术暴击",
			"弱点土",
			"水攻"
		}
	elseif bb == "炎魔神" or bb == "炎魔神x" then
		bbs[1] = 125
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1320
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级必杀",
			"高级火属性吸收",
			"烈火",
			"地狱烈火"
		}
	elseif bb == "鼠先锋" then
		bbs[1] = 85
		bbs[2] = 1200
		bbs[3] = 1440
		bbs[4] = 4440
		bbs[5] = 2880
		bbs[6] = 1560
		bbs[7] = 1560
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"驱鬼",
			"冥思",
			"泰山压顶",
			"敏捷"
		}
	elseif bb == "夜罗刹" or bb == "夜罗刹x" then
		bbs[1] = 125
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 5760
		bbs[5] = 2880
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"必杀",
			"高级敏捷",
			"高级魔之心",
			"夜舞倾城"
		}
	elseif bb == "星灵仙子" or bb == "星灵仙子x" then
		bbs[1] = 75
		bbs[2] = 1200
		bbs[3] = 1416
		bbs[4] = 4380
		bbs[5] = 2700
		bbs[6] = 1440
		bbs[7] = 1380
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"雷击",
			"奔雷咒",
			"水漫金山",
			"高级慧根"
		}
	elseif bb == "蜘蛛精" or bb == "蜘蛛精x" then
		bbs[1] = 35
		bbs[2] = 1140
		bbs[3] = 1355
		bbs[4] = 4980
		bbs[5] = 2580
		bbs[6] = 1080
		bbs[7] = 1200
		bbs[8] = {
			1.068,
			1.079,
			1.09,
			1.1,
			1.111
		}
		bbs[9] = {
			"吸血",
			"高级感知",
			"高级毒",
			"弱点土"
		}
	elseif bb == "净瓶女娲" then
		bbs[1] = 105
		bbs[2] = 1464
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2880
		bbs[6] = 1560
		bbs[7] = 1560
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"上古灵符",
			"奔雷咒",
			"高级慧根",
			"雨润丰泽"
		}
	elseif bb == "鲛人" then
		bbs[1] = 65
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 1920
		bbs[6] = 1380
		bbs[7] = 1440
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"连击",
			"高级水属性吸收",
			"移花接木",
			"敏捷"
		}
	elseif bb == "天将" or bb == "天将x" then
		bbs[1] = 55
		bbs[2] = 1380
		bbs[3] = 1140
		bbs[4] = 4800
		bbs[5] = 2340
		bbs[6] = 1380
		bbs[7] = 1200
		bbs[8] = {
			1.136,
			1.148,
			1.16,
			1.171,
			1.183
		}
		bbs[9] = {
			"高级强力",
			"驱鬼",
			"连击",
			"幸运"
		}
	elseif bb == "龟丞相" or bb == "龟丞相x" then
		bbs[1] = 35
		bbs[2] = 1020
		bbs[3] = 1440
		bbs[4] = 5820
		bbs[5] = 1980
		bbs[6] = 900
		bbs[7] = 1140
		bbs[8] = {
			1.038,
			1.049,
			1.06,
			1.07,
			1.081
		}
		bbs[9] = {
			"冥思",
			"驱鬼",
			"防御",
			"水漫金山",
			"水属性吸收",
			"水攻"
		}
	elseif bb == "蝎子精" then
		bbs[1] = 135
		bbs[2] = 1464
		bbs[3] = 1464
		bbs[4] = 6240
		bbs[5] = 2880
		bbs[6] = 1320
		bbs[7] = 1800
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"高级反震",
			"招架",
			"高级再生",
			"毒"
		}
	elseif bb == "犀牛将军兽形" then
		bbs[1] = 75
		bbs[2] = 1440
		bbs[3] = 1464
		bbs[4] = 4800
		bbs[5] = 2520
		bbs[6] = 1200
		bbs[7] = 1140
		bbs[8] = {
			1.205,
			1.217,
			1.23,
			1.242,
			1.254
		}
		bbs[9] = {
			"法术暴击",
			"土属性吸收",
			"法术波动",
			"落岩"
		}
	elseif bb == "僵尸" or bb == "僵尸x" then
		bbs[1] = 35
		bbs[2] = 1440
		bbs[3] = 1080
		bbs[4] = 4320
		bbs[5] = 2400
		bbs[6] = 1200
		bbs[7] = 1380
		bbs[8] = {
			1.048,
			1.059,
			1.07,
			1.08,
			1.091
		}
		bbs[9] = {
			"土属性吸收",
			"弱点雷",
			"防御",
			"鬼魂术",
			"夜战"
		}
	elseif bb == "蝴蝶仙子" or bb == "蝴蝶仙子x" then
		bbs[1] = 45
		bbs[2] = 1320
		bbs[3] = 1140
		bbs[4] = 3000
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1440
		bbs[8] = {
			1.078,
			1.089,
			1.1,
			1.111,
			1.122
		}
		bbs[9] = {
			"神迹",
			"高级魔之心",
			"高级敏捷",
			"飞行",
			"雨润丰泽"
		}
	elseif bb == "马面" or bb == "马面x" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 1800
		bbs[6] = 1440
		bbs[7] = 1200
		bbs[8] = {
			1.048,
			1.059,
			1.07,
			1.08,
			1.091
		}
		bbs[9] = {
			"驱鬼",
			"高级必杀",
			"强力",
			"高级鬼魂术",
			"夜战"
		}
	elseif bb == "蟹将" or bb == "蟹将x" then
		bbs[1] = 25
		bbs[2] = 1320
		bbs[3] = 1200
		bbs[4] = 5100
		bbs[5] = 2280
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			1.025,
			1.035,
			1.046,
			1.056,
			1.066
		}
		bbs[9] = {
			"高级连击",
			"精神集中",
			"招架",
			"水属性吸收"
		}
	elseif bb == "画魂" then
		bbs[1] = 105
		bbs[2] = 1380
		bbs[3] = 1440
		bbs[4] = 4320
		bbs[5] = 2880
		bbs[6] = 1320
		bbs[7] = 1440
		bbs[8] = {
			1.215,
			1.227,
			1.24,
			1.252,
			1.264
		}
		bbs[9] = {
			"高级鬼魂术",
			"地狱烈火",
			"幸运",
			"高级魔之心"
		}
	elseif bb == "碧水夜叉" then
		bbs[1] = 65
		bbs[2] = 1380
		bbs[3] = 1320
		bbs[4] = 4200
		bbs[5] = 2760
		bbs[6] = 1440
		bbs[7] = 1800
		bbs[8] = {
			1.186,
			1.198,
			1.21,
			1.222,
			1.234
		}
		bbs[9] = {
			"高级反震",
			"奔雷咒",
			"强力",
			"壁垒击破"
		}
	elseif bb == "狂豹人形" or bb == "黑白狂豹人形" then
		bbs[1] = 155
		bbs[2] = 1536
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2280
		bbs[6] = 1440
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"夜战",
			"高级飞行",
			"高级强力",
			"偷袭",
			"吸血"
		}
	elseif bb == "超级土地公公" then
		bbs[9] = {
			"高级神佑",
			"高级法术连击",
			"天降灵葫",
			"招架",
			"高级魔之心"
		}
	elseif bb == "超级六耳猕猴" then
		bbs[9] = {
			"须弥真言",
			"高级法术连击",
			"永恒",
			"上古灵符",
			"高级法术暴击"
		}
	elseif bb == "超级神鸡" then
		bbs[9] = {
			"高级感知",
			"高级法术波动",
			"地狱烈火",
			"招架",
			"魔之心"
		}
	elseif bb == "超级玉兔" then
		bbs[9] = {
			"高级神佑复生",
			"高级法术波动",
			"月光",
			"驱怪",
			"高级法术暴击"
		}
	elseif bb == "超级神猴" then
		bbs[9] = {
			"高级法术波动",
			"高级法术连击",
			"奔雷咒",
			"法术暴击",
			"魔之心"
		}
	elseif bb == "超级神龙" then
		bbs[9] = {
			"龙魂",
			"高级法术波动",
			"奔雷咒",
			"再生",
			"魔之心"
		}
	elseif bb == "超级神羊" then
		bbs[9] = {
			"驱鬼",
			"高级法术波动",
			"奔雷咒",
			"法术暴击",
			"高级魔之心"
		}
	elseif bb == "超级孔雀" then
		bbs[9] = {
			"幸运",
			"高级法术暴击",
			"高级神佑",
			"再生",
			"高级魔之心"
		}
	elseif bb == "超级灵狐" then
		bbs[9] = {
			"高级感知",
			"高级法术暴击",
			"奔雷咒",
			"法术连击",
			"高级魔之心"
		}
	elseif bb == "超级筋斗云" then
		bbs[9] = {
			"高级感知",
			"高级法术连击",
			"奔雷咒",
			"反震",
			"高级魔之心"
		}
	elseif bb == "超级神鸡(物理型)" then
		bbs[9] = {
			"高级神佑",
			"高级强力",
			"从天而降",
			"驱怪",
			"必杀"
		}
	elseif bb == "鲲鹏(物理型)" or bb == "进阶鲲鹏(物理型)" then
		bbs[9] = {
			"水击三千",
			"高级必杀",
			"高级偷袭",
			"高级神佑复生",
			"逍遥游"
		}
	elseif bb == "超级玉兔(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级感知",
			"连击",
			"高级夜战",
			"偷袭"
		}
	elseif bb == "超级神猴(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"高级吸血",
			"大快朵颐",
			"连击",
			"必杀"
		}
	elseif bb == "超级土地公公(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级必杀",
			"高级连击",
			"驱怪",
			"高级神佑复生"
		}
	elseif bb == "超级神羊(物理型)" then
		bbs[9] = {
			"高级必杀",
			"感知",
			"高级连击",
			"千钧一怒",
			"反震"
		}
	elseif bb == "超级六耳猕猴(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级招架",
			"高级连击",
			"幸运",
			"高级偷袭"
		}
	elseif bb == "超级神马(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"浮云神马",
			"高级连击",
			"幸运",
			"神迹"
		}
	elseif bb == "超级神马" then
		bbs[9] = {
			"高级魔之心",
			"奔雷咒",
			"高级法术连击",
			"法术暴击",
			"慧根"
		}
	elseif bb == "超级孔雀(物理型)" then
		bbs[9] = {
			"高级偷袭",
			"高级飞行",
			"高级再生",
			"必杀",
			"高级连击"
		}
	elseif bb == "超级灵狐(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"惊心一剑",
			"高级必杀",
			"驱怪",
			"高级偷袭"
		}
	elseif bb == "超级筋斗云(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"高级偷袭",
			"高级夜战",
			"强力",
			"高级敏捷"
		}
	elseif bb == "超级神龙(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"幸运",
			"强力"
		}
	elseif bb == "超级麒麟(物理型)" then
		bbs[9] = {
			"高级合纵",
			"高级夜战",
			"高级连击",
			"高级幸运",
			"偷袭"
		}
	elseif bb == "超级麒麟" then
		bbs[9] = {
			"高级魔之心",
			"泰山压顶",
			"高级法术连击",
			"感知",
			"高级驱鬼"
		}
	elseif bb == "超级大鹏" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级法术暴击",
			"高级招架",
			"冥思"
		}
	elseif bb == "超级麒麟(物理型)" then
		bbs[9] = {
			"高级飞行",
			"高级偷袭",
			"高级神佑复生",
			"高级敏捷",
			"必杀"
		}
	elseif bb == "超级赤焰兽" then
		bbs[9] = {
			"高级法术连击",
			"高级神佑复生",
			"魔之心",
			"高级法术暴击",
			"高级冥思"
		}
	elseif bb == "超级赤焰兽(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级感知",
			"高级反击",
			"幸运",
			"高级毒"
		}
	elseif bb == "超级白泽" then
		bbs[9] = {
			"高级法术暴击",
			"水漫金山",
			"高级魔之心",
			"高级反震",
			"上古灵符"
		}
	elseif bb == "超级白泽(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级夜战",
			"高级敏捷",
			"高级幸运",
			"感知"
		}
	elseif bb == "超级灵鹿" then
		bbs[9] = {
			"高级法术暴击",
			"泰山压顶",
			"高级法术连击",
			"高级再生",
			"上古灵符"
		}
	elseif bb == "超级灵鹿(物理型)" then
		bbs[9] = {
			"善恶有报",
			"高级再生",
			"高级偷袭",
			"高级冥思",
			"永恒"
		}
	elseif bb == "超级大象" then
		bbs[9] = {
			"高级法术连击",
			"奔雷咒",
			"高级魔之心",
			"高级神迹",
			"雷击"
		}
	elseif bb == "超级大象(物理型)" then
		bbs[9] = {
			"高级强力",
			"高级再生",
			"高级必杀",
			"高级反震",
			"驱怪"
		}
	elseif bb == "超级金猴" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级魔之心",
			"高级精神集中",
			"雷击"
		}
	elseif bb == "超级金猴(物理型)" then
		bbs[9] = {
			"高级偷袭",
			"高级连击",
			"高级幸运",
			"高级敏捷",
			"驱怪"
		}
	elseif bb == "超级大熊猫" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级魔之心",
			"高级冥思",
			"雷击"
		}
	elseif bb == "超级大熊猫(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级防御",
			"高级感知",
			"高级夜战",
			"高级强力"
		}
	elseif bb == "超级泡泡" then
		bbs[9] = {
			"高级感知",
			"奔雷咒",
			"高级魔之心",
			"高级慧根",
			"雷击"
		}
	elseif bb == "超级泡泡(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级神佑复生",
			"高级感知",
			"高级飞行",
			"驱怪"
		}
	elseif bb == "超级神兔" then
		bbs[9] = {
			"高级法术连击",
			"奔雷咒",
			"魔之心",
			"高级反震",
			"感知"
		}
	elseif bb == "超级神兔(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级偷袭",
			"高级敏捷",
			"驱怪",
			"幸运"
		}
	elseif bb == "超级神虎" then
		bbs[9] = {
			"高级法术暴击",
			"奔雷咒",
			"魔之心",
			"高级驱鬼",
			"法术波动"
		}
	elseif bb == "超级神虎(物理型)" then
		bbs[9] = {
			"高级感知",
			"嗜血追击",
			"高级夜战",
			"连击",
			"强力"
		}
	elseif bb == "超级神牛" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级法术连击",
			"冥思",
			"魔之心"
		}
	elseif bb == "超级神牛(物理型)" then
		bbs[9] = {
			"力劈华山",
			"高级幸运",
			"高级招架",
			"必杀",
			"强力"
		}
	elseif bb == "超级海豚" then
		bbs[9] = {
			"高级法术暴击",
			"水漫金山",
			"高级魔之心",
			"高级感知",
			"慧根"
		}
	elseif bb == "超级海豚(物理型)" then
		bbs[9] = {
			"剑荡四方",
			"高级偷袭",
			"高级幸运",
			"高级必杀",
			"驱怪"
		}
	elseif bb == "超级人参娃娃" then
		bbs[9] = {
			"高级法术波动",
			"泰山压顶",
			"魔之心",
			"高级法术连击",
			"高级冥思"
		}
	elseif bb == "超级人参娃娃(物理型)" then
		bbs[9] = {
			"壁垒击破",
			"高级必杀",
			"高级强力",
			"高级驱鬼",
			"幸运"
		}
	elseif bb == "超级青鸾" then
		bbs[9] = {
			"法术暴击",
			"奔雷咒",
			"高级魔之心",
			"高级幸运",
			"高级神佑复生"
		}
	elseif bb == "超级青鸾(物理型)" then
		bbs[9] = {
			"高级夜战",
			"苍鸾怒击",
			"高级飞行",
			"高级反震",
			"高级连击"
		}
	elseif bb == "超级腾蛇" then
		bbs[9] = {
			"高级法术波动",
			"地狱烈火",
			"魔之心",
			"灵能激发",
			"永恒"
		}
	elseif bb == "超级腾蛇(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级毒",
			"高级夜战",
			"偷袭",
			"敏捷"
		}
	elseif bb == "进阶超级土地公公" then
		bbs[9] = {
			"高级神佑",
			"高级法术连击",
			"天降灵葫",
			"招架",
			"高级魔之心"
		}
	elseif bb == "进阶超级六耳猕猴" then
		bbs[9] = {
			"须弥真言",
			"高级法术连击",
			"永恒",
			"上古灵符",
			"高级法术暴击"
		}
	elseif bb == "进阶超级神鸡" then
		bbs[9] = {
			"高级感知",
			"高级法术波动",
			"地狱烈火",
			"招架",
			"魔之心"
		}
	elseif bb == "进阶超级玉兔" then
		bbs[9] = {
			"高级神佑复生",
			"高级法术波动",
			"月光",
			"驱怪",
			"高级法术暴击"
		}
	elseif bb == "进阶超级神猴" then
		bbs[9] = {
			"高级法术波动",
			"高级法术连击",
			"奔雷咒",
			"法术暴击",
			"魔之心"
		}
	elseif bb == "进阶超级神龙" then
		bbs[9] = {
			"龙魂",
			"高级法术波动",
			"奔雷咒",
			"再生",
			"魔之心"
		}
	elseif bb == "进阶超级神羊" then
		bbs[9] = {
			"驱鬼",
			"高级法术波动",
			"奔雷咒",
			"法术暴击",
			"高级魔之心"
		}
	elseif bb == "进阶超级孔雀" then
		bbs[9] = {
			"幸运",
			"高级法术暴击",
			"高级神佑",
			"再生",
			"高级魔之心"
		}
	elseif bb == "进阶超级灵狐" then
		bbs[9] = {
			"高级感知",
			"高级法术暴击",
			"奔雷咒",
			"法术连击",
			"高级魔之心"
		}
	elseif bb == "进阶超级筋斗云" then
		bbs[9] = {
			"高级感知",
			"高级法术连击",
			"奔雷咒",
			"反震",
			"高级魔之心"
		}
	elseif bb == "进阶超级神鸡(物理型)" then
		bbs[9] = {
			"高级神佑",
			"高级冲击",
			"从天而降",
			"驱怪",
			"必杀"
		}
	elseif bb == "进阶超级玉兔(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级感知",
			"连击",
			"高级夜战",
			"偷袭"
		}
	elseif bb == "进阶超级神猴(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"高级吸血",
			"大快朵颐",
			"连击",
			"必杀"
		}
	elseif bb == "进阶超级土地公公(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级必杀",
			"高级连击",
			"驱怪",
			"高级神佑复生"
		}
	elseif bb == "进阶超级神羊(物理型)" then
		bbs[9] = {
			"高级必杀",
			"感知",
			"高级连击",
			"千钧一怒",
			"赶尽杀绝"
		}
	elseif bb == "进阶超级六耳猕猴(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"高级招架",
			"高级连击",
			"幸运",
			"高级偷袭"
		}
	elseif bb == "进阶超级神马(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"浮云神马",
			"高级连击",
			"幸运",
			"神迹"
		}
	elseif bb == "进阶超级神马" then
		bbs[9] = {
			"高级魔之心",
			"奔雷咒",
			"高级法术连击",
			"法术暴击",
			"慧根"
		}
	elseif bb == "进阶超级孔雀(物理型)" then
		bbs[9] = {
			"高级偷袭",
			"高级飞行",
			"高级再生",
			"必杀",
			"高级连击"
		}
	elseif bb == "进阶超级灵狐(物理型)" then
		bbs[9] = {
			"高级敏捷",
			"惊心一剑",
			"高级必杀",
			"驱怪",
			"高级偷袭"
		}
	elseif bb == "进阶超级筋斗云(物理型)" then
		bbs[9] = {
			"高级神佑复生",
			"高级偷袭",
			"高级夜战",
			"强力",
			"高级敏捷"
		}
	elseif bb == "进阶超级神龙(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"幸运",
			"强力"
		}
	elseif bb == "进阶超级麒麟(物理型)" then
		bbs[9] = {
			"高级合纵",
			"高级夜战",
			"高级连击",
			"高级幸运",
			"偷袭"
		}
	elseif bb == "进阶超级麒麟" then
		bbs[9] = {
			"高级魔之心",
			"泰山压顶",
			"高级法术连击",
			"感知",
			"高级驱鬼"
		}
	elseif bb == "进阶超级大鹏" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级法术暴击",
			"高级招架",
			"冥思"
		}
	elseif bb == "进阶超级麒麟(物理型)" then
		bbs[9] = {
			"高级飞行",
			"高级偷袭",
			"高级神佑复生",
			"高级敏捷",
			"必杀"
		}
	elseif bb == "进阶超级赤焰兽" then
		bbs[9] = {
			"高级法术连击",
			"高级神佑复生",
			"魔之心",
			"高级法术暴击",
			"高级冥思"
		}
	elseif bb == "进阶超级赤焰兽(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级感知",
			"高级反击",
			"幸运",
			"高级毒"
		}
	elseif bb == "进阶超级白泽" then
		bbs[9] = {
			"高级法术暴击",
			"水漫金山",
			"高级魔之心",
			"高级反震",
			"上古灵符"
		}
	elseif bb == "进阶超级白泽(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级夜战",
			"高级敏捷",
			"高级幸运",
			"感知"
		}
	elseif bb == "进阶超级灵鹿" then
		bbs[9] = {
			"高级法术暴击",
			"泰山压顶",
			"高级法术连击",
			"高级再生",
			"上古灵符"
		}
	elseif bb == "进阶超级灵鹿(物理型)" then
		bbs[9] = {
			"善恶有报",
			"高级再生",
			"高级偷袭",
			"高级冥思",
			"永恒"
		}
	elseif bb == "进阶超级大象" then
		bbs[9] = {
			"高级法术连击",
			"奔雷咒",
			"高级魔之心",
			"高级神迹",
			"雷击"
		}
	elseif bb == "进阶超级大象(物理型)" then
		bbs[9] = {
			"高级强力",
			"高级再生",
			"高级必杀",
			"高级反震",
			"驱怪"
		}
	elseif bb == "进阶超级金猴" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级魔之心",
			"高级精神集中",
			"雷击"
		}
	elseif bb == "进阶超级金猴(物理型)" then
		bbs[9] = {
			"高级偷袭",
			"高级连击",
			"高级幸运",
			"高级敏捷",
			"驱怪"
		}
	elseif bb == "进阶超级大熊猫" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级魔之心",
			"高级冥思",
			"雷击"
		}
	elseif bb == "进阶超级大熊猫(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级防御",
			"高级感知",
			"高级夜战",
			"高级强力"
		}
	elseif bb == "进阶超级泡泡" then
		bbs[9] = {
			"高级感知",
			"奔雷咒",
			"高级魔之心",
			"高级慧根",
			"雷击"
		}
	elseif bb == "进阶超级泡泡(物理型)" then
		bbs[9] = {
			"高级必杀",
			"高级神佑复生",
			"高级感知",
			"高级飞行",
			"驱怪"
		}
	elseif bb == "进阶超级神兔" then
		bbs[9] = {
			"高级法术连击",
			"奔雷咒",
			"魔之心",
			"高级反震",
			"感知"
		}
	elseif bb == "进阶超级神兔(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级偷袭",
			"高级敏捷",
			"驱怪",
			"幸运"
		}
	elseif bb == "进阶超级神虎" then
		bbs[9] = {
			"高级法术暴击",
			"奔雷咒",
			"魔之心",
			"高级驱鬼",
			"法术波动"
		}
	elseif bb == "进阶超级神虎(物理型)" then
		bbs[9] = {
			"高级感知",
			"嗜血追击",
			"高级夜战",
			"连击",
			"强力"
		}
	elseif bb == "进阶超级神牛" then
		bbs[9] = {
			"高级法术波动",
			"奔雷咒",
			"高级法术连击",
			"冥思",
			"魔之心"
		}
	elseif bb == "进阶超级神牛(物理型)" then
		bbs[9] = {
			"力劈华山",
			"高级幸运",
			"高级招架",
			"必杀",
			"强力"
		}
	elseif bb == "进阶超级海豚" then
		bbs[9] = {
			"高级法术暴击",
			"水漫金山",
			"高级魔之心",
			"高级感知",
			"慧根"
		}
	elseif bb == "进阶超级海豚(物理型)" then
		bbs[9] = {
			"剑荡四方",
			"高级偷袭",
			"高级幸运",
			"高级必杀",
			"驱怪"
		}
	elseif bb == "进阶超级人参娃娃" then
		bbs[9] = {
			"高级法术波动",
			"泰山压顶",
			"魔之心",
			"高级法术连击",
			"高级冥思"
		}
	elseif bb == "进阶超级人参娃娃(物理型)" then
		bbs[9] = {
			"壁垒击破",
			"高级必杀",
			"高级强力",
			"高级驱鬼",
			"幸运"
		}
	elseif bb == "进阶超级青鸾" then
		bbs[9] = {
			"法术暴击",
			"奔雷咒",
			"高级魔之心",
			"高级幸运",
			"高级神佑复生"
		}
	elseif bb == "进阶超级青鸾(物理型)" then
		bbs[9] = {
			"高级夜战",
			"苍鸾怒击",
			"高级飞行",
			"高级反震",
			"高级连击"
		}
	elseif bb == "进阶超级腾蛇" then
		bbs[9] = {
			"高级法术波动",
			"地狱烈火",
			"魔之心",
			"灵能激发",
			"永恒"
		}
	elseif bb == "进阶超级腾蛇(物理型)" then
		bbs[9] = {
			"高级连击",
			"高级毒",
			"高级夜战",
			"偷袭",
			"敏捷"
		}
	elseif bb == "小毛头" then
		bbs[1] = 0
		bbs[2] = 960
		bbs[3] = 960
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[6] = 840
		bbs[7] = 1320
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"高级连击",
			"高级防御",
			"高级夜战",
			"高级偷袭"
		}
	elseif bb == "小丫丫" then
		bbs[1] = 0
		bbs[2] = 960
		bbs[3] = 960
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[6] = 840
		bbs[7] = 1320
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"高级连击",
			"高级防御",
			"高级夜战",
			"高级偷袭"
		}
	elseif bb == "毗舍童子" or bb == "暗黑毗舍童子" then
		bbs[1] = 175
		bbs[2] = 1560
		bbs[3] = 1428
		bbs[4] = 4200
		bbs[5] = 2160
		bbs[6] = 1440
		bbs[7] = 1620
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级合纵",
			"敏捷",
			"高级法术抵抗",
			"连击",
			"神迹"
		}
	elseif bb == "增长巡守" then
		bbs[1] = 175
		bbs[2] = 1500
		bbs[3] = 1380
		bbs[4] = 6000
		bbs[5] = 2760
		bbs[6] = 1200
		bbs[7] = 960
		bbs[8] = {
			1.265,
			1.27,
			1.275,
			1.28,
			1.285
		}
		bbs[9] = {
			"灵山禅语",
			"高级招架",
			"驱鬼",
			"神佑复生"
		}
	elseif bb == "真陀护法" then
		bbs[1] = 175
		bbs[2] = 1536
		bbs[3] = 1440
		bbs[4] = 5040
		bbs[5] = 2400
		bbs[6] = 1380
		bbs[7] = 1560
		bbs[8] = {
			1.226,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"高级精神集中",
			"必杀",
			"偷袭",
			"吸血",
			"驱怪",
			"连击"
		}
	elseif bb == "般若天女" then
		bbs[1] = 175
		bbs[2] = 1459
		bbs[3] = 1459
		bbs[4] = 5521
		bbs[5] = 3301
		bbs[6] = 1471
		bbs[7] = 1567
		bbs[8] = {
			1.226,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"高级飞行",
			"高级幸运",
			"敏捷",
			"魔之心",
			"高级慧根",
			"上古灵符"
		}
	elseif bb == "持国巡守" then
		bbs[1] = 175
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 6000
		bbs[5] = 3000
		bbs[6] = 1200
		bbs[7] = 960
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"须弥真言",
			"再生",
			"奔雷咒",
			"神佑复生"
		}
	elseif bb == "飞天" then
		bbs[1] = 0
		bbs[2] = 1462
		bbs[3] = 1483
		bbs[4] = 5952
		bbs[5] = 3000
		bbs[6] = 1358
		bbs[7] = 1496
		bbs[8] = {
			1.235,
			1.2475,
			1.26,
			1.2725,
			1.285
		}
		bbs[9] = {
			"高级法术连击",
			"高级魔之心",
			"奔雷咒",
			"慧根"
		}
	elseif bb == "谛听" or bb == "暗黑谛听" then
		bbs[1] = 175
		bbs[2] = 1464
		bbs[3] = 1440
		bbs[4] = 6000
		bbs[5] = 3240
		bbs[6] = 1416
		bbs[7] = 1320
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级驱鬼",
			"泰山压顶",
			"观照万象",
			"落岩"
		}
	elseif bb == "狐不归" then
		bbs[1] = 105
		bbs[2] = 1320
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[6] = 1440
		bbs[7] = 1560
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"招架",
			"冥思",
			"敏捷",
			"进击必杀",
			"高级水属性吸收"
		}
	elseif bb == "花铃" then
		bbs[1] = 55
		bbs[2] = 1320
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1320
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级防御",
			"敏捷",
			"高级幸运",
			"地狱烈火",
			"生命守护"
		}
	elseif bb == "涂山雪" then
		bbs[1] = 175
		bbs[2] = 1512
		bbs[3] = 1416
		bbs[4] = 5040
		bbs[5] = 2880
		bbs[6] = 1380
		bbs[7] = 1320
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"冥思",
			"高级防御",
			"高级反震",
			"高级神佑复生"
		}
	elseif bb == "月魅" then
		bbs[1] = 125
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 5760
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1560
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"法术暴击",
			"水攻",
			"高级招架",
			"法术连击",
			"偷袭"
		}
	elseif bb == "云游火" then
		bbs[1] = 105
		bbs[2] = 1452
		bbs[3] = 1380
		bbs[4] = 4440
		bbs[5] = 2280
		bbs[6] = 1320
		bbs[7] = 1560
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级合纵",
			"敏捷",
			"连击",
			"否定信仰"
		}
	elseif bb == "鲲鹏" then
		bbs[1] = 0
		bbs[2] = 1550
		bbs[3] = 1482
		bbs[4] = 6000
		bbs[5] = 2027
		bbs[6] = 1343
		bbs[7] = 1396
		bbs[8] = {
			1.235,
			1.2475,
			1.26,
			1.2725,
			1.285
		}
		bbs[9] = {
			"扶摇万里",
			"高级魔之心",
			"高级法术暴击",
			"高级神佑复生",
			"逍遥游"
		}
	elseif bb == "老夫子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级土属性吸收",
			"高级否定信仰",
			"高级偷袭"
		}
	elseif bb == "琴瑟仙女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级鬼魂术",
			"高级神迹",
			"高级强力"
		}
	elseif bb == "逍遥神牛" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级吸血",
			"善恶有报",
			"奋勇当先",
			"高级必杀"
		}
	elseif bb == "龙仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级鬼魂术",
			"高级雷属性吸收",
			"泰山压顶",
			"高级魔之心"
		}
	elseif bb == "龙鲤" then
		bbs[1] = 65
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[6] = 1440
		bbs[7] = 1320
		bbs[8] = {
			1.154,
			1.166,
			1.178,
			1.189,
			1.201
		}
		bbs[9] = {
			"高级法术连击",
			"高级鬼魂术",
			"奔雷咒",
			"高级冥思"
		}
	elseif bb == "涂山瞳" then
		bbs[1] = 105
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 4320
		bbs[5] = 3200
		bbs[6] = 1440
		bbs[7] = 1520
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"水漫金山",
			"高级慧根",
			"进击法爆",
			"高级法术波动"
		}
	elseif bb == "武罗仙子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"高级火属性吸收",
			"高级连击",
			"高级防御",
			"烈焰斩"
		}
	elseif bb == "月影仙" then
		bbs[1] = 65
		bbs[2] = 1380
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2160
		bbs[6] = 1380
		bbs[7] = 1440
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"必杀",
			"弱点火",
			"反击",
			"高级强力",
			"再生"
		}
	elseif bb == "暗黑龙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级鬼魂术",
			"高级吸血",
			"高级驱鬼"
		}
	elseif bb == "剑灵双子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级强力",
			"高级偷袭",
			"剑气四射"
		}
	elseif bb == "太极捶童子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级否定信仰",
			"死亡召唤",
			"赶尽杀绝"
		}
	elseif bb == "暗雷豹" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级连击",
			"高级反震",
			"高级冥思",
			"高级火属性吸收"
		}
	elseif bb == "黑灵猫" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"高级否定信仰",
			"高级神迹",
			"善恶有报"
		}
	elseif bb == "红衣战锤使" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级必杀",
			"高级水属性吸收",
			"高级吸血"
		}
	elseif bb == "美猴王" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级吸血",
			"高级连击",
			"大快朵颐",
			"高级雷属性吸收"
		}
	elseif bb == "火熔石" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"水漫金山",
			"高级再生",
			"舍身一搏",
			"上善若水"
		}
	elseif bb == "三尾火狐" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级雷属性吸收",
			"高级神佑复生",
			"高级冲击",
			"高级必杀"
		}
	elseif bb == "骏天马" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级吸血",
			"高级飞行",
			"死亡召唤",
			"驱怪"
		}
	elseif bb == "鲛人鱼" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"奔雷咒",
			"水漫金山",
			"高级反击"
		}
	elseif bb == "狗头人" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"必杀",
			"高级防御",
			"高级精神集中"
		}
	elseif bb == "巨灵狼" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级鬼魂术",
			"高级驱鬼",
			"高级幸运"
		}
	elseif bb == "黑翼弓使" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"赶尽杀绝",
			"高级连击",
			"高级反击",
			"高级必杀"
		}
	elseif bb == "无名上仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"高级法术连击",
			"高级冥思",
			"水漫金山"
		}
	elseif bb == "光辉女神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级感知",
			"高级法术连击",
			"高级精神集中",
			"水漫金山"
		}
	elseif bb == "四翼上仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"赶尽杀绝",
			"高级幸运",
			"高级神佑复生"
		}
	elseif bb == "大象精" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"地狱烈火",
			"高级飞行",
			"泰山压顶",
			"高级鬼魂术"
		}
	elseif bb == "四臂魔神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"力劈华山",
			"高级冥思",
			"高级再生"
		}
	elseif bb == "老鹰精" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级飞行",
			"高级反击",
			"高级雷属性吸收",
			"高级夜战"
		}
	elseif bb == "氪金大佬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级幸运",
			"力劈华山",
			"水漫金山"
		}
	elseif bb == "超级三眼娃" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级强力",
			"高级招架",
			"力劈华山"
		}
	elseif bb == "太极真君" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"高级防御",
			"高级偷袭",
			"高级反击"
		}
	elseif bb == "托塔娃" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级水属性吸收",
			"高级反击",
			"高级魔之心",
			"高级强力"
		}
	elseif bb == "巨斧猛男" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"高级吸血",
			"夜舞倾城",
			"高级反击"
		}
	elseif bb == "齐天大圣" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"风起龙游",
			"高级必杀",
			"高级连击",
			"高级冲击"
		}
	elseif bb == "酷炫佬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级精神集中",
			"高级驱鬼",
			"奔雷咒"
		}
	elseif bb == "酷炫老逼登" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级感知",
			"高级精神集中",
			"高级偷袭",
			"高级防御"
		}
	elseif bb == "风火轮器灵" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级吸血",
			"高级反震",
			"高级强力",
			"惊心一剑"
		}
	elseif bb == "月宫仙子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"高级慧根",
			"高级法术连击",
			"地狱烈火"
		}
	elseif bb == "夜莺" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级感知",
			"高级反震",
			"高级敏捷",
			"高级吸血"
		}
	elseif bb == "蓝凤凰" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级水属性吸收",
			"高级火属性吸收",
			"水漫金山",
			"高级神佑复生",
			"薪火相传"
		}
	elseif bb == "小雪人" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级必杀",
			"高级连击",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "团团" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级必杀",
			"高级连击",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "小欣" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级必杀",
			"高级连击",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "兔乖乖" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级连击",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "神武雨师" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冰霜",
			"水漫金山",
			"神迹",
			"神佑复生",
			"高级法术连击"
		}
	elseif bb == "神兽孙小圣" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级必杀",
			"高级连击",
			"影袭",
			"烈焰斩"
		}
	elseif bb == "杨二郎" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"双星闪",
			"高级气势",
			"高级蛮劲",
			"高级助攻"
		}
	elseif bb == "萼华仙子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"魔之心",
			"高级飞行",
			"高级神迹",
			"上古灵符"
		}
	elseif bb == "蚩尤武魂" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"荒古破击",
			"高级必杀",
			"高级偷袭",
			"高级吸血"
		}
	elseif bb == "神武风伯" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术暴击",
			"高级否定信仰",
			"上古灵符",
			"高级法术连击",
			"雨润丰泽"
		}
	elseif bb == "幽灵虎" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"高级连击",
			"高级敏捷",
			"高级夜战",
			"上善若水"
		}
	elseif bb == "龙虾骑士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级连击",
			"高级偷袭",
			"高级感知",
			"敏捷",
			"战斗号角"
		}
	elseif bb == "战神罗成" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级反击",
			"高级防御",
			"高级幸运",
			"必杀",
			"战斗号角"
		}
	elseif bb == "死亡骑士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"舍身一搏",
			"鬼魂术",
			"必杀",
			"影袭"
		}
	elseif bb == "贪狼" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级否定信仰",
			"高级再生",
			"高级夜战",
			"高级神迹",
			"上善若水"
		}
	elseif bb == "仙兽翼龙" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"高级魔之心",
			"高级法术连击",
			"水漫金山",
			"战斗号角"
		}
	elseif bb == "小肥羊" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"高级连击",
			"偷袭",
			"必杀",
			"生命守护",
			"雨润丰泽"
		}
	elseif bb == "神兽小龙人" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级偷袭",
			"善恶有报",
			"高级敏捷",
			"生命守护"
		}
	elseif bb == "神兽雪精灵" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级必杀",
			"高级感知",
			"夜战",
			"上善若水"
		}
	elseif bb == "月影兔" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级敏捷",
			"舍身一搏",
			"慧根",
			"冥思"
		}
	elseif bb == "神兽时光叽" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"赶尽杀绝",
			"高级神佑复生",
			"嗜血追击",
			"高级冲击"
		}
	elseif bb == "神兽百灵羊" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级魔之心",
			"高级敏捷",
			"高级幸运",
			"泰山压顶"
		}
	elseif bb == "玄武" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"水漫金山",
			"高级防御",
			"法术防御",
			"高级法术连击",
			"生命守护"
		}
	elseif bb == "金钱龟" then
		bbs[1] = 0
		bbs[2] = 1350
		bbs[3] = 1400
		bbs[4] = 5000
		bbs[5] = 2500
		bbs[6] = 1350
		bbs[7] = 1400
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"水攻",
			"永恒",
			"再生",
			"夜战"
		}
	elseif bb == "金麟鹿" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"力劈华山",
			"高级幸运",
			"高级神佑复生"
		}
	elseif bb == "吉祥" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级防御",
			"连击",
			"高级幸运",
			"高级再生",
			"夜战"
		}
	elseif bb == "嵩鼠" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级偷袭",
			"剑气四射",
			"高级必杀",
			"高级再生",
			"夜战"
		}
	elseif bb == "龙须豹" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"敏捷",
			"冲击",
			"高级强力",
			"高级必杀"
		}
	elseif bb == "熊猫大侠" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"地狱烈火",
			"高级连击",
			"高级偷袭",
			"高级敏捷"
		}
	elseif bb == "白無常" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级鬼魂术",
			"高级连击",
			"偷袭",
			"夜战"
		}
	elseif bb == "拽王" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"高级飞行",
			"高级精神集中",
			"高级吸血"
		}
	elseif bb == "齐天小圣" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级气势",
			"高级偷袭",
			"理直气壮",
			"高级永恒",
			"影袭"
		}
	elseif bb == "萌狗" then
		bbs[1] = 0
		bbs[2] = 1450
		bbs[3] = 1450
		bbs[4] = 5000
		bbs[5] = 2750
		bbs[6] = 1450
		bbs[7] = 1450
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级神佑复生",
			"高级夜战",
			"高级冥思",
			"高级反击"
		}
	elseif bb == "小红孩儿" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术连击",
			"高级冥思",
			"水漫金山",
			"高级敏捷"
		}
	elseif bb == "月仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级魔之心",
			"高级水属性吸收",
			"奔雷咒",
			"高级法术连击"
		}
	elseif bb == "狮仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"惊心一剑",
			"高级敏捷",
			"高级火属性吸收",
			"高级否定信仰"
		}
	elseif bb == "剑仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级神迹",
			"高级必杀",
			"剑气四射"
		}
	elseif bb == "判官" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"死亡召唤",
			"高级火属性吸收",
			"高级法术连击",
			"高级防御"
		}
	elseif bb == "龙羽" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"死亡召唤",
			"高级必杀",
			"高级幸运",
			"灵能激发"
		}
	elseif bb == "罗汉" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冥思",
			"高级招架",
			"高级法术连击",
			"高级吸血"
		}
	elseif bb == "龙王" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"灵能激发",
			"地狱烈火",
			"高级偷袭",
			"高级吸血"
		}
	elseif bb == "天师" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级幸运",
			"高级魔之心",
			"夜舞倾城",
			"水漫金山"
		}
	elseif bb == "战将" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级水属性吸收",
			"高级感知",
			"力劈华山",
			"高级土属性吸收"
		}
	elseif bb == "狂狮" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级雷属性吸收",
			"高级招架",
			"奔雷咒"
		}
	elseif bb == "佛子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"地狱烈火",
			"高级隐身",
			"高级敏捷",
			"奔雷咒"
		}
	elseif bb == "葫仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"水漫金山",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "法僧" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级招架",
			"奔雷咒",
			"高级魔之心"
		}
	elseif bb == "金衣仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"夜舞倾城",
			"水漫金山",
			"高级反震"
		}
	elseif bb == "龙剑士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"力劈华山",
			"高级防御",
			"高级偷袭",
			"剑气四射"
		}
	elseif bb == "龙剑女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"剑气四射",
			"高级永恒",
			"高级偷袭"
		}
	elseif bb == "水龙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级强力",
			"高级再生",
			"水漫金山"
		}
	elseif bb == "画仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"地狱烈火",
			"高级再生",
			"死亡召唤",
			"高级幸运"
		}
	elseif bb == "天帝" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"高级毒",
			"高级必杀",
			"惊心一剑"
		}
	elseif bb == "镇元" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术波动",
			"高级慧根",
			"高级魔之心",
			"高级雷属性吸收"
		}
	elseif bb == "鬼君" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级飞行",
			"高级必杀",
			"高级偷袭",
			"泰山压顶"
		}
	elseif bb == "鹿君" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"水漫金山",
			"力劈华山",
			"高级驱鬼",
			"高级防御"
		}
	elseif bb == "火女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术暴击",
			"高级慧根",
			"上古灵符",
			"高级水属性吸收"
		}
	elseif bb == "福禄仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"高级敏捷",
			"高级再生",
			"雨润丰泽"
		}
	elseif bb == "天后" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术暴击",
			"夜舞倾城",
			"泰山压顶",
			"高级永恒"
		}
	elseif bb == "太极老君" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"惊心一剑",
			"高级毒",
			"高级幸运",
			"高级反击"
		}
	elseif bb == "天兵统领" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级精神集中",
			"高级魔之心",
			"惊心一剑",
			"高级感知"
		}
	elseif bb == "阎王爷" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级毒",
			"水漫金山",
			"高级法术连击"
		}
	elseif bb == "大蛇丸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"高级反击",
			"高级雷属性吸收",
			"泰山压顶"
		}
	elseif bb == "干柿鬼鲛" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级偷袭",
			"高级法术波动",
			"水漫金山"
		}
	elseif bb == "佩恩" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"力劈华山",
			"高级连击",
			"高级必杀",
			"剑气四射"
		}
	elseif bb == "李洛克" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"舍身一搏",
			"高级反震",
			"高级敏捷",
			"高级必杀"
		}
	elseif bb == "小南" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级招架",
			"奔雷咒",
			"高级驱鬼"
		}
	elseif bb == "春野樱" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级幸运",
			"高级敏捷",
			"高级反击",
			"高级精神集中"
		}
	elseif bb == "宇智波带土" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级连击",
			"高级偷袭",
			"奔雷咒"
		}
	elseif bb == "宇智波鼬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"高级反击",
			"奔雷咒",
			"高级招架"
		}
	elseif bb == "宇智波佐助" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"力劈华山",
			"高级水属性吸收",
			"高级再生"
		}
	elseif bb == "女仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级幸运",
			"奔雷咒",
			"高级敏捷"
		}
	elseif bb == "斧魂" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级鬼魂术",
			"高级永恒",
			"高级吸血",
			"高级幸运"
		}
	elseif bb == "剑魂" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级夜战",
			"高级防御",
			"高级幸运",
			"剑气四射"
		}
	elseif bb == "枪魂" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级雷属性吸收",
			"死亡召唤",
			"高级吸血"
		}
	elseif bb == "魔化毗舍童子" then
		bbs[1] = 175
		bbs[2] = 1560
		bbs[3] = 1550
		bbs[4] = 6000
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1560
		bbs[8] = {
			1.235,
			1.2475,
			1.26,
			1.2725,
			1.285
		}
		bbs[9] = {
			"无赦魔诀",
			"连击",
			"高级合纵",
			"敏捷",
			"高级法术抵抗"
		}
	elseif bb == "赵云" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "紫霞仙子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"水漫金山",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "阿朱" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"水漫金山",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "白子画" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"水漫金山",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "貂蝉" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "凤九" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "关羽" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "Q版魔化毗舍童子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "花无缺" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "剑圣" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "巨灵神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "李蓉蓉" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"水漫金山",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "雷龙" then
		bbs[1] = 175
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5040
		bbs[5] = 2600
		bbs[6] = 1200
		bbs[7] = 1200
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"风起龙游",
			"连击",
			"驱鬼",
			"高级反震",
			"高级神迹"
		}
	elseif bb == "怜星" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"奔雷咒",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "光明战神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "执音" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 5400
		bbs[5] = 3240
		bbs[6] = 1320
		bbs[7] = 1200
		bbs[8] = {
			1.243,
			1.256,
			1.269,
			1.281,
			1.294
		}
		bbs[9] = {
			"飞行",
			"地狱烈火",
			"高级法术暴击",
			"薪火相传",
			"永恒"
		}
	elseif bb == "洛神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"水漫金山",
			"高级冥思",
			"高级魔之心"
		}
	elseif bb == "赤炎战神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "神僧" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "青霞仙子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "火龙骑士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "杀阡陌" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "通臂猿猴" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "白龙骑士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "尉迟恭" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "蓝人龙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "邀月" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "太极神君" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "赵敏" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"力劈华山",
			"高级冥思",
			"高级敏捷"
		}
	elseif bb == "壬寅神虎" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"虎虎生风",
			"高级敏捷",
			"高级反震",
			"高级反击"
		}
	elseif bb == "妙华天女" then
		bbs[1] = 175
		bbs[2] = 1423
		bbs[3] = 1423
		bbs[4] = 5449
		bbs[5] = 3433
		bbs[6] = 1471
		bbs[7] = 1567
		bbs[8] = {
			1.285,
			1.2875,
			1.29,
			1.2925,
			1.297
		}
		bbs[9] = {
			"凝光炼彩",
			"高级永恒",
			"冥思",
			"再生"
		}
	elseif bb == "月皇" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术暴击",
			"高级雷属性吸收",
			"高级水属性吸收",
			"高级防御"
		}
	elseif bb == "巨石守卫(昼)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 5400
		bbs[5] = 2400
		bbs[6] = 1332
		bbs[7] = 1440
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"迟钝",
			"高级土属性吸收",
			"魔法反击",
			"落岩"
		}
	elseif bb == "日游神" then
		bbs[1] = 85
		bbs[2] = 1440
		bbs[3] = 1260
		bbs[4] = 4200
		bbs[5] = 2400
		bbs[6] = 1380
		bbs[7] = 1320
		bbs[8] = {
			1.185,
			1.197,
			1.21,
			1.222,
			1.234
		}
		bbs[9] = {
			"高级感知",
			"强力",
			"神迹",
			"反击",
			"盾气"
		}
	elseif bb == "鬼妃" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级鬼魂术",
			"死亡召唤",
			"高级必杀",
			"冥思"
		}
	elseif bb == "无常鬼差(白)" then
		bbs[1] = 155
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2880
		bbs[6] = 1476
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"鬼魂术",
			"敏捷",
			"高级飞行",
			"高级遗志"
		}
	elseif bb == "无常鬼差(黑)" then
		bbs[1] = 155
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2880
		bbs[6] = 1476
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"高级遗志",
			"偷袭",
			"毒",
			"神佑复生"
		}
	elseif bb == "玄珠灵仙" then
		bbs[1] = 105
		bbs[2] = 1320
		bbs[3] = 1380
		bbs[4] = 4320
		bbs[5] = 2940
		bbs[6] = 1464
		bbs[7] = 1680
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级魔法反击",
			"永恒",
			"神佑复生",
			"法术暴击",
			"烈焰斩"
		}
	elseif bb == "夜游神" then
		bbs[1] = 125
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 3000
		bbs[6] = 1440
		bbs[7] = 1560
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"驱鬼",
			"高级魔之心",
			"神佑复生",
			"法术暴击",
			"影袭"
		}
	elseif bb == "月灵" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"泰山压顶",
			"夜舞倾城",
			"高级魔之心",
			"高级神佑复生"
		}
	elseif bb == "独角鬼王" then
		bbs[1] = 65
		bbs[2] = 1380
		bbs[3] = 1440
		bbs[4] = 4200
		bbs[5] = 2760
		bbs[6] = 1440
		bbs[7] = 1320
		bbs[8] = {
			1.155,
			1.167,
			1.179,
			1.19,
			1.202
		}
		bbs[9] = {
			"地狱烈火",
			"驱鬼",
			"法术暴击",
			"盾气",
			"鬼魂术"
		}
	elseif bb == "琴鹤" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "晶怪" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "魂女猫" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "金凤凰" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "砍刀猴" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "金长毛猪" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "蓝衣剑魂" then
		bbs[1] = 165
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "鸟妖仙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级夜战",
			"高级反击",
			"高级偷袭"
		}
	elseif bb == "龙魂仙女" then
		bbs[1] = 165
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冥思",
			"高级防御",
			"惊心一剑",
			"高级必杀"
		}
	elseif bb == "黑悟空" then
		bbs[1] = 165
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冥思",
			"高级防御",
			"惊心一剑",
			"高级必杀"
		}
	elseif bb == "孙行者" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"上古灵符",
			"力劈华山",
			"高级毒"
		}
	elseif bb == "白衣剑客" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级火属性吸收",
			"剑气四射",
			"高级连击"
		}
	elseif bb == "猫女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级雷属性吸收",
			"高级慧根",
			"高级反击"
		}
	elseif bb == "莲女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级再生",
			"高级火属性吸收",
			"奔雷咒",
			"高级防御"
		}
	elseif bb == "绿衣女神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"善恶有报",
			"高级反震",
			"高级必杀"
		}
	elseif bb == "五彩神女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"上古灵符",
			"高级必杀",
			"高级毒",
			"高级敏捷"
		}
	elseif bb == "红衣仙女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"上古灵符",
			"高级法术连击",
			"高级法术暴击",
			"高级夜战"
		}
	elseif bb == "葫芦小金刚" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "路飞" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "部落勇士" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级敏捷",
			"高级必杀",
			"高级偷袭",
			"高级感知"
		}
	elseif bb == "沙暴" then
		bbs[1] = 175
		bbs[2] = 1404
		bbs[3] = 1400
		bbs[4] = 4200
		bbs[5] = 2160
		bbs[6] = 1380
		bbs[7] = 1500
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"风沙之盾",
			"高级防御",
			"招架",
			"反击",
			"法术抵抗"
		}
	elseif bb == "恶魔泡泡" or bb == "恶魔泡泡(哭泣)" or bb == "恶魔泡泡(困惑)" or bb == "恶魔泡泡(奸笑)" or bb == "恶魔泡泡(白眼)" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 2000
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"连击",
			"高级吸血",
			"必杀"
		}
	elseif bb == "自在心猿" then
		bbs[1] = 175
		bbs[2] = 1584
		bbs[3] = 1464
		bbs[4] = 4800
		bbs[5] = 2160
		bbs[6] = 1500
		bbs[7] = 1320
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"驱鬼",
			"高级敏捷",
			"高级否定信仰",
			"必杀",
			"永恒"
		}
	elseif bb == "觉醒涂山雪" then
		bbs[1] = 175
		bbs[2] = 1519
		bbs[3] = 1419
		bbs[4] = 5049
		bbs[5] = 2889
		bbs[6] = 1389
		bbs[7] = 1329
		bbs[8] = {
			1.238,
			1.251,
			1.264,
			1.276,
			1.289
		}
		bbs[9] = {
			"天狐之舞",
			"冥思",
			"防御",
			"高级否定信仰",
			"高级精神集中"
		}
	elseif bb == "有苏鸩" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 5500
		bbs[5] = 3240
		bbs[6] = 1320
		bbs[7] = 1560
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"否定信仰",
			"欣欣向荣",
			"魔之心",
			"高级毒"
		}
	elseif bb == "幼狮" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"必杀",
			"连击",
			"勇敢",
			"高级偷袭"
		}
	elseif bb == "虬龙" then
		bbs[1] = 105
		bbs[2] = 1500
		bbs[3] = 1400
		bbs[4] = 4800
		bbs[5] = 1600
		bbs[6] = 1440
		bbs[7] = 1200
		bbs[8] = {
			1.213,
			1.225,
			1.238,
			1.25,
			1.262
		}
		bbs[9] = {
			"嗜血追击",
			"高级必杀",
			"偷袭",
			"高级反击"
		}
	elseif bb == "司雪" then
		bbs[1] = 175
		bbs[2] = 1404
		bbs[3] = 1400
		bbs[4] = 4080
		bbs[5] = 2160
		bbs[6] = 1200
		bbs[7] = 1320
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"水漫金山",
			"映雪棱镜",
			"幸运",
			"永恒"
		}
	elseif bb == "幻姬" then
		bbs[1] = 125
		bbs[2] = 1500
		bbs[3] = 1440
		bbs[4] = 4800
		bbs[5] = 2160
		bbs[6] = 1560
		bbs[7] = 1440
		bbs[8] = {
			1.213,
			1.225,
			1.238,
			1.25,
			1.262
		}
		bbs[9] = {
			"高级魔之心",
			"高级冥思",
			"飞行",
			"薪火相传",
			"鬼魂术"
		}
	elseif bb == "嘲风" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"高级冥思",
			"反震",
			"高级防御"
		}
	elseif bb == "龙女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"剑气四射",
			"高级气势",
			"再生",
			"必杀"
		}
	elseif bb == "呆枭" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"感知",
			"高级敏捷",
			"高级飞行",
			"双星闪"
		}
	elseif bb == "怒鳞" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"舍身一搏",
			"永恒",
			"高级勇敢",
			"高级报复"
		}
	elseif bb == "泡泡灵仙·剑侠客" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.3,
			1.3,
			1.3,
			1.3,
			1.3
		}
		bbs[9] = {
			"高级连击",
			"偷袭",
			"招架",
			"乘胜追击"
		}
	elseif bb == "泡泡灵仙·骨精灵" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.3,
			1.3,
			1.3,
			1.3,
			1.3
		}
		bbs[9] = {
			"泰山压顶",
			"法术波动",
			"幸运",
			"拘魂索命"
		}
	elseif bb == "泡泡灵仙·羽灵神" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.3,
			1.3,
			1.3,
			1.3,
			1.3
		}
		bbs[9] = {
			"高级必杀",
			"强力",
			"防御",
			"凭风借力"
		}
	elseif bb == "泡泡灵仙·神天兵" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.3,
			1.3,
			1.3,
			1.3,
			1.3
		}
		bbs[9] = {
			"高级偷袭",
			"连击",
			"强力",
			"气贯长虹"
		}
	elseif bb == "泡泡灵仙·巫蛮儿" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.249,
			1.262,
			1.275,
			1.287,
			1.3
		}
		bbs[9] = {
			"泰山压顶",
			"魔之心",
			"法术连击",
			"柳暗花明"
		}
	elseif bb == "泡泡灵仙·杀破狼" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.249,
			1.262,
			1.275,
			1.287,
			1.3
		}
		bbs[9] = {
			"高级幸运",
			"再生",
			"防御",
			"与生俱来"
		}
	elseif bb == "泡泡灵仙·飞燕女" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.249,
			1.262,
			1.275,
			1.287,
			1.3
		}
		bbs[9] = {
			"水漫金山",
			"魔之心",
			"冥思",
			"顾盼生姿"
		}
	elseif bb == "泡泡灵仙·龙太子" then
		bbs[1] = 0
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 5500
		bbs[5] = 3500
		bbs[6] = 1400
		bbs[7] = 1400
		bbs[8] = {
			1.249,
			1.262,
			1.275,
			1.287,
			1.3
		}
		bbs[9] = {
			"水漫金山",
			"魔之心",
			"神佑复生",
			"义薄云天"
		}
	elseif bb == "超级红孩儿" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"超级三昧真火",
			"魔之心",
			"敏捷",
			"法术连击",
			"法术暴击"
		}
	elseif bb == "超级飞廉" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"迅风出击",
			"高级幸运",
			"高级偷袭",
			"高级敏捷"
		}
	elseif bb == "超级离火兽" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级飞行",
			"高级毒",
			"力劈华山"
		}
	elseif bb == "癸卯神兔" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级火属性吸收",
			"高级慧根",
			"高级敏捷",
			"高级必杀"
		}
	elseif bb == "超级神柚" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"超级神柚复生",
			"高级驱鬼",
			"高级连击",
			"高级精神集中"
		}
	elseif bb == "长乐灵仙" then
		bbs[1] = 175
		bbs[2] = 1500
		bbs[3] = 1380
		bbs[4] = 4080
		bbs[5] = 2160
		bbs[6] = 1440
		bbs[7] = 1620
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"幸运",
			"高级飞行",
			"神佑复生",
			"花好月圆"
		}
	elseif bb == "紫焰妖姬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"高级必杀",
			"高级夜战",
			"高级飞行"
		}
	elseif bb == "白素贞" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"水漫金山",
			"高级慧根",
			"高级冥思",
			"高级法术连击"
		}
	elseif bb == "彩蝶依依" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"泰山压顶",
			"高级魔之心",
			"高级防御",
			"高级法术波动"
		}
	elseif bb == "春岚蔷薇" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级隐身",
			"高级必杀",
			"高级偷袭",
			"高级反震"
		}
	elseif bb == "剑姬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级连击",
			"高级反震",
			"高级强力",
			"高级反击"
		}
	elseif bb == "小青" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级幸运",
			"高级慧根",
			"奔雷咒",
			"高级魔之心"
		}
	elseif bb == "妖星" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神迹",
			"高级感知",
			"高级精神集中",
			"高级必杀"
		}
	elseif bb == "女飞贼" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级强力",
			"高级飞行",
			"高级敏捷",
			"高级火属性吸收"
		}
	elseif bb == "白娘子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术连击",
			"死亡召唤",
			"水漫金山",
			"高级防御"
		}
	elseif bb == "貂裘红衣" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"上古灵符",
			"高级幸运",
			"高级反击",
			"高级招架"
		}
	elseif bb == "小魔女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级慧根",
			"高级反击",
			"高级必杀",
			"高级毒"
		}
	elseif bb == "小狐狸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级连击",
			"高级必杀",
			"高级吸血"
		}
	elseif bb == "蓝仙女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级敏捷",
			"高级土属性吸收",
			"高级感知",
			"奔雷咒"
		}
	elseif bb == "女捕头" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级敏捷",
			"高级火属性吸收",
			"高级飞行",
			"夜舞倾城"
		}
	elseif bb == "女狐妖" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级雷属性吸收",
			"高级法术连击",
			"地狱烈火",
			"高级敏捷"
		}
	elseif bb == "三尾妖狐" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级土属性吸收",
			"高级偷袭",
			"高级招架",
			"高级夜战"
		}
	elseif bb == "蝠女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级鬼魂术",
			"高级水属性吸收",
			"高级法术暴击",
			"奔雷咒"
		}
	elseif bb == "男狐妖" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"死亡召唤",
			"高级火属性吸收",
			"高级夜战",
			"高级必杀"
		}
	elseif bb == "婚纱女" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级土属性吸收",
			"高级神迹",
			"泰山压顶"
		}
	elseif bb == "红娘子" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级夜战",
			"高级反震",
			"高级吸血",
			"高级连击"
		}
	elseif bb == "蝶妖" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级吸血",
			"力劈华山",
			"高级土属性吸收"
		}
	elseif bb == "鬼魅" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级法术暴击",
			"高级法术波动",
			"高级防御",
			"地狱烈火"
		}
	elseif bb == "镜子变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级必杀",
			"惊心一剑",
			"高级火属性吸收"
		}
	elseif bb == "手铃变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级感知",
			"高级再生",
			"高级偷袭",
			"高级夜战"
		}
	elseif bb == "三叉变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级感知",
			"高级反震",
			"地狱烈火",
			"高级再生"
		}
	elseif bb == "长鞭变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级火属性吸收",
			"上古灵符",
			"高级雷属性吸收",
			"高级冥思"
		}
	elseif bb == "金锤变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"上古灵符",
			"高级魔之心",
			"高级法术暴击",
			"高级水属性吸收"
		}
	elseif bb == "喷火变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级偷袭",
			"高级连击",
			"高级否定信仰",
			"高级反击"
		}
	elseif bb == "关羽变脸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"高级强力",
			"高级幸运",
			"高级飞行"
		}
	elseif bb == "黑脸判官" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冥思",
			"泰山压顶",
			"高级魔之心",
			"高级幸运"
		}
	elseif bb == "青衣" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级永恒",
			"高级防御",
			"高级毒",
			"高级慧根"
		}
	elseif bb == "卧龙" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级慧根",
			"高级鬼魂术",
			"高级幸运"
		}
	elseif bb == "小蓝" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级连击",
			"高级雷属性吸收",
			"高级招架",
			"高级感知"
		}
	elseif bb == "虎王" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反震",
			"高级驱鬼",
			"高级强力",
			"高级偷袭"
		}
	elseif bb == "白脸京剧" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级招架",
			"高级否定信仰",
			"高级驱鬼",
			"高级土属性吸收"
		}
	elseif bb == "黑脸京剧" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级神佑复生",
			"高级感知",
			"高级飞行",
			"高级法术暴击"
		}
	elseif bb == "小彩蝶" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"奔雷咒",
			"高级否定信仰",
			"高级法术连击",
			"高级夜战"
		}
	elseif bb == "小蓝娥" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级精神集中",
			"高级夜战",
			"高级否定信仰",
			"高级法术连击"
		}
	elseif bb == "小浪鼓" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.235,
			1.2475,
			1.26,
			1.2725,
			1.285
		}
		bbs[9] = {
			"高级精神集中",
			"高级吸血",
			"高级毒",
			"高级神迹"
		}
	elseif bb == "小绅士" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"惊心一剑",
			"高级幸运",
			"灵能激发",
			"高级反震"
		}
	elseif bb == "小圣斗士" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级毒",
			"高级魔之心",
			"高级否定信仰",
			"高级火属性吸收"
		}
	elseif bb == "小兔兔" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反震",
			"灵能激发",
			"高级毒",
			"高级隐身"
		}
	elseif bb == "小熊熊" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反震",
			"灵能激发",
			"高级毒",
			"高级隐身"
		}
	elseif bb == "小DJ" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级连击",
			"高级毒",
			"高级土属性吸收",
			"高级水属性吸收"
		}
	elseif bb == "小卷发" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级吸血",
			"高级招架",
			"高级神佑复生",
			"高级冥思"
		}
	elseif bb == "小羊角" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"善恶有报",
			"高级吸血",
			"高级防御",
			"高级夜战"
		}
	elseif bb == "部落酋长" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级夜战",
			"惊心一剑",
			"高级水属性吸收",
			"高级反震"
		}
	elseif bb == "吕布" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级强力",
			"高级蛮劲",
			"高级连击",
			"高级神佑复生"
		}
	elseif bb == "魔化吕布" then
		bbs[1] = 65
		bbs[2] = 1600
		bbs[3] = 1600
		bbs[4] = 6000
		bbs[5] = 3500
		bbs[6] = 1600
		bbs[7] = 1600
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级强力",
			"高级蛮劲",
			"高级连击",
			"高级神佑复生"
		}
	elseif bb == "神射手" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级敏捷",
			"地狱烈火",
			"高级法术连击",
			"高级神佑复生"
		}
	elseif bb == "小战神" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级连击",
			"高级必杀",
			"高级吸血"
		}
	elseif bb == "小神女" then
		bbs[1] = 0
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级连击",
			"高级必杀",
			"高级吸血"
		}
	elseif bb == "黑猫警长" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级驱鬼",
			"高级招架",
			"高级永恒",
			"高级反击"
		}
	elseif bb == "惊奇队长" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级反击",
			"高级感知",
			"高级慧根",
			"高级法术暴击"
		}
	elseif bb == "灭霸" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级冥思",
			"高级必杀",
			"死亡召唤",
			"高级偷袭"
		}
	elseif bb == "绿巨人" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"高级土属性吸收",
			"高级必杀",
			"高级连击"
		}
	elseif bb == "钢铁侠" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级防御",
			"高级土属性吸收",
			"高级必杀",
			"高级连击"
		}
	elseif bb == "雷神托尔" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级驱鬼",
			"高级魔之心",
			"奔雷咒",
			"高级敏捷"
		}
	elseif bb == "智慧女神" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级驱鬼",
			"高级魔之心",
			"奔雷咒",
			"高级敏捷"
		}
	elseif bb == "六道带土" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "大筒木辉夜" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "鼬" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "佐助" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "小佐助" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "旗木卡卡西" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "鸣人" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "小鸣人" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "带土" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "我爱罗" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "六道斑" then
		bbs[1] = 65
		bbs[2] = 1500
		bbs[3] = 1500
		bbs[4] = 5500
		bbs[5] = 3000
		bbs[6] = 1500
		bbs[7] = 1500
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"高级敏捷"
		}
	elseif bb == "云龟" then
		bbs[1] = 35
		bbs[2] = 960
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2700
		bbs[7] = 1080
		bbs[6] = 1380
		bbs[8] = {
			0.96,
			0.97,
			0.98,
			0.989,
			0.999
		}
		bbs[9] = {
			"高级敏捷",
			"高级驱鬼",
			"雷属性吸收",
			"飞行"
		}
	elseif bb == "五行山神(土)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 4800
		bbs[5] = 2820
		bbs[7] = 1560
		bbs[6] = 1440
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级反震",
			"精神集中",
			"幸运",
			"再生",
			"克敌五行"
		}
	elseif bb == "五行山神(木)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 4800
		bbs[5] = 2820
		bbs[7] = 1560
		bbs[6] = 1440
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级反震",
			"精神集中",
			"幸运",
			"再生",
			"克敌五行"
		}
	elseif bb == "五行山神(水)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 4800
		bbs[5] = 2820
		bbs[7] = 1560
		bbs[6] = 1440
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级反震",
			"精神集中",
			"幸运",
			"再生",
			"克敌五行"
		}
	elseif bb == "五行山神(火)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 4800
		bbs[5] = 2820
		bbs[7] = 1560
		bbs[6] = 1440
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级反震",
			"精神集中",
			"幸运",
			"再生",
			"克敌五行"
		}
	elseif bb == "五行山神(金)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 4800
		bbs[5] = 2820
		bbs[7] = 1560
		bbs[6] = 1440
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"高级反震",
			"精神集中",
			"幸运",
			"再生",
			"克敌五行"
		}
	elseif bb == "元宝龟" then
		bbs[1] = 0
		bbs[2] = 960
		bbs[3] = 1380
		bbs[4] = 3600
		bbs[5] = 1500
		bbs[7] = 1320
		bbs[6] = 840
		bbs[8] = {
			1.029,
			1.039,
			1.05,
			1.06,
			1.071
		}
		bbs[9] = {
			"敏捷",
			"招财进宝",
			"神迹",
			"高级感知",
			"高级幸运"
		}
	elseif bb == "冰火龟" then
		bbs[1] = 35
		bbs[2] = 1080
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[7] = 1080
		bbs[6] = 840
		bbs[8] = {
			1.097,
			1.108,
			1.12,
			1.131,
			1.142
		}
		bbs[9] = {
			"力大无穷(水)",
			"力大无穷(火)",
			"烈火",
			"必杀"
		}
	elseif bb == "冰龟" then
		bbs[1] = 25
		bbs[2] = 1080
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[7] = 1080
		bbs[6] = 840
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"健壮(水)",
			"水攻",
			"法术连击",
			"弱点雷"
		}
	elseif bb == "司辰侍者(未来)" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 4800
		bbs[5] = 3240
		bbs[7] = 1680
		bbs[6] = 1560
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级永恒",
			"再生",
			"飞行",
			"慧根"
		}
	elseif bb == "司辰侍者(过去)" then
		bbs[1] = 155
		bbs[2] = 1440
		bbs[3] = 1500
		bbs[4] = 4800
		bbs[5] = 3240
		bbs[7] = 1680
		bbs[6] = 1560
		bbs[8] = {
			1.234,
			1.247,
			1.26,
			1.272,
			1.285
		}
		bbs[9] = {
			"高级永恒",
			"再生",
			"飞行",
			"慧根"
		}
	elseif bb == "司雨" then
		bbs[1] = 175
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 4200
		bbs[5] = 2160
		bbs[7] = 1440
		bbs[6] = 1200
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"偷袭",
			"必杀",
			"高级再生",
			"雨露之泽"
		}
	elseif bb == "司风" then
		bbs[1] = 175
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 4080
		bbs[5] = 2160
		bbs[7] = 1500
		bbs[6] = 1320
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"清风之华",
			"敏捷",
			"连击",
			"高级飞行"
		}
	elseif bb == "多闻巡守" then
		bbs[1] = 175
		bbs[2] = 1536
		bbs[3] = 1380
		bbs[4] = 6000
		bbs[5] = 2640
		bbs[7] = 960
		bbs[6] = 1380
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"诸天正法",
			"高级幸运",
			"感知",
			"神佑复生"
		}
	elseif bb == "天机虫" then
		bbs[1] = 0
		bbs[2] = 1320
		bbs[3] = 1200
		bbs[4] = 2700
		bbs[5] = 2100
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			0.93,
			0.94,
			0.95,
			0.959,
			0.969
		}
		bbs[9] = {
			"高级否定信仰",
			"偷袭",
			"防御",
			"夜战"
		}
	elseif bb == "岩冰龟" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 1800
		bbs[7] = 1080
		bbs[6] = 840
		bbs[8] = {
			1.078,
			1.089,
			1.1,
			1.111,
			1.122
		}
		bbs[9] = {
			"防御",
			"水攻",
			"落岩",
			"高级水属性吸收",
			"力大无穷(水)"
		}
	elseif bb == "岩龟" then
		bbs[1] = 15
		bbs[2] = 1320
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 1800
		bbs[7] = 1080
		bbs[6] = 840
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"健壮(土)",
			"落岩",
			"防御"
		}
	elseif bb == "巨石守卫(夜)" then
		bbs[1] = 105
		bbs[2] = 1416
		bbs[3] = 1476
		bbs[4] = 5400
		bbs[5] = 2400
		bbs[7] = 1440
		bbs[6] = 1344
		bbs[8] = {
			1.214,
			1.226,
			1.239,
			1.251,
			1.263
		}
		bbs[9] = {
			"魔之心",
			"高级土属性吸收",
			"泰山压顶",
			"反震"
		}
	elseif bb == "广目巡守" then
		bbs[1] = 175
		bbs[2] = 1440
		bbs[3] = 1380
		bbs[4] = 6240
		bbs[5] = 2640
		bbs[7] = 960
		bbs[6] = 1380
		bbs[8] = {
			1.225,
			1.237,
			1.25,
			1.262,
			1.275
		}
		bbs[9] = {
			"净台妙谛",
			"高级敏捷",
			"防御",
			"神佑复生"
		}
	elseif bb == "强盗沙狸" then
		bbs[1] = 35
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.172
		}
		bbs[9] = {
			"健壮(金)",
			"力大无穷(土)",
			"高级必杀",
			"强力",
			"高级反击"
		}
	elseif bb == "强盗狸" then
		bbs[1] = 15
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.097,
			1.108,
			1.12,
			1.131,
			1.142
		}
		bbs[9] = {
			"高级必杀",
			"强力",
			"高级反击"
		}
	elseif bb == "强盗鬼狸" then
		bbs[1] = 35
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.154,
			1.166,
			1.178,
			1.189,
			1.201
		}
		bbs[9] = {
			"力大无穷(金)",
			"高级必杀",
			"强力",
			"高级反击",
			"鬼魂术"
		}
	elseif bb == "月光虫" then
		bbs[1] = 35
		bbs[2] = 960
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 3000
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"茁壮",
			"慧根",
			"冥思",
			"精神集中"
		}
	elseif bb == "月光金乌虫" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"欣欣向荣",
			"慧根",
			"冥思",
			"精神集中"
		}
	elseif bb == "月光雪蛙" then
		bbs[1] = 35
		bbs[2] = 1080
		bbs[3] = 1080
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[7] = 1020
		bbs[6] = 1200
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.172
		}
		bbs[9] = {
			"万物之灵(水)",
			"法术波动",
			"水属性吸收",
			"弱点火"
		}
	elseif bb == "望月蛙" then
		bbs[1] = 15
		bbs[2] = 1320
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"茁壮",
			"慧根",
			"冥思",
			"高级精神集中"
		}
	elseif bb == "毒云龟" then
		bbs[1] = 35
		bbs[2] = 960
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2700
		bbs[7] = 1080
		bbs[6] = 1380
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.172
		}
		bbs[9] = {
			"高级敏捷",
			"高级驱鬼",
			"雷属性吸收",
			"飞行"
		}
	elseif bb == "毒花龟(夜)" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1356
		bbs[4] = 4800
		bbs[5] = 2580
		bbs[7] = 1080
		bbs[6] = 960
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"力大无穷(木)",
			"鬼魂术",
			"毒",
			"防御"
		}
	elseif bb == "毒花龟(日)" then
		bbs[1] = 35
		bbs[2] = 1080
		bbs[3] = 1356
		bbs[4] = 4800
		bbs[5] = 2400
		bbs[7] = 1080
		bbs[6] = 960
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"健壮(木)",
			"鬼魂术",
			"毒",
			"防御"
		}
	elseif bb == "沙狸" then
		bbs[1] = 5
		bbs[2] = 1320
		bbs[3] = 900
		bbs[4] = 2880
		bbs[5] = 1200
		bbs[7] = 1320
		bbs[6] = 1380
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"健壮(土)",
			"土属性吸收",
			"幸运",
			"敏捷"
		}
	elseif bb == "沙虫" then
		bbs[1] = 25
		bbs[2] = 1320
		bbs[3] = 900
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"真灵(土)",
			"盾气",
			"连击"
		}
	elseif bb == "海狸" then
		bbs[1] = 5
		bbs[2] = 1200
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2100
		bbs[7] = 1320
		bbs[6] = 1320
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"健壮(水)",
			"感知",
			"水攻",
			"水属性吸收"
		}
	elseif bb == "火云龟" then
		bbs[1] = 35
		bbs[2] = 1080
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2700
		bbs[7] = 1080
		bbs[6] = 1380
		bbs[8] = {
			1.154,
			1.166,
			1.178,
			1.189,
			1.201
		}
		bbs[9] = {
			"力大无穷(火)",
			"高级敏捷",
			"高级驱鬼",
			"雷属性吸收",
			"飞行"
		}
	elseif bb == "火月蛙" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.154,
			1.166,
			1.178,
			1.189,
			1.201
		}
		bbs[9] = {
			"万物之灵(火)",
			"慧根",
			"冥思",
			"高级精神集中",
			"茁壮"
		}
	elseif bb == "火沙虫" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 900
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.097,
			1.108,
			1.12,
			1.131,
			1.142
		}
		bbs[9] = {
			"万物之灵(土)",
			"真灵(火)",
			"盾气",
			"连击"
		}
	elseif bb == "炼丹童子" then
		bbs[1] = 65
		bbs[2] = 1416
		bbs[3] = 1440
		bbs[4] = 4440
		bbs[5] = 3000
		bbs[7] = 1380
		bbs[6] = 1320
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级驱鬼",
			"慧根",
			"神迹",
			"神佑复生"
		}
	elseif bb == "熔岩龟" then
		bbs[1] = 25
		bbs[2] = 1200
		bbs[3] = 1380
		bbs[4] = 4800
		bbs[5] = 2580
		bbs[7] = 1080
		bbs[6] = 960
		bbs[8] = {
			1.004,
			1.014,
			1.025,
			1.035,
			1.045
		}
		bbs[9] = {
			"健壮(金)",
			"弱点水",
			"烈火",
			"必杀"
		}
	elseif bb == "熔火虫" then
		bbs[1] = 25
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 2700
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.004,
			1.014,
			1.025,
			1.035,
			1.045
		}
		bbs[9] = {
			"健壮(金)",
			"必杀",
			"夜战",
			"弱点水"
		}
	elseif bb == "熔火蛙" then
		bbs[1] = 25
		bbs[2] = 1380
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 1200
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			0.989,
			0.999,
			1.01,
			1.02,
			1.03
		}
		bbs[9] = {
			"真灵(火)",
			"再生",
			"高级火属性吸收",
			"地狱烈火"
		}
	elseif bb == "燧明兽" then
		bbs[1] = 65
		bbs[2] = 1400
		bbs[3] = 1400
		bbs[4] = 4500
		bbs[5] = 2500
		bbs[7] = 1200
		bbs[6] = 1200
		bbs[8] = {
			1.152,
			1.164,
			1.176,
			1.187,
			1.199
		}
		bbs[9] = {
			"高级感知",
			"连击",
			"强力"
		}
	elseif bb == "积水蛙" then
		bbs[1] = 0
		bbs[2] = 1080
		bbs[3] = 840
		bbs[4] = 2700
		bbs[5] = 1200
		bbs[7] = 1020
		bbs[6] = 1200
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"真灵(木)",
			"幸运"
		}
	elseif bb == "积水鬼蛙" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 1500
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.105,
			1.116,
			1.128,
			1.139,
			1.15
		}
		bbs[9] = {
			"万物之灵(水)",
			"弱点雷",
			"鬼魂术"
		}
	elseif bb == "竹笋虫" then
		bbs[1] = 0
		bbs[2] = 1200
		bbs[3] = 900
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1440
		bbs[8] = {
			0.98,
			0.99,
			1,
			1.01,
			1.02
		}
		bbs[9] = {
			"真灵(木)",
			"感知",
			"再生",
			"弱点火"
		}
	elseif bb == "纵火狸" then
		bbs[1] = 25
		bbs[2] = 1320
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[7] = 1320
		bbs[6] = 1320
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"健壮(金)",
			"高级敏捷",
			"法术暴击",
			"火属性吸收"
		}
	elseif bb == "胖海狸" then
		bbs[1] = 35
		bbs[2] = 1200
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2100
		bbs[7] = 1320
		bbs[6] = 1320
		bbs[8] = {
			1.067,
			1.078,
			1.089,
			1.099,
			1.11
		}
		bbs[9] = {
			"力大无穷(水)",
			"强力",
			"感知",
			"幸运"
		}
	elseif bb == "草叶虫" then
		bbs[1] = 0
		bbs[2] = 1200
		bbs[3] = 900
		bbs[4] = 2400
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1440
		bbs[8] = {
			0.98,
			0.99,
			1,
			1.01,
			1.02
		}
		bbs[9] = {
			"真灵(木)",
			"感知",
			"再生",
			"弱点火"
		}
	elseif bb == "草叶魂虫" then
		bbs[1] = 35
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 2400
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.172
		}
		bbs[9] = {
			"万物之灵(木)",
			"招架",
			"夜战",
			"毒"
		}
	elseif bb == "草龟" then
		bbs[1] = 0
		bbs[2] = 960
		bbs[3] = 960
		bbs[4] = 3900
		bbs[5] = 1200
		bbs[7] = 1080
		bbs[6] = 840
		bbs[8] = {
			0.882,
			0.891,
			0.9,
			0.909,
			0.918
		}
		bbs[9] = {
			"土属性吸收",
			"防御",
			"迟钝",
			"盾气"
		}
	elseif bb == "金乌月光虫" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"欣欣向荣",
			"慧根",
			"冥思",
			"精神集中"
		}
	elseif bb == "金乌火虫" then
		bbs[1] = 35
		bbs[2] = 1500
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 1800
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.154,
			1.166,
			1.178,
			1.189,
			1.201
		}
		bbs[9] = {
			"万物之灵(金)",
			"法术暴击",
			"驱鬼",
			"慧根"
		}
	elseif bb == "金乌虫" then
		bbs[1] = 35
		bbs[2] = 1500
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 1800
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"真灵(火)",
			"法术暴击",
			"烈火",
			"反击"
		}
	elseif bb == "金翼" then
		bbs[1] = 85
		bbs[2] = 1100
		bbs[3] = 1440
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1320
		bbs[6] = 1380
		bbs[8] = {
			1.203,
			1.215,
			1.228,
			1.24,
			1.252
		}
		bbs[9] = {
			"薪火相传",
			"高级神佑复生",
			"烈火",
			"飞行"
		}
	elseif bb == "阿宝" then
		bbs[1] = 55
		bbs[2] = 1440
		bbs[3] = 1320
		bbs[4] = 4560
		bbs[5] = 2400
		bbs[7] = 1080
		bbs[6] = 1440
		bbs[8] = {
			1.176,
			1.188,
			1.2,
			1.212,
			1.224
		}
		bbs[9] = {
			"高级敏捷",
			"独行",
			"高级再生",
			"土属性吸收",
			"连击"
		}
	elseif bb == "雪人" then
		bbs[1] = 0
		bbs[2] = 1440
		bbs[3] = 1440
		bbs[4] = 4560
		bbs[5] = 2400
		bbs[7] = 1440
		bbs[6] = 1380
		bbs[8] = {
			1.204,
			1.216,
			1.229,
			1.241,
			1.253
		}
		bbs[9] = {
			"必杀",
			"偷袭",
			"夜战",
			"连击"
		}
	elseif bb == "雪月蛙" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1080
		bbs[4] = 3600
		bbs[5] = 3000
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.127,
			1.138,
			1.15,
			1.161,
			1.172
		}
		bbs[9] = {
			"欣欣向荣",
			"慧根",
			"冥思",
			"高级精神集中"
		}
	elseif bb == "雪狸" then
		bbs[1] = 15
		bbs[2] = 1380
		bbs[3] = 1320
		bbs[4] = 3900
		bbs[5] = 1200
		bbs[7] = 1200
		bbs[6] = 1080
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"强力",
			"水属性吸收",
			"法术抵抗",
			"幸运"
		}
	elseif bb == "雪蛙" then
		bbs[1] = 25
		bbs[2] = 1080
		bbs[3] = 1080
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[7] = 1020
		bbs[6] = 1200
		bbs[8] = {
			0.93,
			0.94,
			0.95,
			0.959,
			0.969
		}
		bbs[9] = {
			"真灵(水)",
			"法术波动",
			"弱点火",
			"水属性吸收"
		}
	elseif bb == "食魂虫(夜)" then
		bbs[1] = 35
		bbs[2] = 1440
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 2400
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"万物之灵(木)",
			"夜战",
			"强力",
			"毒"
		}
	elseif bb == "食魂虫(日)" then
		bbs[1] = 35
		bbs[2] = 1080
		bbs[3] = 900
		bbs[4] = 2700
		bbs[5] = 2100
		bbs[7] = 1200
		bbs[6] = 1320
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"真灵(木)",
			"招架",
			"毒"
		}
	elseif bb == "鬼火狸" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1200
		bbs[4] = 3600
		bbs[5] = 2400
		bbs[7] = 1320
		bbs[6] = 1320
		bbs[8] = {
			1.078,
			1.089,
			1.1,
			1.111,
			1.122
		}
		bbs[9] = {
			"健壮(金)",
			"高级敏捷",
			"法术暴击",
			"火属性吸收"
		}
	elseif bb == "鬼狸" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1200
		bbs[4] = 3900
		bbs[5] = 1320
		bbs[7] = 1080
		bbs[6] = 1080
		bbs[8] = {
			0.999,
			1.009,
			1.02,
			1.03,
			1.04
		}
		bbs[9] = {
			"法术暴击",
			"法术连击",
			"独行",
			"鬼魂术"
		}
	elseif bb == "鬼蛙" then
		bbs[1] = 35
		bbs[2] = 1320
		bbs[3] = 1320
		bbs[4] = 3600
		bbs[5] = 1500
		bbs[7] = 1020
		bbs[6] = 1080
		bbs[8] = {
			1.013,
			1.023,
			1.034,
			1.044,
			1.054
		}
		bbs[9] = {
			"夜战",
			"弱点雷",
			"吸血",
			"鬼魂术"
		}
	end

	return bbs
end

取天生 = function(ac)
	local acs = {}

	if ac == "持国巡守" then
		acs = {}
	elseif ac == "龙魂仙女" then
		acs = {
			"高级冥思"
		}
	elseif ac == "黑悟空" then
		acs = {
			"高级冥思"
		}
	elseif ac == "孙行者" then
		acs = {
			"上古灵符"
		}
	elseif ac == "白衣剑客" then
		acs = {
			"高级反击"
		}
	elseif ac == "猫女" then
		acs = {
			"高级反击"
		}
	elseif ac == "莲女" then
		acs = {
			"高级防御"
		}
	elseif ac == "绿衣女神" then
		acs = {
			"高级反震"
		}
	elseif ac == "五彩神女" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "红衣仙女" then
		acs = {
			"高级夜战"
		}
	elseif ac == "葫芦小金刚" then
		acs = {
			"高级驱鬼"
		}
	elseif ac == "路飞" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "部落勇士" then
		acs = {
			"高级感知"
		}
	elseif ac == "沙暴" then
		acs = {
			"法术抵抗"
		}
	elseif ac == "恶魔泡泡" or ac == "恶魔泡泡(哭泣)" or ac == "恶魔泡泡(困惑)" or ac == "恶魔泡泡(奸笑)" or ac == "恶魔泡泡(白眼)" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "自在心猿" then
		acs = {
			"必杀",
			"永恒"
		}
	elseif ac == "有苏鸩" then
		acs = {
			"高级毒"
		}
	elseif ac == "幼狮" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "虬龙" then
		acs = {
			"高级反击"
		}
	elseif ac == "司雪" then
		acs = {
			"幸运",
			"永恒"
		}
	elseif ac == "幻姬" then
		acs = {
			"飞行",
			"鬼魂术"
		}
	elseif ac == "嘲风" then
		acs = {
			"反震"
		}
	elseif ac == "泡泡灵仙·剑侠客" then
		acs = {
			"乘胜追击"
		}
	elseif ac == "泡泡灵仙·骨精灵" then
		acs = {
			"拘魂索命"
		}
	elseif ac == "泡泡灵仙·羽灵神" then
		acs = {
			"凭风借力"
		}
	elseif ac == "泡泡灵仙·神天兵" then
		acs = {
			"气贯长虹"
		}
	elseif ac == "龙女" then
		acs = {
			"再生"
		}
	elseif ac == "呆枭" then
		acs = {
			"感知"
		}
	elseif ac == "怒鳞" then
		acs = {
			"永恒"
		}
	elseif ac == "紫焰妖姬" then
		acs = {
			"高级慧根"
		}
	elseif ac == "白素贞" then
		acs = {
			"水漫金山"
		}
	elseif ac == "彩蝶依依" then
		acs = {
			"泰山压顶"
		}
	elseif ac == "春岚蔷薇" then
		acs = {
			"高级隐身"
		}
	elseif ac == "剑姬" then
		acs = {
			"高级连击"
		}
	elseif ac == "小青" then
		acs = {
			"高级幸运"
		}
	elseif ac == "妖星" then
		acs = {
			"高级神迹"
		}
	elseif ac == "女飞贼" then
		acs = {
			"高级强力"
		}
	elseif ac == "白娘子" then
		acs = {
			"高级法术连击"
		}
	elseif ac == "貂裘红衣" then
		acs = {
			"高级反击"
		}
	elseif ac == "小魔女" then
		acs = {
			"高级慧根"
		}
	elseif ac == "小狐狸" then
		acs = {
			"高级神佑复生"
		}
	elseif ac == "蓝仙女" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "女捕头" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "女狐妖" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "三尾妖狐" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "蝠女" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "男狐妖" then
		acs = {
			"高级夜战"
		}
	elseif ac == "婚纱女" then
		acs = {
			"高级招架"
		}
	elseif ac == "红娘子" then
		acs = {
			"高级夜战"
		}
	elseif ac == "蝶妖" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "鬼魅" then
		acs = {
			"高级法术暴击"
		}
	elseif ac == "镜子变脸" then
		acs = {
			"高级招架"
		}
	elseif ac == "手铃变脸" then
		acs = {
			"高级感知"
		}
	elseif ac == "三叉变脸" then
		acs = {
			"高级感知"
		}
	elseif ac == "长鞭变脸" then
		acs = {
			"高级冥思"
		}
	elseif ac == "金锤变脸" then
		acs = {
			"高级魔之心"
		}
	elseif ac == "喷火变脸" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "关羽变脸" then
		acs = {
			"高级防御"
		}
	elseif ac == "黑脸判官" then
		acs = {
			"高级冥思"
		}
	elseif ac == "青衣" then
		acs = {
			"高级永恒"
		}
	elseif ac == "卧龙" then
		acs = {
			"高级幸运"
		}
	elseif ac == "小蓝" then
		acs = {
			"高级连击"
		}
	elseif ac == "虎王" then
		acs = {
			"高级反震"
		}
	elseif ac == "白脸京剧" then
		acs = {
			"高级招架"
		}
	elseif ac == "黑脸京剧" then
		acs = {
			"高级神佑复生"
		}
	elseif ac == "小彩蝶" then
		acs = {
			"奔雷咒"
		}
	elseif ac == "小蓝娥" then
		acs = {
			"高级精神集中"
		}
	elseif ac == "小浪鼓" then
		acs = {
			"高级吸血"
		}
	elseif ac == "小绅士" then
		acs = {
			"高级反震"
		}
	elseif ac == "小圣斗士" then
		acs = {
			"高级毒"
		}
	elseif ac == "小兔兔" then
		acs = {
			"高级反震"
		}
	elseif ac == "小熊熊" then
		acs = {
			"高级反震"
		}
	elseif ac == "小DJ" then
		acs = {
			"高级连击"
		}
	elseif ac == "小卷发" then
		acs = {
			"高级吸血"
		}
	elseif ac == "小羊角" then
		acs = {
			"高级防御"
		}
	elseif ac == "部落酋长" then
		acs = {
			"高级夜战"
		}
	elseif ac == "吕布" then
		acs = {
			"高级强力"
		}
	elseif ac == "魔化吕布" then
		acs = {
			"高级蛮劲"
		}
	elseif ac == "神射手" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "小战神" then
		acs = {
			"高级反击"
		}
	elseif ac == "小神女" then
		acs = {
			"高级必杀"
		}
	elseif ac == "黑猫警长" then
		acs = {
			"高级驱鬼"
		}
	elseif ac == "惊奇队长" then
		acs = {
			"高级反击"
		}
	elseif ac == "灭霸" then
		acs = {
			"高级冥思"
		}
	elseif ac == "绿巨人" then
		acs = {
			"高级防御"
		}
	elseif ac == "钢铁侠" then
		acs = {
			"高级连击"
		}
	elseif ac == "雷神托尔" then
		acs = {
			"奔雷咒"
		}
	elseif ac == "智慧女神" then
		acs = {
			"高级魔之心"
		}
	elseif ac == "六道带土" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "大筒木辉夜" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "鼬" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "佐助" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "小佐助" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "旗木卡卡西" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "鸣人" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "小鸣人" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "带土" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "我爱罗" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "六道斑" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "琴鹤" then
		acs = {
			"高级招架"
		}
	elseif ac == "晶怪" then
		acs = {
			"高级招架"
		}
	elseif ac == "魂女猫" then
		acs = {
			"高级招架"
		}
	elseif ac == "金凤凰" then
		acs = {
			"高级招架"
		}
	elseif ac == "砍刀猴" then
		acs = {
			"高级招架"
		}
	elseif ac == "金长毛猪" then
		acs = {
			"高级招架"
		}
	elseif ac == "蓝衣剑魂" then
		acs = {
			"高级招架"
		}
	elseif ac == "鸟妖仙" then
		acs = {
			"高级招架"
		}
	elseif ac == "狐不归" then
		acs = {
			"高级水属性吸收",
			"进击必杀"
		}
	elseif ac == "花铃" then
		acs = {
			"敏捷"
		}
	elseif ac == "月魅" then
		acs = {
			"高级招架",
			"法术连击"
		}
	elseif ac == "云游火" then
		acs = {
			"高级合纵",
			"敏捷"
		}
	elseif ac == "老夫子" then
		acs = {
			"高级土属性吸收"
		}
	elseif ac == "琴瑟仙女" then
		acs = {
			"高级强力"
		}
	elseif ac == "逍遥神牛" then
		acs = {
			"高级吸血"
		}
	elseif ac == "龙仙" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "龙鲤" then
		acs = {
			"高级冥思"
		}
	elseif ac == "涂山瞳" then
		acs = {
			"高级慧根",
			"进击法爆"
		}
	elseif ac == "武罗仙子" then
		acs = {
			"高级连击"
		}
	elseif ac == "月影仙" then
		acs = {
			"必杀",
			"弱点火"
		}
	elseif ac == "暗黑龙" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "剑灵双子" then
		acs = {
			"高级强力"
		}
	elseif ac == "太极捶童子" then
		acs = {
			"高级否定信仰"
		}
	elseif ac == "暗雷豹" then
		acs = {
			"高级反震"
		}
	elseif ac == "黑灵猫" then
		acs = {
			"高级神迹"
		}
	elseif ac == "红衣战锤使" then
		acs = {
			"高级水属性吸收"
		}
	elseif ac == "美猴王" then
		acs = {
			"高级连击"
		}
	elseif ac == "火熔石" then
		acs = {
			"高级再生"
		}
	elseif ac == "三尾火狐" then
		acs = {
			"高级冲击"
		}
	elseif ac == "骏天马" then
		acs = {
			"高级飞行"
		}
	elseif ac == "鲛人鱼" then
		acs = {
			"高级防御"
		}
	elseif ac == "狗头人" then
		acs = {
			"高级精神集中"
		}
	elseif ac == "巨灵狼" then
		acs = {
			"高级幸运"
		}
	elseif ac == "黑翼弓使" then
		acs = {
			"高级反击"
		}
	elseif ac == "无名上仙" then
		acs = {
			"水漫金山"
		}
	elseif ac == "光辉女神" then
		acs = {
			"高级感知"
		}
	elseif ac == "四翼上仙" then
		acs = {
			"高级反击"
		}
	elseif ac == "大象精" then
		acs = {
			"地狱烈火"
		}
	elseif ac == "四臂魔神" then
		acs = {
			"高级防御"
		}
	elseif ac == "老鹰精" then
		acs = {
			"高级飞行"
		}
	elseif ac == "氪金大佬" then
		acs = {
			"高级幸运"
		}
	elseif ac == "超级三眼娃" then
		acs = {
			"高级招架"
		}
	elseif ac == "太极真君" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "托塔娃" then
		acs = {
			"高级水属性吸收"
		}
	elseif ac == "巨斧猛男" then
		acs = {
			"高级反击"
		}
	elseif ac == "齐天大圣" then
		acs = {
			"高级冲击"
		}
	elseif ac == "酷炫佬" then
		acs = {
			"奔雷咒"
		}
	elseif ac == "酷炫老逼登" then
		acs = {
			"高级感知"
		}
	elseif ac == "风火轮器灵" then
		acs = {
			"惊心一剑"
		}
	elseif ac == "月宫仙子" then
		acs = {
			"高级防御"
		}
	elseif ac == "夜莺" then
		acs = {
			"高级感知"
		}
	elseif ac == "蓝凤凰" then
		acs = {
			"高级神佑复生"
		}
	elseif ac == "小雪人" then
		acs = {
			"高级连击"
		}
	elseif ac == "团团" then
		acs = {
			"高级反击"
		}
	elseif ac == "小欣" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "兔乖乖" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "神武雨师" then
		acs = {
			"水漫金山"
		}
	elseif ac == "杨二郎" then
		acs = {
			"高级助攻"
		}
	elseif ac == "萼华仙子" then
		acs = {
			"上古灵符"
		}
	elseif ac == "蚩尤武魂" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "神武风伯" then
		acs = {
			"高级法术暴击"
		}
	elseif ac == "幽灵虎" then
		acs = {
			"高级毒"
		}
	elseif ac == "龙虾骑士" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "战神罗成" then
		acs = {
			"高级反击"
		}
	elseif ac == "死亡骑士" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "贪狼" then
		acs = {
			"高级夜战"
		}
	elseif ac == "小肥羊" then
		acs = {
			"必杀"
		}
	elseif ac == "月影兔" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "玄武" then
		acs = {
			"水漫金山"
		}
	elseif ac == "金钱龟" then
		acs = {
			"再生"
		}
	elseif ac == "金麟鹿" then
		acs = {
			"高级必杀"
		}
	elseif ac == "吉祥" then
		acs = {
			"连击"
		}
	elseif ac == "嵩鼠" then
		acs = {
			"夜战"
		}
	elseif ac == "龙须豹" then
		acs = {
			"敏捷"
		}
	elseif ac == "熊猫大侠" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "白無常" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "拽王" then
		acs = {
			"高级吸血"
		}
	elseif ac == "萌狗" then
		acs = {
			"高级反击"
		}
	elseif ac == "小红孩儿" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "月仙" then
		acs = {
			"高级魔之心"
		}
	elseif ac == "狮仙" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "剑仙" then
		acs = {
			"高级反击"
		}
	elseif ac == "判官" then
		acs = {
			"高级防御"
		}
	elseif ac == "龙羽" then
		acs = {
			"高级幸运"
		}
	elseif ac == "罗汉" then
		acs = {
			"高级招架"
		}
	elseif ac == "龙王" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "天师" then
		acs = {
			"高级幸运"
		}
	elseif ac == "战将" then
		acs = {
			"高级感知"
		}
	elseif ac == "狂狮" then
		acs = {
			"高级招架"
		}
	elseif ac == "佛子" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "葫仙" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "法僧" then
		acs = {
			"高级招架"
		}
	elseif ac == "金衣仙" then
		acs = {
			"高级永恒"
		}
	elseif ac == "龙剑士" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "龙剑女" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "水龙" then
		acs = {
			"高级再生"
		}
	elseif ac == "画仙" then
		acs = {
			"高级幸运"
		}
	elseif ac == "天帝" then
		acs = {
			"高级必杀"
		}
	elseif ac == "镇元" then
		acs = {
			"高级法术波动"
		}
	elseif ac == "鬼君" then
		acs = {
			"高级飞行"
		}
	elseif ac == "鹿君" then
		acs = {
			"高级驱鬼"
		}
	elseif ac == "火女" then
		acs = {
			"高级法术暴击"
		}
	elseif ac == "福禄仙" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "天后" then
		acs = {
			"高级法术暴击"
		}
	elseif ac == "太极老君" then
		acs = {
			"高级幸运"
		}
	elseif ac == "天兵统领" then
		acs = {
			"高级感知"
		}
	elseif ac == "阎王爷" then
		acs = {
			"高级法术连击"
		}
	elseif ac == "大蛇丸" then
		acs = {
			"高级雷属性吸收"
		}
	elseif ac == "干柿鬼鲛" then
		acs = {
			"水漫金山"
		}
	elseif ac == "佩恩" then
		acs = {
			"高级必杀"
		}
	elseif ac == "李洛克" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "小南" then
		acs = {
			"高级反击"
		}
	elseif ac == "春野樱" then
		acs = {
			"高级幸运"
		}
	elseif ac == "宇智波带土" then
		acs = {
			"高级偷袭"
		}
	elseif ac == "宇智波鼬" then
		acs = {
			"高级招架"
		}
	elseif ac == "宇智波佐助" then
		acs = {
			"高级再生"
		}
	elseif ac == "女仙" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "斧魂" then
		acs = {
			"高级幸运"
		}
	elseif ac == "剑魂" then
		acs = {
			"高级夜战"
		}
	elseif ac == "枪魂" then
		acs = {
			"高级必杀"
		}
	elseif ac == "魔化毗舍童子" then
		acs = {
			"无赦魔诀",
			"连击"
		}
	elseif ac == "赵云" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "紫霞仙子" then
		acs = {
			"高级再生"
		}
	elseif ac == "阿朱" then
		acs = {
			"高级冥思"
		}
	elseif ac == "白子画" then
		acs = {
			"高级再生"
		}
	elseif ac == "貂蝉" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "凤九" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "关羽" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "Q版魔化毗舍童子" then
		acs = {
			"高级毒"
		}
	elseif ac == "花无缺" then
		acs = {
			"高级毒"
		}
	elseif ac == "剑圣" then
		acs = {
			"高级毒"
		}
	elseif ac == "巨灵神" then
		acs = {
			"高级冥思"
		}
	elseif ac == "李蓉蓉" then
		acs = {
			"高级冥思"
		}
	elseif ac == "雷龙" then
		acs = {
			"高级反震"
		}
	elseif ac == "怜星" then
		acs = {
			"高级再生"
		}
	elseif ac == "光明战神" then
		acs = {
			"高级毒"
		}
	elseif ac == "执音" then
		acs = {
			"飞行",
			"地狱烈火"
		}
	elseif ac == "洛神" then
		acs = {
			"高级再生"
		}
	elseif ac == "赤炎战神" then
		acs = {
			"高级毒"
		}
	elseif ac == "神僧" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "青霞仙子" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "火龙骑士" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "杀阡陌" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "通臂猿猴" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "白龙骑士" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "尉迟恭" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "蓝人龙" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "邀月" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "太极神君" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "赵敏" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "月皇" then
		acs = {
			"高级防御"
		}
	elseif ac == "巨石守卫(昼)" then
		acs = {
			"落岩"
		}
	elseif ac == "日游神" then
		acs = {
			"盾气",
			"反击",
			"强力"
		}
	elseif ac == "鬼妃" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "无常鬼差(白)" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "无常鬼差(黑)" then
		acs = {
			"神佑复生"
		}
	elseif ac == "玄珠灵仙" then
		acs = {
			"永恒"
		}
	elseif ac == "月灵" then
		acs = {
			"泰山压顶"
		}
	elseif ac == "独角鬼王" then
		acs = {
			"法术暴击",
			"鬼魂术"
		}
	elseif ac == "云龟" then
		acs = {
			"飞行"
		}
	elseif ac == "五行山神(土)" then
		acs = {
			"克敌五行"
		}
	elseif ac == "五行山神(木)" then
		acs = {
			"克敌五行"
		}
	elseif ac == "五行山神(水)" then
		acs = {
			"克敌五行"
		}
	elseif ac == "五行山神(火)" then
		acs = {
			"克敌五行"
		}
	elseif ac == "五行山神(金)" then
		acs = {
			"克敌五行"
		}
	elseif ac == "元宝龟" then
		acs = {
			"高级幸运"
		}
	elseif ac == "冰火龟" then
		acs = {
			"必杀"
		}
	elseif ac == "冰龟" then
		acs = {
			"弱点雷"
		}
	elseif ac == "司辰侍者(未来)" then
		acs = {
			"慧根"
		}
	elseif ac == "司辰侍者(过去)" then
		acs = {
			"慧根"
		}
	elseif ac == "司雨" then
		acs = {}
	elseif ac == "司风" then
		acs = {}
	elseif ac == "多闻巡守" then
		acs = {}
	elseif ac == "天机虫" then
		acs = {
			"夜战"
		}
	elseif ac == "岩冰龟" then
		acs = {
			"防御"
		}
	elseif ac == "岩龟" then
		acs = {
			"防御"
		}
	elseif ac == "巨石守卫(夜)" then
		acs = {
			"泰山压顶"
		}
	elseif ac == "广目巡守" then
		acs = {}
	elseif ac == "强盗沙狸" then
		acs = {
			"高级反击"
		}
	elseif ac == "强盗狸" then
		acs = {
			"高级反击"
		}
	elseif ac == "强盗鬼狸" then
		acs = {
			"高级反击",
			"鬼魂术"
		}
	elseif ac == "月光虫" then
		acs = {
			"精神集中"
		}
	elseif ac == "月光金乌虫" then
		acs = {
			"精神集中"
		}
	elseif ac == "月光雪蛙" then
		acs = {
			"弱点火"
		}
	elseif ac == "望月蛙" then
		acs = {}
	elseif ac == "毒云龟" then
		acs = {
			"飞行"
		}
	elseif ac == "毒花龟(夜)" then
		acs = {}
	elseif ac == "毒花龟(日)" then
		acs = {}
	elseif ac == "沙狸" then
		acs = {
			"敏捷"
		}
	elseif ac == "沙虫" then
		acs = {
			"盾气",
			"连击"
		}
	elseif ac == "泡泡灵仙·巫蛮儿" then
		acs = {
			"柳暗花明"
		}
	elseif ac == "泡泡灵仙·杀破狼" then
		acs = {
			"与生俱来"
		}
	elseif ac == "泡泡灵仙·飞燕女" then
		acs = {
			"顾盼生姿"
		}
	elseif ac == "泡泡灵仙·龙太子" then
		acs = {
			"义薄云天"
		}
	elseif ac == "海狸" then
		acs = {
			"水属性吸收"
		}
	elseif ac == "火云龟" then
		acs = {
			"飞行"
		}
	elseif ac == "火月蛙" then
		acs = {
			"茁壮"
		}
	elseif ac == "火沙虫" then
		acs = {
			"盾气",
			"连击"
		}
	elseif ac == "炼丹童子" then
		acs = {
			"神佑复生"
		}
	elseif ac == "熔岩龟" then
		acs = {
			"必杀"
		}
	elseif ac == "熔火虫" then
		acs = {
			"必杀",
			"弱点水"
		}
	elseif ac == "熔火蛙" then
		acs = {
			"地狱烈火"
		}
	elseif ac == "燧明兽" then
		acs = {
			"强力"
		}
	elseif ac == "积水蛙" then
		acs = {}
	elseif ac == "积水鬼蛙" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "竹笋虫" then
		acs = {
			"弱点火"
		}
	elseif ac == "纵火狸" then
		acs = {
			"火属性吸收"
		}
	elseif ac == "胖海狸" then
		acs = {
			"幸运"
		}
	elseif ac == "草叶虫" then
		acs = {
			"弱点火"
		}
	elseif ac == "草叶魂虫" then
		acs = {
			"毒"
		}
	elseif ac == "草龟" then
		acs = {
			"迟钝",
			"盾气"
		}
	elseif ac == "金乌月光虫" then
		acs = {
			"精神集中"
		}
	elseif ac == "金乌火虫" then
		acs = {
			"慧根"
		}
	elseif ac == "金乌虫" then
		acs = {
			"反击"
		}
	elseif ac == "金翼" then
		acs = {
			"飞行"
		}
	elseif ac == "阿宝" then
		acs = {
			"连击"
		}
	elseif ac == "雪人" then
		acs = {}
	elseif ac == "雪月蛙" then
		acs = {}
	elseif ac == "雪狸" then
		acs = {
			"幸运"
		}
	elseif ac == "雪蛙" then
		acs = {
			"弱点火",
			"水属性吸收"
		}
	elseif ac == "食魂虫(夜)" then
		acs = {
			"毒"
		}
	elseif ac == "食魂虫(日)" then
		acs = {
			"毒"
		}
	elseif ac == "鬼火狸" then
		acs = {
			"火属性吸收"
		}
	elseif ac == "鬼狸" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "鬼蛙" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "毗舍童子" or ac == "暗黑毗舍童子" then
		acs = {
			"连击",
			"神迹"
		}
	elseif ac == "灵灯侍者" then
		acs = {
			"高级慧根"
		}
	elseif ac == "金身罗汉" then
		acs = {
			"高级敏捷"
		}
	elseif ac == "曼珠沙华" then
		acs = {
			"高级再生"
		}
	elseif ac == "修罗傀儡妖" then
		acs = {
			"高级连击"
		}
	elseif ac == "蜃气妖" then
		acs = {
			"上古灵符"
		}
	elseif ac == "藤蔓妖花" then
		acs = {
			"高级法术连击"
		}
	elseif ac == "修罗傀儡鬼" then
		acs = {
			"嗜血追击"
		}
	elseif ac == "巨力神猿" then
		acs = {
			"敏捷"
		}
	elseif ac == "长眉灵猴" then
		acs = {
			"奔雷咒"
		}
	elseif ac == "混沌兽" then
		acs = {
			"奔雷咒"
		}
	elseif ac == "狂豹人形" or ac == "黑白狂豹人形" then
		acs = {
			"偷袭",
			"吸血"
		}
	elseif ac == "猫灵人形" then
		acs = {
			"敏捷"
		}
	elseif ac == "猫灵兽形" then
		acs = {
			"弱点水"
		}
	elseif ac == "巴蛇" then
		acs = {
			"再生"
		}
	elseif ac == "连弩车" then
		acs = {
			"迟钝"
		}
	elseif ac == "机关鸟" then
		acs = {
			"飞行"
		}
	elseif ac == "机关兽" then
		acs = {
			"烈火"
		}
	elseif ac == "机关人" then
		acs = {
			"高级招架"
		}
	elseif ac == "龙龟" then
		acs = {
			"水攻"
		}
	elseif ac == "踏云兽" then
		acs = {
			"弱点土"
		}
	elseif ac == "蝎子精" then
		acs = {
			"毒"
		}
	elseif ac == "葫芦宝贝" then
		acs = {
			"魔之心"
		}
	elseif ac == "琴仙" then
		acs = {
			"敏捷"
		}
	elseif ac == "炎魔神" or ac == "炎魔神x" then
		acs = {
			"地狱烈火"
		}
	elseif ac == "金铙僧" then
		acs = {
			"偷袭",
			"高级雷属性吸收"
		}
	elseif ac == "鬼将" or ac == "鬼将x" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "画魂" then
		acs = {
			"高级鬼魂术",
			"地狱烈火"
		}
	elseif ac == "幽萤娃娃" then
		acs = {
			"高级鬼魂术"
		}
	elseif ac == "吸血鬼" or ac == "吸血鬼x" then
		acs = {
			"鬼魂术",
			"夜战",
			"弱点水"
		}
	elseif ac == "幽灵" or ac == "幽灵x" then
		acs = {
			"鬼魂术"
		}
	elseif ac == "灵符女娲" then
		acs = {
			"落岩"
		}
	elseif ac == "阴阳伞" then
		acs = {
			"高级飞行"
		}
	elseif ac == "泪妖" then
		acs = {
			"法术暴击",
			"弱点土",
			"水攻"
		}
	elseif ac == "镜妖" then
		acs = {
			"雷击"
		}
	elseif ac == "鼠先锋" then
		acs = {
			"敏捷"
		}
	elseif ac == "百足将军" then
		acs = {
			"弱点水"
		}
	elseif ac == "犀牛将军人形" then
		acs = {
			"再生"
		}
	elseif ac == "犀牛将军兽形" then
		acs = {
			"落岩"
		}
	elseif ac == "锦毛貂精" then
		acs = {
			"敏捷"
		}
	elseif ac == "如意仙子" or ac == "如意仙子x" then
		acs = {
			"烈火"
		}
	elseif ac == "星灵仙子" or ac == "星灵仙子x" then
		acs = {
			"雷击"
		}
	elseif ac == "蚌精" then
		acs = {
			"冥思"
		}
	elseif ac == "鲛人" then
		acs = {
			"敏捷"
		}
	elseif ac == "凤凰" or ac == "凤凰x" then
		acs = {
			"飞行"
		}
	elseif ac == "蛟龙" or ac == "蛟龙x" then
		acs = {
			"感知"
		}
	elseif ac == "雨师" or ac == "雨师x" then
		acs = {
			"水攻"
		}
	elseif ac == "雷鸟人" or ac == "雷鸟人x" then
		acs = {
			"飞行",
			"弱点土",
			"雷击"
		}
	elseif ac == "蝴蝶仙子" or ac == "蝴蝶仙子x" then
		acs = {
			"飞行",
			"弱点水"
		}
	elseif ac == "白熊" or ac == "白熊x" then
		acs = {
			"迟钝"
		}
	elseif ac == "龟丞相" or ac == "龟丞相x" then
		acs = {
			"水攻",
			"水属性吸收"
		}
	elseif ac == "兔子怪" or ac == "兔子怪x" then
		acs = {
			"弱点土"
		}
	elseif ac == "蜘蛛精" or ac == "蜘蛛精x" then
		acs = {
			"弱点土"
		}
	elseif ac == "黑熊精" or ac == "黑熊精x" then
		acs = {
			"弱点雷"
		}
	elseif ac == "僵尸" or ac == "僵尸x" then
		acs = {
			"鬼魂术",
			"夜战"
		}
	elseif ac == "牛头" or ac == "牛头x" then
		acs = {
			"高级鬼魂术",
			"夜战"
		}
	elseif ac == "马面" or ac == "马面x" then
		acs = {
			"高级鬼魂术",
			"夜战"
		}
	elseif ac == "小龙女" or ac == "小龙女x" then
		acs = {
			"高级水属性吸收"
		}
	elseif ac == "野鬼" or ac == "野鬼x" then
		acs = {
			"鬼魂术",
			"夜战"
		}
	elseif ac == "狼" or ac == "狼x" then
		acs = {
			"夜战",
			"连击",
			"偷袭"
		}
	elseif ac == "虾兵" or ac == "虾兵x" then
		acs = {
			"水属性吸收"
		}
	elseif ac == "蟹将" or ac == "蟹将x" then
		acs = {
			"水属性吸收"
		}
	elseif ac == "骷髅怪" or ac == "骷髅怪x" then
		acs = {
			"鬼魂术",
			"夜战"
		}
	elseif ac == "狐狸精" or ac == "狐狸精x" then
		acs = {
			"弱点雷"
		}
	elseif ac == "黑熊" or ac == "黑熊x" then
		acs = {
			"迟钝"
		}
	elseif ac == "花妖" or ac == "花妖x" then
		acs = {
			"水属性吸收"
		}
	elseif ac == "海毛虫" then
		acs = {
			"弱点火",
			"夜战"
		}
	elseif ac == "大蝙蝠" then
		acs = {
			"弱点水",
			"高级夜战",
			"飞行"
		}
	elseif ac == "狸" then
		acs = {
			"敏捷"
		}
	elseif ac == "巨蛙" then
		acs = {
			"弱点火"
		}
	elseif ac == "大海龟" then
		acs = {
			"水属性吸收",
			"防御"
		}
	elseif ac == "树怪" then
		acs = {
			"迟钝",
			"弱点火"
		}
	elseif ac == "章鱼" then
		acs = {
			"弱点火"
		}
	elseif ac == "海星" then
		acs = {
			"水属性吸收",
			"弱点火"
		}
	end

	return acs
end

取资质丸 = function()
	local ms = {
		"攻击资质",
		"防御资质",
		"体力资质",
		"法力资质",
		"速度资质",
		"成长"
	}

	return ms[ygsj(#ms)]
end

取大力神丸 = function()
	local ms = {
		"大力神丸",
	  "大力神丸"
	}

	return ms[ygsj(#ms)]
end

取属性石 = function()
	local ms = {
		"伤害",
		"灵力",
		"防御",
		"速度",
		"气血",
		"魔法",
		"魔法",
		"力量",
		"魔力",
		"耐力",
		"体质",
		"敏捷",
		"伤害",
		"灵力",
		"防御",
		"速度",
		"气血",
		"力量",
		"魔力",
		"耐力",
		"体质",
		"敏捷"
	}

	return ms[ygsj(#ms)]
end

取中秋炮 = function()
	local ms = {
		"力量",
		"魔力",
		"耐力",
		"体质",
		"敏捷",
		"气血",
		"力量",
		"魔力",
		"耐力",
		"体质",
		"敏捷"
	}

	return ms[ygsj(#ms)]
end
取特技 = function()
	return 通用特技[math.ceil(取随机数(1, #通用特技 * 100) / 100)]
end

取特效 = function()
	local ms = 通用新特效
	local ms1 = {
		"无级别限制",
		"永不磨损",
		"永不磨损",
		"愤怒",
		"超级简易",
		"无级别限制",
		"超级简易",
		"无级别限制",
		"超级简易",
		"无级别限制",
		"超级简易"
	}

	for i = 1, #ms do
		ms1[#ms1 + 1] = ms[i]
	end

	return ms1[ygsj(#ms1)]
end

取六艺技能 = function()
	return 六艺技能列表[math.ceil(取随机数(1, #六艺技能列表 * 100) / 100)]
end

取认证法术 = function()
	local ms = {
		"反震",
		"吸血",
		"反击",
		"连击",
		"飞行",
		"驱鬼",
		"法术抵抗",
		"感知",
		"再生",
		"冥思",
		"慧根",
		"必杀",
		"幸运",
		"神迹",
		"招架",
		"永恒",
		"敏捷",
		"强力",
		"防御",
		"偷袭",
		"毒",
		"驱鬼",
		"鬼魂术",
		"魔之心",
		"神佑复生",
		"精神集中",
		"否定信仰",
		"法术连击",
		"法术暴击",
		"法术波动",
		"雷属性吸收",
		"土属性吸收",
		"火属性吸收",
		"水属性吸收",
		"迟钝"
	}

	return ms[ygsj(#ms)]
end

取低级要诀 = function(数量)
	if 数量 == nil or 数量 <= 1 then
		return 低级兽决[ygsj(#低级兽决)]
	else
		local 避免 = {
			"隐身",
			"冲击",
			"恐吓",
			"恐怖",
			"神佑复生"
		}
		local ms = {}

		for i = 1, #低级兽决 do
			if 取列表中是否存在内容(避免, 低级兽决[i]) == false then
				ms[#ms + 1] = 低级兽决[i]
			end
		end

		local ms1 = {}

		for i = 1, 数量 do
			local n = ygsj(#ms)
			ms1[i] = ms[n]

			table.remove(ms, n)
		end

		return ms1
	end
end

取高级要诀 = function(数量)
	if 数量 == nil or 数量 <= 1 then
		return 高级兽决[ygsj(#高级兽决)]
	else
		local 避免 = {
			"高级隐身",
			"赶尽杀绝",
			"高级冲击",
			"高级恐吓",
			"高级恐怖",
			"高级神佑复生"
		}
		local ms = {}

		for i = 1, #高级兽决 do
			if 取列表中是否存在内容(避免, 高级兽决[i]) == false then
				ms[#ms + 1] = 高级兽决[i]
			end
		end

		local ms1 = {}

		for i = 1, 数量 do
			local n = ygsj(#ms)
			ms1[i] = ms[n]

			table.remove(ms, n)
		end

		return ms1
	end
end

取高级要诀点化 = function()
	local ms = {
		"高级反震",
		"高级夜战",
		"法术防御",
		"高级隐身",
		"高级感知",
		"高级再生",
		"高级冥思",
		"高级慧根",
		"高级必杀",
		"高级幸运",
		"高级神迹",
		"高级招架",
		"高级永恒",
		"高级敏捷",
		"高级强力",
		"高级防御",
		"高级偷袭",
		"高级毒",
		"高级驱鬼",
		"高级鬼魂术",
		"高级魔之心",
		"高级神佑复生",
		"高级精神集中",
		"高级否定信仰",
		"奔雷咒",
		"泰山压顶",
		"水漫金山",
		"地狱烈火",
		"高级法术连击",
		"高级法术暴击",
		"高级法术波动",
		"高级雷属性吸收",
		"高级土属性吸收",
		"高级火属性吸收",
		"高级水属性吸收",
		"反震",
		"吸血",
		"反击",
		"连击",
		"飞行",
		"驱怪",
		"隐身",
		"感知",
		"再生",
		"冥思",
		"慧根",
		"必杀",
		"幸运",
		"神迹",
		"招架",
		"永恒",
		"敏捷",
		"强力",
		"防御",
		"偷袭",
		"毒",
		"驱鬼",
		"鬼魂术",
		"魔之心",
		"神佑复生",
		"精神集中",
		"否定信仰",
		"雷击",
		"落岩",
		"水攻",
		"烈火",
		"法术连击",
		"法术暴击",
		"法术波动",
		"雷属性吸收",
		"土属性吸收",
		"火属性吸收",
		"水属性吸收",
		"迟钝",
		"高级吸血",
		"高级反击",
		"高级连击",
		"高级飞行",
		"八凶法阵",
		"高级夜战",
		"法术防御",
		"高级隐身",
		"高级感知",
		"高级再生",
		"高级冥思",
		"高级慧根",
		"高级必杀",
		"高级幸运",
		"高级神迹",
		"高级招架",
		"高级永恒",
		"高级敏捷",
		"高级强力",
		"高级防御",
		"高级偷袭",
		"高级毒",
		"高级驱鬼",
		"高级鬼魂术",
		"高级魔之心",
		"高级神佑复生",
		"高级精神集中",
		"高级否定信仰",
		"奔雷咒",
		"泰山压顶",
		"水漫金山",
		"地狱烈火",
		"高级法术连击",
		"高级法术暴击",
		"高级法术波动",
		"高级雷属性吸收",
		"高级土属性吸收",
		"高级火属性吸收",
		"高级水属性吸收",
		"反震",
		"吸血",
		"反击",
		"连击",
		"飞行",
		"隐身",
		"感知",
		"再生",
		"冥思",
		"慧根",
		"必杀",
		"幸运",
		"神迹",
		"招架",
		"永恒",
		"敏捷",
		"强力",
		"防御",
		"偷袭",
		"毒",
		"驱鬼",
		"鬼魂术",
		"魔之心",
		"神佑复生",
		"精神集中",
		"否定信仰",
		"雷击",
		"落岩",
		"水攻",
		"烈火",
		"法术连击",
		"法术暴击",
		"法术波动",
		"雷属性吸收",
		"土属性吸收",
		"火属性吸收",
		"水属性吸收",
		"迟钝"
	}

	return ms[ygsj(#ms)]
end

取全部高级要诀 = function()
	local ms = ygsj(10000)

	if ms <= 1 then
		return 特殊兽决[ygsj(#特殊兽决)]
	elseif ms <= 2 then
		return 神兽兽决[ygsj(#神兽兽决)]
	elseif ms <= 3 then
		return 精选有用高级兽决[ygsj(#精选有用高级兽决)]
	else
		return 高级兽决[ygsj(#高级兽决)]
	end
end

取特殊要诀10 = function()
	local ms = ygsj(1000)

	if ms <= 1 then
		return 精选有用高级兽决[ygsj(#精选有用高级兽决)]
	else
		return 高级兽决[ygsj(#高级兽决)]
	end
end

取特殊要诀 = function()
	local jg = 特殊兽决[ygsj(#特殊兽决)]

	if jg == "逍遥游" and ygsj() <= 30 then
		jg = 特殊兽决[ygsj(#特殊兽决)]
	end

	if jg == "虎虎生风" and ygsj() <= 30 then
		jg = 特殊兽决[ygsj(#特殊兽决)]
	end

	if jg == "饕餮盛宴" and ygsj() <= 50 then
		jg = 特殊兽决[ygsj(#特殊兽决)]
	end

	if jg == "奋勇当先" then
		jg = 特殊兽决[ygsj(#特殊兽决)]
	end

	return jg
end

取特殊要诀1 = function()
	return 精选有用高级兽决[ygsj(#精选有用高级兽决)]
end

神兽要诀 = function()
	return 神兽兽决[ygsj(#神兽兽决)]
end

取全部要诀 = function()
	local ms = ygsj()

	if ms <= 3 then
		return 全部兽决[ygsj(#全部兽决)]
	else
		return 低级兽决[ygsj(#低级兽决)]
	end
end

取全部要诀平等 = function()
	return 全部兽决[ygsj(#全部兽决)]
end

观照万象 = function()
	local ms = {
		"观照万象"
	}

	return ms[ygsj(#ms)]
end

钟灵石列表 = {
	"心源",
	"狂浪滔天",
	"固若金汤",
	"锐不可当",
	"通真达灵",
	"血气方刚",
	"健步如飞"
}
钟灵石列表1 = {
	锐不可当 = 1,
	通真达灵 = 1,
	固若金汤 = 1,
	狂浪滔天 = 1,
	心源 = 1,
	健步如飞 = 1,
	血气方刚 = 1
}

取钟灵石 = function()
	local ms = 钟灵石列表

	return ms[ygsj(#ms)]
end

DeepCopy = function(object)
	local lookup_table = {}

	local function _copy(object)
		if type(object) ~= "table" then
			return object
		elseif lookup_table[object] then
			return lookup_table[object]
		end

		local new_table = {}
		lookup_table[object] = new_table

		for key, value in pairs(object) do
			new_table[_copy(key)] = _copy(value)
		end

		return setmetatable(new_table, getmetatable(object))
	end

	return _copy(object)
end

列表1合并到列表2 = function(列表1, 列表2)
	local lookup_table = {}

	local function _copy(object)
		if type(object) ~= "table" then
			return object
		elseif lookup_table[object] then
			return lookup_table[object]
		end

		local new_table = DeepCopy(列表2)
		lookup_table[object] = new_table

		for key, value in pairs(object) do
			new_table[_copy(key)] = _copy(value)
		end

		return setmetatable(new_table, getmetatable(object))
	end

	return _copy(列表1)
end

活动次数详情排序列表 = {
	"天蓬娶亲",
	"白龙闹海",
	"乌鸡国",
	"车迟斗法",
	"水陆大会",
	"通天河",
	"大闹天宫",
	"黑风山",
	"齐天大圣",
	"十二祖巫1",
	"十二祖巫2",
	"十二祖巫3",
	"迷宫宝箱",
	"初出江湖",
	"师门任务",
	"宝图任务",
	"抓鬼任务",
	"自动捉鬼",
	"鬼王任务",
	"官职任务",
	"心魔宝珠",
	"皇宫飞贼",
	"皇宫飞贼贼王",
	"降妖伏魔",
	"三界悬赏令",
	"跑环",
	"游泳比赛",
	"门派闯关",
	"地煞星",
	"天罡星",
	"二十八星宿",
	"知了王",
	"天庭叛逆",
	"捣乱的水果",
	"小鬼子",
	"天降星辰",
	"突厥探子",
	"突厥精英",
	"封妖战斗",
	"妖魔鬼怪",
	"妖王",
	"世界BOSS",
	"决战九黎城",
	"血洗龙宫",
	"门派发育史",
	"终结者",
  "化圣探路者",
  "高级boss",
   "超级boss",
	"押镖",
	"镖王押镖",
	"福利BOSS",
	"散财童子",
	"福利宝箱",
	"修炼宝箱",
	"跑商",
	"青龙任务",
	"玄武任务",
	"五虎上将"
}

取活动次数详情文本 = function(id)
	local 文本 = {}

	for i = 1, #活动次数详情排序列表 do
		文本[i] = {
			活动次数详情排序列表[i]
		}

		if 文本[i][1] == "乌鸡国" or 文本[i][1] == "车迟斗法" or 文本[i][1] == "水陆大会" or 文本[i][1] == "通天河" or 文本[i][1] == "大闹天宫" or 文本[i][1] == "黑风山" or 文本[i][1] == "齐天大圣" or 文本[i][1] == "一斛珠" then
			文本[i][3] = 活动初始次数.副本
		else
			文本[i][3] = 活动初始次数[活动次数详情排序列表[i]]
		end

		local aa = 活动次数详情排序列表[i]

		if 活动次数详情排序列表[i] == "天蓬娶亲" then
			aa = "天蓬娶亲4"
		elseif 活动次数详情排序列表[i] == "白龙闹海" then
			aa = "白龙闹海3"
		end

		if 活动次数[aa] == nil then
			活动次数[aa] = {}
		end

		文本[i][2] = 文本[i][3] - (活动次数[aa][id] or 文本[i][3])
	end

	return 文本
end

副本次数 = f函数.读配置(程序目录 .. "活动次数配置.ini", "活动次数", "副本次数") + 0
活动次数配置 = {
	"天蓬娶亲",
	"白龙闹海",
	"师门任务",
	"宝图任务",
	"修炼宝箱",
	"自动捉鬼",
	"抓鬼任务",
	"鬼王任务",
	"突厥探子",
	"突厥精英",
	"地煞星",
	"天罡星",
	"知了王",
	"游泳比赛",
	"天庭叛逆",
	"封妖战斗",
	"妖魔鬼怪",
	"押镖",
	"镖王押镖",
	"门派闯关",
	"福利BOSS",
	"散财童子",
	"天降星辰",
	"皇宫飞贼",
	"皇宫飞贼贼王",
	"三界悬赏令",
	"跑环",
	"世界BOSS",
	"决战九黎城",
	"血洗龙宫",
	"门派发育史",
	"终结者",
	"化圣探路者",
	"高级boss",
	 "超级boss",
		"五虎上将",
	"初出江湖",
	"官职任务",
	"跑商",
	"青龙任务",
	"玄武任务",
	"迷宫宝箱",
	"福利宝箱",
	"妖王",
	"捣乱的水果",
	"小鬼子",
	"二十八星宿",
	"降妖伏魔",
	"心魔宝珠"
}
活动初始次数 = {
	捣乱的年兽 = 50,
	邪恶年兽 = 1,
	年兽王 = 10,
	副本 = 副本次数,
	乌鸡国1 = (副本减负.乌鸡国[1] + 副本减负.乌鸡国[2] + 副本减负.乌鸡国[3] + 3) * 副本次数,
	车迟斗法1 = (副本减负.车迟斗法[1] + 副本减负.车迟斗法[2] + 6) * 副本次数,
	水陆大会1 = (副本减负.水陆大会[1] + 副本减负.水陆大会[2] + 副本减负.水陆大会[3] + 副本减负.水陆大会[4] + 4) * 副本次数,
	水陆大会2 = (副本减负.水陆大会[5] + 2) * 副本次数,
	通天河1 = (副本减负.通天河[1] + 副本减负.通天河[2] + 8) * 副本次数,
	通天河2 = 1 * 副本次数,
	齐天大圣1 = (副本减负.齐天大圣[1] * 2 + 副本减负.齐天大圣[2]) * 副本次数,
	齐天大圣2 = 3 * 副本次数,
	齐天大圣3 = 2 * 副本次数,
	齐天大圣4 = 2 * 副本次数,
	大闹天宫1 = (副本减负.大闹天宫[1] + 副本减负.大闹天宫[2] + 副本减负.大闹天宫[3] + 副本减负.大闹天宫[4] + 副本减负.大闹天宫[5] + 副本减负.大闹天宫[6]) * 副本次数,
	大闹天宫2 = 4 * 副本次数,
	大闹天宫3 = 2 * 副本次数,
	大闹天宫4 = 2 * 副本次数,
	黑风山1 = (副本减负.黑风山[1] + 副本减负.黑风山[2] + 副本减负.黑风山[3] + 副本减负.黑风山[4] + 副本减负.黑风山[5] + 副本减负.黑风山[6]) * 副本次数,
	黑风山2 = 3 * 副本次数,
	十二祖巫 = 1 * 副本次数,
	十二祖巫1 = 1 * 副本次数,
	十二祖巫2 = 1 * 副本次数,
	十二祖巫3 = 1 * 副本次数
}
十二祖巫列表 = {
	"奢比尸",
	"翕兹",
	"天吴",
	"强良",
	"烛九阴",
	"后土",
	"帝江",
	"蓐收",
	"句芒",
	"玄冥",
	"共工",
	"祝融"
}
十二祖巫顺序 = {
	"奢比尸",
	"翕兹",
	"天吴",
	"强良",
	"烛九阴",
	"后土",
	"帝江",
	"蓐收",
	"句芒",
	"",
	"玄冥",
	"共工",
	"祝融"
}

for i = 1, #活动次数配置 do
	活动初始次数[活动次数配置[i]] = f函数.读配置(程序目录 .. "活动次数配置.ini", "活动次数", 活动次数配置[i]) + 0
end

添加活动次数 = function(id, 类型, 次数)
	if 活动次数[类型] == nil then
		活动次数[类型] = {}
	end

	if 活动次数[类型][id] == nil then
		if 类型 == "天兵飞剑" or 类型 == "日常鬼魂" or 类型 == "日常妖风" or 类型 == "日常白鹿" or 类型 == "蚩尤大战" or 类型 == "挑战刻晴" or 类型 == "幻域迷宫" or 类型 == "日常酒肉" or 类型 == "守门天兵" then
			活动次数[类型][id] = 1
		elseif 类型 == "师门任务" then
			活动次数[类型][id] = 活动初始次数[类型]
		elseif 类型 == "自动师门" then
			活动次数[类型][id] = 1
		elseif 类型 == "乌鸡国" or 类型 == "车迟斗法" or 类型 == "水陆大会" or 类型 == "通天河" or 类型 == "大闹天宫" or 类型 == "黑风山" or 类型 == "齐天大圣" then
			活动次数[类型][id] = 活动初始次数.副本
		elseif 类型 == "天蓬娶亲1" or 类型 == "天蓬娶亲2" or 类型 == "天蓬娶亲3" or 类型 == "天蓬娶亲4" then
			活动次数[类型][id] = 活动初始次数.天蓬娶亲
		elseif 类型 == "白龙闹海1" or 类型 == "白龙闹海2" or 类型 == "白龙闹海3" or 类型 == "白龙闹海4" then
			活动次数[类型][id] = 活动初始次数.白龙闹海
		elseif 活动初始次数[类型] ~= nil then
			活动次数[类型][id] = 活动初始次数[类型]
		elseif 类型 == "知了先锋" then
			活动次数[类型][id] = 50
		elseif 类型 == "木桩伤害" then
			活动次数[类型][id] = 9999
		elseif 类型 == "建邺城赏金任务" then
			活动次数[类型][id] = 100
		elseif 类型 == "宝藏山小宝箱" then
			活动次数[类型][id] = 10
		elseif 类型 == "宝藏山大宝箱" then
			活动次数[类型][id] = 5
		elseif 类型 == "活跃次数" then
			活动次数[类型][id] = 5
		elseif 类型 == "商人的鬼魂" then
			活动次数[类型][id] = 1
		elseif 类型 == "妖风战斗" then
			活动次数[类型][id] = 1
		elseif 类型 == "白鹿精" then
			活动次数[类型][id] = 1
		elseif 类型 == "酒肉和尚假" then
			活动次数[类型][id] = 1
		elseif 类型 == "执法天兵" then
			活动次数[类型][id] = 1
		elseif 类型 == "白琉璃" then
			活动次数[类型][id] = 1
		elseif 类型 == "酒肉和尚真" then
			活动次数[类型][id] = 1
		elseif 类型 == "酒肉和尚假" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战灵鹤2" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战江南小盗" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战大大龟" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战绿皮蛙" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战屈原" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战狂盗" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战马全有" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战海盗头子" then
			活动次数[类型][id] = 1
		elseif 类型 == "梦战浪鬼" then
			活动次数[类型][id] = 1
		elseif 类型 == "幽冥鬼" then
			活动次数[类型][id] = 1
		elseif 类型 == "蟹将军" then
			活动次数[类型][id] = 1
		elseif 类型 == "假刘洪" then
			活动次数[类型][id] = 1
		elseif 类型 == "真刘洪" then
			活动次数[类型][id] = 1
		elseif 类型 == "洛树妖" then
			活动次数[类型][id] = 1
		elseif 类型 == "赌徒喽啰" then
			活动次数[类型][id] = 1
		elseif 类型 == "江州县令" then
			活动次数[类型][id] = 1
		elseif 类型 == "江洋大盗" then
			活动次数[类型][id] = 1
		elseif 类型 == "洛川鬼" then
			活动次数[类型][id] = 1
		elseif 类型 == "妩媚狐仙" then
			活动次数[类型][id] = 1
		elseif 类型 == "赌霸城" then
			活动次数[类型][id] = 1
		elseif 类型 == "半阁守将" then
			活动次数[类型][id] = 1
		elseif 类型 == "流氓兔" then
			活动次数[类型][id] = 1
		elseif 类型 == "大雁塔塔主" then
			活动次数[类型][id] = 1
		elseif 类型 == "卷帘大将1" then
			活动次数[类型][id] = 1
		elseif 类型 == "卷帘大将3" then
			活动次数[类型][id] = 1
		elseif 类型 == "路人甲" then
			活动次数[类型][id] = 1
		elseif 类型 == "杨戬" then
			活动次数[类型][id] = 1
		elseif 类型 == "龙孙" then
			活动次数[类型][id] = 1
		elseif 类型 == "玄奘分身" then
			活动次数[类型][id] = 1
		elseif 类型 == "法宝材料" then
			活动次数[类型][id] = 9999
		elseif 类型 == "法宝内丹" then
			活动次数[类型][id] = 9999
		elseif 类型 == "空慈方丈" then
			活动次数[类型][id] = 1
		elseif 类型 == "王福来" then
			活动次数[类型][id] = 1
		elseif 类型 == "蓝火兽" then
			活动次数[类型][id] = 1
		elseif 类型 == "吸血蝙蝠" then
			活动次数[类型][id] = 1
		elseif 类型 == "肾宝狼" then
			活动次数[类型][id] = 1
		elseif 类型 == "每日月卡奖励" then
			活动次数[类型][id] = 1
	   elseif 类型 == "膜拜大佬" then
			活动次数[类型][id] = 1
		elseif 类型 == "月卡师门奖励" then
			活动次数[类型][id] = 1
		elseif 类型 == "月卡抓鬼奖励" then
			活动次数[类型][id] = 1
		elseif 类型 == "月卡押镖奖励" then
			活动次数[类型][id] = 1
		elseif 类型 == "月卡官职奖励" then
			活动次数[类型][id] = 1
		end
	end

	次数 = 次数 or 1

	if 次数 <= 活动次数[类型][id] then
		活动次数[类型][id] = 活动次数[类型][id] - 次数

		if 活动次数[类型][id] == 0 then
			常规提示(id, "#Y/你已经完成了今日所有#G/" .. 类型 .. "#Y/活动!")
		else
			常规提示(id, "#Y/你已经完成了" .. 次数 .. "次#G/" .. 类型 .. "#Y/活动，今日还可以挑战#R/" .. 活动次数[类型][id] .. "#Y/次！")
		end
	elseif 活动次数[类型][id] <= 0 then
		活动次数[类型][id] = 0

		常规提示(id, "#Y/你今日的#G/" .. 类型 .. "#Y/奖励次数已用完，无法再获得奖励!")

		return false
	else
		常规提示(id, "#Y/你今日的#G/" .. 类型 .. "#Y/剩余奖励次数#G/" .. 活动次数[类型][id] .. "#Y/次、不足#R" .. 次数 .. "#Y次，无法获得奖励!")

		return false
	end

	return true
end

剧情战斗列表 = {
	酒肉和尚真 = 1,
	白鹿精 = 1,
	卷帘大将1 = 1,
	路人甲 = 1,
	真刘洪 = 1,
	商人的鬼魂 = 1,
	天兵飞剑 = 1,
	执法天兵 = 1,
	假刘洪 = 1,
	幽冥鬼 = 1,
	酒肉和尚假 = 1,
	杨戬 = 1,
	龙孙 = 1,
	白琉璃 = 1,
	蟹将军 = 1
}

活动次数查询 = function(id, 类型, 单人, 次数)
	if 剧情战斗列表[类型] ~= nil then
		return true
	end

	if 活动次数[类型] == nil then
		活动次数[类型] = {}
	end

	if 单人 ~= nil then
		if 活动次数[类型][id] ~= nil and 活动次数[类型][id] < (次数 or 1) then
			if (次数 or 1) > 1 then
				常规提示(id, "#Y/你的挑战#G/[" .. 类型 .. "]#Y/活动次数不足#R" .. 次数 .. "#Y次。")
			else
				常规提示(id, "#Y/你的挑战#G/[" .. 类型 .. "]#Y/活动已经达到次数上限啦")
			end

			return false
		end
	else
		local id组 = {}

		if 玩家数据[id].队伍 == 0 then
			id组[1] = id
		else
			local 队伍id = 玩家数据[id].队伍

			for n = 1, #队伍数据[队伍id].成员数据 do
				id组[n] = 队伍数据[队伍id].成员数据[n]
			end
		end

		for n = 1, #id组 do
			if 活动次数[类型][id组[n]] ~= nil and 活动次数[类型][id组[n]] <= 0 then
				常规提示(id, "#Y/队伍中#R/" .. 玩家数据[id组[n]].角色.数据.名称 .. "#Y/的挑战#G/[" .. 类型 .. "]#Y/活动已经达到次数上限啦")

				return false
			end
		end
	end

	return true
end

活动次数查询月卡 = function(id, 类型)
	if 活动次数[类型] == nil then
		活动次数[类型] = {}
	end

	local id组 = {}

	if 玩家数据[id].队伍 == 0 then
		id组[1] = id
	else
		local 队伍id = 玩家数据[id].队伍

		for n = 1, #队伍数据[队伍id].成员数据 do
			id组[n] = 队伍数据[队伍id].成员数据[n]
		end
	end

	for n = 1, #id组 do
		if 活动次数[类型][id组[n]] ~= nil and 活动次数[类型][id组[n]] <= 0 or 玩家数据[id组[n]].角色.数据.月卡领取 ~= nil and 玩家数据[id组[n]].角色.数据.月卡领取 <= 0 then
			常规提示(id, "#Y/队伍中#R/" .. 玩家数据[id组[n]].角色.数据.名称 .. "#Y/的挑战#G/[" .. 类型 .. "]#Y/活动已经达到次数上限啦\n或者你队伍里有人#G没开通月卡#和#Y月卡次数已经用完#")

			return false
		end
	end

	return true
end

取动物套概率 = function(名称, 件数)
	local 动物套数据 = {
		强盗 = {
			50,
			100
		},
		海毛虫 = {
			50,
			100
		},
		蛤蟆精 = {
			50,
			100
		},
		老虎 = {
			50,
			100
		},
		马面 = {
			50,
			100
		},
		天将 = {
			50,
			100
		},
		地狱战神 = {
			50,
			100
		},
		巡游天神 = {
			50,
			100
		},
		鬼将 = {
			50,
			100
		},
		夜罗刹 = {
			50,
			100
		},
		噬天虎 = {
			50,
			100
		},
		狂豹人形 = {
			50,
			100
		},
		巨力神猿 = {
			50,
			100
		},
		修罗傀儡鬼 = {
			50,
			100
		},
		大海龟 = {
			50,
			100
		},
		树怪 = {
			50,
			100
		},
		山贼 = {
			50,
			100
		},
		野猪 = {
			50,
			100
		},
		黑熊 = {
			50,
			100
		},
		野鬼 = {
			50,
			100
		},
		龟丞相 = {
			50,
			100
		},
		黑熊精 = {
			50,
			100
		},
		僵尸 = {
			50,
			100
		},
		白熊 = {
			50,
			100
		},
		黑山老妖 = {
			50,
			100
		},
		大力金刚 = {
			50,
			100
		},
		踏云兽 = {
			50,
			100
		},
		机关兽 = {
			50,
			100
		},
		金身罗汉 = {
			50,
			100
		},
		藤蔓妖花 = {
			50,
			100
		},
		巨蛙 = {
			50,
			100
		},
		花妖 = {
			50,
			100
		},
		小龙女 = {
			50,
			100
		},
		蜘蛛精 = {
			50,
			100
		},
		蝴蝶仙子 = {
			50,
			100
		},
		古代瑞兽 = {
			50,
			100
		},
		蛟龙 = {
			50,
			100
		},
		雨师 = {
			50,
			100
		},
		如意仙子 = {
			50,
			100
		},
		星灵仙子 = {
			50,
			100
		},
		净瓶女娲 = {
			50,
			100
		},
		灵符女娲 = {
			50,
			100
		},
		灵鹤 = {
			50,
			100
		},
		炎魔神 = {
			50,
			100
		},
		葫芦宝贝 = {
			50,
			100
		},
		混沌兽 = {
			50,
			100
		},
		长眉灵猴 = {
			50,
			100
		},
		蜃气妖 = {
			50,
			100
		},
		护卫 = {
			50,
			100
		},
		羊头怪 = {
			50,
			100
		},
		牛妖 = {
			50,
			100
		},
		蟹将 = {
			50,
			100
		},
		牛头 = {
			50,
			100
		},
		天兵 = {
			50,
			100
		},
		芙蓉仙子 = {
			50,
			100
		},
		律法女娲 = {
			50,
			100
		},
		幽萤娃娃 = {
			50,
			100
		},
		红萼仙子 = {
			50,
			100
		},
		龙龟 = {
			50,
			100
		},
		连弩车 = {
			50,
			100
		},
		蝎子精 = {
			50,
			100
		},
		曼珠沙华 = {
			50,
			100
		},
		赌徒 = {
			50,
			100
		},
		大蝙蝠 = {
			50,
			100
		},
		骷髅怪 = {
			50,
			100
		},
		狐狸精 = {
			50,
			100
		},
		狼 = {
			50,
			100
		},
		虾兵 = {
			50,
			100
		},
		兔子怪 = {
			50,
			100
		},
		雷鸟人 = {
			50,
			100
		},
		风伯 = {
			50,
			100
		},
		凤凰 = {
			50,
			100
		},
		幽灵 = {
			50,
			100
		},
		吸血鬼 = {
			50,
			100
		},
		画魂 = {
			50,
			100
		},
		雾中仙 = {
			50,
			100
		},
		机关鸟 = {
			50,
			100
		},
		巴蛇 = {
			50,
			100
		},
		猫灵人形 = {
			50,
			100
		},
		修罗傀儡妖 = {
			50,
			100
		}
	}

	if 件数 >= 3 and 件数 < 5 then
		return 动物套数据[名称][1]
	elseif 件数 >= 5 then
		return 动物套数据[名称][2]
	end
end

取所有动物套 = {
	"强盗",
	"海毛虫",
	"蛤蟆精",
	"老虎",
	"马面",
	"天将",
	"地狱战神",
	"巡游天神",
	"鬼将",
	"夜罗刹",
	"噬天虎",
	"狂豹人形",
	"巨力神猿",
	"修罗傀儡鬼",
	"大海龟",
	"树怪",
	"山贼",
	"野猪",
	"黑熊",
	"野鬼",
	"龟丞相",
	"黑熊精",
	"僵尸",
	"白熊",
	"黑山老妖",
	"大力金刚",
	"踏云兽",
	"机关兽",
	"金身罗汉",
	"藤蔓妖花",
	"巨蛙",
	"花妖",
	"小龙女",
	"蜘蛛精",
	"蝴蝶仙子",
	"古代瑞兽",
	"蛟龙",
	"雨师",
	"如意仙子",
	"星灵仙子",
	"净瓶女娲",
	"灵符女娲",
	"灵鹤",
	"炎魔神",
	"葫芦宝贝",
	"混沌兽",
	"混沌兽",
	"长眉灵猴",
	"蜃气妖",
	"护卫",
	"羊头怪",
	"牛妖",
	"蟹将",
	"牛头",
	"天兵",
	"芙蓉仙子",
	"律法女娲",
	"幽萤娃娃",
	"红萼仙子",
	"龙龟",
	"连弩车",
	"蝎子精",
	"曼珠沙华",
	"赌徒",
	"大蝙蝠",
	"骷髅怪",
	"狐狸精",
	"狼",
	"虾兵",
	"兔子怪",
	"雷鸟人",
	"风伯",
	"凤凰",
	"幽灵",
	"吸血鬼",
	"画魂",
	"雾中仙",
	"机关鸟",
	"巴蛇",
	"猫灵人形",
	"修罗傀儡妖"
}

取动物套加成 = function(名称, 等级)
	local 动物套数据 = {
		强盗 = {
			类型 = "力量",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		海毛虫 = {
			类型 = "力量",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		蛤蟆精 = {
			类型 = "力量",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		老虎 = {
			类型 = "力量",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		马面 = {
			类型 = "力量",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		天将 = {
			类型 = "力量",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		地狱战神 = {
			类型 = "力量",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		巡游天神 = {
			类型 = "力量",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		鬼将 = {
			类型 = "力量",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		夜罗刹 = {
			类型 = "力量",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		噬天虎 = {
			类型 = "力量",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		狂豹人形 = {
			类型 = "力量",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		巨力神猿 = {
			类型 = "力量",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		修罗傀儡鬼 = {
			类型 = "力量",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		大海龟 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		树怪 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		山贼 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		野猪 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		黑熊 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		野鬼 = {
			类型 = "体质",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		龟丞相 = {
			类型 = "体质",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		黑熊精 = {
			类型 = "体质",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		僵尸 = {
			类型 = "体质",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		白熊 = {
			类型 = "体质",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		黑山老妖 = {
			类型 = "体质",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		大力金刚 = {
			类型 = "体质",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		踏云兽 = {
			类型 = "体质",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		机关兽 = {
			类型 = "体质",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		金身罗汉 = {
			类型 = "体质",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		藤蔓妖花 = {
			类型 = "体质",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		巨蛙 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		花妖 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		小龙女 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		蜘蛛精 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		蝴蝶仙子 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		古代瑞兽 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		蛟龙 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		雨师 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		如意仙子 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		星灵仙子 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		净瓶女娲 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		灵符女娲 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		灵鹤 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		炎魔神 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		葫芦宝贝 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		混沌兽 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		长眉灵猴 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		蜃气妖 = {
			类型 = "魔力",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		护卫 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		羊头怪 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		牛妖 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		蟹将 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		牛头 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		天兵 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		芙蓉仙子 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		律法女娲 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		幽萤娃娃 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		红萼仙子 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		龙龟 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		连弩车 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		蝎子精 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		曼珠沙华 = {
			类型 = "耐力",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		},
		赌徒 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		大蝙蝠 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		骷髅怪 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		狐狸精 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		狼 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		虾兵 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 6),
			件数 = {
				5,
				10
			}
		},
		兔子怪 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		雷鸟人 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		风伯 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 5),
			件数 = {
				10,
				15
			}
		},
		凤凰 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		幽灵 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		吸血鬼 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				10,
				15
			}
		},
		画魂 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		雾中仙 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		机关鸟 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		巴蛇 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		猫灵人形 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 4),
			件数 = {
				15,
				25
			}
		},
		修罗傀儡妖 = {
			类型 = "敏捷",
			属性 = math.floor(等级 / 3),
			件数 = {
				5,
				15
			}
		}
	}

	return 动物套数据[名称]
end

判断n号帮 = function(id, 编号)
	local id组 = {}

	if 玩家数据[id].队伍 == 0 then
		id组[1] = id
	else
		local 队伍id = 玩家数据[id].队伍

		for n = 1, #队伍数据[队伍id].成员数据 do
			id组[n] = 队伍数据[队伍id].成员数据[n]
		end
	end

	for n = 1, #id组 do
		if 玩家数据[id组[n]].角色.数据.帮派数据.编号 ~= 编号 then
			return false
		end
	end

	return true
end

比武资格 = function(id)
	if id == 1 then
		return false
	end
end

保留小数位数 = function(nNum, n)
	if type(nNum) ~= "number" then
		return nNum
	end

	n = n or 0
	n = math.floor(n)
	local fmt = "%." .. n .. "f"
	local nRet = tonumber(string.format(fmt, nNum))

	return nRet
end

随机排序 = function(tbl)
	local n = #tbl

	for i = 1, n do
		local j = math.random(i, n)

		if i < j then
			tbl[i], tbl[j] = tbl[j], tbl[i]
		end
	end
end

铃铛奖励生成 = function(玩家id, 名称, 数量)
	local 铃铛奖励数据 = nil
	local 识别码 = 玩家id .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列
	随机序列 = 随机序列 + 1
	铃铛奖励数据 = 物品类()

	铃铛奖励数据:置对象(名称)

	临时道具 = 取物品数据(名称)
	临时道具.总类 = 临时道具[2]
	临时道具.子类 = 临时道具[4]
	临时道具.分类 = 临时道具[3]
	铃铛奖励数据.数量 = 1

	if 名称 == "点化石" then
		if ygsj(100) <= 1 then
			铃铛奖励数据.附带技能 = "剑荡四方"
		elseif ygsj(100) <= 5 then
			铃铛奖励数据.附带技能 = 取高级要诀()
		else
			铃铛奖励数据.附带技能 = 取低级要诀()
		end
	elseif 名称 ~= "藏宝图" then
		if 名称 == "高级藏宝图" then
		elseif 名称 == "神兜兜" then
			铃铛奖励数据.数量 = 数量
		elseif 名称 == "珍珠" then
			铃铛奖励数据.级别限制 = 数量
		elseif 名称 == "清灵净瓶" then
			铃铛奖励数据.数量 = 数量
		elseif 名称 == "魔兽要诀" then
		elseif 名称 == "高级魔兽要诀" then
		elseif 名称 == "召唤兽内丹" then
		elseif 名称 == "百炼精铁" then
			铃铛奖励数据.子类 = 数量
		elseif 名称 == "金柳露" then
			铃铛奖励数据.数量 = 数量
		elseif 名称 == "超级金柳露" then
			铃铛奖励数据.数量 = 数量
		elseif 名称 == "九转金丹" then
			铃铛奖励数据.阶品 = 数量
		end
	end

	if 铃铛奖励数据.可叠加 then
		铃铛奖励数据.数量 = 数量
	end

	铃铛奖励数据.识别码 = 识别码

	return 铃铛奖励数据
end

取唯一任务 = function(类型, id)
	随机序列 = 随机序列 + 1

	if id ~= nil then
		local bm = id .. "_" .. 类型 .. "_" .. os.time() .. "_" .. 随机序列 .. "_" .. 取随机数(88, 99999999)

		if 玩家数据[id].队伍 == 0 then
			return bm, {
				id
			}
		else
			local fh = {}

			for i = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
				if 队伍数据[玩家数据[id].队伍].成员数据[i] ~= nil then
					fh[#fh + 1] = 队伍数据[玩家数据[id].队伍].成员数据[i]
				end
			end

			return bm, fh
		end
	end

	return "_" .. 类型 .. "_" .. os.time() .. "_" .. 随机序列 .. "_" .. 取随机数(88, 99999999)
end

取个人唯一任务 = function(类型, id)
	随机序列 = 随机序列 + 1

	if id ~= nil then
		local bm = id .. "_" .. 类型 .. "_" .. os.time() .. "_" .. 随机序列 .. "_" .. 取随机数(88, 99999999)

		return bm, {
			id
		}
	end

	return "_" .. 类型 .. "_" .. os.time() .. "_" .. 随机序列 .. "_" .. 取随机数(88, 99999999)
end

播放引擎动画 = function(id, 动画编号)
	发送数据(玩家数据[id].连接id, 3902, {
		编号 = 动画编号
	})
end

取随机阵法 = function()
	return 阵法名称[ygsj(#阵法名称)]
end

取单加数值 = function(等级, 强化, 定制)
	local 数值 = nil

	if 强化 == nil then
		数值 = 取随机数(等级 * 0.3 + 1, 等级 * 0.44 + 1)

		if 定制 ~= nil then
			数值 = 取随机数(等级 * 0.4 + 1, 等级 * 0.44 + 1)
		end
	else
		数值 = 取随机数(等级 * 0.4 + 1, 等级 * 0.56 + 1)

		if 定制 ~= nil then
			数值 = 取随机数(等级 * 0.5 + 1, 等级 * 0.56 + 1)
		end
	end

	return 数值
end

取双加数值 = function(等级, 强化, 定制)
	local 数值 = {}

	if 强化 == nil then
		if 取随机数() < 一加一减概率 and 定制 == nil then
			local 负 = 取随机数(-等级 * 0.25, -等级 * 0.05)
			local 正 = 取随机数(等级 * 0.33 + 1 - 负, 等级 * 0.58 + 1 - 负)

			if 取随机数() <= 50 then
				数值 = {
					负,
					正
				}
			else
				数值 = {
					正,
					负
				}
			end
		else
			for i = 1, 2 do
				数值[i] = 取随机数(math.max(等级 * 0.15 + 1, 5), math.max(等级 * 0.33 + 1, 10))

				if 定制 ~= nil then
					数值[i] = 取随机数(math.max(等级 * 0.3 + 1, 5), math.max(等级 * 0.33 + 1, 10))
				end
			end
		end
	elseif 取随机数() < 一加一减概率 and 定制 == nil then
		local 负 = 取随机数(-等级 * 0.3, -等级 * 0.1)
		local 正 = 取随机数(等级 * 0.44 + 1 - 负, 等级 * 0.74 + 1 - 负)

		if 取随机数() <= 50 then
			数值 = {
				负,
				正
			}
		else
			数值 = {
				正,
				负
			}
		end
	else
		for i = 1, 2 do
			数值[i] = 取随机数(math.max(等级 * 0.25 + 1, 5), math.max(等级 * 0.44 + 1, 10))

			if 定制 ~= nil then
				数值[i] = 取随机数(math.max(等级 * 0.4 + 1, 5), math.max(等级 * 0.44 + 1, 10))
			end
		end
	end

	return 数值
end

取门派主动法术 = function(门派)
	local 门派法术 = {
		龙宫 = {
			"龙卷雨击",
			"龙腾",
			"逆鳞",
			"二龙戏珠"
		},
		女儿村 = {
			"似玉生香",
			"莲步轻舞",
			"如花解语",
			"雨落寒沙"
		},
		化生寺 = {
			"活血",
			"推气过宫",
			"唧唧歪歪",
			"金刚护法",
			"韦陀护法",
			"金刚护体",
			"一苇渡江"
		},
		大唐官府 = {
			"横扫千军",
			"后发制人",
			"翩鸿一击",
			"长驱直入",
			"破釜沉舟",
			"先发制人"
		},
		普陀山 = {
			"苍茫树",
			"普渡众生",
			"紧箍咒",
			"巨岩破",
			"灵动九天"
		},
		阴曹地府 = {
			"阎罗令",
			"判官令",
			"尸腐毒",
			"修罗隐身",
			"幽冥鬼眼",
			"锢魂术",
			"魂飞魄散",
			"百爪狂杀"
		},
		五庄观 = {
			"日月乾坤",
			"烟雨剑法",
			"生命之泉",
			"飘渺式"
		},
		盘丝洞 = {
			"含情脉脉",
			"天罗地网",
			"勾魂",
			"摄魄",
			"盘丝阵"
		},
		魔王寨 = {
			"三昧真火",
			"飞砂走石",
			"牛劲",
			"魔王回首"
		},
		狮驼岭 = {
			"鹰击",
			"狮搏",
			"连环击",
			"变身",
			"极度疯狂",
			"象形"
		},
		天宫 = {
			"天雷斩",
			"百万神兵",
			"五雷轰顶",
			"镇妖",
			"错乱",
			"天神护体",
			"天神护法"
		},
		方寸山 = {
			"五雷咒",
			"定身符",
			"失魂符",
			"归元咒",
			"落雷符"
		},
		凌波城 = {
			"裂石",
			"碎星诀",
			"断岳势",
			"天崩地裂",
			"浪涌",
			"惊涛怒",
			"翻江搅海"
		},
		神木林 = {
			"落叶萧萧",
			"荆棘舞",
			"尘土刃",
			"冰川怒",
			"雾杀",
			"星月之惠"
		},
		无底洞 = {
			"夺魄令",
			"煞气诀",
			"夺命咒",
			"明光宝烛",
			"地涌金莲",
			"移魂化骨",
			"惊魂掌",
			"摧心术"
		}
	}

	return 门派法术[门派]
end

男角色模型 = {
	"剑侠客",
	"逍遥生",
	"偃无师",
	"巨魔王",
	"虎头怪",
	"杀破狼",
	"神天兵",
	"龙太子",
	"羽灵神"
}
女角色模型 = {
	"巫蛮儿",
	"飞燕女",
	"英女侠",
	"狐美人",
	"骨精灵",
	"鬼潇潇",
	"影精灵",
	"玄彩娥",
	"舞天姬",
	"桃夭夭"
}
男角色模型1 = {
	偃无师 = 3,
	巨魔王 = 4,
	羽灵神 = 9,
	杀破狼 = 6,
	逍遥生 = 2,
	神天兵 = 7,
	剑侠客 = 1,
	龙太子 = 8,
	虎头怪 = 5
}
女角色模型1 = {
	巫蛮儿 = 1,
	英女侠 = 3,
	飞燕女 = 2,
	舞天姬 = 8,
	桃夭夭 = 9,
	影精灵 = 10,
	鬼潇潇 = 6,
	玄彩娥 = 7,
	骨精灵 = 5,
	狐美人 = 4
}

取地煞门派 = function(角色)
	local 门派列表 = {
		人男 = {
			"大唐官府",
			"方寸山",
			"化生寺",
			"神木林"
		},
		人女 = {
			"大唐官府",
			"方寸山",
			"女儿村",
			"神木林"
		},
		魔男 = {
			"魔王寨",
			"阴曹地府",
			"无底洞",
			"狮驼岭"
		},
		魔女 = {
			"魔王寨",
			"阴曹地府",
			"无底洞",
			"盘丝岭"
		},
		仙男 = {
			"龙宫",
			"天宫",
			"凌波城",
			"五庄观"
		},
		仙女 = {
			"龙宫",
			"天宫",
			"凌波城",
			"普陀山"
		}
	}
	local 门派 = ""

	if 角色 == "剑侠客" or 角色 == "逍遥生" or 角色 == "偃无师" then
		门派 = 门派列表.人男[ygsj(4)]
	elseif 角色 == "巫蛮儿" or 角色 == "飞燕女" or 角色 == "英女侠" then
		门派 = 门派列表.人女[ygsj(4)]
	elseif 角色 == "巨魔王" or 角色 == "虎头怪" or 角色 == "杀破狼" then
		门派 = 门派列表.魔男[ygsj(4)]
	elseif 角色 == "狐美人" or 角色 == "骨精灵" or 角色 == "鬼潇潇" then
		门派 = 门派列表.魔女[ygsj(4)]
	elseif 角色 == "神天兵" or 角色 == "龙太子" or 角色 == "羽灵神" then
		门派 = 门派列表.仙男[ygsj(4)]
	elseif 角色 == "玄彩娥" or 角色 == "舞天姬" or 角色 == "桃夭夭" then
		门派 = 门派列表.仙女[ygsj(4)]
	end

	return 门派
end

取门派类型 = function(门派)
	local 封印 = {
		五庄观 = 1,
		方寸山 = 1,
		盘丝岭 = 1,
		女儿村 = 1
	}
	local 辅助 = {
		普陀山 = 1,
		神木林 = 1,
		化生寺 = 1,
		阴曹地府 = 1,
		无底洞 = 1
	}
	local 物理 = {
		大唐官府 = 1,
		五庄观 = 1,
		狮驼岭 = 1,
		凌波城 = 1,
		阴曹地府 = 1,
		天宫 = 1
	}
	local 法术 = {
		魔王寨 = 1,
		女儿村 = 1,
		龙宫 = 1,
		神木林 = 1,
		天宫 = 1
	}
	local 类型 = {}

	if 封印[门派] ~= nil then
		类型[#类型 + 1] = "封印"
	end

	if 辅助[门派] ~= nil then
		类型[#类型 + 1] = "辅助"
	end

	if 物理[门派] ~= nil then
		类型[#类型 + 1] = "物理"
	end

	if 法术[门派] ~= nil then
		类型[#类型 + 1] = "法术"
	end

	return 类型[ygsj(#类型)]
end

输出门派列表 = {
	"大唐官府",
	"狮驼岭",
	"天宫",
	"五庄观",
	"凌波城",
	"阴曹地府",
	"神木林",
	"龙宫",
	"魔王寨",
	"天宫",
	"女儿村"
}

取随机输出门派 = function()
	return 输出门派列表[ygsj(#输出门派列表)]
end

取护符等级 = function(名称)
	for i = 1, #重置丹列表 do
		if 名称 == 重置丹列表[i] then
			return i
		end
	end

	for i = 1, #通灵装备 do
		if 名称 == 通灵装备[i] then
			return i
		end
	end

	return nil
end

取护符技能 = function(名称, 技能个数)
	local 数量 = 1

	if ygsj(1000) <= 通灵装备双技能概率 then
		数量 = 2
	end

	if 技能个数 ~= nil then
		数量 = qz(技能个数 or 数量)
	end

	local 技能列表 = {}
	local 高级 = {}
	local 高级1 = {
		"须弥真言",
		"灵能激发",
		"风起龙游",
		"灵山禅语",
		"浮云神马",
		"神出鬼没",
		"昼伏夜出",
		"千钧一怒",
		"灵山禅语",
		"诸天正法",
		"津津有味",
		"烈焰斩",
		"影袭",
		"理直气壮",
		"战斗号角",
		"生命守护",
		"上善若水",
		"驱怪",
		"龙魂",
		"溜之大吉"
	}
	local 低级 = {
		"奔雷咒",
		"泰山压顶",
		"水漫金山",
		"地狱烈火",
		"剑气四射",
		"奔雷咒"
	}
	local wz = nil

	for i = 1, #高级兽决 do
		高级[#高级 + 1] = 高级兽决[i]
	end

	for i = 1, #低级兽决 do
		低级[#低级 + 1] = 低级兽决[i]
	end

	for i = 1, 数量 do
		if i == 1 and 名称 ~= "通灵神臂" then
			wz = ygsj(#高级)
			技能列表[#技能列表 + 1] = 高级[wz]
		elseif i == 1 and 名称 == "通灵神臂" then
			wz = ygsj(#低级兽决)
			技能列表[#技能列表 + 1] = 低级兽决[wz]
		elseif 名称 == "通灵神戒" then
			local pd = 1
			技能列表[#技能列表 + 1] = ""

			while 技能列表[#技能列表] == 技能列表[1] or pd == 1 do
				if ygsj(1000) <= 通灵装备特殊技能概率 and #高级1 > 0 then
					wz = ygsj(#高级1)
					技能列表[#技能列表] = 高级1[wz]

					table.remove(高级1, wz)
				else
					wz = ygsj(#高级)
					技能列表[#技能列表] = 高级[wz]

					table.remove(高级, wz)
				end

				pd = 0
			end
		elseif 名称 == "通灵神符" or 名称 == "通灵神臂" then
			local pd = 1
			技能列表[#技能列表 + 1] = ""

			while 技能列表[#技能列表] == 技能列表[1] or pd == 1 do
				wz = ygsj(#低级)
				技能列表[#技能列表] = 低级[wz]

				table.remove(低级, wz)

				pd = 0
			end
		end
	end

	return 技能列表
end

小法技能 = {
	"雷击",
	"落岩",
	"水攻",
	"烈火"
}
群法技能 = {
	"奔雷咒",
	"泰山压顶",
	"水漫金山",
	"地狱烈火",
	"剑气四射"
}
低级兽决 = {
	"反震",
	"合纵",
	"夜战",
	"吸血",
	"反击",
	"连击",
	"飞行",
	"隐身",
	"感知",
	"再生",
	"冥思",
	"慧根",
	"必杀",
	"法术抵抗",
	"遗志",
	"幸运",
	"神迹",
	"招架",
	"永恒",
	"敏捷",
	"强力",
	"防御",
	"偷袭",
	"毒",
	"驱鬼",
	"鬼魂术",
	"魔之心",
	"神佑复生",
	"精神集中",
	"否定信仰",
	"雷击",
	"落岩",
	"水攻",
	"烈火",
	"法术连击",
	"法术暴击",
	"进击必杀",
	"进击法爆",
	"法术波动",
	"雷属性吸收",
	"土属性吸收",
	"火属性吸收",
	"水属性吸收",
	"迟钝",
	"盾气"
}
高级兽决 = {
	"高级反击",
	"高级反震",
	"高级吸血",
	"高级连击",
	"高级飞行",
	"高级夜战",
	"高级隐身",
	"高级感知",
	"高级再生",
	"高级冥思",
	"高级慧根",
	"高级必杀",
	"高级幸运",
	"高级神迹",
	"高级招架",
	"高级永恒",
	"高级敏捷",
	"高级强力",
	"高级防御",
	"高级偷袭",
	"高级毒",
	"高级驱鬼",
	"高级鬼魂术",
	"高级魔之心",
	"高级神佑复生",
	"高级精神集中",
	"高级否定信仰",
	"奔雷咒",
	"泰山压顶",
	"水漫金山",
	"地狱烈火",
	"移花接木",
	"剑荡四方",
	"高级雷属性吸收",
	"高级土属性吸收",
	"高级火属性吸收",
	"高级水属性吸收",
	"高级法术连击",
	"高级法术暴击",
	"高级法术波动",
	"高级法术抵抗",
	"高级盾气",
	"高级进击必杀",
	"高级进击法爆",
	"高级合纵",
	"高级遗志",
	"茁壮"
}
特殊兽决 = {
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"诸天正法",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"灵山禅语",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"焰火烁星",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"八凶法阵",
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"诸天正法",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"狂莽一击",
	"圣婴大王",
	"灵山禅语",
	"津津有味",
	"水击三千",
	"招财进宝",
	"好梦连连",
	"天狐之舞",
	"花好月圆",
	"泡泡相伴",
	"虎虎生风",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"八凶法阵",
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"诸天正法",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"刀光剑影",
	"毁灭之光",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"灵山禅语",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"八凶法阵",
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"诸天正法",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"狂莽一击",
	"圣婴大王",
	"灵山禅语",
	"津津有味",
	"水击三千",
	"招财进宝",
	"好梦连连",
	"天狐之舞",
	"花好月圆",
	"泡泡相伴",
	"虎虎生风",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"八凶法阵",
	"剑荡四方",
	"扶摇万里",
	"叱咤风云"
}
全部高级兽决 = {}

for i = 1, #低级兽决 do
	全部高级兽决[#全部高级兽决 + 1] = 低级兽决[i]
end

for i = 1, #高级兽决 do
	全部高级兽决[#全部高级兽决 + 1] = 高级兽决[i]
end

for i = 1, #特殊兽决 do
	全部高级兽决[#全部高级兽决 + 1] = 特殊兽决[i]
end

精选有用高级兽决 = {
	"高级反击",
	"高级吸血",
	"高级连击",
	"高级飞行",
	"高级夜战",
	"高级隐身",
	"高级感知",
	"高级必杀",
	"高级幸运",
	"高级神迹",
	"高级招架",
	"高级敏捷",
	"高级强力",
	"高级防御",
	"高级偷袭",
	"高级毒",
	"高级驱鬼",
	"高级魔之心",
	"高级神佑复生",
	"高级精神集中",
	"高级否定信仰",
	"奔雷咒",
	"泰山压顶",
	"水漫金山",
	"地狱烈火",
	"移花接木",
	"剑荡四方",
	"高级法术连击",
	"高级法术暴击",
	"高级法术波动",
	"高级法术抵抗",
	"高级盾气",
	"高级进击必杀",
	"高级进击法爆",
	"高级合纵",
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"灵山禅语",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"奋勇当先回合数",
	"八凶法阵",
	"叱咤风云"
}
神兽兽决 = {
	"高级吸血",
	"高级连击",
	"高级夜战",
	"高级隐身",
	"高级魔之心",
	"高级神佑复生",
	"移花接木",
	"剑荡四方",
	"高级法术连击",
	"高级法术暴击",
	"高级法术波动",
	"高级法术抵抗",
	"高级盾气",
	"高级进击必杀",
	"高级进击法爆",
	"高级合纵",
	"惊心一剑",
	"死亡召唤",
	"善恶有报",
	"上古灵符",
	"力劈华山",
	"夜舞倾城",
	"壁垒击破",
	"嗜血追击",
	"灵能激发",
	"须弥真言",
	"净台妙谛",
	"凝光炼彩",
	"驱怪",
	"龙魂",
	"法术防御",
	"苍鸾怒击",
	"从天而降",
	"大快朵颐",
	"浮云神马",
	"灵山禅语",
	"千钧一怒",
	"天降灵葫",
	"月光",
	"理直气壮",
	"食指大动",
	"流沙轻音",
	"昼伏夜出",
	"神出鬼没",
	"风起龙游",
	"出其不意",
	"八凶法阵",
	"叱咤风云"
}
全部兽决 = {}

for i = 1, #低级兽决 do
	全部兽决[#全部兽决 + 1] = 低级兽决[i]
end

for i = 1, #全部高级兽决 do
	全部兽决[#全部兽决 + 1] = 全部高级兽决[i]
end

新加技能 = {
	"舍身一搏",
	"溜之大吉",
	"双星闪",
	"荒古破击",
	"生命守护",
	"薪火相传",
	"烈焰斩",
	"影袭",
	"战斗号角",
	"逍遥游",
	"上善若水",
	"饕餮盛宴",
	"雨润丰泽",
	"翻江倒海",
	"超级神柚复生",
	"凭风借力",
	"拘魂索命",
	"气贯长虹",
	"乘胜追击",
	"顾盼生姿",
	"义薄云天",
	"与生俱来",
	"柳暗花明"
}
新加技能1 = {
	"高级魔法反击",
	"高级保命",
	"高级冲击",
	"高级恐怖",
	"高级恐吓",
	"高级勇敢",
	"高级报复",
	"高级神武盾气",
	"高级气势",
	"高级震摄",
	"高级逆击",
	"高级冰霜",
	"高级审判",
	"高级健壮",
	"高级蛮劲",
	"高级助攻",
	"高级法术助攻",
	"高级物理穿透",
	"高级法术穿透",
	"赶尽杀绝",
	"剑气四射",
	"刀背打"
}
新加技能2 = {
	"魔法反击",
	"冲击",
	"恐怖",
	"恐吓",
	"冰霜",
	"审判",
	"勇敢",
	"保命",
	"报复",
	"神武盾气",
	"气势",
	"震摄",
	"逆击",
	"健壮",
	"蛮劲",
	"助攻",
	"法术助攻",
	"物理穿透",
	"法术穿透"
}
GM工具生效技能 = {}
新加增益状态 = {
	气势 = 1,
	震摄 = 1,
	奋勇当先 = 1,
	神武盾气 = 1,
	战斗号角 = 1
}
新加单体增益技能 = {
	雨润丰泽 = 1
}
新加群体增益技能 = {}
新加普攻被动单法技能 = {
	烈焰斩 = 1,
	影袭 = 1
}
新加单法技能 = {}
新加群法技能 = {
	["饕餮盛宴·觉醒"] = 2,
	饕餮盛宴 = 2,
	翻江倒海 = 1
}
物攻群法技能列表 = {
	剑气四射 = 1,
	["剑气四射·觉醒"] = 1,
	六道无量 = 1
}
新加物攻技能 = {
	枫影二刃 = 1,
	魔神之刃 = 1,
	刀背打 = 1,
	铁血生风 = 1,
	舍身一搏 = 1,
	三荒尽灭 = 1,
	水击三千 = 1,
	荒古破击 = 1,
	力辟苍穹 = 1,
	一斧开天 = 1,
	双星闪 = 1
}
九黎城攻击技能 = {
	枫影二刃 = 1,
	三荒尽灭 = 1,
	力辟苍穹 = 1,
	铁血生风 = 1,
	一斧开天 = 1,
	魔神之刃 = 1
}
九黎城三次概率 = 15
九黎城双斧减属性 = 0.7
觉醒技能列表 = {
	剑气四射 = 1,
	饕餮盛宴 = 2
}
法术吸血技能 = {
	["剑气四射·觉醒"] = 1,
	["饕餮盛宴·觉醒"] = 2,
	饕餮盛宴 = 2
}
法术吸血技能比例 = {
	0.15,
	0.25
}
单机生效特殊技能 = {
	"观照万象",
	"扶摇万里",
	"泡泡相伴",
	"虎虎生风",
	"水击三千",
	"奋勇当先",
	"桀骜自恃",
	"圣婴大王",
	"神来气旺",
	"焚天陨火",
	"好梦连连",
	"超级三昧真火",
	"迅风出击",
	"无畏布施",
	"津津有味",
	"超级神柚复生",
	"花好月圆",
	"欣欣向荣",
	"雨露之泽",
	"映雪棱镜",
	"清风之华",
	"风沙之盾",
	"狂莽一击",
	"焰火烁星",
	"招财进宝"
}
单机生效高级技能 = {
	"高级强壮",
	"独行",
	"力大无穷(金)",
	"力大无穷(木)",
	"力大无穷(水)",
	"力大无穷(火)",
	"力大无穷(土)",
	"万物之灵(金)",
	"万物之灵(木)",
	"万物之灵(水)",
	"万物之灵(火)",
	"万物之灵(土)"
}
单机生效低级技能 = {
	"真灵(金)",
	"真灵(木)",
	"真灵(水)",
	"真灵(火)",
	"真灵(土)",
	"健壮(金)",
	"健壮(木)",
	"健壮(水)",
	"健壮(火)",
	"健壮(土)"
}

for i = 1, #新加技能 do
	特殊兽决[#特殊兽决 + 1] = 新加技能[i]
	神兽兽决[#神兽兽决 + 1] = 新加技能[i]
	全部高级兽决[#全部高级兽决 + 1] = 新加技能[i]
	全部兽决[#全部兽决 + 1] = 新加技能[i]
	精选有用高级兽决[#精选有用高级兽决 + 1] = 新加技能[i]
end

for i = 1, #新加技能1 do
	高级兽决[#高级兽决 + 1] = 新加技能1[i]
	精选有用高级兽决[#精选有用高级兽决 + i] = 新加技能1[i]
	神兽兽决[#神兽兽决 + 1] = 新加技能1[i]
	全部高级兽决[#全部高级兽决 + 1] = 新加技能1[i]
	全部兽决[#全部兽决 + 1] = 新加技能1[i]
end

for i = 1, #新加技能2 do
	低级兽决[#低级兽决 + 1] = 新加技能2[i]
	全部兽决[#全部兽决 + 1] = 新加技能2[i]
end

if 单机设置 then
	for i = 1, #单机生效特殊技能 do
		特殊兽决[#特殊兽决 + 1] = 单机生效特殊技能[i]
		神兽兽决[#神兽兽决 + 1] = 单机生效特殊技能[i]
		全部高级兽决[#全部高级兽决 + 1] = 单机生效特殊技能[i]
		全部兽决[#全部兽决 + 1] = 单机生效特殊技能[i]
		精选有用高级兽决[#精选有用高级兽决 + 1] = 单机生效特殊技能[i]
	end

	for i = 1, #单机生效高级技能 do
		高级兽决[#高级兽决 + 1] = 单机生效高级技能[i]
		神兽兽决[#神兽兽决 + 1] = 单机生效高级技能[i]
		全部高级兽决[#全部高级兽决 + 1] = 单机生效高级技能[i]
		全部兽决[#全部兽决 + 1] = 单机生效高级技能[i]
		精选有用高级兽决[#精选有用高级兽决 + 1] = 单机生效高级技能[i]
	end

	for i = 1, #单机生效低级技能 do
		低级兽决[#低级兽决 + 1] = 单机生效低级技能[i]
		全部兽决[#全部兽决 + 1] = 单机生效低级技能[i]
	end
end

特殊兽决1 = {}

for i = 1, #特殊兽决 do
	特殊兽决1[特殊兽决[i]] = 1
end

全部兽决1 = 列表模式转换(全部兽决)
坐骑低级技能 = 列表2加入到列表1({}, 低级兽决)
坐骑低级技能1 = 列表模式转换(坐骑低级技能)
坐骑特殊技能 = 列表2加入到列表1({
	"剑气四射",
	"刀背打"
}, 特殊兽决)
坐骑特殊技能1 = 列表模式转换(坐骑特殊技能)
交易中心标签 = {
	{
		" 50级装备 ",
		" 60级装备 ",
		" 70级装备 ",
		" 80级装备 ",
		" 90级装备 ",
		"100级*装备"
	},
	{
		"110级*装备",
		"120级*装备",
		"130级*装备",
		"140级*装备",
		"150级*装备",
		"160级*装备"
	},
	{
		" 低级魔诀 ",
		" 高级魔诀 ",
		" 特殊魔诀 ",
		" 道具物品 ",
		" 低级灵饰 ",
		" 高级灵饰 "
	},
	{
		" 0～35级  ",
		" 45～75级 ",
		"85～115级 ",
		"125～155级",
		"155级以上 ",
		" 新加宠物 "
	},
	{
		"道具相关*1",
		"道具相关*2",
		"道具相关*3",
		"道具相关*4",
		"道具相关*5",
		"道具相关*6"
	}
}

初始化交易中心 = function()
	local 低级装备 = {}

	for i = 1, 6 do
		local aa = 交易中心配置1[交易中心配置[i]]

		if aa == 1 or aa == "1" then
			table.insert(低级装备, {
				类型 = 交易中心标签[1][i],
				内容 = 取制造指南书组(40 + i * 10)
			})
		end
	end

	table.insert(交易中心, 低级装备)

	local 高级装备 = {}

	for i = 7, 12 do
		local aa = 交易中心配置1[交易中心配置[i]]

		if aa == 1 or aa == "1" then
			table.insert(高级装备, {
				类型 = 交易中心标签[2][i - 6],
				内容 = 取制造指南书组(40 + i * 10)
			})
		end
	end

	table.insert(交易中心, 高级装备)

	local 宠物相关 = {}
	local bb = {
		取低级魔兽要诀组,
		取高级魔兽要诀组,
		取特殊魔兽要诀组,
		取交易中心道具组,
		取低级灵饰书组,
		取高级灵饰书组
	}

	for i = 13, 18 do
		local aa = 交易中心配置1[交易中心配置[i]]

		if aa == 1 or aa == "1" then
			table.insert(宠物相关, {
				类型 = 交易中心标签[3][i - 12],
				内容 = bb[i - 12]()
			})
		end
	end

	table.insert(交易中心, 宠物相关)

	local 野怪相关 = {}
	local bb = {
		{
			0,
			35
		},
		{
			45,
			75
		},
		{
			85,
			115
		},
		{
			125,
			155
		},
		{
			156,
			175
		},
		{
			190,
			190,
			true
		}
	}

	for i = 19, 24 do
		local aa = 交易中心配置1[交易中心配置[i]]

		if aa == 1 or aa == "1" then
			table.insert(野怪相关, {
				类型 = 交易中心标签[4][i - 18],
				内容 = 取交易中心野怪组(bb[i - 18][1], bb[i - 18][2], bb[i - 18][3])
			})
		end
	end

	table.insert(交易中心, 野怪相关)

	local 道具相关 = {}

	table.insert(交易中心, 道具相关)
	写出文件("tysj/交易中心.txt", table.tostring(交易中心))
	__S服务:输出("初始化交易中心成功")
end

更新交易中心涨跌幅 = function()
	for i = 1, #交易中心 do
		for n = 1, #交易中心[i] do
			for k = 1, #交易中心[i][n].内容 do
				交易中心[i][n].内容[k].日涨跌幅 = 0
			end
		end
	end

	写出文件("tysj/交易中心.txt", table.tostring(交易中心))
	__S服务:输出("交易中心日涨跌幅更新成功")
end

加入列表元素 = function(总列表, 加入列表)
	for i = 1, #加入列表 do
		总列表[#总列表 + 1] = 加入列表[i]
	end

	return 总列表
end

取低级灵饰书组 = function()
	local 灵饰数组 = {}
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(60))
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(80))

	return 灵饰数组
end

取高级灵饰书组 = function()
	local 灵饰数组 = {}
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(100))
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(120))
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(140))
	灵饰数组 = 加入列表元素(灵饰数组, 取灵饰书组(160))

	return 灵饰数组
end

取灵饰书组 = function(等级)
	local 制造指南书数组 = {}
	local 初始价格 = 100000

	if 等级 <= 80 then
		初始价格 = 等级 * 25000
	elseif 等级 <= 100 then
		初始价格 = 等级 * 50000
	elseif 等级 <= 120 then
		初始价格 = 等级 * 100000
	elseif 等级 <= 140 then
		初始价格 = 等级 * 200000
	elseif 等级 <= 160 then
		初始价格 = 等级 * 400000
	end

	local 铁数据 = {
		日涨跌幅 = 0,
		参数一类型 = "子类",
		名称 = "元灵晶石",
		参数一 = 等级,
		价格 = math.floor(初始价格 / 2)
	}
	铁数据.最低价格 = qz(铁数据.价格 / 10)

	table.insert(制造指南书数组, 铁数据)

	local 灵饰特效1 = {
		"耳饰",
		"佩饰",
		"戒指",
		"手镯"
	}

	for i = 1, 4 do
		local 临时指南 = {
			参数一类型 = "子类",
			名称 = "灵饰指南书",
			参数二类型 = "特效",
			日涨跌幅 = 0,
			参数一 = 等级,
			参数二 = 灵饰特效1[i],
			价格 = 初始价格
		}
		临时指南.最低价格 = qz(临时指南.价格 / 10)

		table.insert(制造指南书数组, 临时指南)
	end

	return 制造指南书数组
end

取制造指南书组 = function(等级)
	local 制造指南书数组 = {}
	local 初始价格 = 100000

	if 等级 <= 50 then
		初始价格 = 等级 * 8000
	elseif 等级 <= 80 then
		初始价格 = 等级 * 12000
	elseif 等级 <= 100 then
		初始价格 = 等级 * 25000
	elseif 等级 <= 120 then
		初始价格 = 等级 * 50000
	elseif 等级 <= 170 then
		初始价格 = 等级 * 100000
	end

	local 铁数据 = {
		日涨跌幅 = 0,
		参数一类型 = "子类",
		名称 = "百炼精铁",
		参数一 = 等级,
		价格 = math.floor(初始价格 / 2)
	}
	铁数据.最低价格 = qz(铁数据.价格 / 10)

	table.insert(制造指南书数组, 铁数据)

	for i = 1, 25 do
		local 临时指南 = {
			参数一类型 = "子类",
			名称 = "制造指南书",
			参数二类型 = "特效",
			日涨跌幅 = 0,
			参数一 = 等级,
			参数二 = i,
			价格 = 初始价格
		}
		临时指南.最低价格 = qz(临时指南.价格 / 10)

		table.insert(制造指南书数组, 临时指南)
	end

	return 制造指南书数组
end

交易中心道具 = {
	--[[{
		名称 = "龙鳞",
		价格 = 500000
	},
	{
		名称 = "金刚石",
		价格 = 500000
	},
	{
		名称 = "定魂珠",
		价格 = 500000
	},
	{
		名称 = "避水珠",
		价格 = 500000
	},
	{
		名称 = "夜光珠",
		价格 = 500000
	},--]]
	{
		名称 = "符石卷轴",
		价格 = 200000
	},
	{
		名称 = "七彩石",
		参数一 = 1,
		价格 = 10000000
	},
	{
		名称 = "五行石",
		参数一 = 1,
		价格 = 10000000
	},
	{
		名称 = "坐骑内丹",
		价格 = 1000000
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "红玛瑙"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "太阳石"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "舍利子"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "黑宝石"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "月亮石"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "光芒石"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "神秘石"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 100000,
		名称 = "昆仑玉"
	},
	{
		参数一 = 1,
		参数一类型 = "级别限制",
		价格 = 50000,
		名称 = "星辉石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "红玛瑙"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "太阳石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "舍利子"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "黑宝石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "月亮石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "光芒石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "神秘石"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 1600000,
		名称 = "昆仑玉"
	},
	{
		参数一 = 5,
		参数一类型 = "级别限制",
		价格 = 4050000,
		名称 = "星辉石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "红玛瑙"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "太阳石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "舍利子"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "黑宝石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "月亮石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "光芒石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "神秘石"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 51200000,
		名称 = "昆仑玉"
	},
	{
		参数一 = 10,
		参数一类型 = "级别限制",
		价格 = 984150000,
		名称 = "星辉石"
	}
}
宠物道具 = {}

取交易中心道具组 = function()
	local 道具组 = {}

	for i = 1, #交易中心道具 do
		local 临时兽决 = {
			日涨跌幅 = 0,
			名称 = 交易中心道具[i].名称,
			价格 = 交易中心道具[i].价格,
			参数一类型 = 交易中心道具[i].参数一类型,
			参数一 = 交易中心道具[i].参数一,
			参数二类型 = 交易中心道具[i].参数二类型,
			参数二 = 交易中心道具[i].参数二
		}
		临时兽决.最低价格 = qz(临时兽决.价格 / 10)

		table.insert(道具组, 临时兽决)
	end

	return 道具组
end

取交易中心野怪组 = function(等级1, 等级2, 特殊)
	local 野怪组 = {}
	local 类型 = 取等级怪1(等级1, 等级2)
	local 野怪名称, 临时兽决 = nil

	for i = 1, #类型 do
		野怪名称 = 取敌人信息(类型[i])
		类型[i] = 野怪名称[2]
		local 等级 = 野怪名称[3]
		临时兽决 = {
			参数一 = "野怪",
			参数一类型 = "召唤兽",
			日涨跌幅 = 0,
			名称 = 类型[i],
			价格 = 取交易中心野怪价格(等级, 特殊)
		}
		临时兽决.最低价格 = qz(临时兽决.价格 / 10)

		table.insert(野怪组, 临时兽决)
	end

	table.sort(野怪组, function (a, b)
		return a.价格 + 0 < b.价格 + 0
	end)

	return 野怪组
end

取交易中心野怪价格 = function(等级, 特殊)
	local x = 1

	if 特殊 ~= nil then
		x = 10 + qz1(等级 / 10 * 1.5)
	end

	if 等级 < 5 then
		return 5000 * x
	elseif 等级 >= 5 and 等级 < 15 then
		return 8000 * x
	elseif 等级 >= 15 and 等级 <= 25 then
		return (10000 + 等级 * 100) * x
	elseif 等级 > 25 and 等级 <= 45 then
		return (15000 + 等级 * 100) * x
	elseif 等级 > 45 and 等级 <= 75 then
		return (20000 + 等级 * 150) * x
	elseif 等级 > 75 and 等级 <= 105 then
		return (30000 + 等级 * 200) * x
	elseif 等级 > 105 and 等级 <= 135 then
		return (50000 + 等级 * 400) * x
	elseif 等级 > 135 and 等级 <= 155 then
		return (80000 + 等级 * 800) * x
	elseif 等级 > 155 then
		return (150000 + 等级 * 1500) * x
	end

	return 100000 * x
end

取低级魔兽要诀组 = function()
	local 兽决价格 = {
		慧根 = 300000,
		合纵 = 1000000,
		永恒 = 1000000,
		恐吓 = 800000,
		水属性吸收 = 200000,
		反震 = 300000,
		恐怖 = 800000,
		进击法爆 = 1500000,
		强力 = 800000,
		偷袭 = 1000000,
		气势 = 800000,
		勇敢 = 500000,
		审判 = 800000,
		魔之心 = 1000000,
		精神集中 = 300000,
		法术抵抗 = 800000,
		保命 = 800000,
		健壮 = 1000000,
		震摄 = 800000,
		敏捷 = 500000,
		隐身 = 300000,
		物理穿透 = 1000000,
		感知 = 300000,
		吸血 = 1500000,
		法术连击 = 1500000,
		报复 = 800000,
		法术穿透 = 1000000,
		防御 = 300000,
		飞行 = 300000,
		盾气 = 300000,
		必杀 = 2000000,
		进击必杀 = 1500000,
		否定信仰 = 300000,
		法术暴击 = 2000000,
		毒 = 800000,
		魔法反击 = 800000,
		法术波动 = 800000,
		神迹 = 300000,
		蛮劲 = 1000000,
		冥思 = 300000,
		神佑复生 = 1000000,
		再生 = 300000,
		迟钝 = 300000,
		助攻 = 1500000,
		幸运 = 800000,
		冰霜 = 500000,
		招架 = 800000,
		法术助攻 = 1500000,
		连击 = 1000000,
		逆击 = 800000,
		雷属性吸收 = 200000,
		反击 = 800000,
		神武盾气 = 800000,
		土属性吸收 = 200000,
		驱鬼 = 500000,
		鬼魂术 = 200000,
		火属性吸收 = 200000,
		夜战 = 1000000,
		冲击 = 800000
	}
	local bl = 2

	if 掉率模式 == 1 then
		bl = 2
	end

	local 低级兽决数组 = {}

	for i = 1, #低级兽决 do
		local 临时兽决 = {
			日涨跌幅 = 0,
			参数一类型 = "附带技能",
			名称 = "魔兽要诀",
			参数一 = 低级兽决[i],
			价格 = (兽决价格[低级兽决[i]] or 500000) / bl
		}
		临时兽决.最低价格 = qz(临时兽决.价格 / 10)

		table.insert(低级兽决数组, 临时兽决)
	end

	table.sort(低级兽决数组, function (a, b)
		return b.价格 < a.价格
	end)

	return 低级兽决数组
end

取特殊魔兽要诀组 = function()
	local 特殊兽决数组 = {}
	local 特殊兽决2 = {
		双星闪 = 1,
		生命守护 = 1,
		薪火相传 = 1,
		翻江倒海 = 1,
		舍身一搏 = 1,
		风起龙游 = 1,
		上善若水 = 1,
		大快朵颐 = 1,
		出其不意 = 1,
		影袭 = 1,
		荒古破击 = 1,
		雨润丰泽 = 1,
		烈焰斩 = 1,
		饕餮盛宴 = 1,
		战斗号角 = 1
	}

	for i = 1, #特殊兽决 do
		local 初始价格 = 200000000

		if 特殊兽决[i] == "惊心一剑" or 特殊兽决[i] == "死亡召唤" or 特殊兽决[i] == "善恶有报" or 特殊兽决[i] == "上古灵符" or 特殊兽决[i] == "力劈华山" or 特殊兽决[i] == "夜舞倾城" or 特殊兽决[i] == "壁垒击破" or 特殊兽决[i] == "千钧一怒" or 特殊兽决[i] == "天降灵葫" or 特殊兽决[i] == "月光" or 特殊兽决[i] == "理直气壮" or 特殊兽决[i] == "食指大动" or 特殊兽决[i] == "扶摇万里" or 特殊兽决[i] == "神出鬼没" then
			初始价格 = 300000000
		elseif 特殊兽决2[特殊兽决[i]] ~= nil then
			初始价格 = 500000000
		elseif 特殊兽决[i] == "奋勇当先" or 特殊兽决[i] == "横扫千军" or 特殊兽决[i] == "龙卷雨击" or 特殊兽决[i] == "观照万象" then
			初始价格 = 10000000000.0
		end

		local 临时兽决 = {
			日涨跌幅 = 0,
			参数一类型 = "附带技能",
			名称 = "特殊魔兽要诀",
			参数一 = 特殊兽决[i],
			价格 = 初始价格
		}
		临时兽决.最低价格 = qz(临时兽决.价格 / 10)

		table.insert(特殊兽决数组, 临时兽决)
	end

	return 特殊兽决数组
end

取高级魔兽要诀组 = function()
	local 兽决价格 = {
		高级反震 = 5000000,
		高级冥思 = 5000000,
		高级冲击 = 15000000,
		高级迟钝 = 10000000,
		高级强力 = 15000000,
		高级魔之心 = 25000000,
		高级永恒 = 20000000,
		高级火属性吸收 = 3000000,
		高级水属性吸收 = 3000000,
		高级法术助攻 = 30000000,
		高级合纵 = 30000000,
		高级隐身 = 15000000,
		高级再生 = 5000000,
		高级偷袭 = 30000000,
		高级进击法爆 = 30000000,
		高级法术抵抗 = 20000000,
		高级蛮劲 = 25000000,
		高级土属性吸收 = 3000000,
		地狱烈火 = 20000000,
		高级鬼魂术 = 5000000,
		高级否定信仰 = 5000000,
		高级必杀 = 30000000,
		高级进击必杀 = 30000000,
		高级恐吓 = 15000000,
		高级精神集中 = 5000000,
		高级感知 = 15000000,
		高级慧根 = 5000000,
		高级报复 = 15000000,
		高级神佑复生 = 30000000,
		高级法术连击 = 30000000,
		高级毒 = 10000000,
		高级盾气 = 15000000,
		高级魔法反击 = 10000000,
		高级防御 = 15000000,
		剑气四射 = 30000000,
		高级保命 = 15000000,
		高级神迹 = 10000000,
		高级法术波动 = 20000000,
		高级连击 = 30000000,
		高级勇敢 = 15000000,
		高级飞行 = 10000000,
		奔雷咒 = 20000000,
		高级幸运 = 20000000,
		高级法术穿透 = 20000000,
		高级冰霜 = 15000000,
		高级雷属性吸收 = 3000000,
		移花接木 = 30000000,
		高级健壮 = 25000000,
		赶尽杀绝 = 20000000,
		高级恐怖 = 15000000,
		高级神武盾气 = 15000000,
		高级逆击 = 15000000,
		高级物理穿透 = 20000000,
		高级敏捷 = 20000000,
		高级夜战 = 30000000,
		高级法术暴击 = 30000000,
		高级审判 = 20000000,
		泰山压顶 = 20000000,
		刀背打 = 20000000,
		高级反击 = 10000000,
		剑荡四方 = 20000000,
		高级招架 = 20000000,
		水漫金山 = 20000000,
		高级助攻 = 30000000,
		高级震摄 = 15000000,
		高级吸血 = 30000000,
		高级驱鬼 = 15000000,
		高级气势 = 15000000
	}
	local bl = 2

	if 掉率模式 == 1 then
		bl = 2
	end

	local 高级兽决数组 = {}

	for i = 1, #高级兽决 do
		local 临时兽决 = {
			日涨跌幅 = 0,
			参数一类型 = "附带技能",
			名称 = "高级魔兽要诀",
			参数一 = 高级兽决[i],
			价格 = (兽决价格[高级兽决[i]] or 10000000) / bl
		}
		临时兽决.最低价格 = qz(临时兽决.价格 / 10)

		table.insert(高级兽决数组, 临时兽决)
	end

	table.sort(高级兽决数组, function (a, b)
		return b.价格 < a.价格
	end)

	return 高级兽决数组
end

获取交易中心列表 = function(类型, 类名)
	for i = 1, #交易中心[类型] do
		if 交易中心[类型][i].类型 == 类名 then
			return 交易中心[类型][i].内容, i
		end
	end

	return nil, nil
end

取NPC寻路信息 = function(地图, NPC名称, x, y)
	local NPC采集 = "#Y/xx/" .. 地图 .. "|" .. NPC名称 .. "|" .. x .. "|" .. y .. "|#W"

	return NPC采集
end

数组去重 = function(a)
	local b = {}

	for k, v in ipairs(a) do
		if #b == 0 then
			b[1] = v
		else
			local index = 0

			for i = 1, #b do
				if v == b[i] then
					break
				end

				index = index + 1
			end

			if index == #b then
				b[#b + 1] = v
			end
		end
	end

	return b
end

数字转简 = function(数字)
	if 数字 == nil then
		return ""
	end

	local a = tonumber(数字) + 0
	local b, c = nil
	local d = ""

	if a >= 1000000000000.0 then
		b = a / 1000000000000.0
		c = 保留小数位数(b, 2)
		d = tostring(c) .. "万亿"
	elseif a >= 100000000 then
		b = a / 100000000
		c = 保留小数位数(b, 4)
		d = tostring(c) .. "亿"
	elseif a >= 10000 then
		b = a / 10000
		c = 保留小数位数(b, 2)
		d = tostring(c) .. "万"
	else
		d = tostring(a)
	end

	return d
end

统一取经验 = function(id, lv)
	local exp = {}

	if id == 1 then
		if 单机设置 then
			exp = {
				40,
				110,
				237,
				450,
				779,
				1252,
				1898,
				2745,
				3822,
				5159,
				6784,
				8726,
				11013,
				13674,
				16739,
				20236,
				24194,
				28641,
				33606,
				39119,
				45208,
				51902,
				55229,
				67218,
				75899,
				85300,
				95450,
				106377,
				118110,
				130679,
				144112,
				158438,
				173685,
				189882,
				207059,
				225244,
				244466,
				264753,
				286134,
				308639,
				332296,
				357134,
				383181,
				410466,
				439019,
				468868,
				500042,
				532569,
				566478,
				601799,
				638560,
				676790,
				716517,
				757770,
				800579,
				844972,
				890978,
				938625,
				987942,
				1038959,
				1091704,
				1146206,
				1202493,
				1260594,
				1320539,
				1382356,
				1446074,
				1511721,
				1579326,
				1648919,
				1720528,
				1794182,
				1869909,
				1947738,
				2027699,
				2109820,
				2194130,
				2280657,
				2369431,
				2460479,
				2553832,
				2649518,
				2747565,
				2848003,
				2950859,
				3056164,
				3163946,
				3274233,
				3387055,
				3502439,
				3620416,
				3741014,
				3864261,
				3990187,
				4118819,
				4250188,
				4384322,
				4521249,
				4660999,
				4803599,
				4998571,
				5199419,
				5406260,
				5619213,
				5838397,
				6063933,
				6295941,
				6534544,
				6779867,
				7032035,
				7291172,
				7557407,
				7830869,
				8111686,
				8399990,
				8695912,
				8999586,
				9311145,
				9630726,
				9958463,
				10294496,
				10638964,
				10992005,
				11353761,
				11724374,
				12103988,
				12492748,
				12890799,
				13298287,
				13715362,
				14142172,
				14578867,
				15025600,
				15482522,
				15949788,
				16427552,
				16915970,
				17415202,
				17925402,
				18446732,
				18979354,
				19523428,
				20079116,
				20646584,
				212259980,
				436350440,
				448426480,
				460751480,
				473328860,
				486162000,
				748881480,
				768914010,
				789345801,
				810182190,
				831428350,
				853089690,
				879774210,
				897679440,
				920618700,
				1461487640,
				1500947800,
				1541473400,
				1583093108,
				1625836690,
				1669734280,
				1714817110,
				1761117170,
				1808667340,
				1857801350,
				2406029040.0,
				5336793620.0,
				8194071000.0,
				11181699470.0,
				14303066640.0,
				17561612250.0,
				20960828530.0
			}
		else
			exp = {
				1000,
				2750,
				5925,
				9000,
				11685,
				18780,
				22776,
				27450,
				38220,
				41272,
				47488,
				52356,
				55065,
				68370,
				83695,
				101180,
				120970,
				143205,
				168030,
				195595,
				226040,
				259510,
				276145,
				336090,
				379495,
				426500,
				477250,
				531885,
				590550,
				653395,
				720560,
				792190,
				868425,
				949410,
				1035295,
				1126220,
				1222330,
				1323765,
				1430670,
				2160473,
				2326072,
				2499938,
				2682267,
				2873262,
				3073133,
				3282076,
				3500294,
				3727983,
				3965346,
				4212593,
				4469920,
				4737530,
				5015619,
				5304390,
				5604053,
				5914804,
				6236846,
				6570375,
				6915594,
				10389590,
				10917040,
				11462060,
				12024930,
				12605940,
				13205390,
				13823560,
				14460740,
				15117210,
				15793260,
				16489190,
				17205280,
				17941820,
				18699090,
				19477380,
				20276990,
				21098200,
				21941300,
				22806570,
				23694310,
				29525748,
				30645984,
				31794216,
				32970780,
				34176036,
				35410308,
				36673968,
				37967352,
				39290796,
				40644660,
				42029268,
				43444992,
				44892168,
				46371132,
				47882244,
				49425828,
				51002256,
				52611864,
				54254988,
				55931988,
				67250386,
				69979994,
				72791866,
				75687640,
				78668982,
				81737558,
				84895062,
				88143174,
				91483616,
				94918138,
				98448490,
				102076408,
				105803698,
				109632166,
				113563604,
				117599860,
				121742768,
				125994204,
				130356030,
				134830164,
				169293871,
				175006432,
				180862388,
				186864085,
				193013937,
				199314358,
				205767796,
				212376716,
				219143583,
				226070879,
				233161154,
				240416924,
				247840739,
				255435200,
				263202874,
				271146396,
				279268384,
				287571490,
				296058434,
				304731834,
				368934640,
				379587080,
				390468560,
				401582320,
				412931680,
				1061299900,
				2181752200.0,
				2242132400.0,
				2303757400.0,
				2366644300.0,
				2430810000.0,
				3744407400.0,
				3844570050.0,
				3946729005.0,
				4050910950.0,
				4157141750.0,
				0xFE3D9402,
				4398871050.0,
				4488397200.0,
				4603093500.0,
				7307438200.0,
				7504739000.0,
				7707367000.0,
				7915465540.0,
				8129183450.0,
				8348671400.0,
				8574085550.0,
				8805585850.0,
				9043336700.0,
				9289006750.0,
				12030145200.0,
				26683968100.0,
				40970355000.0,
				55908497350.0,
				71515333200.0,
				87808061250.0,
				98515894091.0,
				108515894091.0,
				118515894091.0,
				128515894091.0,
				138515894091.0,
				148515894091.0
			}
		end
	elseif 单机设置 then
		exp = {
			50,
			200,
			450,
			800,
			1250,
			1800,
			2450,
			3250,
			4050,
			5000,
			6050,
			7200,
			8450,
			9800,
			11250,
			12800,
			14450,
			16200,
			18050,
			20000,
			22050,
			24200,
			26450,
			28800,
			31250,
			33800,
			36450,
			39200,
			42050,
			45000,
			48050,
			51200,
			54450,
			57800,
			61250,
			64800,
			68450,
			72200,
			76050,
			80000,
			84050,
			88200,
			92450,
			96800,
			101250,
			105800,
			110450,
			115200,
			120050,
			125000,
			130050,
			135200,
			140450,
			145800,
			151250,
			156800,
			162450,
			168200,
			174050,
			180000,
			186050,
			192200,
			198450,
			204800,
			211250,
			217800,
			224450,
			231200,
			238050,
			245000,
			252050,
			259200,
			266450,
			273800,
			281250,
			288800,
			296450,
			304200,
			312050,
			320000,
			328050,
			336200,
			344450,
			352800,
			361250,
			369800,
			378450,
			387200,
			396050,
			405000,
			414050,
			423200,
			432450,
			441800,
			451250,
			460800,
			470450,
			480200,
			490050,
			500000,
			510050,
			520200,
			530450,
			540800,
			551250,
			561800,
			572450,
			583200,
			594050,
			605000,
			616050,
			627200,
			638450,
			649800,
			661250,
			672800,
			684450,
			696200,
			708050,
			720000,
			732050,
			744200,
			756450,
			768800,
			781250,
			793800,
			806450,
			819200,
			832050,
			845000,
			858050,
			871200,
			884450,
			897800,
			911250,
			924800,
			938450,
			952200,
			966050,
			980000,
			994050,
			1008200,
			1022450,
			1036800,
			1051250,
			1065800,
			1080450,
			1095200,
			1110050,
			1125000,
			1140050,
			1155200,
			1170450,
			1185800,
			1201250,
			1216800,
			1232450,
			1248200,
			1264050,
			1280000,
			1300000,
			1340000,
			1380000,
			1420000,
			1460000,
			1500000,
			1540000,
			1580000,
			1700000,
			1780000,
			1820000,
			1940000,
			2400000,
			2880000,
			3220000,
			4020000,
			4220000,
			4420000,
			4620000,
			5220000,
			5820000,
			6220000,
			7020000,
			8020000,
			9020000
		}
	else
		exp = {
			1250,
			5000,
			11250,
			16000,
			18750,
			27000,
			29400,
			32500,
			40500,
			40000,
			42350,
			43200,
			42250,
			49000,
			56250,
			64000,
			72250,
			81000,
			90250,
			100000,
			110250,
			121000,
			132250,
			144000,
			156250,
			169000,
			182250,
			196000,
			210250,
			225000,
			240250,
			256000,
			272250,
			289000,
			306250,
			324000,
			342250,
			361000,
			380250,
			560000,
			588350,
			617400,
			647150,
			677600,
			708750,
			740600,
			773150,
			806400,
			840350,
			875000,
			910350,
			946400,
			983150,
			1020600,
			1058750,
			1097600,
			1137150,
			1177400,
			1218350,
			1800000,
			1860500,
			1922000,
			1984500,
			2048000,
			2112500,
			2178000,
			2244500,
			2312000,
			2380500,
			2450000,
			2520500,
			2592000,
			2664500,
			2738000,
			2812500,
			2888000,
			2964500,
			3042000,
			3120500,
			3840000,
			3936600,
			4034400,
			4133400,
			4233600,
			4335000,
			4437600,
			4541400,
			4646400,
			4752600,
			4860000,
			4968600,
			5078400,
			5189400,
			5301600,
			5415000,
			5529600,
			5645400,
			5762400,
			5880600,
			7000000,
			7140700,
			7282800,
			7426300,
			7571200,
			7717500,
			7865200,
			8014300,
			8164800,
			8316700,
			8470000,
			8624700,
			8780800,
			8938300,
			9097200,
			9257500,
			9419200,
			9582300,
			9746800,
			9912700,
			12240000,
			12444850,
			12651400,
			12859650,
			13069600,
			13281250,
			13494600,
			13709650,
			13926400,
			14144850,
			14365000,
			14586850,
			14810400,
			15035650,
			15262600,
			15491250,
			15721600,
			15953650,
			16187400,
			16422850,
			19600000,
			19881000,
			20164000,
			20449000,
			20736000,
			21025000,
			21316000,
			21609000,
			21904000,
			22201000,
			28125000,
			28501250,
			28880000,
			29261250,
			29645000,
			30031250,
			30420000,
			30811250,
			31205000,
			31601250,
			32000000,
			32500000,
			33500000,
			34500000,
			35500000,
			36500000,
			37500000,
			38500000,
			39500000,
			42500000,
			89000000,
			91000000,
			97000000,
			120000000,
			144000000,
			161000000,
			201000000,
			211000000,
			221000000,
			231000000,
			261000000,
			291000000,
			311000000,
			351000000,
			401000000,
			451000000,
			501000000,
			551000000,
			601000000,
			651000000,
			701000000,
			751000000,
			801000000,
			851000000,
			901000000,
			951000000,
			1001000000,
			1051000000,
			1101000000,
			1151000000,
			1201000000
		}
	end

	return exp[lv + 1]
end

删除副本地图单位 = function(任务id, 地图, 类型)
	local 副本id = 任务数据[任务id].副本id
	local 删除地图 = DeepCopy(地图)

	for n = 1, #删除地图 do
		local aa = 删除地图[n]

		for i, v in pairs(地图处理类.地图单位[aa]) do
			if 任务数据[地图处理类.地图单位[aa][i].id].副本id == 副本id and (类型 == nil or tostring(任务数据[地图处理类.地图单位[aa][i].id].类型) == tostring(类型)) then
				地图处理类:删除单位(aa, i)
			end
		end
	end
end

提取奇经八脉 = function(mp)
	if mp == "方寸山" then
		return {
			"苦缠",
			"雷动",
			"奔雷",
			"黄粱",
			"不舍",
			"鬼惧",
			"补缺",
			"不倦",
			"不灭",
			"化身",
			"调息",
			"批亢",
			"斗法",
			"吐纳",
			"飞符炼魂",
			"鬼念",
			"碎甲",
			"摧心",
			"顺势而为",
			"额外能力",
			"钟馗论道"
		}
	elseif mp == "女儿村" then
		return {
			"自矜",
			"暗伤",
			"杏花",
			"花舞",
			"倩影",
			"淬芒",
			"傲娇",
			"花护",
			"天香",
			"国色",
			"鸿影",
			"轻霜",
			"机巧",
			"毒引",
			"毒雾",
			"嫣然",
			"磐石",
			"花殇",
			"碎玉弄影",
			"额外能力",
			"鸿渐于陆"
		}
	elseif mp == "神木林" then
		return {
			"风灵",
			"法身",
			"咒术",
			"灵压",
			"咒法",
			"蔓延",
			"鞭挞",
			"月影",
			"不侵",
			"风魂",
			"冰锥",
			"血契",
			"滋养",
			"纯净",
			"破杀",
			"追击",
			"灵能",
			"寄生",
			"风卷残云",
			"额外能力",
			"凋零之歌"
		}
	elseif mp == "化生寺" then
		return {
			"止戈",
			"销武",
			"佛屠",
			"佛誉",
			"仁心",
			"聚气",
			"佛显",
			"心韧",
			"归气",
			"天照",
			"舍利",
			"感念",
			"慈针",
			"佛性",
			"妙悟",
			"慈心",
			"映法",
			"流刚",
			"渡劫金身",
			"额外能力",
			"诸天看护"
		}
	elseif mp == "大唐官府" then
		return {
			"目空",
			"风刃",
			"扶阵",
			"翩鸿一击",
			"勇武",
			"长驱直入",
			"杀意",
			"念心",
			"静岳",
			"干将",
			"勇念",
			"神凝",
			"狂狷",
			"不惊",
			"突进",
			"破空",
			"历战",
			"连破",
			"无敌",
			"额外能力",
			"破军"
		}
	elseif mp == "阴曹地府" then
		return {
			"判官",
			"回旋",
			"夜行",
			"入骨",
			"聚魂",
			"六道无量",
			"索魂",
			"伤魂",
			"百炼",
			"黄泉",
			"毒印",
			"百爪狂杀",
			"幽光",
			"泉爆",
			"鬼火",
			"魂飞",
			"汲魂",
			"击破",
			"魑魅缠身",
			"额外能力",
			"夜之王者"
		}
	elseif mp == "盘丝洞" then
		return {
			"鼓乐",
			"妖气",
			"怜心",
			"迷瘴",
			"粘附",
			"意乱",
			"绝殇",
			"安抚",
			"忘忧",
			"忘川",
			"迷梦",
			"倾情",
			"情劫",
			"脱壳",
			"迷意",
			"结阵",
			"媚态",
			"利刃",
			"落花成泥",
			"额外能力",
			"偷龙转凤"
		}
	elseif mp == "无底洞" then
		return {
			"金莲",
			"追魂",
			"回敬",
			"由己渡人",
			"自愈",
			"陷阱",
			"化莲",
			"风墙",
			"御兽",
			"精进",
			"救人",
			"灵身",
			"持戒",
			"内伤",
			"反先",
			"忍辱",
			"暗潮",
			"噬魂",
			"同舟共济",
			"额外能力",
			"妖风四起"
		}
	elseif mp == "魔王寨" then
		return {
			"充沛",
			"炙烤",
			"震怒",
			"蚀天",
			"敛恨",
			"赤暖",
			"火神",
			"震天",
			"神焰",
			"神炎",
			"返火",
			"坚甲",
			"魔冥",
			"燃魂",
			"狂月",
			"威吓",
			"连营",
			"魔心",
			"魔焰滔天",
			"额外能力",
			"烈焰真诀"
		}
	elseif mp == "狮驼岭" then
		return {
			"爪印",
			"翼展",
			"驭兽",
			"化血",
			"宁息",
			"兽王",
			"狮吼",
			"怒象",
			"鹰啸",
			"乱破",
			"魔息",
			"威震",
			"狂袭",
			"失心",
			"羁绊",
			"死地",
			"乱击",
			"悲恸",
			"背水",
			"额外能力",
			"肝胆"
		}
	elseif mp == "天宫" then
		return {
			"威赫",
			"疾雷",
			"轰鸣",
			"趁虚",
			"余韵",
			"驭意",
			"震慑",
			"神念",
			"伏魔",
			"苏醒",
			"护佑",
			"电芒",
			"月桂",
			"怒气",
			"灵光",
			"神律",
			"洞察",
			"雷波",
			"画地为牢",
			"额外能力",
			"风雷韵动"
		}
	elseif mp == "普陀山" then
		return {
			"化戈",
			"推衍",
			"借灵",
			"莲花心音",
			"生克",
			"默诵",
			"劳心",
			"普渡",
			"化怨",
			"甘露",
			"法印",
			"秘术",
			"灵动",
			"雨润",
			"莲心剑意",
			"玉帛",
			"道衍",
			"法咒",
			"波澜不惊",
			"额外能力",
			"五行制化"
		}
	elseif mp == "凌波城" then
		return {
			"山破",
			"战诀",
			"抗击",
			"暴气",
			"神诀",
			"魂聚",
			"神躯",
			"斩魔",
			"不动",
			"力战",
			"破击",
			"怒涛",
			"海沸",
			"怒火释放",
			"煞气",
			"强袭",
			"雷附",
			"再战",
			"天神怒斩",
			"额外能力",
			"真君显灵"
		}
	elseif mp == "五庄观" then
		return {
			"体恤",
			"锤炼",
			"神附",
			"心浪",
			"养生",
			"强击",
			"归本",
			"修心",
			"混元",
			"修身",
			"同辉",
			"雨杀",
			"乾坤",
			"意境",
			"傲视",
			"陌宝",
			"心随意动",
			"致命",
			"清风望月",
			"额外能力",
			"天命剑法"
		}
	elseif mp == "龙宫" then
		return {
			"波涛",
			"破浪",
			"云霄",
			"逐浪",
			"踏涛",
			"清吟",
			"天龙",
			"龙珠",
			"龙骇",
			"龙慑",
			"傲翔",
			"飞龙",
			"戏珠",
			"回魔",
			"月魂",
			"汹涌",
			"龙魄",
			"摧意",
			"亢龙归海",
			"额外能力",
			"雷浪穿云"
		}
	elseif mp == "女魃墓" then
		return {
			"腐蚀",
			"引魂",
			"咒怨",
			"不共戴天",
			"灵诅",
			"噬魔",
			"异兆",
			"不灭",
			"灵威",
			"余烬",
			"遗世",
			"怒火",
			"凋零",
			"血泉",
			"俱灭",
			"焕然",
			"伤蚀",
			"狂焰",
			"觉醒",
			"额外能力",
			"无相诛戮"
		}
	elseif mp == "天机城" then
		return {
			"锐志",
			"精奇",
			"善工",
			"玄机",
			"催锋",
			"巧偃",
			"连枷",
			"断矶",
			"纯青",
			"无痕",
			"奇肱",
			"攻云",
			"造化",
			"天匠",
			"穷变",
			"鲸甲",
			"天机神迹",
			"不厌",
			"铜山铁壁",
			"额外能力",
			"所向披靡"
		}
	elseif mp == "花果山" then
		return {
			"顽心",
			"逐胜",
			"愈勇",
			"斗志",
			"忘形",
			"贪天",
			"显圣",
			"锤炼",
			"火眼",
			"闹天",
			"铁骨",
			"搅海",
			"伏妖",
			"豪胆",
			"压邪",
			"战魄",
			"不坏",
			"荡魔",
			"战神",
			"额外能力",
			"齐天神通"
		}
	end
end

切换经脉消耗银两 = 1000

切换经脉流派 = function(id, 角色数据, 流派, 助战编号)
	local 收费 = true

	if 角色数据.经脉流派 == nil then
		收费 = false
	end

	if 门派名称1[角色数据.门派] == nil then
		常规提示(id, "#Y/门派数据错误！")

		return
	elseif 收费 and 玩家数据[id].角色:扣除银子(切换经脉消耗银两 * 10000, 0, 0, "切换经脉", 1) == false then
		return
	end

	if 角色数据.奇经八脉.经脉流派 ~= nil and 助战编号 == nil then
		print(角色数据.奇经八脉.经脉流派)
		玩家数据[id].角色:删除称谓(id, 角色数据.奇经八脉.经脉流派)
	end

	角色数据.奇经八脉 = {}
	角色数据.经脉流派 = 流派
	角色数据.开启奇经八脉 = nil
	角色数据.技能树 = nil
	角色数据.装备属性.剩余乾元丹 = 角色数据.装备属性.剩余乾元丹 + 角色数据.装备属性.乾元丹
	角色数据.装备属性.乾元丹 = 0

	常规提示(id, "#Y/经脉切换成功！你已启用#P【" .. 经脉流派(角色数据.门派)[流派] .. "】#Y流派经脉！")
	发送数据(玩家数据[id].连接id, 7008, {
		编号 = 助战编号,
		流派 = 角色数据.经脉流派,
		门派 = 角色数据.门派,
		奇经八脉 = 角色数据.奇经八脉,
		装备属性 = 角色数据.装备属性
	})
end

提取三经脉奇经八脉 = function(mp, 流派)
	if 流派 == nil then
		流派 = 1
	end

	local 技能表 = {}

	if mp == "大唐官府" then
		技能表 = {
			浴血豪侠 = {
				"目空",
				"风刃",
				"扶阵",
				"翩鸿",
				"勇武",
				"长驱直入",
				"杀意",
				"念心",
				"静岳",
				"干将",
				"勇念",
				"神凝",
				"执剑",
				"不惊",
				"傲視",
				"破空",
				"历战",
				"安神",
				"额外能力",
				"无敌",
				"浴血豪侠"
			},
			无双战神 = {
				"目空",
				"勇进",
				"突刺",
				"翩鸿",
				"勇武",
				"长驱直入",
				"亢强",
				"念心",
				"静岳",
				"干将",
				"勇念",
				"神凝",
				"执剑",
				"不惊",
				"突进",
				"破势",
				"孤勇",
				"熟练",
				"额外能力",
				"破军",
				"无双战神"
			},
			虎贲上将 = {
				"潜心",
				"笃志",
				"昂扬",
				"效法",
				"追戮",
				"烈光",
				"摧枯拉朽",
				"肃杀",
				"幸运一击",
				"怒伤",
				"奉还",
				"催迫",
				"攻伐",
				"暴突",
				"诛伤",
				"破刃",
				"奋战",
				"霊能",
				"额外能力",
				"披挂上阵",
				"虎贲上将"
			}
		}
	elseif mp == "化生寺" then
		技能表 = {
			杏林妙手 = {
				"销武",
				"止戈",
				"圣手",
				"妙手",
				"仁心",
				"化瘀",
				"佛显",
				"心韧",
				"归气",
				"天照",
				"舍利",
				"佛佑",
				"佛法",
				"佛性",
				"妙悟",
				"慈心",
				"虔诚",
				"佛缘",
				"额外能力",
				"渡劫金身",
				"杏林妙手"
			},
			护法金刚 = {
				"施他",
				"佛屠",
				"销武",
				"聚念",
				"仁心",
				"磅礴",
				"佛显",
				"心韧",
				"归气",
				"感念",
				"舍利",
				"无碍",
				"佛法",
				"佛性",
				"妙悟",
				"慈心",
				"映法",
				"流刚",
				"额外能力",
				"诸天看护",
				"护法金刚"
			},
			无量尊者 = {
				"诵律",
				"诵经",
				"授业",
				"修习",
				"悲悯",
				"解惑",
				"持戒",
				"生花",
				"悟彻",
				"抚琴",
				"舍利",
				"静气",
				"自在",
				"无量",
				"慧定",
				"金刚",
				"顿悟",
				"韦陀",
				"额外能力",
				"罗汉悟道",
				"无量尊者"
			}
		}
	elseif mp == "龙宫" then
		技能表 = {
			海中蛟虬 = {
				"波涛",
				"破浪",
				"狂浪",
				"叱咤",
				"踏涛",
				"龙啸",
				"逐浪",
				"龙珠",
				"龙息",
				"龙慑",
				"傲翔",
				"飞龙",
				"斩浪",
				"月光",
				"戏珠",
				"汹涌",
				"龙魄",
				"御水",
				"额外能力",
				"亢龙归海",
				"海中蛟虬"
			},
			云龙真身 = {
				"波涛",
				"破浪",
				"云霄",
				"呼风",
				"踏涛",
				"清吟",
				"龙息",
				"龙珠",
				"唤雨",
				"龙慑",
				"傲翔",
				"飞龙",
				"戏珠",
				"月光",
				"云变",
				"沐雨",
				"龙魄",
				"摧意",
				"额外能力",
				"雷浪穿云",
				"云龙真身"
			},
			沧海潜龙 = {
				"傲岸",
				"云魂",
				"雨魄",
				"盘龙",
				"踏涛",
				"叱咤",
				"凛然",
				"龙珠",
				"瞋目",
				"龙慑",
				"傲翔",
				"飞龙",
				"戏珠",
				"月光",
				"波濤",
				"龙钩",
				"琴魂",
				"惊鸿",
				"额外能力",
				"潜龙在渊",
				"沧海潜龙"
			}
		}
	elseif mp == "魔王寨" then
		技能表 = {
			平天大圣 = {
				"充沛",
				"震怒",
				"激怒",
				"蚀天",
				"邪火",
				"赤暖",
				"火神",
				"震天",
				"真炎",
				"神焰",
				"吹牛",
				"焚尽",
				"咆哮",
				"狂月",
				"燃魂",
				"威吓",
				"连营",
				"魔心",
				"额外能力",
				"魔焰滔天",
				"平天大圣"
			},
			盖世魔君 = {
				"充沛",
				"震怒",
				"炙烤",
				"烈焰",
				"赤暖",
				"邪火",
				"火神",
				"震天",
				"折服",
				"焰星",
				"吹牛",
				"焰威",
				"咆哮",
				"狂月",
				"魔焱",
				"威吓",
				"连营",
				"狂劲",
				"额外能力",
				"升温",
				"盖世魔君"
			},
			风火妖王 = {
				"秘传三昧真火",
				"烈火真言",
				"秘传飞砂走石",
				"极炙",
				"咒言",
				"摧山",
				"不忿",
				"震天",
				"融骨",
				"神焰",
				"焦土",
				"不滅",
				"烬藏",
				"固基",
				"蔽日",
				"碾压",
				"旋阳",
				"魔心",
				"额外能力",
				"燎原",
				"风火妖王"
			}
		}
	elseif mp == "神木林" then
		技能表 = {
			通天法王 = {
				"法身",
				"风魂",
				"灵佑",
				"追击",
				"咒法",
				"狂叶",
				"劲草",
				"冰锥",
				"苍埃",
				"神木",
				"月影",
				"薪火",
				"纯净",
				"蔓延",
				"破杀",
				"啸风",
				"滋养",
				"灵归",
				"额外能力",
				"风卷残云",
				"通天法王"
			},
			巫影祭司 = {
				"风魂",
				"迷缚",
				"法身",
				"伏毒",
				"咒法",
				"灵木",
				"绞藤",
				"冰锥",
				"寄生",
				"神木",
				"月影",
				"薪火",
				"纯净",
				"蔓延",
				"破杀",
				"激活",
				"滋养",
				"毒萃",
				"额外能力",
				"凋零之歌",
				"巫影祭司"
			},
			灵木药宗 = {
				"风魂",
				"灵秀",
				"归原",
				"苍风",
				"咒法",
				"焕新",
				"萦风",
				"奉愿",
				"秀木",
				"神木",
				"月影",
				"薪火",
				"凉秋",
				"蔓延",
				"碾杀",
				"星光",
				"滋养",
				"灵精",
				"额外能力",
				"枯木逢春",
				"灵木神侍"
			}
		}
	elseif mp == "方寸山" then
		技能表 = {
			拘灵散修 = {
				"雷动",
				"苦缠",
				"灵咒",
				"黄粱",
				"制约",
				"必果",
				"补缺",
				"不倦",
				"精炼",
				"化身",
				"调息",
				"幻变",
				"斗法",
				"吐纳",
				"神符",
				"鬼念",
				"灵威",
				"碎甲",
				"额外能力",
				"顺势而为",
				"拘灵散修"
			},
			伏魔天师 = {
				"驱雷",
				"策电",
				"雷动",
				"鬼恸",
				"穿透",
				"余悸",
				"宝诀",
				"妙用",
				"不灭",
				"化身",
				"怒霆",
				"批亢",
				"顺势",
				"炼魂",
				"吐纳",
				"灵能",
				"超导",
				"摧心",
				"额外能力",
				"钟馗论道",
				"伏魔天师"
			},
			五雷正宗 = {
				"五雷·挪移",
				"雷动",
				"雷暴",
				"咒诀",
				"穿透",
				"符威",
				"宝诀",
				"妙用",
				"不灭",
				"雷衍",
				"雷鸣",
				"天箓",
				"顺势",
				"神机",
				"吐纳",
				"造化",
				"聚集",
				"摧心",
				"额外能力",
				"奇门",
				"五雷正宗"
			}
		}
	elseif mp == "女儿村" then
		技能表 = {
			绝代妖娆 = {
				"独尊",
				"暗伤",
				"重明",
				"倩影",
				"花舞",
				"风行",
				"傲娇",
				"花护",
				"空灵",
				"叶护",
				"国色",
				"轻霜",
				"抑怒",
				"机巧",
				"毒雾",
				"嫣然",
				"磐石",
				"倾国",
				"额外能力",
				"碎玉弄影",
				"绝代妖娆"
			},
			花雨伊人 = {
				"涂毒",
				"杏花",
				"暗伤",
				"淬芒",
				"花舞",
				"暗刃",
				"傲娇",
				"花护",
				"天香",
				"轻霜",
				"花影",
				"百花",
				"毒雾",
				"毒引",
				"余韵",
				"磐石",
				"飞花",
				"花殇",
				"额外能力",
				"鸿渐于陆",
				"花雨伊人"
			},
			妙舞佳人 = {
				"天籁",
				"即兴",
				"夺目",
				"独舞",
				"静心",
				"变奏",
				"翻飞",
				"水漾",
				"惊鸿起舞",
				"矫健",
				"花雨",
				"跃动",
				"幽美",
				"风姿",
				"伴舞",
				"轻霜",
				"纷舞",
				"映日妙舞",
				"额外能力",
				"余韵索心",
				"妙舞佳人"
			}
		}
	elseif mp == "天宫" then
		技能表 = {
			镇妖神使 = {
				"威吓",
				"疾雷",
				"轰鸣",
				"趁虚",
				"余韵",
				"天威",
				"震慑",
				"神念",
				"藏招",
				"苏醒",
				"护佑",
				"坚壁",
				"月桂",
				"怒气",
				"套索",
				"神律",
				"起搏",
				"洞察",
				"额外能力",
				"画地为牢",
				"镇妖神使"
			},
			踏雷天尊 = {
				"频变",
				"威吓",
				"惊曜",
				"霜雷",
				"轰鸣",
				"驭意",
				"电掣",
				"神念",
				"伏魔",
				"雷霆汹涌",
				"苏醒",
				"天劫",
				"共鸣",
				"怒电",
				"灵光",
				"洞察",
				"仙音",
				"雷波",
				"额外能力",
				"风雷韵动",
				"踏雷天尊"
			},
			霹雳真君 = {
				"霆震",
				"疾雷",
				"激越",
				"存雄",
				"余韵",
				"慨叹",
				"电掣",
				"伏魔",
				"惊霆",
				"雷吞",
				"苏醒",
				"电光",
				"神采",
				"劲健",
				"啸傲",
				"起搏",
				"气势",
				"洞察",
				"额外能力",
				"威仪九霄",
				"霹雳真君"
			}
		}
	elseif mp == "普陀山" then
		技能表 = {
			莲台仙子 = {
				"推衍",
				"化戈",
				"普照",
				"莲花心音",
				"静心",
				"慈佑",
				"劳心",
				"普渡",
				"度厄",
				"甘露",
				"清净",
				"莲动",
				"法华",
				"灵动",
				"感念",
				"玉帛",
				"雨润",
				"道衍",
				"额外能力",
				"波澜不惊",
				"莲台仙子"
			},
			五行咒师 = {
				"庄严",
				"借灵",
				"推衍",
				"默诵",
				"静心",
				"莲花心音",
				"赐咒",
				"普渡",
				"慧眼",
				"无怖",
				"清净",
				"秘术",
				"感念",
				"莲心剑意",
				"法华",
				"道衍",
				"缘起",
				"法咒",
				"额外能力",
				"相灭相生",
				"五行咒师"
			},
			落伽神女 = {
				"湛然",
				"因缘",
				"莲音",
				"安忍",
				"静心",
				"低眉",
				"顿悟",
				"怒目",
				"馀威",
				"清净",
				"业障",
				"困兽",
				"无尽",
				"抖擞",
				"莲华",
				"化用",
				"智念",
				"执念",
				"额外能力",
				"万象",
				"落伽神女"
			}
		}
	elseif mp == "盘丝洞" then
		技能表 = {
			风华舞圣 = {
				"粘附",
				"妖气",
				"怜心",
				"迷瘴",
				"鼓乐",
				"魔音",
				"玲珑",
				"安抚",
				"丹香",
				"迷梦",
				"忘川",
				"连绵",
				"情劫",
				"绝殇",
				"绵密",
				"结阵",
				"媚态",
				"绝媚",
				"额外能力",
				"落花成泥",
				"风华舞圣"
			},
			迷情妖姬 = {
				"粘附",
				"妖气",
				"怜心",
				"迷瘴",
				"鼓乐",
				"忘忧",
				"玲珑",
				"安抚",
				"倾情",
				"连绵",
				"忘川",
				"意乱",
				"情劫",
				"魔瘴",
				"迷意",
				"结阵",
				"绝媚",
				"利刃",
				"额外能力",
				"偷龙转凤",
				"迷情妖姬"
			},
			百媚魔姝 = {
				"粘附",
				"杀戮",
				"罗网",
				"天网",
				"凌弱",
				"制怒",
				"狂击",
				"千蛛",
				"引诛",
				"附骨",
				"亡缚",
				"罗刹",
				"障眼",
				"连绵",
				"意乱",
				"结阵",
				"牵魂蛛丝",
				"扑袭",
				"额外能力",
				"绝命毒牙",
				"百媚魔姝"
			}
		}
	elseif mp == "阴曹地府" then
		技能表 = {
			勾魂阎罗 = {
				"阎罗",
				"回旋",
				"夜行",
				"入骨",
				"聚魂",
				"拘魄",
				"索魂",
				"伤魂",
				"克敌",
				"黄泉",
				"幽冥",
				"冥视",
				"幽光",
				"泉爆",
				"鬼火",
				"魂飞",
				"汲魂",
				"扼命",
				"额外能力",
				"魍魉追魂",
				"勾魂阎罗"
			},
			六道魍魉 = {
				"阎罗",
				"回旋",
				"夜行",
				"聚魂",
				"狱火",
				"六道",
				"索魂",
				"伤魂",
				"百爪狂杀",
				"追命",
				"幽冥",
				"百炼",
				"咒令",
				"泉爆",
				"鬼火",
				"恶焰",
				"汲魂",
				"噬毒",
				"额外能力",
				"夜之王者",
				"六道魍魉"
			},
			诛刑毒师 = {
				"毒炽",
				"回旋",
				"阴翳",
				"聚魂",
				"破毒",
				"入魂",
				"毒慑",
				"破印",
				"瘴幕",
				"无赦咒令",
				"幽冥",
				"冥毒",
				"狂宴",
				"鬼火",
				"轮回",
				"追命",
				"汲魂",
				"恶焰",
				"额外能力",
				"生杀予夺",
				"诛刑毒师"
			}
		}
	elseif mp == "狮驼岭" then
		技能表 = {
			嗜血狂魔 = {
				"爪印",
				"迅捷",
				"驭兽",
				"化血",
				"宁息",
				"兽王",
				"威压",
				"鹰啸",
				"怒象",
				"九天",
				"展翅",
				"协战",
				"怒火",
				"狂袭",
				"癫狂",
				"死地",
				"乱击",
				"肝胆",
				"额外能力",
				"背水",
				"嗜血狂魔"
			},
			万兽之王 = {
				"狮王",
				"健壮",
				"图腾",
				"回光",
				"育养",
				"守势",
				"护盾",
				"狂化",
				"矫健",
				"协同",
				"九天",
				"嗜血",
				"羁绊",
				"报恩",
				"钢牙",
				"复仇",
				"逞凶",
				"救主",
				"额外能力",
				"最佳搭档",
				"万兽之王"
			},
			狂怒斗兽 = {
				"焦躁",
				"迅捷",
				"横眉",
				"忿忿",
				"激变",
				"狂乱",
				"暴怒",
				"灭兽",
				"狂血",
				"九天",
				"魔息",
				"协战",
				"羁绊",
				"狂袭",
				"长啸",
				"怒火",
				"乱击",
				"不羁",
				"额外能力",
				"困兽之斗",
				"狂怒斗兽"
			}
		}
	elseif mp == "五庄观" then
		技能表 = {
			清心羽客 = {
				"体恤",
				"运转",
				"行气",
				"心浪",
				"养生",
				"蓄志",
				"归本",
				"修心",
				"存思",
				"修身",
				"同辉",
				"守中",
				"乾坤",
				"意境",
				"日月同辉",
				"陌宝",
				"心随意动",
				"玄机",
				"额外能力",
				"清风望月",
				"清心羽客"
			},
			乾坤力士 = {
				"体恤",
				"锤炼",
				"神附",
				"心浪",
				"养生",
				"强击",
				"无极",
				"修心",
				"混元",
				"修身",
				"剑气",
				"雨杀",
				"意境",
				"起雨",
				"滂沱",
				"剑势",
				"心随意动",
				"致命",
				"额外能力",
				"天命剑法",
				"乾坤力士"
			},
			万寿真仙 = {
				"木摧",
				"道果",
				"饮露",
				"炼果",
				"心浪",
				"聚力",
				"无极",
				"修心",
				"混元",
				"刺果",
				"修身",
				"三元",
				"凝神",
				"纳气",
				"气盛",
				"绵延",
				"还元",
				"致命",
				"额外能力",
				"归真",
				"万寿真仙"
			}
		}
	elseif mp == "无底洞" then
		技能表 = {
			妙谛金莲 = {
				"灵照",
				"秉幽",
				"护法",
				"涌泉",
				"绝处逢生",
				"烛照",
				"华光",
				"风墙",
				"血潮",
				"精进",
				"救人",
				"疗愈",
				"持戒",
				"罗汉",
				"灵通",
				"忍辱",
				"暗潮",
				"噬魂",
				"额外能力",
				"同舟共济",
				"妙谛金莲"
			},
			摄魂迷影 = {
				"阴魅",
				"诡印",
				"萦魄",
				"御兽",
				"绝处逢生",
				"陷阱",
				"椎骨",
				"风墙",
				"血潮",
				"妖法",
				"精进",
				"救人",
				"烈煞",
				"持戒",
				"罗汉",
				"忍辱",
				"暗潮",
				"噬魂",
				"额外能力",
				"妖风四起",
				"摄魂迷影"
			},
			幽冥巫煞 = {
				"弥愤",
				"魂守",
				"刺骨",
				"余咒",
				"鬼袭",
				"羽裂",
				"分魄",
				"盛怒",
				"血潮",
				"夺血",
				"灵变",
				"深刻",
				"牵动",
				"独一",
				"聚魂",
				"纠缠",
				"灵身",
				"踏魄",
				"额外能力",
				"冥煞",
				"幽冥巫煞"
			}
		}
	elseif mp == "凌波城" then
		技能表 = {
			九天武圣 = {
				"山破",
				"战诀",
				"无双",
				"聚气",
				"贯通",
				"穿石",
				"神躯",
				"冰爆",
				"不动",
				"力战",
				"破击",
				"巧变",
				"海沸",
				"怒意",
				"煞气",
				"强袭",
				"提气",
				"再战",
				"额外能力",
				"天神怒斩",
				"九天武圣"
			},
			灵霄斗士 = {
				"石摧",
				"战诀",
				"天泽",
				"聚气",
				"贯通",
				"穿石",
				"神躯",
				"涡流",
				"不动",
				"妙得",
				"闪雷",
				"惊涛",
				"海沸",
				"怒意",
				"煞气",
				"乘势",
				"提气",
				"再战",
				"额外能力",
				"真君显灵",
				"灵霄斗士"
			},
			风云战将 = {
				"山破",
				"战诀",
				"拍岸",
				"怒眼",
				"贯通",
				"穿石",
				"神躯",
				"砥石",
				"不动",
				"威震",
				"盛势",
				"天眼",
				"海沸",
				"怒意",
				"煞气",
				"蓄势",
				"杀罚",
				"再战",
				"额外能力",
				"风云再现",
				"风云战将"
			}
		}
	elseif mp == "花果山" then
		技能表 = {
			齐天武圣 = {
				"威仪",
				"逐胜",
				"愈勇",
				"斗志",
				"忘形",
				"贪天",
				"显圣",
				"火眼",
				"棒打雄风",
				"闹天",
				"铁骨",
				"填海",
				"伏妖",
				"豪胆",
				"压邪",
				"翻天",
				"降兽",
				"荡魔",
				"额外能力",
				"齐天神通",
				"齐天武圣"
			},
			斗战真神 = {
				"顽心",
				"逐胜",
				"自在",
				"变通",
				"忘形",
				"顽性",
				"显圣",
				"金睛",
				"棒打雄风",
				"通天",
				"铁骨",
				"威震",
				"伏妖",
				"豪胆",
				"压邪",
				"朝拜",
				"降兽",
				"荡魔",
				"额外能力",
				"战神",
				"斗战真神"
			},
			通天行者 = {
				"威仪",
				"闹海",
				"愈勇",
				"斗志",
				"忘形",
				"顽性",
				"显圣",
				"逞胜",
				"金睛",
				"斗战",
				"添威",
				"胜意",
				"大圣",
				"冲霄",
				"锻炼",
				"朝拜",
				"降兽",
				"荡魔",
				"额外能力",
				"齐天神通",
				"通天行者"
			}
		}
	elseif mp == "九黎城" then
		技能表 = {
			铁火战魔 = {
				"枫魂",
				"怒刃",
				"震怒",
				"俾睨",
				"识破",
				"得势",
				"飞扬",
				"凌人",
				"生风",
				"蛮横",
				"难保",
				"乘风",
				"擎天",
				"族魂",
				"魂力",
				"狂暴",
				"驭魔",
				"野蛮",
				"额外能力",
				"魔神之刃",
				"铁火战魔"
			},
			暂无流派 = {}
		}
	end

	return 技能表[经脉流派(mp)[流派]]
end

经脉流派 = function(mp)
	if mp == "大唐官府" then
		return {
			"浴血豪侠",
			"无双战神",
			"虎贲上将"
		}
	elseif mp == "化生寺" then
		return {
			"无量尊者",
			"杏林妙手",
			"护法金刚"
		}
	elseif mp == "女儿村" then
		return {
			"绝代妖娆",
			"花雨伊人",
			"妙舞佳人"
		}
	elseif mp == "方寸山" then
		return {
			"伏魔天师",
			"拘灵散修",
			"五雷正宗"
		}
	elseif mp == "天宫" then
		return {
			"踏雷天尊",
			"镇妖神使",
			"霹雳真君"
		}
	elseif mp == "普陀山" then
		return {
			"五行咒师",
			"莲台仙子",
			"落伽神女"
		}
	elseif mp == "龙宫" then
		return {
			"海中蛟虬",
			"云龙真身",
			"沧海潜龙"
		}
	elseif mp == "五庄观" then
		return {
			"乾坤力士",
			"清心羽客",
			"万寿真仙"
		}
	elseif mp == "狮驼岭" then
		return {
			"嗜血狂魔",
			"万兽之王",
			"狂怒斗兽"
		}
	elseif mp == "魔王寨" then
		return {
			"平天大圣",
			"盖世魔君",
			"风火妖王"
		}
	elseif mp == "阴曹地府" then
		return {
			"勾魂阎罗",
			"六道魍魉",
			"诛刑毒师"
		}
	elseif mp == "盘丝洞" then
		return {
			"百媚魔姝",
			"风华舞圣",
			"迷情妖姬"
		}
	elseif mp == "神木林" then
		return {
			"通天法王",
			"巫影祭司",
			"灵木神侍"
		}
	elseif mp == "凌波城" then
		return {
			"九天武圣",
			"灵霄斗士",
			"风云战将"
		}
	elseif mp == "无底洞" then
		return {
			"妙谛金莲",
			"摄魂迷影",
			"幽冥巫煞"
		}
	elseif mp == "女魃墓" then
		return {
			"无相鬼魃",
			"唤魂山鬼",
			"幽影怨灵"
		}
	elseif mp == "天机城" then
		return {
			"磐石宗匠",
			"千机修罗",
			"神机圣手"
		}
	elseif mp == "花果山" then
		return {
			"齐天武圣",
			"斗战真神",
			"通天行者"
		}
	elseif mp == "九黎城" then
		return {
			"铁火战魔"
		}
	end
end

取洗宠技能 = function(模型, 变异, 自带技能列表, 超级金柳露)
	local jn = 自带技能列表
	local jn0 = {}
	local jn1 = 取天生(去模型进阶(模型))
	local cj = 0

	if 超级金柳露 ~= nil then
		cj = 5
	end

	for q = 1, #jn do
		if ygsj() - cj <= (洗宠特殊技能概率[jn[q]] or 洗宠技能概率) then
			table.insert(jn0, jn[q])
		end
	end

	for i = 1, #jn1 do
		table.insert(jn0, jn1[i])
	end

	if 变异 == true and ygsj() - cj <= 变异多技能概率 then
		local jnlb = 列表模式转换(jn0)
		local aa = ""

		while true do
			aa = 取低级要诀()

			if jnlb[aa] == nil then
				break
			end
		end

		table.insert(jn0, aa)
	end

	jn0 = 删除重复(jn0)

	return jn0
end

一级符石 = {
	"冰符石",
	"土符石",
	"雷符石",
	"电符石",
	"风符石",
	"炎符石",
	"火符石"
}
二级符石 = {
	"红云符石",
	"碧玉符石",
	"金光符石",
	"天神符石",
	"飘渺符石",
	"天仙符石",
	"霞光符石",
	"逍遥符石"
}
三级符石 = {
	"虹珀符石",
	"陌影符石",
	"北冥符石",
	"灵月符石",
	"锦瑟符石",
	"银光符石",
	"清心符石",
	"星辰符石",
	"雪月符石",
	"玄魂符石",
	"乾坤符石",
	"珍珀符石",
	"银竹符石",
	"神川符石",
	"玲珑符石",
	"暮影符石",
	"天珍符石",
	"九影符石",
	"百冥符石",
	"莫念符石",
	"醉魂符石",
	"玄羽符石",
	"霸风符石",
	"无相符石",
	"无极符石",
	"紫晶符石",
	"圣火符石",
	"昔光符石",
	"子蚀符石",
	"流风符石",
	"地炎符石",
	"素影符石",
	"燕灵符石",
	"降龙符石",
	"苍玉符石",
	"流魂符石",
	"九凤符石",
	"墨陀符石",
	"南夕符石",
	"引幽符石",
	"波涛符石",
	"铃星符石",
	"狂念符石",
	"乱花符石",
	"幽月符石",
	"两仪符石",
	"七情符石",
	"召影符石"
}
新三级符石 = {
	"太极符石",
	"阴仪符石",
	"阳仪符石",
	"太阴符石",
	"少阴符石",
	"少阳符石",
	"太阳符石"
}
封印状态列表 = {
	全部 = {
		"妖风四起",
		"一笑倾城",
		"落魄符",
		"誓血之祭",
		"象形",
		"碎玉弄影",
		"冰川怒",
		"反间之计",
		"诱袭",
		"锋芒毕露",
		"催眠符",
		"失心符",
		"落魄符",
		"失忆符",
		"追魂符",
		"恐怖",
		"晕眩",
		"离魂符",
		"失魂符",
		"定身符",
		"莲步轻舞",
		"如花解语",
		"似玉生香",
		"娉婷袅娜",
		"镇妖",
		"错乱",
		"百万神兵",
		"日月乾坤",
		"威慑",
		"含情脉脉",
		"夺魄令1",
		"夺魄令",
		"惊魂掌",
		"煞气诀",
		"冲击"
	},
	全部1 = {
		日月乾坤 = 1,
		定身符 = 1,
		失心符 = 1,
		誓血之祭 = 1,
		离魂符 = 1,
		追魂符 = 1,
		娉婷袅娜 = 1,
		如花解语 = 1,
		诱袭 = 1,
		象形 = 1,
		恐怖 = 1,
		惊魂掌 = 1,
		煞气诀 = 1,
		夺魄令1 = 1,
		反间之计 = 1,
		错乱 = 1,
		夺魄令 = 1,
		威慑 = 1,
		碎玉弄影 = 1,
		落魄符 = 1,
		莲步轻舞 = 1,
		百万神兵 = 1,
		妖风四起 = 1,
		晕眩 = 1,
		失魂符 = 1,
		似玉生香 = 1,
		镇妖 = 1,
		锋芒毕露 = 1,
		冰川怒 = 1,
		催眠符 = 1,
		一笑倾城 = 1,
		失忆符 = 1,
		冲击 = 1,
		含情脉脉 = 1
	},
	不可攻击 = {
		追魂符 = 1,
		誓血之祭 = 1,
		定身符 = 1,
		楚楚可怜 = 1,
		含情脉脉 = 1,
		横扫千军 = 1,
		似玉生香 = 1,
		如花解语 = 1,
		连环击 = 1,
		象形 = 1,
		晕眩 = 1,
		慧眼 = 1,
		夺魄令1 = 1,
		煞气诀 = 1,
		威慑 = 1,
		碎玉弄影 = 1,
		鹰击 = 1,
		冰川怒 = 1,
		催眠符 = 1,
		百万神兵 = 1,
		冲击 = 1,
		日月乾坤 = 1
	},
	不可法术 = {
		妖风四起 = 1,
		晕眩 = 1,
		失心符 = 1,
		夺魄令 = 1,
		日月乾坤 = 1,
		横扫千军 = 1,
		誓血之祭 = 1,
		修罗隐身 = 1,
		离魂符 = 1,
		象形 = 1,
		反间之计 = 1,
		错乱 = 1,
		煞气诀 = 1,
		威慑 = 1,
		碎玉弄影 = 1,
		落魄符 = 1,
		莲步轻舞 = 1,
		慧眼 = 1,
		诱袭 = 1,
		失魂符 = 1,
		疯狂 = 1,
		似玉生香 = 1,
		连环击 = 1,
		锋芒毕露 = 1,
		楚楚可怜 = 1,
		顺势而为 = 1,
		鹰击 = 1,
		冰川怒 = 1,
		催眠符 = 1,
		一笑倾城 = 1,
		血雨 = 1,
		冲击 = 1,
		含情脉脉 = 1
	},
	不可特技 = {
		诱袭 = 1,
		镇妖 = 1,
		楚楚可怜 = 1,
		誓血之祭 = 1,
		晕眩 = 1,
		横扫千军 = 1,
		娉婷袅娜 = 1,
		连环击 = 1,
		象形 = 1,
		反间之计 = 1,
		锋芒毕露 = 1,
		煞气诀 = 1,
		威慑 = 1,
		鹰击 = 1,
		催眠符 = 1,
		血雨 = 1,
		失忆符 = 1,
		冲击 = 1,
		日月乾坤 = 1
	},
	休息状态 = {
		"横扫千军",
		"破釜沉舟",
		"披挂上阵",
		"幸运一击",
		"鹰击",
		"连环击"
	},
	毒状态 = {
		"毒",
		"尸腐毒",
		"尸腐毒 ",
		"猛毒"
	}
}
增益状态列表 = {
	全部1 = {}
}
