取传送点 = function(地图ID)
	local 传送 = {}

	if 地图ID == 1501 then
		传送[1] = {
			切换 = "建邺城进建邺杂货铺",
			x = 115,
			y = 13
		}
		传送[2] = {
			切换 = "建邺城进建邺衙门",
			x = 147,
			y = 59
		}
		传送[3] = {
			切换 = "建邺城进建邺合生记",
			x = 128,
			y = 102
		}
		传送[4] = {
			切换 = "建邺城进建邺兵铁铺",
			x = 75.7,
			y = 131.3
		}
		传送[5] = {
			切换 = "建邺城进建邺布庄",
			x = 172,
			y = 108
		}
		传送[6] = {
			切换 = "建邺城进建邺回春堂",
			x = 219.7,
			y = 136.2
		}
		传送[7] = {
			切换 = "建邺城进东海湾旧",
			x = 242,
			y = 12
		}
		传送[8] = {
			切换 = "建邺城进东海湾新",
			x = 272,
			y = 113
		}
		传送[9] = {
			切换 = "建邺城进建邺钱庄",
			x = 237,
			y = 63
		}
		传送[10] = {
			切换 = "建邺城进建邺李府",
			x = 4,
			y = 59
		}
		传送[11] = {
			切换 = "建邺城进建邺周猎户家",
			x = 244,
			y = 121
		}
		传送[12] = {
			切换 = "建邺城进建邺普通民居",
			x = 258,
			y = 55
		}
	elseif 地图ID >= 100000 and 地图ID <= 400000000 then
		local res = tonumber(string.sub(地图ID, 1, 1))

		if res == 1 then
			传送[1] = {
				切换 = "庭院进长安城",
				x = 8,
				y = 80
			}
			传送[2] = {
				切换 = "庭院进室内",
				x = 71,
				y = 30
			}
		elseif res == 2 then
			传送[1] = {
				切换 = "室内进庭院",
				x = 45,
				y = 69
			}
		end
	elseif 地图ID == 1505 then
		传送[1] = {
			切换 = "建邺杂货铺出建邺城",
			x = 29,
			y = 33
		}
	elseif 地图ID == 1537 then
		传送[1] = {
			切换 = "建邺衙门出建邺城",
			x = 9,
			y = 29
		}
	elseif 地图ID == 1523 then
		传送[1] = {
			切换 = "建邺合生记出建邺城",
			x = 10,
			y = 25
		}
	elseif 地图ID == 1502 then
		传送[1] = {
			切换 = "建邺兵铁铺出建邺城",
			x = 9,
			y = 20
		}
	elseif 地图ID == 1503 then
		传送[1] = {
			切换 = "建邺布庄出建邺城",
			x = 11,
			y = 22
		}
	elseif 地图ID == 1504 then
		传送[1] = {
			切换 = "建邺回春堂出建邺城",
			x = 28.4,
			y = 24.3
		}
	elseif 地图ID == 1524 then
		传送[1] = {
			切换 = "建邺钱庄出建邺城",
			x = 17,
			y = 25
		}
	elseif 地图ID == 1526 then
		传送[1] = {
			切换 = "建邺周猎户家出建邺城",
			x = 31,
			y = 29
		}
	elseif 地图ID == 1525 then
		传送[1] = {
			切换 = "建邺普通民居出建邺城",
			x = 11,
			y = 19
		}
	elseif 地图ID == 1527 then
		传送[1] = {
			切换 = "建邺李府出建邺城",
			x = 32.3,
			y = 27.8
		}
		传送[2] = {
			切换 = "建邺李府进建邺李善人家",
			x = 5,
			y = 20
		}
	elseif 地图ID == 1534 then
		传送[1] = {
			切换 = "建邺李善人家出建邺李府",
			x = 41,
			y = 19
		}
	elseif 地图ID == 1003 then
		传送[1] = {
			切换 = "桃源镇到东海湾",
			x = 17,
			y = 95
		}
	elseif 地图ID == 1506 then
		传送[1] = {
			切换 = "东海湾进建邺城旧",
			x = 4,
			y = 36
		}
		传送[2] = {
			切换 = "东海湾进建邺城新",
			x = 5,
			y = 112
		}
		传送[3] = {
			切换 = "东海湾进东海海底",
			x = 89,
			y = 109
		}
		传送[4] = {
			切换 = "东海湾到桃源镇",
			x = 31,
			y = 8
		}
	elseif 地图ID == 6044 then
		传送[1] = {
			切换 = "梦战东海湾进建邺城旧",
			x = 4,
			y = 36
		}
		传送[2] = {
			切换 = "梦战东海湾进建邺城新",
			x = 5,
			y = 112
		}
		传送[3] = {
			切换 = "梦战东海湾进东海岩洞",
			x = 91,
			y = 81
		}
		传送[4] = {
			切换 = "梦战东海湾进东海海底",
			x = 89,
			y = 109
		}
	elseif 地图ID == 6043 then
		传送[1] = {
			切换 = "建邺城进东海湾旧",
			x = 242,
			y = 12
		}
		传送[2] = {
			切换 = "建邺城进东海湾新",
			x = 272,
			y = 113
		}
	elseif 地图ID == 1126 then
		传送[1] = {
			切换 = "东海岩洞出东海湾",
			x = 10,
			y = 72
		}
		传送[2] = {
			切换 = "东海岩洞传送女魃墓",
			x = 108,
			y = 16
		}
	elseif 地图ID == 6045 then
		传送[1] = {
			切换 = "梦战东海岩洞出东海湾",
			x = 10,
			y = 72
		}
	elseif 地图ID == 1116 then
		传送[1] = {
			切换 = "龙宫进水晶宫",
			x = 114,
			y = 52
		}
		传送[2] = {
			切换 = "龙宫进海底迷宫一层",
			x = 206,
			y = 6
		}
		传送[3] = {
			切换 = "龙宫进水晶宫1",
			x = 132,
			y = 52
		}
	elseif 地图ID == 1117 then
		传送[1] = {
			切换 = "水晶宫出龙宫",
			x = 16.4,
			y = 34.6
		}
		传送[2] = {
			切换 = "水晶宫出龙宫1",
			x = 50.4,
			y = 33
		}
	elseif 地图ID == 1118 then
		传送[1] = {
			切换 = "海底迷宫一层进龙宫",
			x = 5,
			y = 42
		}
		传送[2] = {
			切换 = "海底迷宫一层进海底迷宫二层",
			x = 58,
			y = 8
		}
		传送[3] = {
			切换 = "海底迷宫一层进海底迷宫三层",
			x = 14,
			y = 7
		}
	elseif 地图ID == 1119 then
		传送[1] = {
			切换 = "海底迷宫二层进海底迷宫一层",
			x = 6,
			y = 43
		}
		传送[2] = {
			切换 = "海底迷宫二层进海底迷宫五层",
			x = 53,
			y = 6
		}
	elseif 地图ID == 1120 then
		传送[1] = {
			切换 = "海底迷宫三层进海底迷宫一层",
			x = 56,
			y = 40
		}
		传送[2] = {
			切换 = "海底迷宫三层进海底迷宫四层",
			x = 57,
			y = 5
		}
	elseif 地图ID == 1121 then
		传送[1] = {
			切换 = "海底迷宫四层进海底迷宫三层",
			x = 4,
			y = 43
		}
		传送[2] = {
			切换 = "海底迷宫四层进海底迷宫五层",
			x = 55,
			y = 42
		}
	elseif 地图ID == 1532 then
		传送[1] = {
			切换 = "海底迷宫五层进海底迷宫二层",
			x = 20,
			y = 42
		}
		传送[2] = {
			切换 = "海底迷宫五层进海底迷宫四层",
			x = 4,
			y = 5
		}
	elseif 地图ID == 6046 then
		传送[1] = {
			切换 = "梦战东海海底进东海湾",
			x = 11,
			y = 12.2
		}
	elseif 地图ID == 1507 then
		传送[1] = {
			切换 = "东海海底进东海湾",
			x = 11,
			y = 12.2
		}
		传送[2] = {
			切换 = "东海海底进沉船",
			x = 89,
			y = 13.8
		}
	elseif 地图ID == 1508 then
		传送[1] = {
			切换 = "沉船出东海海底",
			x = 22,
			y = 6
		}
		传送[2] = {
			切换 = "沉船进沉船内室",
			x = 75,
			y = 69
		}
	elseif 地图ID == 1509 then
		传送[1] = {
			切换 = "沉船内室出沉船",
			x = 11,
			y = 14
		}
	elseif 地图ID == 1193 then
		传送[1] = {
			切换 = "江南野外传送建邺城",
			x = 156,
			y = 64
		}
		传送[2] = {
			切换 = "江南野外传送长安",
			x = 20,
			y = 10
		}
		传送[3] = {
			切换 = "江南野外传送南岭山",
			x = 106,
			y = 10
		}
	elseif 地图ID == 1001 then
		传送[1] = {
			切换 = "长安传送江南野外",
			x = 540,
			y = 277
		}
		传送[2] = {
			切换 = "长安传送长安酒店一楼",
			x = 461,
			y = 112
		}
		传送[3] = {
			切换 = "长安传送化生寺",
			x = 502,
			y = 8
		}
		传送[4] = {
			切换 = "长安传送万胜兵器铺",
			x = 475.6,
			y = 238
		}
		传送[5] = {
			切换 = "长安传送锦绣饰品店",
			x = 394,
			y = 265
		}
		传送[6] = {
			切换 = "长安传送张记布庄",
			x = 368,
			y = 240
		}
		传送[7] = {
			切换 = "长安传送云来酒店",
			x = 436,
			y = 219
		}
		传送[8] = {
			切换 = "长安传送大雁塔一层路口1",
			x = 447,
			y = 33
		}
		传送[9] = {
			切换 = "长安传送大雁塔一层路口2",
			x = 475,
			y = 33
		}
		传送[10] = {
			切换 = "长安传送大唐官府",
			x = 308,
			y = 4
		}
		传送[11] = {
			切换 = "长安传送大唐国境",
			x = 5,
			y = 276
		}
		传送[12] = {
			切换 = "长安传送回春堂",
			x = 487,
			y = 120.7
		}
		传送[13] = {
			切换 = "长安传送留香阁",
			x = 218,
			y = 244.5
		}
		传送[14] = {
			切换 = "长安传送长风镖局",
			x = 529,
			y = 125.5
		}
		传送[15] = {
			切换 = "长安传送国子监",
			x = 281.2,
			y = 77.6
		}
		传送[16] = {
			切换 = "长安传送金銮殿",
			x = 100.5,
			y = 46.8
		}
		传送[17] = {
			切换 = "长安传送书香斋",
			x = 518,
			y = 206
		}
		传送[18] = {
			切换 = "长安传送冯记铁铺",
			x = 485,
			y = 182
		}
		传送[19] = {
			切换 = "长安传送广源钱庄",
			x = 513,
			y = 82
		}
		传送[20] = {
			切换 = "长安传送丞相府",
			x = 161,
			y = 140
		}
	elseif 地图ID == 1049 then
		传送[1] = {
			切换 = "丞相府传送长安",
			x = 61,
			y = 44
		}
	elseif 地图ID == 1013 then
		传送[1] = {
			切换 = "广源钱庄传送长安",
			x = 17,
			y = 31
		}
	elseif 地图ID == 1019 then
		传送[1] = {
			切换 = "书香斋传送长安",
			x = 15,
			y = 29
		}
	elseif 地图ID == 1025 then
		传送[1] = {
			切换 = "冯记铁铺传送长安",
			x = 16,
			y = 24
		}
	elseif 地图ID == 1044 then
		传送[1] = {
			切换 = "金銮殿传送长安",
			x = 102.5,
			y = 78
		}
	elseif 地图ID == 1028 then
		传送[1] = {
			切换 = "长安酒店一楼传送长安",
			x = 14,
			y = 39
		}
		传送[2] = {
			切换 = "长安酒店一楼传送长安酒店二楼",
			x = 31.2,
			y = 14.9
		}
	elseif 地图ID == 1029 then
		传送[1] = {
			切换 = "长安酒店二楼传送长安酒店一楼",
			x = 36,
			y = 15
		}
	elseif 地图ID == 1198 then
		传送[1] = {
			切换 = "大唐官府传送长安",
			x = 162,
			y = 97.5
		}
		传送[2] = {
			切换 = "大唐官府传送程咬金府",
			x = 77.3,
			y = 56
		}
	elseif 地图ID == 1054 then
		传送[1] = {
			切换 = "程咬金府传送大唐官府",
			x = 38.5,
			y = 29
		}
	elseif 地图ID == 1002 then
		传送[1] = {
			切换 = "化生寺传送长安",
			x = 4,
			y = 92
		}
		传送[2] = {
			切换 = "化生寺传送光华殿",
			x = 58,
			y = 56
		}
		传送[3] = {
			切换 = "化生寺传送藏经阁",
			x = 91,
			y = 40
		}
	elseif 地图ID == 1043 then
		传送[1] = {
			切换 = "藏经阁传送化生寺",
			x = 9.9,
			y = 16.4
		}
	elseif 地图ID == 1528 then
		传送[1] = {
			切换 = "光华殿传送化生寺",
			x = 12,
			y = 26
		}
	elseif 地图ID == 1004 then
		传送[1] = {
			切换 = "大雁塔一层路口1传送长安",
			x = 30.2,
			y = 59.8
		}
		传送[2] = {
			切换 = "大雁塔一层路口2传送长安",
			x = 108,
			y = 60
		}
		传送[3] = {
			切换 = "大雁塔一层传送大雁塔二层",
			x = 69,
			y = 4
		}
	elseif 地图ID == 1005 then
		传送[1] = {
			切换 = "大雁塔二层传送大雁塔一层",
			x = 65,
			y = 16
		}
		传送[2] = {
			切换 = "大雁塔二层传送大雁塔三层",
			x = 78,
			y = 62
		}
	elseif 地图ID == 1006 then
		传送[1] = {
			切换 = "大雁塔三层传送大雁塔二层",
			x = 67,
			y = 66
		}
		传送[2] = {
			切换 = "大雁塔三层传送大雁塔四层",
			x = 67,
			y = 9
		}
	elseif 地图ID == 1007 then
		传送[1] = {
			切换 = "大雁塔四层传送大雁塔三层",
			x = 60,
			y = 24
		}
		传送[2] = {
			切换 = "大雁塔四层传送大雁塔五层",
			x = 100,
			y = 23
		}
	elseif 地图ID == 1008 then
		传送[1] = {
			切换 = "大雁塔五层传送大雁塔四层",
			x = 93,
			y = 29
		}
		传送[2] = {
			切换 = "大雁塔五层传送大雁塔六层",
			x = 16,
			y = 38
		}
	elseif 地图ID == 1090 then
		传送[1] = {
			切换 = "大雁塔六层传送大雁塔五层",
			x = 15,
			y = 40
		}
		传送[2] = {
			切换 = "大雁塔六层传送大雁塔七层",
			x = 62,
			y = 36
		}
	elseif 地图ID == 1009 then
		传送[1] = {
			切换 = "大雁塔七层传送大雁塔六层",
			x = 38,
			y = 34
		}
	elseif 地图ID == 1020 then
		传送[1] = {
			切换 = "万胜兵器铺传送长安",
			x = 11.8,
			y = 22.1
		}
	elseif 地图ID == 1017 then
		传送[1] = {
			切换 = "锦绣饰品店传送长安",
			x = 38,
			y = 28
		}
	elseif 地图ID == 1022 then
		传送[1] = {
			切换 = "张记布庄传送长安",
			x = 33,
			y = 24
		}
	elseif 地图ID == 1030 then
		传送[1] = {
			切换 = "云来酒店传送长安",
			x = 9,
			y = 23
		}
	elseif 地图ID == 1016 then
		传送[1] = {
			切换 = "回春堂传送长安",
			x = 10,
			y = 27
		}
	elseif 地图ID == 1033 then
		传送[1] = {
			切换 = "留香阁传送长安",
			x = 51,
			y = 43.3
		}
	elseif 地图ID == 1024 then
		传送[1] = {
			切换 = "长风镖局传送长安",
			x = 8,
			y = 25
		}
		传送[2] = {
			切换 = "长风镖局传送长安",
			x = 29,
			y = 36
		}
	elseif 地图ID == 1026 then
		传送[1] = {
			切换 = "国子监传送长安",
			x = 58.5,
			y = 39.8
		}
	elseif 地图ID == 1092 then
		传送[1] = {
			切换 = "傲来国传送女儿村",
			x = 6,
			y = 11
		}
		传送[2] = {
			切换 = "傲来国传送傲来武器店",
			x = 130,
			y = 109
		}
		传送[3] = {
			切换 = "傲来国传送花果山",
			x = 216,
			y = 9
		}
		传送[4] = {
			切换 = "傲来国传送傲来国客栈",
			x = 180,
			y = 120
		}
		传送[5] = {
			切换 = "傲来国传送傲来国杂货店",
			x = 98,
			y = 131
		}
		传送[6] = {
			切换 = "傲来国传送傲来国药店",
			x = 56,
			y = 110.2
		}
		传送[7] = {
			切换 = "傲来国传送傲来国服饰店",
			x = 30.7,
			y = 78.6
		}
		传送[8] = {
			切换 = "傲来国传送傲来圣殿",
			x = 138,
			y = 44
		}
		传送[9] = {
			切换 = "傲来国传送傲来钱庄",
			x = 103,
			y = 91
		}
	elseif 地图ID == 1099 then
		传送[1] = {
			切换 = "傲来钱庄传送傲来国",
			x = 52,
			y = 37
		}
	elseif 地图ID == 1100 then
		传送[1] = {
			切换 = "傲来圣殿传送傲来国",
			x = 15,
			y = 33
		}
	elseif 地图ID == 1093 then
		传送[1] = {
			切换 = "傲来国客栈传送傲来国",
			x = 43,
			y = 34
		}
	elseif 地图ID == 1104 then
		传送[1] = {
			切换 = "傲来国药店传送傲来国",
			x = 42,
			y = 35
		}
	elseif 地图ID == 1105 then
		传送[1] = {
			切换 = "傲来国杂货店传送傲来国",
			x = 33,
			y = 28
		}
	elseif 地图ID == 1095 then
		传送[1] = {
			切换 = "傲来国服饰店传送傲来国",
			x = 39.3,
			y = 29.7
		}
	elseif 地图ID == 1514 then
		传送[1] = {
			切换 = "花果山传送傲来国",
			x = 5,
			y = 110
		}
		传送[2] = {
			切换 = "花果山传送北俱芦洲",
			x = 20,
			y = 15
		}
		传送[3] = {
			切换 = "花果山传送水帘洞",
			x = 65.5,
			y = 48.4
		}
		传送[4] = {
			切换 = "花果山传送海底迷宫1层",
			x = 103,
			y = 112
		}
		传送[5] = {
			切换 = "花果山传送幻境花果山",
			x = 145,
			y = 101
		}
	elseif 地图ID == 1103 then
		传送[1] = {
			切换 = "水帘洞传送花果山",
			x = 3,
			y = 47
		}
	elseif 地图ID == 1174 then
		传送[1] = {
			切换 = "北俱芦洲传送花果山",
			x = 197,
			y = 64
		}
		传送[2] = {
			切换 = "北俱芦洲传送龙窟",
			x = 10,
			y = 89
		}
		传送[3] = {
			切换 = "北俱芦洲传送凤巢",
			x = 86,
			y = 19
		}
	elseif 地图ID == 1177 then
		传送[1] = {
			切换 = "龙窟一层传送北俱芦洲",
			x = 152,
			y = 87
		}
		传送[2] = {
			切换 = "龙窟一层传送龙窟二层",
			x = 17,
			y = 24
		}
	elseif 地图ID == 1178 then
		传送[1] = {
			切换 = "龙窟二层传送龙窟一层",
			x = 130,
			y = 49
		}
		传送[2] = {
			切换 = "龙窟二层传送龙窟三层",
			x = 21,
			y = 65
		}
	elseif 地图ID == 1179 then
		传送[1] = {
			切换 = "龙窟三层传送龙窟二层",
			x = 10,
			y = 5
		}
		传送[2] = {
			切换 = "龙窟三层传送龙窟四层",
			x = 133,
			y = 59
		}
	elseif 地图ID == 1180 then
		传送[1] = {
			切换 = "龙窟四层传送龙窟三层",
			x = 4,
			y = 63
		}
		传送[2] = {
			切换 = "龙窟四层传送龙窟五层",
			x = 124,
			y = 44
		}
	elseif 地图ID == 1181 then
		传送[1] = {
			切换 = "龙窟五层传送龙窟四层",
			x = 131,
			y = 8
		}
		传送[2] = {
			切换 = "龙窟五层传送龙窟六层",
			x = 51,
			y = 61
		}
	elseif 地图ID == 1182 then
		传送[1] = {
			切换 = "龙窟六层传送龙窟七层",
			x = 120,
			y = 18
		}
		传送[2] = {
			切换 = "龙窟六层传送龙窟五层",
			x = 81,
			y = 65
		}
	elseif 地图ID == 1183 then
		传送[1] = {
			切换 = "龙窟七层传送龙窟六层",
			x = 6,
			y = 9
		}
	elseif 地图ID == 1186 then
		传送[1] = {
			切换 = "凤巢一层传送北俱芦洲",
			x = 75,
			y = 6.8
		}
		传送[2] = {
			切换 = "凤巢一层传送凤巢二层",
			x = 52,
			y = 62
		}
	elseif 地图ID == 1187 then
		传送[1] = {
			切换 = "凤巢二层传送凤巢一层",
			x = 43.5,
			y = 3
		}
		传送[2] = {
			切换 = "凤巢二层传送凤巢三层",
			x = 121,
			y = 24
		}
	elseif 地图ID == 1188 then
		传送[1] = {
			切换 = "凤巢三层传送凤巢二层",
			x = 11,
			y = 13
		}
		传送[2] = {
			切换 = "凤巢三层传送凤巢四层",
			x = 123,
			y = 65.5
		}
	elseif 地图ID == 1189 then
		传送[1] = {
			切换 = "凤巢四层传送凤巢三层",
			x = 11,
			y = 11
		}
		传送[2] = {
			切换 = "凤巢四层传送凤巢五层",
			x = 73.6,
			y = 4
		}
	elseif 地图ID == 1190 then
		传送[1] = {
			切换 = "凤巢五层传送凤巢四层",
			x = 74,
			y = 68
		}
		传送[2] = {
			切换 = "凤巢五层传送凤巢六层",
			x = 114,
			y = 4
		}
	elseif 地图ID == 1191 then
		传送[1] = {
			切换 = "凤巢六层传送凤巢五层",
			x = 3.8,
			y = 67
		}
		传送[2] = {
			切换 = "凤巢六层传送凤巢七层",
			x = 122.7,
			y = 27
		}
	elseif 地图ID == 1192 then
		传送[1] = {
			切换 = "凤巢七层传送凤巢六层",
			x = 4,
			y = 32
		}
	elseif 地图ID == 1101 then
		传送[1] = {
			切换 = "傲来武器店传送傲来国",
			x = 8,
			y = 21
		}
	elseif 地图ID == 1142 then
		传送[1] = {
			切换 = "女儿村传送傲来国",
			x = 124,
			y = 134
		}
		传送[2] = {
			切换 = "女儿村传送女儿村村长家",
			x = 14.8,
			y = 18.7
		}
	elseif 地图ID == 1143 then
		传送[1] = {
			切换 = "女儿村村长家传送女儿村",
			x = 34.5,
			y = 26
		}
	elseif 地图ID == 1110 then
		传送[1] = {
			切换 = "大唐国境传送长安",
			x = 340,
			y = 186
		}
		传送[2] = {
			切换 = "大唐国境传送阴曹地府",
			x = 51,
			y = 9
		}
		传送[3] = {
			切换 = "大唐国境传送大唐境外",
			x = 4,
			y = 259
		}
		传送[4] = {
			切换 = "大唐国境传送金山寺",
			x = 123,
			y = 149
		}
		传送[5] = {
			切换 = "大唐国境传送赤水洲",
			x = 170,
			y = 6
		}
	elseif 地图ID == 1153 then
		传送[1] = {
			切换 = "金山寺传送大唐国境",
			x = 41,
			y = 28
		}
	elseif 地图ID == 1168 then
		传送[1] = {
			切换 = "江州府传送大唐国境",
			x = 15,
			y = 26
		}
	elseif 地图ID == 1150 then
		传送[1] = {
			切换 = "凌波城传送大唐国境",
			x = 3,
			y = 93
		}
	elseif 地图ID == 1140 then
		传送[1] = {
			切换 = "普陀山传送大唐国境",
			x = 88,
			y = 67
		}
		传送[2] = {
			切换 = "普陀山传送潮音洞",
			x = 8,
			y = 9
		}
	elseif 地图ID == 1141 then
		传送[1] = {
			切换 = "潮音洞传送普陀山",
			x = 58,
			y = 43
		}
		传送[2] = {
			切换 = "潮音洞传送天鸣洞天",
			x = 38.6,
			y = 9.2
		}
	elseif 地图ID == 16050 then
		传送[1] = {
			切换 = "天鸣洞天传送潮音洞",
			x = 4,
			y = 92
		}
	elseif 地图ID == 2001 then
		传送[1] = {
			切换 = "鬼市传送阴曹地府",
			x = 14,
			y = 121
		}
	elseif 地图ID == 2004 then
		传送[1] = {
			切换 = "方壶传送凌云渡",
			x = 65,
			y = 125
		}
	elseif 地图ID == 2007 then
		传送[1] = {
			切换 = "鬼蜮深渊传送无名鬼城",
			x = 31,
			y = 135
		}
	elseif 地图ID == 1920 then
		传送[1] = {
			切换 = "凌云渡传送方壶",
			x = 25,
			y = 210
		}
		传送[2] = {
			切换 = "凌云渡传送丝绸之路",
			x = 113,
			y = 218
		}
	elseif 地图ID == 1122 then
		传送[1] = {
			切换 = "阴曹地府传送大唐国境",
			x = 146,
			y = 116
		}
		传送[2] = {
			切换 = "阴曹地府传送地狱迷宫一层",
			x = 34,
			y = 9
		}
		传送[3] = {
			切换 = "阴曹地府传送森罗殿",
			x = 30.2,
			y = 51.7
		}
		传送[4] = {
			切换 = "阴曹地府传送轮回司",
			x = 105,
			y = 66
		}
	elseif 地图ID == 1123 then
		传送[1] = {
			切换 = "森罗殿传送地藏王府",
			x = 25.9,
			y = 11.5
		}
		传送[2] = {
			切换 = "森罗殿传送阴曹地府",
			x = 47,
			y = 33
		}
	elseif 地图ID == 1124 then
		传送[1] = {
			切换 = "地藏王府传送森罗殿",
			x = 41,
			y = 29
		}
	elseif 地图ID == 1125 then
		传送[1] = {
			切换 = "轮回司传送阴曹地府",
			x = 29,
			y = 31
		}
	elseif 地图ID == 1127 then
		传送[1] = {
			切换 = "地狱迷宫一层传送阴曹地府",
			x = 7,
			y = 13
		}
		传送[2] = {
			切换 = "地狱迷宫一层传送地狱迷宫二层",
			x = 18,
			y = 75
		}
	elseif 地图ID == 1128 then
		传送[1] = {
			切换 = "地狱迷宫二层传送地狱迷宫一层",
			x = 100,
			y = 11
		}
		传送[2] = {
			切换 = "地狱迷宫二层传送地狱迷宫三层",
			x = 112,
			y = 82
		}
		传送[3] = {
			切换 = "地狱迷宫二层传送地狱迷宫三层2",
			x = 114,
			y = 53
		}
	elseif 地图ID == 1129 then
		传送[1] = {
			切换 = "地狱迷宫三层传送地狱迷宫二层2",
			x = 6,
			y = 70
		}
		传送[2] = {
			切换 = "地狱迷宫三层传送地狱迷宫四层",
			x = 114,
			y = 83
		}
		传送[3] = {
			切换 = "地狱迷宫三层传送地狱迷宫二层1",
			x = 5,
			y = 24
		}
	elseif 地图ID == 1130 then
		传送[1] = {
			切换 = "地狱迷宫四层传送地狱迷宫三层",
			x = 6,
			y = 7
		}
		传送[2] = {
			切换 = "地狱迷宫四层传送无名鬼城",
			x = 85,
			y = 33
		}
	elseif 地图ID == 1202 then
		传送[1] = {
			切换 = "无名鬼城传送地狱迷宫四层",
			x = 16,
			y = 107
		}
		传送[2] = {
			切换 = "无名鬼城传送鬼蜮深渊",
			x = 179,
			y = 30
		}
	elseif 地图ID == 1070 then
		传送[1] = {
			切换 = "长寿村传送长寿郊外",
			x = 153,
			y = 205
		}
		传送[2] = {
			切换 = "长寿村传送方寸山",
			x = 109,
			y = 5
		}
		传送[3] = {
			切换 = "长寿村传送长寿村武器店",
			x = 74,
			y = 103
		}
		传送[4] = {
			切换 = "长寿村传送长寿村服装店",
			x = 83.8,
			y = 136.8
		}
		传送[5] = {
			切换 = "长寿村传送长寿神庙",
			x = 128,
			y = 27
		}
		传送[6] = {
			切换 = "长寿村传送长寿钱庄",
			x = 144,
			y = 114
		}
	elseif 地图ID == 1081 then
		传送[1] = {
			切换 = "长寿钱庄传送长寿村",
			x = 19,
			y = 20
		}
	elseif 地图ID == 1082 then
		传送[1] = {
			切换 = "长寿神庙传送长寿村",
			x = 9,
			y = 19
		}
	elseif 地图ID == 1083 then
		传送[1] = {
			切换 = "长寿村服装店传送长寿村",
			x = 9.9,
			y = 20.7
		}
	elseif 地图ID == 1085 then
		传送[1] = {
			切换 = "长寿村武器店传送长寿村",
			x = 27,
			y = 22.4
		}
	elseif 地图ID == 1091 then
		传送[1] = {
			切换 = "长寿郊外传送长寿村",
			x = 155,
			y = 9
		}
		传送[2] = {
			切换 = "长寿郊外传送柳林坡",
			x = 18,
			y = 57
		}
		传送[3] = {
			切换 = "长寿郊外传送丝绸之路",
			x = 19,
			y = 140
		}
	elseif 地图ID == 1135 then
		传送[1] = {
			切换 = "方寸山传送长寿村",
			x = 5,
			y = 132
		}
		传送[2] = {
			切换 = "方寸山传送灵台宫",
			x = 130,
			y = 30
		}
		传送[3] = {
			切换 = "方寸山传送观星台",
			x = 164.5,
			y = 149
		}
	elseif 地图ID == 1137 then
		传送[1] = {
			切换 = "灵台宫传送方寸山",
			x = 17.3,
			y = 42.7
		}
	elseif 地图ID == 1223 then
		传送[1] = {
			切换 = "观星台传送方寸山",
			x = 51,
			y = 4
		}
	elseif 地图ID == 1111 then
		传送[1] = {
			切换 = "天宫传送凌霄宝殿",
			x = 146,
			y = 104
		}
		传送[2] = {
			切换 = "天宫传送蟠桃园",
			x = 5,
			y = 99
		}
		传送[3] = {
			切换 = "天宫传送月宫",
			x = 44,
			y = 5
		}
		传送[4] = {
			切换 = "天宫传送兜率宫",
			x = 27,
			y = 142
		}
	elseif 地图ID == 1112 then
		传送[1] = {
			切换 = "凌霄宝殿传送天宫",
			x = 79.3,
			y = 58.4
		}
	elseif 地图ID == 1114 then
		传送[1] = {
			切换 = "月宫传送天宫",
			x = 124,
			y = 87
		}
	elseif 地图ID == 1231 then
		传送[1] = {
			切换 = "蟠桃园传送天宫",
			x = 148,
			y = 90
		}
	elseif 地图ID == 1113 then
		传送[1] = {
			切换 = "兜率宫传送天宫",
			x = 43,
			y = 30
		}
	elseif 地图ID == 6041 then
		传送[1] = {
			切换 = "梦战兜率宫传送天宫",
			x = 43,
			y = 30
		}
	elseif 地图ID == 6040 then
		传送[1] = {
			切换 = "梦战天宫传送兜率宫",
			x = 27,
			y = 142
		}
		传送[2] = {
			切换 = "梦战天宫传送凌霄宝殿",
			x = 146,
			y = 104
		}
	elseif 地图ID == 6042 then
		传送[1] = {
			切换 = "梦战凌霄宝殿传送天宫",
			x = 79.3,
			y = 58.4
		}
	elseif 地图ID == 1173 then
		传送[1] = {
			切换 = "大唐境外传送魔王寨",
			x = 57,
			y = 5
		}
		传送[2] = {
			切换 = "大唐境外传送五庄观",
			x = 635,
			y = 41
		}
		传送[3] = {
			切换 = "大唐境外传送狮驼岭",
			x = 4,
			y = 72
		}
		传送[4] = {
			切换 = "大唐境外传送大唐国境",
			x = 636,
			y = 17
		}
		传送[5] = {
			切换 = "大唐境外传送盘丝岭",
			x = 528.5,
			y = 4
		}
		传送[6] = {
			切换 = "大唐境外传送朱紫国",
			x = 6,
			y = 54
		}
		传送[7] = {
			切换 = "大唐境外传送小西天",
			x = 10,
			y = 21
		}
		传送[8] = {
			切换 = "大唐境外传送墨家村",
			x = 236,
			y = 13
		}
		传送[9] = {
			切换 = "大唐境外传送高小姐闺房",
			x = 454,
			y = 22
		}
		传送[10] = {
			切换 = "大唐境外传送高老庄大厅",
			x = 407,
			y = 63
		}
		传送[11] = {
			切换 = "大唐境外传送天机城",
			x = 191,
			y = 114
		}
	elseif 地图ID == 1170 then
		传送[1] = {
			切换 = "高老庄大厅传送大唐境外",
			x = 17,
			y = 31
		}
	elseif 地图ID == 1171 then
		传送[1] = {
			切换 = "高小姐闺房传送大唐境外",
			x = 12,
			y = 20
		}
	elseif 地图ID == 1512 then
		传送[1] = {
			切换 = "魔王寨传送大唐境外",
			x = 13,
			y = 86
		}
		传送[2] = {
			切换 = "魔王寨传送魔王居",
			x = 94,
			y = 15
		}
	elseif 地图ID == 1145 then
		传送[1] = {
			切换 = "魔王居传送魔王寨",
			x = 15,
			y = 29
		}
	elseif 地图ID == 1146 then
		传送[1] = {
			切换 = "五庄观传送大唐境外",
			x = 4,
			y = 71
		}
		传送[2] = {
			切换 = "五庄观传送乾坤殿",
			x = 59,
			y = 35.5
		}
	elseif 地图ID == 1147 then
		传送[1] = {
			切换 = "乾坤殿传送五庄观",
			x = 16,
			y = 25
		}
	elseif 地图ID == 1131 then
		传送[1] = {
			切换 = "狮驼岭传送大唐境外",
			x = 125,
			y = 4
		}
		传送[2] = {
			切换 = "狮驼岭传送狮王洞",
			x = 118,
			y = 68
		}
		传送[3] = {
			切换 = "狮驼岭传送大象洞",
			x = 28,
			y = 11
		}
		传送[4] = {
			切换 = "狮驼岭传送老雕洞",
			x = 15,
			y = 56
		}
	elseif 地图ID == 1132 then
		传送[1] = {
			切换 = "大象洞传送狮驼岭",
			x = 20.8,
			y = 26.2
		}
	elseif 地图ID == 1133 then
		传送[1] = {
			切换 = "老雕洞传送狮驼岭",
			x = 6,
			y = 24
		}
	elseif 地图ID == 1134 then
		传送[1] = {
			切换 = "狮王洞传送狮驼岭",
			x = 15,
			y = 26
		}
	elseif 地图ID == 1513 then
		传送[1] = {
			切换 = "盘丝岭传送大唐境外",
			x = 188.5,
			y = 145.55
		}
		传送[2] = {
			切换 = "盘丝岭传送盘丝洞",
			x = 192,
			y = 19
		}
	elseif 地图ID == 1144 then
		传送[1] = {
			切换 = "盘丝洞传送盘丝岭",
			x = 11,
			y = 55
		}
	elseif 地图ID == 1205 then
		传送[1] = {
			切换 = "战神山传送长安",
			x = 125,
			y = 101
		}
		传送[2] = {
			切换 = "战神山传送神木林",
			x = 9,
			y = 100
		}
	elseif 地图ID == 1138 then
		传送[1] = {
			切换 = "神木林传送战神山",
			x = 77,
			y = 163
		}
		传送[2] = {
			切换 = "神木林传送神木屋",
			x = 47.8,
			y = 93
		}
	elseif 地图ID == 1154 then
		传送[1] = {
			切换 = "神木屋传送神木林",
			x = 48,
			y = 38.5
		}
	elseif 地图ID == 1228 then
		传送[1] = {
			切换 = "碗子山传送大唐境外",
			x = 92,
			y = 184
		}
		传送[2] = {
			切换 = "碗子山传送宝象国",
			x = 3,
			y = 183.2
		}
		传送[3] = {
			切换 = "碗子山传送波月洞",
			x = 69.7,
			y = 12
		}
	elseif 地图ID == 1229 then
		传送[1] = {
			切换 = "波月洞传送碗子山",
			x = 7.8,
			y = 11
		}
	elseif 地图ID == 1139 then
		传送[1] = {
			切换 = "无底洞传送碗子山",
			x = 87,
			y = 39.5
		}
		传送[2] = {
			切换 = "无底洞传送琉璃殿",
			x = 60,
			y = 116
		}
	elseif 地图ID == 1156 then
		传送[1] = {
			切换 = "琉璃殿传送无底洞",
			x = 5,
			y = 49
		}
	elseif 地图ID == 1226 then
		传送[1] = {
			切换 = "宝象国传送丝绸之路",
			x = 4,
			y = 55
		}
		传送[2] = {
			切换 = "宝象国传送宝象国皇宫",
			x = 4,
			y = 10
		}
		传送[3] = {
			切换 = "宝象国传送解阳山",
			x = 126,
			y = 3
		}
		传送[4] = {
			切换 = "宝象国传送麒麟山",
			x = 4.75,
			y = 113.3
		}
		传送[5] = {
			切换 = "宝象国传送碗子山",
			x = 153,
			y = 112.3
		}
	elseif 地图ID == 1227 then
		传送[1] = {
			切换 = "宝象国皇宫传送宝象国",
			x = 72.5,
			y = 51
		}
	elseif 地图ID == 1042 then
		传送[1] = {
			切换 = "解阳山传送子母河底",
			x = 7,
			y = 85.9
		}
		传送[2] = {
			切换 = "解阳山传送宝象国",
			x = 113,
			y = 90
		}
	elseif 地图ID == 1041 then
		传送[1] = {
			切换 = "子母河底传送解阳山",
			x = 72.5,
			y = 4.5
		}
		传送[2] = {
			切换 = "子母河底传送西梁女国",
			x = 15.2,
			y = 86.2
		}
	elseif 地图ID == 1040 then
		传送[1] = {
			切换 = "西梁女国传送子母河底",
			x = 156.4,
			y = 111.1
		}
	elseif 地图ID == 1210 then
		传送[1] = {
			切换 = "麒麟山传送太岁府",
			x = 16,
			y = 17
		}
		传送[2] = {
			切换 = "麒麟山传送朱紫国",
			x = 181,
			y = 139
		}
	elseif 地图ID == 1211 then
		传送[1] = {
			切换 = "太岁府传送麒麟山",
			x = 57.5,
			y = 91.3
		}
	elseif 地图ID == 1235 then
		传送[1] = {
			切换 = "丝绸之路传送须弥东界",
			x = 214,
			y = 6.5
		}
		传送[2] = {
			切换 = "丝绸之路传送比丘国",
			x = 348.4,
			y = 92.5
		}
		传送[3] = {
			切换 = "丝绸之路传送凌云渡",
			x = 5,
			y = 92
		}
		传送[4] = {
			切换 = "丝绸之路传送朱紫国",
			x = 308,
			y = 3
		}
		传送[5] = {
			切换 = "丝绸之路传送宝象国",
			x = 391,
			y = 5
		}
		传送[6] = {
			切换 = "丝绸之路传长寿郊外",
			x = 596,
			y = 9
		}
	elseif 地图ID == 1232 then
		传送[1] = {
			切换 = "比丘国传送丝绸之路",
			x = 3,
			y = 26
		}
		传送[2] = {
			切换 = "比丘国传送柳林坡",
			x = 36.5,
			y = 3.5
		}
	elseif 地图ID == 1233 then
		传送[1] = {
			切换 = "柳林坡传送比丘国",
			x = 8,
			y = 102
		}
		传送[2] = {
			切换 = "柳林坡传送长寿郊外",
			x = 147,
			y = 93
		}
	elseif 地图ID == 1208 then
		传送[1] = {
			切换 = "朱紫国传送大唐境外",
			x = 5,
			y = 115.5
		}
		传送[2] = {
			切换 = "朱紫国传送麒麟山",
			x = 3,
			y = 8
		}
		传送[3] = {
			切换 = "朱紫国传送朱紫国皇宫",
			x = 148,
			y = 20
		}
		传送[4] = {
			切换 = "朱紫国传送丝绸之路",
			x = 159,
			y = 107
		}
	elseif 地图ID == 1209 then
		传送[1] = {
			切换 = "朱紫国皇宫传送朱紫国",
			x = 23,
			y = 61
		}
	elseif 地图ID == 1218 then
		传送[1] = {
			切换 = "墨家村传送大唐境外",
			x = 86,
			y = 163
		}
		传送[2] = {
			切换 = "墨家村传送墨家禁地",
			x = 52,
			y = 7
		}
	elseif 地图ID == 1221 then
		传送[1] = {
			切换 = "墨家禁地传送墨家村",
			x = 25,
			y = 4
		}
	elseif 地图ID == 1203 then
		传送[1] = {
			切换 = "小西天传送大唐境外",
			x = 104,
			y = 235
		}
		传送[2] = {
			切换 = "小西天传送小雷音寺",
			x = 21,
			y = 19
		}
	elseif 地图ID == 1204 then
		传送[1] = {
			切换 = "小雷音寺传送小西天",
			x = 174.4,
			y = 133.4
		}
	elseif 地图ID == 1201 then
		传送[1] = {
			切换 = "女娲神迹传送北俱芦洲",
			x = 40,
			y = 111.5
		}
	elseif 地图ID == 1242 then
		传送[1] = {
			切换 = "须弥东界传送丝绸之路",
			x = 82,
			y = 196
		}
	elseif 地图ID == 1920 then
		传送[1] = {
			切换 = "凌云渡传送丝绸之路",
			x = 114,
			y = 218
		}
	elseif 地图ID == 1209 then
		传送[1] = {
			切换 = "朱紫国皇宫传送朱紫国",
			x = 24,
			y = 59
		}
	elseif 地图ID == 1216 then
		传送[1] = {
			切换 = "仙缘洞天到朱紫国",
			x = 213,
			y = 46
		}
	elseif 地图ID == 1237 then
		传送[1] = {
			切换 = "四方城传送南岭山",
			x = 242,
			y = 5
		}
	elseif 地图ID == 1876 then
		传送[1] = {
			切换 = "南岭山传送四方城",
			x = 4,
			y = 99
		}
		传送[2] = {
			切换 = "南岭山传送江南野外",
			x = 145,
			y = 72
		}
	elseif 地图ID == 1251 then
		传送[1] = {
			切换 = "幻境花果山传送花果山",
			x = 12,
			y = 22
		}
	elseif 地图ID == 1258 then
		传送[1] = {
			切换 = "赤水洲传送女魃墓",
			x = 100,
			y = 17
		}
		传送[2] = {
			切换 = "赤水洲传送大唐国境",
			x = 153,
			y = 89
		}
	elseif 地图ID == 1249 then
		传送[1] = {
			切换 = "女魃墓传送女魃墓室内",
			x = 82,
			y = 25
		}
		传送[2] = {
			切换 = "女魃墓传送东海岩洞",
			x = 10,
			y = 130
		}
		传送[3] = {
			切换 = "女魃墓传送赤水洲",
			x = 76,
			y = 113
		}
	elseif 地图ID == 1252 then
		传送[1] = {
			切换 = "女魃墓室内传送女魃墓",
			x = 18,
			y = 28
		}
	elseif 地图ID == 1250 then
		传送[1] = {
			切换 = "天机城传送天机堂",
			x = 137,
			y = 38
		}
		传送[2] = {
			切换 = "天机城传送大唐境外",
			x = 20,
			y = 138
		}
	elseif 地图ID == 1253 then
		传送[1] = {
			切换 = "天机堂传送天机城",
			x = 44,
			y = 133
		}
	elseif 地图ID == 1340 then
		传送[1] = {
			切换 = "初级庭院传送长安",
			x = 4,
			y = 36
		}
		传送[2] = {
			切换 = "初级庭院传送庭院内屋",
			x = 46,
			y = 13
		}
	elseif 地图ID == 1341 then
		传送[1] = {
			切换 = "中级庭院传送长安",
			x = 12,
			y = 39
		}
	elseif 地图ID == 1342 then
		传送[1] = {
			切换 = "高级庭院传送长安",
			x = 7,
			y = 52
		}
	elseif 地图ID == 1332 then
		传送[1] = {
			切换 = "庭院内屋传送庭院",
			x = 22,
			y = 41
		}
	end

	return 传送
end
