取门派巡逻地图 = function(m, 地图)
	local cs = nil

	if m == "方寸山" then
		cs = {
			1135,
			1137
		}
	elseif m == "女儿村" then
		cs = {
			1142,
			1143
		}
	elseif m == "神木林" then
		cs = {
			1138,
			1154
		}
	elseif m == "大唐官府" then
		cs = {
			1198,
			1054
		}
	elseif m == "化生寺" then
		cs = {
			1002,
			1528,
			1043
		}
	elseif m == "阴曹地府" then
		cs = {
			1122,
			1123,
			102
		}
	elseif m == "盘丝洞" then
		cs = {
			1513,
			1144
		}
	elseif m == "无底洞" then
		cs = {
			1139,
			1156
		}
	elseif m == "狮驼岭" then
		cs = {
			1131,
			1134
		}
	elseif m == "魔王寨" then
		cs = {
			1512,
			1145
		}
	elseif m == "普陀山" then
		cs = {
			1140,
			1141
		}
	elseif m == "天宫" then
		cs = {
			1111,
			1112
		}
	elseif m == "凌波城" then
		cs = {
			1150
		}
	elseif m == "五庄观" then
		cs = {
			1146,
			1147
		}
	elseif m == "龙宫" then
		cs = {
			1116,
			1117
		}
	elseif m == "女魃墓" then
		cs = {
			1249,
			1252
		}
	elseif m == "天机城" then
		cs = {
			1250,
			1253
		}
	elseif m == "花果山" then
		cs = {
			1251
		}
	elseif m == "九黎城" then
		cs = {
			2008
		}
	end

	if 地图 == nil then
		return cs
	end

	for n = 1, #cs do
		if cs[n] == 地图 then
			return true
		end
	end

	return false
end

取十二生肖任务 = function(m)
	local cs = nil

	if m == "子鼠" then
		cs = {
			1001,
			72,
			63
		}
	elseif m == "丑牛" then
		cs = {
			1001,
			37,
			37
		}
	elseif m == "寅虎" then
		cs = {
			1193,
			46,
			121
		}
	elseif m == "卯兔" then
		cs = {
			1193,
			131,
			82
		}
	elseif m == "辰龙" then
		cs = {
			1501,
			7,
			88
		}
	elseif m == "巳蛇" then
		cs = {
			1501,
			101,
			102
		}
	elseif m == "午马" then
		cs = {
			1506,
			174,
			31
		}
	elseif m == "未羊" then
		cs = {
			1514,
			61,
			125
		}
	elseif m == "申猴" then
		cs = {
			1514,
			109,
			77
		}
	elseif m == "酉鸡" then
		cs = {
			1173,
			76,
			29
		}
	elseif m == "戌狗" then
		cs = {
			1173,
			20,
			18
		}
	elseif m == "亥猪" then
		cs = {
			1173,
			175,
			122
		}
	end

	return cs
end

取门派地图 = function(m)
	local cs = nil

	if m == "方寸山" then
		cs = {
			1135,
			72,
			63
		}
	elseif m == "女儿村" then
		cs = {
			1142,
			37,
			37
		}
	elseif m == "神木林" then
		cs = {
			1138,
			46,
			121
		}
	elseif m == "大唐官府" then
		cs = {
			1198,
			131,
			82
		}
	elseif m == "化生寺" then
		cs = {
			1002,
			7,
			88
		}
	elseif m == "阴曹地府" then
		cs = {
			1122,
			60,
			61
		}
	elseif m == "盘丝洞" then
		cs = {
			1513,
			174,
			31
		}
	elseif m == "无底洞" then
		cs = {
			1139,
			61,
			125
		}
	elseif m == "狮驼岭" then
		cs = {
			1131,
			109,
			77
		}
	elseif m == "魔王寨" then
		cs = {
			1512,
			76,
			29
		}
	elseif m == "普陀山" then
		cs = {
			1140,
			20,
			18
		}
	elseif m == "天宫" then
		cs = {
			1111,
			175,
			122
		}
	elseif m == "凌波城" then
		cs = {
			1150,
			33,
			67
		}
	elseif m == "五庄观" then
		cs = {
			1146,
			26,
			55
		}
	elseif m == "龙宫" then
		cs = {
			1116,
			71,
			77
		}
	elseif m == "天机城" then
		cs = {
			1250,
			63,
			92
		}
	elseif m == "女魃墓" then
		cs = {
			1249,
			51,
			44
		}
	elseif m == "花果山" then
		cs = {
			1251,
			38,
			76
		}
	end

	return cs
end

判断师门召唤兽选项 = function(id, 事件)
	local 任务id = 玩家数据[id].角色:取任务(111)

	if 任务数据[任务id] == nil or 任务数据[任务id].分类 ~= 3 then
		return
	end

	local 选项 = {}
	local 模型 = 任务数据[任务id].bb
	local 要求 = nil

	if 任务数据[任务id].要求 == "武艺超群" then
		要求 = "力量"
	elseif 任务数据[任务id].要求 == "法力高深" then
		要求 = "魔力"
	elseif 任务数据[任务id].要求 == "身强体壮" then
		要求 = "体质"
	elseif 任务数据[任务id].要求 == "刀枪不入" then
		要求 = "耐力"
	elseif 任务数据[任务id].要求 == "身手敏捷" then
		要求 = "敏捷"
	end

	for n = 1, #玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].模型 == 模型 then
			if 要求 == nil then
				选项[#选项 + 1] = {
					对话 = format("%s,等级:%s", 玩家数据[id].召唤兽.数据[n].名称, 玩家数据[id].召唤兽.数据[n].等级),
					编号 = n
				}
			else
				local 通过 = 2

				for i = 1, #玩家数据[id].召唤兽.数据 do
					if i ~= n and 玩家数据[id].召唤兽.数据[n][要求] < 玩家数据[id].召唤兽.数据[i][要求] then
						通过 = 通过 - 1
					end
				end

				if 通过 >= 0 then
					选项[#选项 + 1] = {
						对话 = format("%s,等级:%s", 玩家数据[id].召唤兽.数据[n].名称, 玩家数据[id].召唤兽.数据[n].等级),
						编号 = n
					}
				end
			end
		end
	end

	for n = 1, #选项 do
		if 选项[n].对话 == 事件 then
			玩家数据[id].召唤兽:删除处理(id, 选项[n].编号)
			任务处理类:完成门派任务(id, 3)

			return
		end
	end

	添加最后对话(id, "你所选的这只召唤兽并不是对方想要的")
end

取符合师门召唤兽选项 = function(id)
	local 任务id = 玩家数据[id].角色:取任务(111)

	if 任务数据[任务id] == nil or 任务数据[任务id].分类 ~= 3 then
		return
	end

	local 选项 = {}
	local 模型 = 任务数据[任务id].bb
	local 要求 = nil

	if 任务数据[任务id].要求 == "武艺超群" then
		要求 = "力量"
	elseif 任务数据[任务id].要求 == "法力高深" then
		要求 = "魔力"
	elseif 任务数据[任务id].要求 == "身强体壮" then
		要求 = "体质"
	elseif 任务数据[任务id].要求 == "刀枪不入" then
		要求 = "耐力"
	elseif 任务数据[任务id].要求 == "身手敏捷" then
		要求 = "敏捷"
	end

	for n = 1, #玩家数据[id].召唤兽.数据 do
		if 玩家数据[id].召唤兽.数据[n].模型 == 模型 and 玩家数据[id].召唤兽.数据[n].名称 == 模型 then
			if 要求 == nil then
				选项[#选项 + 1] = format("%s,等级:%s", 玩家数据[id].召唤兽.数据[n].名称, 玩家数据[id].召唤兽.数据[n].等级)
			else
				local 通过 = 2

				for i = 1, #五维列表 do
					if 五维列表[i] ~= 要求 and 玩家数据[id].召唤兽.数据[n][要求] < 玩家数据[id].召唤兽.数据[n][五维列表[i]] then
						通过 = 通过 - 1

						if 通过 < 0 then
							break
						end
					end
				end

				if 通过 >= 0 then
					选项[#选项 + 1] = format("%s,等级:%s", 玩家数据[id].召唤兽.数据[n].名称, 玩家数据[id].召唤兽.数据[n].等级)
				end
			end
		end
	end

	return 选项
end

Q_师门送信 = {
	{
		地图 = 1150,
		名称 = {
			"二郎神"
		}
	},
	{
		地图 = 1141,
		名称 = {
			"观音姐姐"
		}
	},
	{
		地图 = 1124,
		名称 = {
			"地藏王"
		}
	},
	{
		地图 = 1117,
		名称 = {
			"东海龙王"
		}
	},
	{
		地图 = 1054,
		名称 = {
			"程咬金"
		}
	},
	{
		地图 = 1002,
		名称 = {
			"慧海"
		}
	},
	{
		地图 = 1043,
		名称 = {
			"空度禅师"
		}
	},
	{
		地图 = 1143,
		名称 = {
			"孙婆婆"
		}
	},
	{
		地图 = 1137,
		名称 = {
			"菩提祖师"
		}
	},
	{
		地图 = 1112,
		名称 = {
			"李靖"
		}
	},
	{
		地图 = 1145,
		名称 = {
			"牛魔王"
		}
	},
	{
		地图 = 1147,
		名称 = {
			"镇元大仙"
		}
	},
	{
		地图 = 1134,
		名称 = {
			"大大王"
		}
	},
	{
		地图 = 1154,
		名称 = {
			"巫奎虎"
		}
	},
	{
		地图 = 1156,
		名称 = {
			"地涌夫人"
		}
	},
	{
		地图 = 1144,
		名称 = {
			"白晶晶"
		}
	},
	{
		地图 = 1033,
		名称 = {
			"罗百万",
			"陈妈妈",
			"小桃红"
		}
	},
	{
		地图 = 1001,
		名称 = {
			"陈员外",
			"张老财",
			"刘副将",
			"御林军右统领",
			"御林军左统领",
			"怜儿姑娘",
			"月老",
			"小宝",
			"说书先生",
			"马副将",
			"杜少海",
			"皇宫护卫",
			"兰虎",
			"李捕头",
			"建房吏",
			"仓库管理员",
			"礼部侍郎",
			"帮派管理员"
		}
	},
	{
		地图 = 1044,
		名称 = {
			"李世民",
			"魏征",
			"房玄龄"
		}
	},
	{
		地图 = 1049,
		名称 = {
			"殷丞相",
			"殷夫人"
		}
	},
	{
		地图 = 1198,
		名称 = {
			"程夫人",
			"丫鬟",
			"程府护卫"
		}
	},
	{
		地图 = 1019,
		名称 = {
			"颜如玉"
		}
	},
	{
		地图 = 1026,
		名称 = {
			"吴举人"
		}
	},
	{
		地图 = 1025,
		名称 = {
			"冯铁匠"
		}
	},
	{
		地图 = 1024,
		名称 = {
			"郑镖头"
		}
	}
}
Q_押镖数据 = {
	{
		名称 = "二郎神",
		地图 = 1150
	},
	{
		名称 = "观音姐姐",
		地图 = 1141
	},
	{
		名称 = "地藏王",
		地图 = 1124
	},
	{
		名称 = "东海龙王",
		地图 = 1117
	},
	{
		名称 = "程咬金",
		地图 = 1054
	},
	{
		名称 = "空度禅师",
		地图 = 1043
	},
	{
		名称 = "孙婆婆",
		地图 = 1143
	},
	{
		名称 = "菩提祖师",
		地图 = 1137
	},
	{
		名称 = "李靖",
		地图 = 1112
	},
	{
		名称 = "牛魔王",
		地图 = 1145
	},
	{
		名称 = "镇元大仙",
		地图 = 1147
	},
	{
		名称 = "大大王",
		地图 = 1134
	},
	{
		名称 = "巫奎虎",
		地图 = 1154
	},
	{
		名称 = "地涌夫人",
		地图 = 1156
	},
	{
		名称 = "白晶晶",
		地图 = 1144
	}
}
Q_闯关数据 = {
	大唐官府 = {
		y = 46,
		模型 = "剑侠客",
		名称 = "剑侠客",
		方向 = 1,
		x = 139,
		武器 = {
			名称 = "四法青云",
			等级 = 120
		},
		弟子 = {
			"护卫"
		}
	},
	化生寺 = {
		y = 74,
		模型 = "逍遥生",
		名称 = "逍遥生",
		方向 = 1,
		x = 34,
		武器 = {
			名称 = "秋水人家",
			等级 = 120
		},
		弟子 = {
			"古代瑞兽",
			"大力金刚"
		}
	},
	方寸山 = {
		y = 125,
		模型 = "飞燕女",
		名称 = "飞燕女",
		方向 = 1,
		x = 46,
		武器 = {
			名称 = "九天金线",
			等级 = 120
		},
		弟子 = {
			"僵尸",
			"野鬼"
		}
	},
	女儿村 = {
		y = 80,
		模型 = "英女侠",
		名称 = "英女侠",
		方向 = 1,
		x = 81,
		武器 = {
			名称 = "金龙双剪",
			等级 = 120
		},
		弟子 = {
			"如意仙子",
			"星灵仙子"
		}
	},
	神木林 = {
		y = 161,
		模型 = "巫蛮儿",
		名称 = "巫蛮儿",
		方向 = 0,
		x = 42,
		武器 = {
			名称 = "紫金葫芦",
			等级 = 120
		},
		弟子 = {
			"小龙女",
			"白熊"
		}
	},
	盘丝洞 = {
		y = 106,
		模型 = "狐美人",
		名称 = "狐美人",
		方向 = 0,
		x = 145,
		武器 = {
			名称 = "游龙惊鸿",
			等级 = 120
		},
		弟子 = {
			"花妖",
			"狐狸精"
		}
	},
	魔王寨 = {
		y = 43,
		模型 = "巨魔王",
		名称 = "巨魔王",
		方向 = 0,
		x = 32,
		武器 = {
			名称 = "晓风残月",
			等级 = 120
		},
		弟子 = {
			"牛妖"
		}
	},
	狮驼岭 = {
		y = 5,
		模型 = "虎头怪",
		名称 = "虎头怪",
		方向 = 0,
		x = 90,
		武器 = {
			名称 = "元神禁锢",
			等级 = 120
		},
		弟子 = {
			"蝴蝶仙子",
			"雷鸟人"
		}
	},
	阴曹地府 = {
		y = 79,
		模型 = "骨精灵",
		名称 = "骨精灵",
		方向 = 0,
		x = 62,
		武器 = {
			名称 = "九阴勾魂",
			等级 = 120
		},
		弟子 = {
			"幽灵",
			"吸血鬼"
		}
	},
	无底洞 = {
		y = 86,
		模型 = "杀破狼",
		名称 = "杀破狼",
		方向 = 2,
		x = 58,
		武器 = {
			名称 = "冥火薄天",
			等级 = 120
		},
		弟子 = {
			"老虎",
			"黑熊"
		}
	},
	天宫 = {
		y = 132,
		模型 = "舞天姬",
		名称 = "舞天姬",
		方向 = 0,
		x = 195,
		武器 = {
			名称 = "此最相思",
			等级 = 120
		},
		弟子 = {
			"芙蓉仙子"
		}
	},
	普陀山 = {
		y = 50,
		模型 = "玄彩娥",
		名称 = "玄彩娥",
		方向 = 0,
		x = 70,
		武器 = {
			名称 = "青藤玉树",
			等级 = 120
		},
		弟子 = {
			"雾中仙"
		}
	},
	凌波城 = {
		y = 79,
		模型 = "羽灵神",
		名称 = "羽灵神",
		方向 = 1,
		x = 44,
		武器 = {
			名称 = "庄周梦蝶",
			等级 = 120
		},
		弟子 = {
			"凤凰",
			"蛟龙"
		}
	},
	五庄观 = {
		y = 32,
		模型 = "神天兵",
		名称 = "神天兵",
		方向 = 0,
		x = 39,
		武器 = {
			名称 = "九瓣莲花",
			等级 = 120
		},
		弟子 = {
			"天将"
		}
	},
	龙宫 = {
		y = 78,
		模型 = "龙太子",
		名称 = "龙太子",
		方向 = 1,
		x = 71,
		武器 = {
			名称 = "飞龙在天",
			等级 = 120
		},
		弟子 = {
			"小龙女",
			"龟丞相"
		}
	}
}
Q_十二生肖怪物数据 = {
	子鼠 = {
		y = 135,
		地图名称 = "长安城",
		模型 = "鼠先锋",
		名称 = "子鼠",
		方向 = 3,
		x = 54,
		弟子 = {
			"鼠先锋"
		}
	},
	丑牛 = {
		y = 212,
		地图名称 = "长安城",
		模型 = "踏云兽",
		名称 = "丑牛",
		方向 = 1,
		x = 505,
		弟子 = {
			"踏云兽",
			"踏云兽"
		}
	},
	寅虎 = {
		y = 99,
		地图名称 = "江南野外",
		模型 = "噬天虎",
		名称 = "寅虎",
		方向 = 1,
		x = 17,
		弟子 = {
			"噬天虎",
			"噬天虎"
		}
	},
	卯兔 = {
		y = 21,
		地图名称 = "江南野外",
		模型 = "兔子怪",
		名称 = "卯兔",
		方向 = 1,
		x = 137,
		弟子 = {
			"兔子怪",
			"兔子怪"
		}
	},
	辰龙 = {
		y = 9,
		地图名称 = "建邺城",
		模型 = "蛟龙",
		名称 = "辰龙",
		方向 = 0,
		x = 32,
		弟子 = {
			"蛟龙",
			"蛟龙"
		}
	},
	巳蛇 = {
		y = 110,
		地图名称 = "建邺城",
		模型 = "千年蛇魅",
		名称 = "巳蛇",
		方向 = 0,
		x = 263,
		弟子 = {
			"千年蛇魅",
			"千年蛇魅"
		}
	},
	午马 = {
		y = 23,
		地图名称 = "东海湾",
		模型 = "马面",
		名称 = "午马",
		方向 = 0,
		x = 58,
		弟子 = {
			"马面"
		}
	},
	未羊 = {
		y = 68,
		地图名称 = "花果山",
		模型 = "羊头怪",
		名称 = "未羊",
		方向 = 0,
		x = 80,
		弟子 = {
			"羊头怪",
			"羊头怪"
		}
	},
	申猴 = {
		y = 12,
		地图名称 = "花果山",
		模型 = "长眉灵猴",
		名称 = "申猴",
		方向 = 0,
		x = 126,
		弟子 = {
			"长眉灵猴",
			"长眉灵猴"
		}
	},
	酉鸡 = {
		y = 26,
		地图名称 = "大唐境外",
		模型 = "雷鸟人",
		名称 = "酉鸡",
		方向 = 2,
		x = 66,
		弟子 = {
			"雷鸟人",
			"雷鸟人"
		}
	},
	戌狗 = {
		y = 60,
		地图名称 = "大唐境外",
		模型 = "哮天犬",
		名称 = "戌狗",
		方向 = 0,
		x = 300,
		弟子 = {
			"哮天犬"
		}
	},
	亥猪 = {
		y = 89,
		地图名称 = "大唐境外",
		模型 = "野猪",
		名称 = "亥猪",
		方向 = 0,
		x = 576,
		弟子 = {
			"野猪"
		}
	}
}
Q_门派法术1 = {
	大唐官府 = {
		"横扫千军",
		"后发制人"
	},
	化生寺 = {
		"唧唧歪歪",
		"推气过宫",
		"雷击",
		"奔雷咒"
	},
	方寸山 = {
		"落雷符",
		"五雷咒",
		"催眠符",
		"失心符",
		"失魂符",
		"定身符"
	},
	女儿村 = {
		"雨落寒沙",
		"似玉生香",
		"莲步轻舞",
		"如花解语"
	},
	神木林 = {
		"落叶萧萧",
		"荆棘舞",
		"雾杀",
		"星月之惠",
		"蜜润"
	},
	盘丝洞 = {
		"盘丝阵",
		"天罗地网",
		"含情脉脉",
		"勾魂",
		"摄魄"
	},
	魔王寨 = {
		"飞砂走石",
		"三昧真火",
		"牛劲",
		"魔王回首"
	},
	狮驼岭 = {
		"狮搏",
		"威慑",
		"象形",
		"鹰击",
		"连环击"
	},
	阴曹地府 = {
		"阎罗令",
		"判官令",
		"尸腐毒"
	},
	无底洞 = {
		"夺魄令",
		"煞气诀",
		"夺命咒",
		"明光宝烛",
		"地涌金莲"
	},
	天宫 = {
		"天雷斩",
		"五雷轰顶",
		"错乱",
		"百万神兵"
	},
	普陀山 = {
		"靛沧海",
		"日光华",
		"地裂火",
		"苍茫树",
		"紧箍咒",
		"普渡众生"
	},
	凌波城 = {
		"裂石",
		"断岳势",
		"浪涌",
		"惊涛怒",
		"天崩地裂",
		"翻江搅海",
		"碎星诀"
	},
	五庄观 = {
		"飘渺式",
		"日月乾坤",
		"烟雨剑法",
		"生命之泉"
	},
	龙宫 = {
		"龙卷雨击",
		"龙腾",
		"龙吟"
	},
	九黎城 = {
		"横扫千军",
		"后发制人",
		"破釜沉舟",
		"杀气诀"
	}
}
Q_门派法术 = {
	大唐官府 = {
		"横扫千军",
		"后发制人",
		"破釜沉舟",
		"杀气诀"
	},
	化生寺 = {
		"推气过宫",
		"活血",
		"慈航普渡",
		"金刚护体",
		"金刚护法",
		"唧唧歪歪"
	},
	方寸山 = {
		"碎甲符",
		"定身符",
		"失心符",
		"五雷咒",
		"落雷符",
		"分身术"
	},
	女儿村 = {
		"一笑倾城",
		"满天花雨",
		"红袖添香",
		"雨落寒沙"
	},
	神木林 = {
		"落叶萧萧",
		"蜜润",
		"风卷残云"
	},
	盘丝洞 = {
		"含情脉脉",
		"瘴气",
		"魔音摄魂",
		"盘丝阵",
		"幻镜术",
		"天罗地网"
	},
	魔王寨 = {
		"火甲术",
		"摇头摆尾",
		"三昧真火",
		"飞砂走石",
		"牛劲"
	},
	狮驼岭 = {
		"连环击",
		"鹰击",
		"狮搏",
		"象形",
		"变身"
	},
	阴曹地府 = {
		"阎罗令",
		"判官令",
		"百爪狂杀",
		"六道无量",
		"尸腐毒"
	},
	无底洞 = {
		"地涌金莲",
		"夺命咒",
		"金身舍利",
		"摧心术",
		"明光宝烛",
		"同舟共济"
	},
	天宫 = {
		"天雷斩",
		"五雷轰顶",
		"雷霆万钧",
		"天神护体",
		"天神护法"
	},
	普陀山 = {
		"普渡众生",
		"波澜不惊",
		"晶清诀",
		"五行制化",
		"灵动九天"
	},
	凌波城 = {
		"天崩地裂",
		"翻江搅海",
		"碎星诀",
		"浪涌"
	},
	五庄观 = {
		"日月乾坤",
		"飘渺式",
		"烟雨剑法",
		"生命之泉"
	},
	龙宫 = {
		"龙卷雨击",
		"龙腾",
		"二龙戏珠",
		"亢龙归海",
		"雷浪穿云"
	},
	九黎城 = {
		"横扫千军",
		"后发制人",
		"破釜沉舟",
		"杀气诀"
	}
}
Q_门派法攻法术 = {
	化生寺 = {
		"唧唧歪歪"
	},
	方寸山 = {
		"五雷咒",
		"落雷符"
	},
	神木林 = {
		"落叶萧萧",
		"风卷残云"
	},
	魔王寨 = {
		"三昧真火",
		"飞砂走石"
	},
	天宫 = {
		"五雷轰顶",
		"雷霆万钧"
	},
	龙宫 = {
		"龙卷雨击",
		"龙腾",
		"二龙戏珠"
	}
}
孩子门派经脉1 = {
	慈佑 = 1,
	煞气 = 1,
	魔焰滔天 = 1,
	莲动 = 1,
	天命剑法 = 1,
	超导 = 1,
	龙啸 = 1,
	雨杀 = 1,
	怒霆 = 1,
	狂击 = 1,
	佛佑 = 1,
	起雨 = 1,
	震怒 = 1,
	霜雷 = 1,
	圣手 = 1,
	咒术 = 1,
	灵身 = 1,
	悲恸 = 1,
	劳心 = 1,
	迅捷 = 1,
	宁息 = 1,
	倾国 = 1,
	神采 = 1,
	冰爆 = 1,
	困兽之斗 = 1,
	碎玉弄影 = 1,
	法身 = 1,
	千蛛噬魂 = 1,
	磐石 = 1,
	罗网 = 1,
	夜行 = 1,
	金莲 = 1,
	勇进 = 1,
	起搏 = 1,
	波涛 = 1,
	目空 = 1,
	夜之王者 = 1,
	破印 = 1,
	真炎 = 1,
	无敌 = 1,
	滋养 = 1,
	风墙 = 1,
	龙魄 = 1,
	流刚 = 1,
	超级战意 = 1
}
孩子门派经脉 = {
	凌波城 = {
		"超级战意",
		"冰爆",
		"煞气"
	},
	方寸山 = {
		"悲恸",
		"怒霆",
		"超导"
	},
	普陀山 = {
		"莲动",
		"慈佑",
		"劳心"
	},
	五庄观 = {
		"天命剑法",
		"雨杀",
		"起雨"
	},
	盘丝洞 = {
		"罗网",
		"千蛛噬魂",
		"狂击"
	},
	龙宫 = {
		"龙魄",
		"波涛",
		"龙啸"
	},
	魔王寨 = {
		"震怒",
		"真炎",
		"魔焰滔天"
	},
	阴曹地府 = {
		"夜之王者",
		"夜行",
		"破印"
	},
	化生寺 = {
		"圣手",
		"流刚",
		"佛佑"
	},
	大唐官府 = {
		"无敌",
		"勇进",
		"目空"
	},
	神木林 = {
		"咒术",
		"法身",
		"滋养"
	},
	无底洞 = {
		"风墙",
		"灵身",
		"金莲"
	},
	狮驼岭 = {
		"迅捷",
		"宁息",
		"困兽之斗"
	},
	天宫 = {
		"神采",
		"霜雷",
		"起搏"
	},
	女儿村 = {
		"倾国",
		"磐石",
		"碎玉弄影"
	}
}
Q_孩子门派经脉 = {
	大唐官府 = {
		連破 = 1
	},
	化生寺 = {
		明光 = 1
	},
	方寸山 = {},
	女儿村 = {
		自矜 = 1
	},
	神木林 = {},
	盘丝洞 = {},
	魔王寨 = {
		魔冥 = 1
	},
	狮驼岭 = {
		狂怒 = 1
	},
	阴曹地府 = {},
	无底洞 = {},
	天宫 = {},
	普陀山 = {},
	凌波城 = {},
	五庄观 = {
		骤雨 = 1
	},
	龙宫 = {
		龙駭 = 1
	}
}
Q_孩子门派法术 = {
	大唐官府 = {
		"横扫千军",
		"后发制人",
		"先发制人"
	},
	化生寺 = {
		"推气过宫",
		"金刚护体",
		"我佛慈悲"
	},
	方寸山 = {
		"失心符",
		"五雷咒"
	},
	女儿村 = {
		"似玉生香",
		"满天花雨"
	},
	神木林 = {
		"雾杀",
		"蜜润",
		"落叶萧萧"
	},
	盘丝洞 = {
		"含情脉脉",
		"盘丝阵"
	},
	魔王寨 = {
		"三昧真火",
		"飞砂走石"
	},
	狮驼岭 = {
		"鹰击",
		"象形"
	},
	阴曹地府 = {
		"百爪狂杀",
		"尸腐毒"
	},
	无底洞 = {
		"地涌金莲",
		"夺魄令"
	},
	天宫 = {
		"天雷斩",
		"五雷轰顶"
	},
	普陀山 = {
		"普渡众生",
		"杨柳甘露"
	},
	凌波城 = {
		"裂石",
		"浪涌",
		"天崩地裂",
		"翻江搅海"
	},
	五庄观 = {
		"烟雨剑法",
		"飘渺式"
	},
	龙宫 = {
		"龙卷雨击",
		"龙腾"
	}
}
Q_十二生肖法术 = {
	子鼠 = {
		"横扫千军",
		"后发制人"
	},
	丑牛 = {
		"唧唧歪歪",
		"推气过宫",
		"雷击",
		"奔雷咒"
	},
	寅虎 = {
		"落雷符",
		"五雷咒",
		"催眠符",
		"失心符",
		"失魂符",
		"定身符"
	},
	卯兔 = {
		"雨落寒沙",
		"似玉生香",
		"莲步轻舞",
		"如花解语"
	},
	辰龙 = {
		"落叶萧萧",
		"荆棘舞",
		"雾杀",
		"星月之惠",
		"蜜润"
	},
	巳蛇 = {
		"盘丝阵",
		"天罗地网",
		"含情脉脉",
		"勾魂",
		"摄魄"
	},
	午马 = {
		"飞砂走石",
		"三昧真火",
		"牛劲",
		"魔王回首"
	},
	未羊 = {
		"狮搏",
		"威慑",
		"象形",
		"鹰击",
		"连环击"
	},
	申猴 = {
		"阎罗令",
		"判官令",
		"尸腐毒"
	},
	酉鸡 = {
		"夺魄令",
		"煞气诀",
		"夺命咒",
		"明光宝烛",
		"地涌金莲"
	},
	戌狗 = {
		"天雷斩",
		"五雷轰顶",
		"错乱",
		"百万神兵"
	},
	亥猪 = {
		"靛沧海",
		"日光华",
		"地裂火",
		"苍茫树",
		"紧箍咒",
		"普渡众生"
	}
}
Q_门派编号 = {
	"大唐官府",
	"化生寺",
	"方寸山",
	"女儿村",
	"神木林",
	"龙宫",
	"五庄观",
	"凌波城",
	"普陀山",
	"天宫",
	"无底洞",
	"阴曹地府",
	"狮驼岭",
	"魔王寨",
	"盘丝洞"
}
Q_十二生肖编号 = {
	"子鼠",
	"丑牛",
	"寅虎",
	"卯兔",
	"辰龙",
	"巳蛇",
	"午马",
	"未羊",
	"申猴",
	"酉鸡",
	"戌狗",
	"亥猪"
}
Q_水陆大会邀请 = {
	{
		名称 = "代笔师爷",
		x = 483,
		y = 125
	},
	{
		名称 = "瓜农",
		x = 478,
		y = 119
	},
	{
		名称 = "绣娘",
		x = 459,
		y = 162
	},
	{
		名称 = "喜轿轿夫",
		x = 483,
		y = 147
	},
	{
		名称 = "卖艺者",
		x = 430,
		y = 182
	},
	{
		名称 = "乞丐乙",
		x = 455,
		y = 184
	},
	{
		名称 = "阿咪",
		x = 470,
		y = 192
	},
	{
		名称 = "马商",
		x = 407,
		y = 211
	},
	{
		名称 = "小顽童",
		x = 401,
		y = 203
	},
	{
		名称 = "卖花童",
		x = 420,
		y = 219
	},
	{
		名称 = "丫鬟",
		x = 424,
		y = 222
	},
	{
		名称 = "富家小姐",
		x = 431,
		y = 225
	},
	{
		名称 = "卖鱼人",
		x = 442,
		y = 229
	},
	{
		名称 = "面点师傅",
		x = 443,
		y = 223
	},
	{
		名称 = "针线娘子",
		x = 464,
		y = 240
	},
	{
		名称 = "樵夫",
		x = 462,
		y = 262
	},
	{
		名称 = "大财主",
		x = 427,
		y = 228
	},
	{
		名称 = "曾衙役",
		x = 421,
		y = 225
	},
	{
		名称 = "布陈太医",
		x = 370,
		y = 243
	},
	{
		名称 = "游方郎中",
		x = 389,
		y = 234
	}
}
Q_飞升化生推荐 = {
	{
		名称 = "慧觉和尚",
		地图 = 1070
	},
	{
		名称 = "陆萧然",
		地图 = 1070
	},
	{
		名称 = "蝴蝶女",
		地图 = 1070
	},
	{
		名称 = "毛驴张",
		地图 = 1070
	},
	{
		名称 = "海老先生",
		地图 = 1070
	},
	{
		名称 = "钟书生",
		地图 = 1070
	},
	{
		名称 = "许姑娘",
		地图 = 1070
	},
	{
		名称 = "仓库管理员",
		地图 = 1070
	},
	{
		名称 = "凤凰姑娘",
		地图 = 1070
	},
	{
		名称 = "长寿珍品商人",
		地图 = 1070
	},
	{
		名称 = "长寿商人",
		地图 = 1070
	},
	{
		名称 = "长寿货商",
		地图 = 1070
	},
	{
		名称 = "许大娘",
		地图 = 1070
	}
}
Q_低级兽决表 = {
	"高级反震",
	"高级吸血",
	"高级反击",
	"高级连击",
	"高级飞行",
	"高级夜战",
	"高级隐身",
	"高级感知",
	"高级再生",
	"高级冥思",
	"高级慧根",
	"高级必杀",
	"高级幸运",
	"高级神迹",
	"高级招架",
	"高级永恒",
	"高级敏捷",
	"高级强力",
	"高级防御",
	"高级偷袭",
	"高级毒",
	"高级驱鬼",
	"高级鬼魂术",
	"高级魔之心",
	"高级神佑复生",
	"高级精神集中",
	"高级否定信仰",
	"奔雷咒",
	"泰山压顶",
	"水漫金山",
	"地狱烈火",
	"高级法术连击",
	"高级法术暴击",
	"高级法术波动",
	"高级雷属性吸收",
	"高级土属性吸收",
	"高级火属性吸收",
	"高级水属性吸收",
	"反震",
	"吸血",
	"反击",
	"连击",
	"飞行",
	"驱怪",
	"隐身",
	"感知",
	"再生",
	"冥思",
	"慧根",
	"必杀",
	"幸运",
	"神迹",
	"招架",
	"永恒",
	"敏捷",
	"强力",
	"防御",
	"偷袭",
	"毒",
	"驱鬼",
	"鬼魂术",
	"魔之心",
	"神佑复生",
	"精神集中",
	"否定信仰",
	"雷击",
	"落岩",
	"水攻",
	"烈火",
	"法术连击",
	"法术暴击",
	"法术波动",
	"雷属性吸收",
	"土属性吸收",
	"火属性吸收",
	"水属性吸收",
	"迟钝"
}
Q_随机药品 = {
	"金香玉",
	"小还丹",
	"千年保心丹",
	"风水混元丹",
	"定神香",
	"蛇蝎美人",
	"九转回魂丹",
	"佛光舍利子",
	"十香返生丸",
	"金创药",
	"五龙丹",
	"孔雀红",
	"鹿茸",
	"仙狐涎",
	"地狱灵芝",
	"六道轮回",
	"凤凰尾",
	"火凤之睛",
	"龙之心屑",
	"紫石英",
	"白露为霜",
	"熊胆",
	"血色茶花",
	"丁香水",
	"麝香"
}
Q_随机三级药 = {
	"金香玉",
	"小还丹",
	"千年保心丹",
	"风水混元丹",
	"定神香",
	"蛇蝎美人",
	"九转回魂丹",
	"佛光舍利子",
	"十香返生丸",
	"金创药",
	"五龙丹"
}
Q_随机烹饪 = {
	"烤肉",
	"醉生梦死",
	"蛇胆酒",
	"百味酒",
	"梅花酒",
	"长寿面",
	"翡翠豆腐",
	"桂花丸",
	"珍露酒",
	"豆斋果",
	"臭豆腐",
	"佛跳墙",
	"烤鸭",
	"虎骨酒",
	"包子",
	"女儿红"
}
Q_随机材料 = {
	"天蚕丝",
	"玄龟板",
	"阴沉木",
	"麒麟血",
	"金凤羽",
	"补天石",
	"龙之筋"
}
