取神兽资质 = function(造型, 物法)
	if 物法 ~= nil then
		造型 = 造型 .. "_" .. 物法
	end

	local bbs = {}

	if 造型 == "超级神龙" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级驱鬼",
			"高级夜战",
			"幸运",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神龙_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"龙魂",
			"高级法术波动",
			"魔之心",
			"再生"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级腾蛇" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级连击",
			"高级毒",
			"高级夜战",
			"偷袭",
			"敏捷"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级腾蛇_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"地狱烈火",
			"灵能激发",
			"高级法术波动",
			"魔之心",
			"永恒"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级青鸾" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"苍鸾怒击",
			"高级夜战",
			"高级飞行",
			"高级连击",
			"反震"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级青鸾_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级魔之心",
			"高级幸运",
			"高级神佑复生",
			"法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级人参娃娃" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"壁垒击破",
			"高级必杀",
			"高级强力",
			"高级驱鬼",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级人参娃娃_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"泰山压顶",
			"高级法术波动",
			"高级冥思",
			"高级法术暴击",
			"魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级海豚" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"剑荡四方",
			"高级偷袭",
			"高级必杀",
			"高级幸运",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级海豚_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"水漫金山",
			"高级魔之心",
			"高级法术暴击",
			"高级感知",
			"慧根"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神牛" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"力劈华山",
			"高级幸运",
			"高级招架",
			"必杀",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神牛_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术波动",
			"高级法术暴击",
			"奔雷咒",
			"冥思",
			"魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "辛丑神牛" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级连击",
			"高级再生",
			"夜战",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "辛丑神牛_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"神来气旺",
			"地狱烈火",
			"高级法术暴击",
			"高级魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神虎" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级感知",
			"嗜血追击",
			"高级夜战",
			"连击",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神虎_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级驱鬼",
			"高级法术暴击",
			"奔雷咒",
			"魔之心",
			"法术波动"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "壬寅神虎" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"虎虎生风",
			"夜战",
			"气势",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "壬寅神虎_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级驱鬼",
			"虎虎生风",
			"奔雷咒",
			"高级魔之心",
			"法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神兔" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级偷袭",
			"高级连击",
			"高级敏捷",
			"夜战",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神兔_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术连击",
			"高级反震",
			"奔雷咒",
			"感知",
			"魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级泡泡" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级神佑复生",
			"高级感知",
			"高级飞行",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级泡泡_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级慧根",
			"高级魔之心",
			"奔雷咒",
			"高级感知",
			"雷击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大熊猫" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级连击",
			"高级防御",
			"高级感知",
			"高级强力",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大熊猫_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级冥思",
			"高级魔之心",
			"奔雷咒",
			"高级法术波动",
			"雷击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级金猴" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级偷袭",
			"高级敏捷",
			"高级幸运",
			"高级连击",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级金猴_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级魔之心",
			"高级精神集中",
			"高级法术波动",
			"雷击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大象" or 造型 == "超级大象使者" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级强力",
			"高级再生",
			"高级反震",
			"高级必杀",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大象_法系" or 造型 == "超级大象使者_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级神迹",
			"高级魔之心",
			"高级法术连击",
			"雷击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级灵鹿" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"善恶有报",
			"高级再生",
			"高级冥思",
			"高级偷袭",
			"永恒"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级灵鹿_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"泰山压顶",
			"高级法术连击",
			"高级法术暴击",
			"上古灵符",
			"高级再生"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级白泽" or 造型 == "超级白泽使者" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级敏捷",
			"高级夜战",
			"高级幸运",
			"感知"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级白泽_法系" or 造型 == "超级白泽使者_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"水漫金山",
			"高级法术暴击",
			"高级魔之心",
			"高级反震",
			"上古灵符"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级赤焰兽" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级感知",
			"高级必杀",
			"高级反击",
			"高级毒",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级赤焰兽_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"八凶法阵",
			"地狱烈火",
			"高级冥思",
			"高级法术暴击",
			"魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级麒麟" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级合纵",
			"高级连击",
			"高级幸运",
			"高级夜战",
			"偷袭"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级麒麟_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"泰山压顶",
			"高级魔之心",
			"高级驱鬼",
			"高级法术连击",
			"感知"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大鹏" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级飞行",
			"高级敏捷",
			"高级偷袭",
			"高级神佑复生",
			"必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级大鹏_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级法术暴击",
			"高级招架",
			"高级法术波动",
			"冥思"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级灵狐" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"惊心一剑",
			"高级敏捷",
			"高级必杀",
			"高级偷袭",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级灵狐_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级法术暴击",
			"高级感知",
			"高级魔之心",
			"法术连击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级孔雀" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级偷袭",
			"高级飞行",
			"高级再生",
			"高级连击",
			"高级必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级孔雀_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级魔之心",
			"高级神佑复生",
			"高级法术暴击",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神马" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级连击",
			"高级神佑复生",
			"浮云神马",
			"幸运",
			"神迹"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神马_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级法术连击",
			"高级魔之心",
			"法术暴击",
			"慧根"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级六耳猕猴" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级敏捷",
			"高级连击",
			"高级招架",
			"高级偷袭",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级六耳猕猴_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"须弥真言",
			"上古灵符",
			"高级法术连击",
			"高级法术暴击",
			"永恒"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神羊" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级连击",
			"千钧一怒",
			"感知",
			"反震"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神羊_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级魔之心",
			"高级法术波动",
			"法术暴击",
			"驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级土地公公" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级敏捷",
			"高级神佑复生",
			"高级连击",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级土地公公_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术连击",
			"高级神佑复生",
			"高级魔之心",
			"天降灵葫",
			"招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神猴" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级吸血",
			"高级神佑复生",
			"大快朵颐",
			"必杀",
			"连击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神猴_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术连击",
			"高级法术波动",
			"奔雷咒",
			"魔之心",
			"法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级玉兔" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级夜战",
			"高级敏捷",
			"高级感知",
			"偷袭",
			"连击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级玉兔_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术波动",
			"高级法术暴击",
			"高级神佑复生",
			"月光",
			"驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神鸡" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级强力",
			"高级神佑复生",
			"从天而降",
			"必杀",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神鸡_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术波动",
			"高级感知",
			"地狱烈火",
			"魔之心",
			"招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级筋斗云" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级偷袭",
			"高级敏捷",
			"高级夜战",
			"强力"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级筋斗云_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级法术连击",
			"高级感知",
			"高级魔之心",
			"反震"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神蛇" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级连击",
			"高级毒",
			"高级夜战",
			"偷袭",
			"敏捷"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神蛇_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"地狱烈火",
			"灵能激发",
			"高级法术波动",
			"魔之心",
			"永恒"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神狗" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神迹",
			"高级神佑复生",
			"理直气壮",
			"强力",
			"再生"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神狗_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"地狱烈火",
			"高级招架",
			"高级防御",
			"魔之心",
			"法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "飞天" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级连击",
			"高级敏捷",
			"高级飞行",
			"高级夜战",
			"神佑复生"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "飞天_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"流沙轻音",
			"净台妙谛",
			"高级法术暴击",
			"高级法术波动",
			"幸运"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神鼠" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级夜战",
			"高级隐身",
			"高级敏捷",
			"偷袭",
			"吸血"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神鼠_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级慧根",
			"高级再生",
			"魔之心",
			"法术波动"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神猪" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级必杀",
			"高级防御",
			"幸运",
			"再生"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神猪_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"地狱烈火",
			"高级法术暴击",
			"招架",
			"驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级小白龙" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级反击",
			"高级再生",
			"高级夜战",
			"感知"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级小白龙_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级法术连击",
			"高级法术暴击",
			"叱咤风云",
			"高级神佑复生",
			"永恒"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级猪小戒" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级强力",
			"高级防御",
			"高级偷袭",
			"反击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级猪小戒_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"食指大动",
			"高级魔之心",
			"高级感知",
			"高级法术连击",
			"法术波动"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级红孩儿" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神迹",
			"高级连击",
			"高级夜战",
			"高级必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级红孩儿_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"超级三昧真火",
			"桀骜自恃",
			"圣婴大王",
			"高级魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级飞廉" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"迅风出击",
			"高级幸运",
			"高级偷袭",
			"高级敏捷"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级飞廉_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奔雷咒",
			"高级法术连击",
			"高级法术暴击",
			"高级法术波动"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级离火兽" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"焚天陨火",
			"高级连击",
			"高级感知",
			"高级夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级离火兽_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"地狱烈火",
			"高级魔之心",
			"高级法术暴击",
			"高级法术波动"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "癸卯神兔" or 造型 == "癸卯神兔_睡梦" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"好梦连连",
			"高级连击",
			"高级神佑复生",
			"高级夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "癸卯神兔_法系" or 造型 == "癸卯神兔_睡梦_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"好梦连连",
			"水漫金山",
			"高级法术暴击",
			"高级魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "逍遥神牛" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奋勇当先",
			"善恶有报",
			"高级必杀",
			"高级吸血"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "逍遥神牛_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"奋勇当先",
			"水漫金山",
			"高级法术暴击",
			"高级魔之心"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "鲲鹏" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"水击三千",
			"高级必杀",
			"高级偷袭",
			"高级神佑复生",
			"逍遥游"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "鲲鹏_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"扶摇万里",
			"高级魔之心",
			"高级法术暴击",
			"高级神佑复生",
			"逍遥游"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽小龙人" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级反击",
			"高级偷袭",
			"善恶有报",
			"高级敏捷",
			"生命守护"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽小龙人_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"地狱烈火",
			"高级法术暴击",
			"招架",
			"生命守护"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽雪精灵" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级必杀",
			"剑气四射",
			"夜战",
			"上善若水"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽雪精灵_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"地狱烈火",
			"高级法术暴击",
			"招架",
			"上善若水"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "仙兽翼龙" then
		bbs[1] = 1600
		bbs[2] = 1600
		bbs[3] = 7000
		bbs[4] = 3000
		bbs[5] = 1600
		bbs[6] = 1600
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级必杀",
			"高级感知",
			"夜战",
			"战斗号角"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "仙兽翼龙_法系" then
		bbs[1] = 1600
		bbs[2] = 1600
		bbs[3] = 7000
		bbs[4] = 3000
		bbs[5] = 1600
		bbs[6] = 1600
		bbs[7] = 1.25
		bbs[8] = {
			"高级慧根",
			"高级魔之心",
			"高级法术连击",
			"水漫金山",
			"战斗号角"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽时光叽" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"赶尽杀绝",
			"高级神佑复生",
			"嗜血追击",
			"高级冲击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽时光叽_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"地狱烈火",
			"高级法术暴击",
			"招架",
			"驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽百灵羊" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级必杀",
			"高级感知",
			"夜战"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽百灵羊_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"高级敏捷",
			"高级幸运",
			"泰山压顶"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "齐天小圣" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级必杀",
			"双星闪",
			"高级气势"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "齐天小圣_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"高级敏捷",
			"高级震摄",
			"泰山压顶"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽孙小圣" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级偷袭",
			"高级必杀",
			"高级连击",
			"影袭",
			"烈焰斩"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "神兽孙小圣_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"高级敏捷",
			"高级震摄",
			"泰山压顶"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "兔乖乖" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级必杀",
			"高级连击",
			"高级反击",
			"影袭",
			"高级偷袭"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "兔乖乖_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级魔之心",
			"高级敏捷",
			"高级震摄",
			"泰山压顶"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神柚" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"超级神柚复生",
			"高级偷袭",
			"高级必杀",
			"高级连击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级神柚_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"超级神柚复生",
			"高级魔之心",
			"水漫金山",
			"高级法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级有熊" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"狂莽一击",
			"高级连击",
			"高级防御",
			"高级必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "超级有熊_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"泰山压顶",
			"高级魔之心",
			"高级法术波动",
			"高级法术暴击"
		}
	elseif 造型 == "甲辰神龙" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"高级防御",
			"高级神佑复生",
			"高级连击",
			"高级必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "甲辰神龙_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"焰火烁星",
			"风起龙游",
			"高级魔之心",
			"高级法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "食铁兽" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"蚩尤之搏",
			"高级神佑复生",
			"高级吸血",
			"高级必杀"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "食铁兽_法系" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 6000
		bbs[4] = 3000
		bbs[5] = 1550
		bbs[6] = 1550
		bbs[7] = 1.25
		bbs[8] = {
			"水漫金山",
			"高级法术连击",
			"高级魔之心",
			"高级法术暴击"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "龙马" or 造型 == "龙马_法系" then
		bbs[1] = 1400
		bbs[2] = 1400
		bbs[3] = 6000
		bbs[4] = 2000
		bbs[5] = 1400
		bbs[6] = 1400
		bbs[7] = 1
		bbs[8] = {
			"法术暴击",
			"观照万象",
			"高级法术连击",
			"奔雷咒",
			"水漫金山",
			"泰山压顶",
            "剑荡四方",
			"力劈华山"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小毛头" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小丫丫" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小神灵" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小仙女" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小精灵" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小魔头" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小彩蝶" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小蓝娥" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小浪鼓" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小绅士" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小圣斗士" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小兔兔" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小熊熊" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小DJ" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小卷发" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小羊角" then
		bbs[1] = 1550
		bbs[2] = 1550
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.25
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小战神" then
		bbs[1] = 1600
		bbs[2] = 1500
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.3
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架",
			"高级驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	elseif 造型 == "小神女" then
		bbs[1] = 1600
		bbs[2] = 1500
		bbs[3] = 5500
		bbs[4] = 3000
		bbs[5] = 1500
		bbs[6] = 1500
		bbs[7] = 1.3
		bbs[8] = {
			"高级神佑复生",
			"高级敏捷",
			"高级法术抵抗",--"高级法术防御",
			"高级招架",
			"高级驱鬼"
		}
		bbs[9] = {
			200,
			40,
			40,
			40,
			40,
			40
		}
	end

	return bbs
end
