坐标转换文本 = function(坐标列表)
	if 坐标列表 ~= nil and 坐标列表.X ~= nil and 坐标列表.Y ~= nil then
		return "(" .. 坐标列表.X .. "," .. 坐标列表.Y .. ")"
	end

	return ""
end

取假人表1 = function(地图ID, 假人ID, 名称)
	local 假人 = {}

	if 地图ID == 1003 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 85,
			方向 = 3,
			X = 37,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_苦力",
			名称 = "夏大叔",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 88,
			方向 = 2,
			X = 42,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_绿儿",
			名称 = "窑窑",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 87,
			方向 = 0,
			X = 71,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_绿儿",
			名称 = "彤彤",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 87,
			方向 = 1,
			X = 78,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_赵姨娘",
			名称 = "萍儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 63,
			方向 = 0,
			X = 115,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "普陀_接引仙女",
			名称 = "桃源仙女",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 73,
			方向 = 0,
			X = 163,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_店小二",
			名称 = "郭大哥",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 79,
			方向 = 1,
			X = 171,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "狸",
			名称 = "狸",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 70,
			方向 = 1,
			X = 170,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "狸",
			名称 = "狸",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 85,
			方向 = 0,
			X = 165,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "狸",
			名称 = "狸",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 48,
			方向 = 1,
			X = 163,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_村长",
			名称 = "谭村长",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 47,
			方向 = 1,
			X = 137,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_药店老板",
			名称 = "玄大夫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 50,
			方向 = 1,
			X = 126,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_老书生",
			名称 = "雨画师",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 40,
			方向 = 0,
			X = 108,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_染色师",
			名称 = "孙厨娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 110,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_翠花",
			名称 = "刘大婶",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 16,
			方向 = 0,
			X = 123,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "小毛头",
			名称 = "小绿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 128,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "小丫丫",
			名称 = "清清",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 18,
			方向 = 3,
			X = 164,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_铁匠",
			名称 = "孙猎户",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 171,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "野猪",
			名称 = "野猪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 25,
			方向 = 2,
			X = 78,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_丫鬟",
			名称 = "霞姑娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 27,
			方向 = 1,
			X = 27,
			饰品 = true,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "进阶芙蓉仙子",
			名称 = "新手接待师",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "新手礼包"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			染色方案 = 9,
			Y = 9,
			商业分类3 = 0,
			方向 = 4,
			X = 51,
			武器 = "狂澜碎岳",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "神天兵",
			名称 = "狼宝宝",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "→助战获取←",
			染色组 = {
				3,
				3,
				3
			}
		}
	elseif 地图ID == 1501 then
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "宠物仙子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老伯",
			商业分类3 = 0,
			Y = 31,
			方向 = 1,
			X = 84,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "戏班班主",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 38,
			方向 = 1,
			X = 88,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "吹牛王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			锦衣 = "黑浪淘纱",
			商业分类3 = 0,
			Y = 101,
			执行事件 = "不执行",
			方向 = 4,
			X = 41,
			武器 = "偃月青龙",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "剑侠客",
			名称 = "刻晴",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "查询领取"
		}
		假人[#假人 + 1] = {
			模型 = "小孩_飞儿",
			商业分类3 = 0,
			Y = 49,
			方向 = 1,
			X = 97,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "飞儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_王大嫂",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 139,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "王大嫂",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_钓鱼",
			商业分类3 = 0,
			Y = 13,
			方向 = 0,
			X = 232,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "海产收购商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老孙头",
			商业分类3 = 0,
			Y = 10,
			方向 = 1,
			X = 224,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "老孙头",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 222,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "陈长寿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "小孩_飞儿",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 217,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "罗招弟",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道士",
			商业分类3 = 0,
			Y = 38,
			方向 = 1,
			X = 230,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "牛大胆",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 24,
			方向 = 1,
			X = 238,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "装备收购商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 28,
			方向 = 1,
			X = 243,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "装备鉴定商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 44,
			方向 = 1,
			X = 214,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_老伯",
			商业分类3 = 0,
			Y = 79,
			方向 = 0,
			X = 227,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "赵元宝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 106,
			方向 = 0,
			X = 204,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小花",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 80,
			方向 = 1,
			X = 115,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_衙役",
			名称 = "赵捕头",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "新手任务"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 87,
			方向 = 0,
			X = 107,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_镖头",
			商业分类3 = 0,
			Y = 71,
			方向 = 0,
			X = 87,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "张来福",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 77,
			方向 = 0,
			X = 84,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "建邺特产商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_武器店老板",
			商业分类3 = 0,
			Y = 89,
			方向 = 1,
			X = 49,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "马全有",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 89,
			方向 = 0,
			X = 10,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "迎客僧",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_店小二",
			商业分类3 = 0,
			Y = 64,
			方向 = 1,
			X = 42,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "管家",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 54,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "符全",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 138.5,
			方向 = 1,
			X = 15.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_衙役",
			名称 = "建邺守卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送江南野外"
		}
		假人[#假人 + 1] = {
			模型 = "小孩_雷黑子",
			商业分类3 = 0,
			Y = 133,
			方向 = 1,
			X = 70,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "雷黑子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 54,
			方向 = 1,
			X = 77,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "教书先生",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 112,
			方向 = 0,
			X = 52,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "仓库管理员",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			锦衣 = "竹林熊猫",
			商业分类3 = 0,
			Y = 19,
			执行事件 = "不执行",
			方向 = 4,
			X = 201,
			武器 = "弑皇",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "龙太子",
			名称 = "哥哥快",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "梦战剧情使"
		}
	elseif 地图ID == 6043 then
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "宠物仙子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_镖头",
			商业分类3 = 0,
			Y = 71,
			方向 = 0,
			X = 87,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "张捕头",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			锦衣 = "竹林熊猫",
			商业分类3 = 0,
			Y = 19,
			执行事件 = "不执行",
			方向 = 4,
			X = 201,
			武器 = "弑皇",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "龙太子",
			名称 = "哥哥快",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "梦战剧情使"
		}
		假人[#假人 + 1] = {
			Y = 2,
			模型 = "强盗",
			名称 = "江南小盗",
			方向 = 0,
			X = 80
		}
		假人[#假人 + 1] = {
			模型 = "男人_老孙头",
			商业分类3 = 0,
			Y = 10,
			方向 = 1,
			X = 224,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "老孙头",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			Y = 64,
			模型 = "少女",
			名称 = "小红",
			方向 = 0,
			X = 41
		}
		假人[#假人 + 1] = {
			Y = 66,
			模型 = "男人_钓鱼",
			名称 = "渔夫",
			方向 = 0,
			X = 39
		}
		假人[#假人 + 1] = {
			Y = 68,
			模型 = "巨魔王",
			名称 = "黄狮王",
			方向 = 2,
			X = 43,
			武器 = "五丁开山"
		}
	elseif 地图ID == 6044 then
		假人[#假人 + 1] = {
			模型 = "大海龟",
			商业分类3 = 0,
			Y = 99,
			方向 = 0,
			X = 77,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "大大龟",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "海毛虫",
			商业分类3 = 0,
			Y = 105,
			方向 = 2,
			X = 81,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "果毛虫",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6045 then
		假人[#假人 + 1] = {
			模型 = "巨蛙",
			商业分类3 = 0,
			Y = 42,
			方向 = 0,
			X = 82,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "绿皮蛙",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6046 then
		假人[#假人 + 1] = {
			模型 = "考官2",
			商业分类3 = 0,
			Y = 30,
			方向 = 1,
			X = 48,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "屈原",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			Y = 17,
			染色方案 = 74,
			模型 = "强盗",
			名称 = "狂盗",
			方向 = 1,
			X = 153,
			染色组 = {
				1,
				1
			}
		}
	elseif 地图ID == 1525 then
		假人[#假人 + 1] = {
			模型 = "宝箱",
			商业分类3 = 0,
			Y = 20,
			方向 = 1,
			X = 19,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小宝箱",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1127 then
		假人[#假人 + 1] = {
			模型 = "巡游天神",
			商业分类3 = 0,
			Y = 31,
			方向 = 1,
			X = 52,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "幽冥鬼",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1128 then
		假人[#假人 + 1] = {
			Y = 11,
			小地图名称颜色 = 0,
			模型 = "野鬼",
			名称 = "吊死鬼",
			方向 = 1,
			X = 53,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1129 then
		假人[#假人 + 1] = {
			模型 = "野鬼",
			商业分类3 = 0,
			Y = 26,
			方向 = 1,
			X = 64,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "无名野鬼",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1130 then
		假人[#假人 + 1] = {
			Y = 20,
			小地图名称颜色 = 0,
			模型 = "白晶晶",
			名称 = "晶晶姑娘的鬼魂",
			方向 = 1,
			X = 113,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1193 then
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "罗纤纤",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 102,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "江湖奸商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 99,
			方向 = 1,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卵二姐",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "樵夫",
			商业分类3 = 0,
			Y = 96,
			方向 = 1,
			X = 134,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "樵夫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 22,
			方向 = 0,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "树怪",
			名称 = "洛树妖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1103 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 34,
			方向 = 1,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "孙悟空",
			名称 = "美猴王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 40,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "齐天小圣",
			名称 = "齐天小圣",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1505 then
		假人[#假人 + 1] = {
			模型 = "男人_巫医",
			商业分类3 = 0,
			Y = 26,
			方向 = 1,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "杂货店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1202 then
		假人[#假人 + 1] = {
			模型 = "宝箱",
			商业分类3 = 0,
			Y = 17,
			方向 = 1,
			X = 127,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小宝箱",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 42,
			方向 = 0,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "死亡骑士",
			名称 = "死亡骑士",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1208 then
		假人[#假人 + 1] = {
			模型 = "校尉",
			商业分类3 = 0,
			Y = 21,
			方向 = 1,
			X = 138,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "朱紫校尉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 97,
			方向 = 1,
			X = 125,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "药店伙计",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 82,
			方向 = 2,
			X = 144,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "紫阳药师",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_栗栗娘",
			商业分类3 = 0,
			Y = 113,
			方向 = 1,
			X = 97,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "端木娘子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "校尉",
			商业分类3 = 0,
			Y = 115,
			方向 = 1,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "朱紫侍卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "校尉",
			商业分类3 = 0,
			Y = 109,
			方向 = 1,
			X = 7,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "朱紫侍卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 31,
			方向 = 0,
			X = 9,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 105,
			方向 = 1,
			X = 76,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "申太公",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "蝴蝶仙子",
			变异 = true,
			商业分类3 = 0,
			Y = 10,
			方向 = 1,
			X = 104,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "妖魔亲信",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_土地",
			商业分类3 = 0,
			Y = 25,
			方向 = 0,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "土地公公",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1040 then
		假人[#假人 + 1] = {
			模型 = "女兵",
			商业分类3 = 0,
			Y = 104,
			方向 = 0,
			X = 129,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "西梁女兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女兵",
			商业分类3 = 0,
			Y = 99,
			方向 = 0,
			X = 141,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "西梁女兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 71,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送朱紫国"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 114,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送丝绸之路"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 62,
			方向 = 0,
			X = 85,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			模型 = "周杰伦",
			名称 = "周吊伦",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情大师"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 18,
			方向 = 0,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			模型 = "春十三娘",
			名称 = "西凉国王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "69级突破战斗"
		}
	elseif 地图ID == 1215 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 32,
			方向 = 0,
			X = 52,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "炎魔神",
			名称 = "蜃妖元神",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = ""
		}
	elseif 地图ID == 1216 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 59,
			方向 = 0,
			X = 151,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶凤凰",
			名称 = "御兽仙",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽进阶"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 84,
			方向 = 0,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			模型 = "大大王",
			名称 = "百兽王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "坐骑任务"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 10,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "龙剑女",
			名称 = "龙剑女",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1242 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 6,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "法僧",
			名称 = "法僧",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1205 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 60,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶炎魔神",
			名称 = "奢比尸",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 114,
			方向 = 1,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶鲛人",
			名称 = "翕兹",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶噬天虎",
			名称 = "天吴",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 34,
			方向 = 1,
			X = 94,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶踏云兽",
			名称 = "强良",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 15,
			方向 = 0,
			X = 88,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶蛟龙",
			名称 = "烛九阴",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 121,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶雾中仙",
			名称 = "后土",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 130,
			方向 = 1,
			X = 109,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "凤凰",
			名称 = "帝江",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 84,
			方向 = 1,
			X = 121,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶百足将军",
			名称 = "蓐收",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 60,
			方向 = 1,
			X = 117,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶大力金刚",
			名称 = "句芒",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 94,
			方向 = 0,
			X = 80,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶金铙僧",
			名称 = "玄冥",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 83,
			方向 = 2,
			X = 34,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶碧水夜叉",
			名称 = "共工",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 74,
			方向 = 2,
			X = 67,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶灵灯侍者",
			名称 = "祝融",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 45,
			方向 = 0,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蚩尤",
			名称 = "蚩尤",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二祖巫挑战"
		}
	elseif 地图ID == 1209 then
	elseif 地图ID == 1226 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 27,
			方向 = 1,
			X = 143,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安城"
		}
		假人[#假人 + 1] = {
			模型 = "男人_店小二",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 54,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "镖局学童",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 16,
			方向 = 2,
			X = 119,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "土地公公",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "宝藏山传送员"
		}
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 67,
			方向 = 1,
			X = 148,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			执行事件 = "不执行",
			名称 = "药店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 5001 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 2,
			X = 76,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "土地公公",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送至宝象国"
		}
	elseif 地图ID == 1537 then
		假人[#假人 + 1] = {
			模型 = "男人_老书生",
			商业分类3 = 0,
			Y = 17,
			方向 = 1,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "建邺县令",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 17,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 29,
			方向 = 2,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 25,
			方向 = 2,
			X = 33,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_师爷",
			商业分类3 = 0,
			Y = 19,
			方向 = 0,
			X = 30,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "简师爷",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1523 then
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 28,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "当铺老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1502 then
		假人[#假人 + 1] = {
			模型 = "男人_武器店老板",
			商业分类3 = 0,
			Y = 18,
			方向 = 1,
			X = 22,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "武器店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老孙头",
			商业分类3 = 0,
			Y = 18,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "武器店掌柜",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1503 then
		假人[#假人 + 1] = {
			模型 = "男人_服装店老板",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "服装店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1504 then
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 20,
			方向 = 1,
			X = 28,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "药店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1526 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 25,
			方向 = 0,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "周猎户",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1524 then
		假人[#假人 + 1] = {
			模型 = "男人_财主",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 36,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "钱庄老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1534 then
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "李善人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1506 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 112,
			方向 = 0,
			X = 55,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "船夫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送傲来国"
		}
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 109,
			方向 = 0,
			X = 75,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "云游神医",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_巫医",
			商业分类3 = 0,
			Y = 104,
			方向 = 0,
			X = 101,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 81,
			方向 = 1,
			X = 91,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_村长",
			名称 = "林老汉",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送东海岩洞"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 29,
			方向 = 2,
			X = 115,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "虾兵",
			名称 = "老虾",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送龙宫"
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 35,
			方向 = 0,
			X = 58,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "楚恋依",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "强盗",
			商业分类3 = 0,
			Y = 102,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "海盗头子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老伯",
			商业分类3 = 0,
			Y = 70,
			方向 = 0,
			X = 59,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "牛二",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "狐狸精",
			商业分类3 = 0,
			Y = 11,
			方向 = 1,
			X = 88,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "玉面公主",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1110 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 74,
			方向 = 0,
			X = 177,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "大唐国境土地",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送凌波城"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 269,
			方向 = 0,
			X = 229,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "普陀_接引仙女",
			名称 = "接引仙女",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送普陀山"
		}
		假人[#假人 + 1] = {
			模型 = "男人_店小二",
			商业分类3 = 0,
			Y = 268,
			方向 = 0,
			X = 68,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小二",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 86,
			方向 = 0,
			X = 86,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安城"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 257,
			方向 = 1,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 248,
			方向 = 1,
			X = 174,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "者释和尚",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 184,
			方向 = 0,
			X = 186,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "业释和尚",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 157,
			方向 = 0,
			X = 139,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "海释和尚",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "星灵仙子",
			商业分类3 = 0,
			Y = 176,
			方向 = 0,
			X = 27,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "白琉璃",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "雨师",
			商业分类3 = 0,
			Y = 98,
			方向 = 1,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "山神",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 76,
			方向 = 0,
			X = 241,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 82,
			方向 = 0,
			X = 312,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "吴老爹",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 33,
			方向 = 0,
			X = 169,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小芸芸",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 116,
			方向 = 0,
			X = 306,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "吴文彩",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_孟婆",
			商业分类3 = 0,
			Y = 310,
			方向 = 0,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "婆婆",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 54,
			方向 = 0,
			X = 238,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "文秀",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 37,
			方向 = 0,
			X = 314,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 117,
			方向 = 0,
			X = 252,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "赌徒",
			名称 = "赌徒喽啰",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			Y = 19,
			模型 = "强盗",
			名称 = "江洋大盗",
			方向 = 0,
			X = 223,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			Y = 22,
			模型 = "骷髅怪",
			名称 = "洛川鬼",
			方向 = 1,
			X = 37,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1153 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "雨师",
			名称 = "酒肉和尚",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情战斗"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 13,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "唐僧",
			名称 = "玄奘",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "金蝉子"
		}
	elseif 地图ID == 1168 then
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "刘洪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "陈妈妈",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 13,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "殷温娇",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 1,
			X = 27,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_老书生",
			名称 = "江州县令",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1150 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 32,
			方向 = 1,
			X = 68,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "二郎神",
			名称 = "二郎神",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
		假人[#假人 + 1] = {
			模型 = "哮天犬",
			商业分类3 = 0,
			Y = 36,
			方向 = 1,
			X = 77,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "哮天犬",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 88,
			方向 = 1,
			X = 6,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门天将",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 93.5,
			方向 = 1,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门天将",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "狂豹人形",
			商业分类3 = 0,
			Y = 117,
			方向 = 0,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "荒芜星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "鲛人",
			商业分类3 = 0,
			Y = 141,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "刀砧星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "羊头怪",
			商业分类3 = 0,
			Y = 137,
			方向 = 1,
			X = 54,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "反吟星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "犀牛将军人形",
			商业分类3 = 0,
			Y = 104,
			方向 = 1,
			X = 93,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天瘟星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "野猪精",
			商业分类3 = 0,
			Y = 48,
			方向 = 0,
			X = 100,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "伏断星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "百足将军",
			商业分类3 = 0,
			Y = 55.5,
			方向 = 1,
			X = 26.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "破碎星",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 57,
			方向 = 1,
			X = 44,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "天兵",
			名称 = "传送天将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1140 then
		假人[#假人 + 1] = {
			模型 = "小龙女",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "龙女宝宝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "黑熊精",
			商业分类3 = 0,
			Y = 47,
			方向 = 0,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "黑熊怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 9,
			方向 = 0,
			X = 8,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "普陀_接引仙女",
			名称 = "接引仙女",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1141 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 11.5,
			方向 = 0,
			X = 12.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "观音姐姐",
			名称 = "观音姐姐",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 33,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "青莲仙女",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1122 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 60,
			方向 = 1,
			X = 63,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_钟馗",
			名称 = "钟馗",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "捉鬼任务"
		}
		假人[#假人 + 1] = {
			模型 = "马面",
			商业分类3 = 0,
			Y = 87,
			方向 = 0,
			X = 10,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "马面",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "兔子怪",
			商业分类3 = 0,
			Y = 104,
			方向 = 0,
			X = 10,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "追梦鬼",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 63.5,
			方向 = 0,
			X = 27.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "僵尸",
			名称 = "地遁鬼",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "女人_孟婆",
			商业分类3 = 0,
			Y = 94.5,
			方向 = 0,
			X = 99.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "孟婆",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 108,
			方向 = 0,
			X = 83,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "地府商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 73,
			方向 = 1,
			X = 68,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "地府货商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 19,
			方向 = 1,
			X = 150,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "进阶幽萤娃娃",
			名称 = "引路灯魂",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送鬼市"
		}
	elseif 地图ID == 1123 then
		假人[#假人 + 1] = {
			模型 = "男人_判官",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "判官",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 26.5,
			方向 = 0,
			X = 22.2,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "阎罗王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 28.5,
			方向 = 0,
			X = 25.6,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "转轮王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 30.5,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "秦广王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 32.5,
			方向 = 0,
			X = 32.4,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "初江王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 34.5,
			方向 = 0,
			X = 35.8,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "宋帝王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 21.7,
			方向 = 0,
			X = 31.7,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卞城王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 23.7,
			方向 = 0,
			X = 35.1,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "平等王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 25.7,
			方向 = 0,
			X = 38.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "泰山王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 27.7,
			方向 = 0,
			X = 41.9,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "都市王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 29.7,
			方向 = 0,
			X = 45.3,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "忤官王",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1125 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 23,
			方向 = 0,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "白无常",
			名称 = "白无常",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 22,
			方向 = 1,
			X = 37,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "黑无常",
			名称 = "黑无常",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "鬼王任务"
		}
	elseif 地图ID == 1124 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 22,
			方向 = 0,
			X = 32,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "地藏王",
			名称 = "地藏王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1116 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 97,
			方向 = 1,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "虾兵",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送东海湾"
		}
		假人[#假人 + 1] = {
			模型 = "蟹将",
			商业分类3 = 0,
			Y = 100,
			方向 = 1,
			X = 32,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "蟹将军",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 104,
			方向 = 1,
			X = 40,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "龟丞相",
			商业分类3 = 0,
			Y = 57,
			方向 = 0,
			X = 99,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "龟千岁",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "小龙女",
			商业分类3 = 0,
			Y = 49,
			方向 = 0,
			X = 96,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小龙女",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 21,
			方向 = 2,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "龟丞相",
			商业分类3 = 0,
			Y = 16,
			方向 = 2,
			X = 53,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "龟太尉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 14,
			方向 = 2,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 12,
			方向 = 3,
			X = 188,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "蛤蟆精",
			商业分类3 = 0,
			Y = 16,
			方向 = 3,
			X = 195,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "蛤蟆勇士",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 20,
			方向 = 3,
			X = 203,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 92,
			方向 = 0,
			X = 188,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 88,
			方向 = 0,
			X = 195,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾将军",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "虾兵",
			商业分类3 = 0,
			Y = 84,
			方向 = 0,
			X = 203,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "虾兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_万圣公主",
			商业分类3 = 0,
			Y = 50,
			方向 = 1,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "万圣公主",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 60,
			方向 = 1,
			X = 108,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蟹将",
			名称 = "传送蟹将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1117 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 25,
			方向 = 1,
			X = 39,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "东海龙王",
			名称 = "东海龙王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1507 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 31,
			方向 = 1,
			X = 34,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蟹将",
			名称 = "螃蟹精",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送建邺城"
		}
		假人[#假人 + 1] = {
			模型 = "蛤蟆精",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 50,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "蛤蟆精",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1514 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 75,
			方向 = 1,
			X = 42,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "马猴",
			名称 = "老马猴",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "法术认证"
		}
		假人[#假人 + 1] = {
			模型 = "长眉灵猴",
			商业分类3 = 0,
			Y = 36,
			方向 = 1,
			X = 135,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "猴医仙",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 44,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "马猴",
			名称 = "老猕猴",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "潜能果兑换"
		}
	elseif 地图ID == 1174 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 163,
			方向 = 2,
			X = 195,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "兔子怪",
			名称 = "地遁鬼",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长寿郊外"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 13,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "净瓶女娲",
			名称 = "女娲神迹传送人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送女娲神迹"
		}
		假人[#假人 + 1] = {
			模型 = "星灵仙子",
			商业分类3 = 0,
			Y = 35,
			方向 = 0,
			X = 202,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "青琉璃",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_巫医",
			商业分类3 = 0,
			Y = 105,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "小龙女",
			商业分类3 = 0,
			Y = 71,
			方向 = 0,
			X = 138,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "龙女妹妹",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "山贼",
			商业分类3 = 0,
			Y = 129,
			方向 = 0,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "莽汉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 145,
			方向 = 1,
			X = 148,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "北俱商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 91,
			方向 = 1,
			X = 198,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "北俱货商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 76,
			方向 = 0,
			X = 93,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安城"
		}
		假人[#假人 + 1] = {
			模型 = "雷鸟人",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 63,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "雷鸟精",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "白熊",
			商业分类3 = 0,
			Y = 117,
			方向 = 0,
			X = 108,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "白熊怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "地狱战神",
			商业分类3 = 0,
			Y = 137,
			方向 = 0,
			X = 181,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "翻天怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			Y = 58,
			小地图名称颜色 = 0,
			模型 = "宝石商人",
			名称 = "江湖奸商",
			方向 = 1,
			X = 106,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1178 then
		假人[#假人 + 1] = {
			Y = 43,
			小地图名称颜色 = 0,
			模型 = "蛟龙",
			名称 = "龙神",
			方向 = 0,
			X = 114,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1183 then
		假人[#假人 + 1] = {
			Y = 42,
			小地图名称颜色 = 0,
			模型 = "如意仙子",
			名称 = "青灵玄女",
			方向 = 3,
			X = 67,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1186 then
		假人[#假人 + 1] = {
			Y = 28,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "辛发明",
			方向 = 1,
			X = 83,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1192 then
		假人[#假人 + 1] = {
			Y = 25,
			小地图名称颜色 = 0,
			模型 = "男人_老和尚",
			名称 = "无心",
			方向 = 0,
			X = 87,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1091 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 88,
			方向 = 1,
			X = 68,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送北俱芦洲"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 112,
			方向 = 0,
			X = 22,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "男人_将军",
			名称 = "传送天将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送天宫"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 158,
			方向 = 2,
			X = 90,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "西牛贺洲土地",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送大唐境外"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 86,
			方向 = 0,
			X = 133,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_道士",
			名称 = "鬼谷道人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "降妖除魔"
		}
		假人[#假人 + 1] = {
			模型 = "赌徒",
			商业分类3 = 0,
			Y = 119,
			方向 = 0,
			X = 174,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "路人甲",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1135 then
		假人[#假人 + 1] = {
			模型 = "男人_道士",
			商业分类3 = 0,
			Y = 118,
			方向 = 0,
			X = 62,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "觉明",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 92,
			方向 = 0,
			X = 50,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "灵儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 30,
			方向 = 1,
			X = 118,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_道童",
			名称 = "接引道童",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1170 then
		假人[#假人 + 1] = {
			Y = 22,
			小地图名称颜色 = 0,
			模型 = "男人_村长",
			名称 = "高老先生",
			方向 = 1,
			X = 33,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1171 then
		假人[#假人 + 1] = {
			Y = 16,
			小地图名称颜色 = 0,
			模型 = "少女",
			名称 = "高翠兰",
			方向 = 1,
			X = 17,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1173 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 102,
			方向 = 0,
			X = 44,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "南瞻部洲土地",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送西牛贺洲"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 95,
			方向 = 0,
			X = 13,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送碗子山"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 49,
			方向 = 0,
			X = 50,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "山贼",
			商业分类3 = 0,
			Y = 15,
			方向 = 0,
			X = 94,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "山贼头子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "牛妖",
			商业分类3 = 0,
			Y = 43,
			方向 = 0,
			X = 79,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "牛将军",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 93,
			方向 = 1,
			X = 205,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安城"
		}
		假人[#假人 + 1] = {
			模型 = "逍遥生",
			商业分类3 = 0,
			Y = 110,
			方向 = 0,
			X = 234,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "白衣人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "星灵仙子",
			商业分类3 = 0,
			Y = 47,
			方向 = 3,
			X = 319,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "阿紫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 44,
			方向 = 1,
			X = 324,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "姚太尉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "空度禅师",
			商业分类3 = 0,
			Y = 89,
			方向 = 0,
			X = 350,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "云游僧",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "赌徒",
			商业分类3 = 0,
			Y = 111,
			方向 = 2,
			X = 354,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "白鹿精",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "狐狸精",
			商业分类3 = 0,
			Y = 110,
			方向 = 0,
			X = 349,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "玉面狐狸",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 108,
			方向 = 1,
			X = 409,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "野猪",
			商业分类3 = 0,
			Y = 113,
			方向 = 0,
			X = 480,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "野猪王",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "骷髅怪",
			商业分类3 = 0,
			Y = 98,
			方向 = 1,
			X = 579,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "偷尸鬼",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "强盗",
			商业分类3 = 0,
			Y = 101,
			方向 = 0,
			X = 588,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "李彪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_马副将",
			商业分类3 = 0,
			Y = 104,
			方向 = 2,
			X = 591,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "刘洪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 33,
			方向 = 0,
			X = 562,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "强盗",
			名称 = "强盗头子",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
		假人[#假人 + 1] = {
			模型 = "僵尸",
			商业分类3 = 0,
			Y = 19,
			方向 = 1,
			X = 603,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "冤魂",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "至尊宝",
			商业分类3 = 0,
			Y = 59,
			方向 = 1,
			X = 161,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "至尊宝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 56,
			方向 = 1,
			X = 246,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天兵飞剑",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "沙僧",
			商业分类3 = 0,
			Y = 64,
			方向 = 0,
			X = 237,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卷帘大将",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "猪八戒",
			商业分类3 = 0,
			Y = 113,
			方向 = 1,
			X = 632,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天蓬元帅",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			Y = 69,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "土地公公",
			方向 = 1,
			X = 556,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 60,
			小地图名称颜色 = 0,
			模型 = "强盗",
			名称 = "二帮主",
			方向 = 2,
			X = 610,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1508 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 16,
			方向 = 0,
			X = 17,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "虾兵",
			名称 = "虾精",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送建邺城"
		}
		假人[#假人 + 1] = {
			模型 = "吸血鬼",
			染色方案 = 96,
			Y = 31,
			商业分类3 = 0,
			方向 = 1,
			X = 55,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "妖风",
			商业分类4 = 0,
			商业分类1 = 0,
			染色组 = {
				1,
				1
			}
		}
	elseif 地图ID == 1509 then
		假人[#假人 + 1] = {
			模型 = "野鬼",
			商业分类3 = 0,
			Y = 27,
			方向 = 2,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "商人的鬼魂",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1001 then
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 262,
			方向 = 0,
			X = 463,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长安导游",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_王大嫂",
			商业分类3 = 0,
			Y = 231,
			方向 = 0,
			X = 393,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "王夫人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 265,
			方向 = 0,
			X = 329,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "商会总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 249,
			方向 = 1,
			X = 176,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "陈员外",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 256,
			方向 = 1,
			X = 301,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "花香香",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 249,
			方向 = 1,
			X = 289,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "老花农",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道士",
			商业分类3 = 0,
			Y = 243,
			方向 = 0,
			X = 258,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "罗道人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_染色师",
			商业分类3 = 0,
			Y = 264,
			方向 = 0,
			X = 290,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "染色师",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 238,
			方向 = 0,
			X = 274,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送大唐国境"
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 253,
			方向 = 0,
			X = 247,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "张老财",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 95,
			方向 = 1,
			X = 526,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_镖头",
			商业分类3 = 0,
			Y = 246.8,
			方向 = 1,
			X = 478,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "门派传送人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_太上老君",
			商业分类3 = 0,
			Y = 205,
			方向 = 1,
			X = 350.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "圣山传送人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 90,
			方向 = 0,
			X = 128,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "男人_马副将",
			名称 = "门派闯关使者",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十五门派大闯关活动使者"
		}
		假人[#假人 + 1] = {
			模型 = "男人_马副将",
			商业分类3 = 0,
			Y = 176,
			方向 = 0,
			X = 147,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "刘副将",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 104,
			方向 = 1,
			X = 234,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_兰虎",
			名称 = "兰虎",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 115,
			方向 = 0,
			X = 194,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "男人_马副将",
			名称 = "马副将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "双倍经验"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 106,
			方向 = 0,
			X = 211,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "男人_马副将",
			名称 = "御林军",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "精修经验"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 102,
			方向 = 1,
			X = 228,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "护卫",
			名称 = "皇宫护卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "平定安邦"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 95,
			方向 = 0,
			X = 280,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "考官2",
			名称 = "礼部侍郎",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "科举大赛"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 112,
			方向 = 1,
			X = 253,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "袁天罡",
			名称 = "袁天罡",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "全功能服务大师"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 84,
			方向 = 0,
			X = 145,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "男人_马副将",
			名称 = "李将军",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "官职任务"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 99,
			方向 = 1,
			X = 223,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_店小二",
			名称 = "杜少海",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "初出江湖"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 65,
			方向 = 0,
			X = 101,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "护卫",
			名称 = "御林军左统领",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "皇宫飞贼"
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 49,
			方向 = 0,
			X = 110,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "御林军右统领",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "珍品商人",
			商业分类3 = 0,
			Y = 261,
			方向 = 1,
			X = 193,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长安珍品商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 47,
			方向 = 1,
			X = 419,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "装备收购商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 51,
			方向 = 1,
			X = 429,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "装备鉴定商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 107,
			方向 = 0,
			X = 449,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "仓库管理员",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道童",
			商业分类3 = 0,
			Y = 203,
			方向 = 1,
			X = 490,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "符石道人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 382,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_兰虎",
			名称 = "帮派管理员",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "帮派业务"
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 166,
			方向 = 3,
			X = 275,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长安商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 120,
			方向 = 1,
			X = 383,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长安货商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_太上老君",
			商业分类3 = 0,
			Y = 263,
			方向 = 1,
			X = 181,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "袁守城",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_小白龙",
			商业分类3 = 0,
			Y = 267,
			方向 = 3,
			X = 176,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "龙孙",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 213,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			模型 = "男人_衙役",
			名称 = "建房吏",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "房屋建设"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 215,
			方向 = 0,
			X = 10,
			商业分类2 = 0,
			小地图名称颜色 = 5,
			模型 = "男人_衙役",
			名称 = "李捕头",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "种族任务"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 109,
			方向 = 1,
			X = 246,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			模型 = "男人_老书生",
			名称 = "效果取消员",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "取消各种状态效果"
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 140,
			方向 = 1,
			X = 497,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			执行事件 = "不执行",
			名称 = "宝石商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 171,
			方向 = 0,
			X = 177,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "相府守卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 162,
			方向 = 0,
			X = 195,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "相府守卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "兔子怪",
			商业分类3 = 0,
			Y = 153,
			方向 = 0,
			X = 206,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "节日礼物使者",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_马副将",
			商业分类3 = 0,
			Y = 206,
			方向 = 0,
			X = 375,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 5,
			执行事件 = "不执行",
			名称 = "房都尉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 184,
			方向 = 0,
			X = 259,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "怜儿姑娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "小孩_飞儿",
			商业分类3 = 0,
			Y = 147,
			方向 = 0,
			X = 314,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小宝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			武器 = "四法青云",
			商业分类3 = 0,
			Y = 106,
			执行事件 = "不执行",
			方向 = 1,
			X = 240,
			锦衣 = "黑浪淘纱",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "偃无师",
			名称 = "奖励发放员",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "各种活动奖励领取"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 167,
			方向 = 0,
			X = 110,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_将军",
			名称 = "比武大会主持人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "英雄会比武PVP活动"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 134,
			方向 = 0,
			X = 422,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_太上老君",
			名称 = "月老",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "月下老人"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 151,
			方向 = 0,
			X = 519,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_兰虎",
			名称 = "轿夫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "家园传送人"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 113,
			方向 = 0,
			X = 206,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_钟馗",
			名称 = "钟馗",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "捉鬼任务"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 114,
			方向 = 1,
			X = 258,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "进阶凤凰",
			名称 = "御兽仙",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽进阶染色"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 166,
			方向 = 4,
			X = 237,
			锦衣 = "黑浪淘纱",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "剑侠客",
			名称 = "抽奖使者",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "幸运抽奖"
		}

		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 166,
			方向 = 4,
			X = 228,
			锦衣 = "黑浪淘纱",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "剑侠客",
			名称 = "桀桀桀",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "膜拜大佬"
		}


		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 166,
			方向 = 4,
			X = 228,
			锦衣 = "万灵夜游",
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "玄彩娥",
			名称 = "月亮",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "膜拜大佬"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 72,
			方向 = 1,
			X = 437,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "雪人5",
			名称 = "雪人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "新春活动"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 125,
			方向 = 3,
			X = 198,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "男人_书生",
			名称 = "说书先生",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "副本接引人"
		}
		假人[#假人 + 1] = {
			Y = 130,
			小地图名称颜色 = 0,
			模型 = "进阶小神灵",
			名称 = "红线童子",
			方向 = 1,
			X = 437,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			Y = 157,
			小地图名称颜色 = 0,
			模型 = "空度禅师",
			名称 = "五行大师",
			方向 = 0,
			X = 364,
			称谓 = "更换五行"
		}
		假人[#假人 + 1] = {
			Y = 45,
			任务显示 = true,
			小地图名称颜色 = 0,
			模型 = "男人_马副将",
			名称 = "雁塔地宫守卫",
			方向 = 1,
			X = 445,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			Y = 97,
			方向 = 0,
			X = 128,
			任务显示 = true,
			小地图名称颜色 = 0,
			模型 = "天兵",
			名称 = "游奕灵官",
			称谓 = "天降星辰"
		}
	elseif 地图ID >= 6010 and 地图ID <= 6019 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 10,
			方向 = 1,
			X = 137,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_马副将",
			名称 = "夺旗竞赛裁判",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "裁判员"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 95,
			方向 = 0,
			X = 7,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_马副将",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送员"
		}
	elseif 地图ID == 6020 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 19,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_马副将",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送员"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 12,
			方向 = 0,
			X = 133,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			模型 = "男人_马副将",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送员"
		}
	elseif 地图ID == 1019 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 25,
			方向 = 1,
			X = 27,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_老书生",
			名称 = "颜如玉",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "书呆子"
		}
	elseif 地图ID == 1015 then
		假人[#假人 + 1] = {
			模型 = "男人_巫医",
			商业分类3 = 0,
			Y = 15,
			方向 = 1,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "杂货店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1013 then
		假人[#假人 + 1] = {
			模型 = "男人_财主",
			商业分类3 = 0,
			Y = 25,
			方向 = 1,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "钱庄老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1049 then
		假人[#假人 + 1] = {
			模型 = "考官2",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "殷丞相",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_程夫人",
			商业分类3 = 0,
			Y = 37,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "殷夫人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1056 then
		假人[#假人 + 1] = {
			模型 = "女人_程夫人",
			商业分类3 = 0,
			Y = 18,
			方向 = 1,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "秦夫人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1057 then
		假人[#假人 + 1] = {
			模型 = "秦琼",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "秦琼",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1081 then
		假人[#假人 + 1] = {
			模型 = "宝石商人",
			商业分类3 = 0,
			Y = 14,
			方向 = 1,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "钱庄老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1099 then
		假人[#假人 + 1] = {
			模型 = "宝石商人",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "钱庄老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1025 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 16,
			方向 = 1,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_武器店老板",
			名称 = "冯铁匠",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "铁王"
		}
		假人[#假人 + 1] = {
			模型 = "物件_打铁炉",
			商业分类3 = 0,
			Y = 19,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "打铁炉",
			名称 = "打铁炉",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1033 then
		假人[#假人 + 1] = {
			模型 = "罗百万",
			商业分类3 = 0,
			Y = 41,
			方向 = 3,
			X = 37,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "罗百万",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "少女",
			商业分类3 = 0,
			Y = 39,
			方向 = 1,
			X = 42,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小桃红",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "陈妈妈",
			商业分类3 = 0,
			Y = 33,
			方向 = 1,
			X = 33,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "陈妈妈",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1044 then
		假人[#假人 + 1] = {
			模型 = "考官2",
			商业分类3 = 0,
			Y = 52.5,
			方向 = 1,
			X = 70,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "魏征",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "考官2",
			商业分类3 = 0,
			Y = 57,
			方向 = 1,
			X = 78,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "房玄龄",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "皇帝",
			商业分类3 = 0,
			Y = 46,
			方向 = 0,
			X = 51,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "李世民",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1028 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 29,
			方向 = 0,
			X = 12,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_店小二",
			名称 = "店小二",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "挖宝图任务"
		}
		假人[#假人 + 1] = {
			模型 = "男人_酒店老板",
			商业分类3 = 0,
			Y = 34,
			方向 = 1,
			X = 41,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "酒店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1198 then
		假人[#假人 + 1] = {
			模型 = "女人_程夫人",
			商业分类3 = 0,
			Y = 26,
			方向 = 0,
			X = 28,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "程夫人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 28,
			方向 = 0,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "丫鬟",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 95,
			方向 = 0,
			X = 89,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "程府护卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 82.4,
			方向 = 0,
			X = 121.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "程府护卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 79,
			方向 = 0,
			X = 128,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "程府护卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "护卫",
			商业分类3 = 0,
			Y = 63,
			方向 = 0,
			X = 155,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "程府护卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 61,
			方向 = 0,
			X = 72,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "护卫",
			名称 = "传送护卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1054 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "程咬金",
			名称 = "程咬金",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1016 then
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 18.7,
			方向 = 0,
			X = 13.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "药店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1024 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 1,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_镖头",
			名称 = "郑镖头",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "镖王活动"
		}
	elseif 地图ID == 1020 then
		假人[#假人 + 1] = {
			模型 = "男人_老孙头",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 16,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "武器店掌柜",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_武器店老板",
			商业分类3 = 0,
			Y = 21,
			方向 = 1,
			X = 28,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "武器店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1026 then
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 26,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "吴举人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1030 then
		假人[#假人 + 1] = {
			模型 = "男人_酒店老板",
			商业分类3 = 0,
			Y = 24,
			方向 = 1,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "酒店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1002 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 55,
			方向 = 1,
			X = 37,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_胖和尚",
			名称 = "疥癞和尚",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "水陆大会"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 66,
			方向 = 1,
			X = 58,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_胖和尚",
			名称 = "接引僧",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 60,
			方向 = 1,
			X = 46,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "慧海",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 51,
			方向 = 2,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "慧悲",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 25,
			方向 = 0,
			X = 40,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_方丈",
			名称 = "空慈方丈",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 47,
			方向 = 0,
			X = 113,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "慧静",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1004 then
		假人[#假人 + 1] = {
			Y = 49,
			商业分类3 = 0,
			武器染色方案 = 20113,
			执行事件 = "不执行",
			方向 = 0,
			X = 54,
			武器 = "擒龙",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "逍遥生",
			名称 = "马超",
			商业分类4 = 0,
			商业分类1 = 0,
			武器染色组 = {
				[1.0] = 1,
				[2.0] = 0
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 7,
			方向 = 0,
			X = 71,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "狐狸精",
			名称 = "妩媚狐仙",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1005 then
		假人[#假人 + 1] = {
			Y = 23,
			商业分类3 = 0,
			武器染色方案 = 20113,
			执行事件 = "不执行",
			方向 = 0,
			X = 85,
			武器 = "若木",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "羽灵神",
			名称 = "黄忠",
			商业分类4 = 0,
			商业分类1 = 0,
			武器染色组 = {
				[1.0] = 2,
				[2.0] = 0
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 71,
			方向 = 1,
			X = 77,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "赌徒",
			名称 = "赌霸城",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			方向 = 1,
			Y = 46,
			小地图名称颜色 = 0,
			模型 = "僵尸",
			名称 = "梦之魅",
			变异 = true,
			X = 9,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1006 then
		假人[#假人 + 1] = {
			Y = 36,
			商业分类3 = 0,
			武器染色方案 = 20113,
			执行事件 = "不执行",
			方向 = 0,
			X = 54,
			武器 = "飞龙在天",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "龙太子",
			名称 = "张飞",
			商业分类4 = 0,
			商业分类1 = 0,
			武器染色组 = {
				[1.0] = 3,
				[2.0] = 0
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 10,
			方向 = 1,
			X = 71,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "天将",
			名称 = "半阁守将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1007 then
		假人[#假人 + 1] = {
			Y = 41,
			商业分类3 = 0,
			武器染色方案 = 20113,
			执行事件 = "不执行",
			方向 = 0,
			X = 79,
			武器 = "裂天",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "巨魔王",
			名称 = "关羽",
			商业分类4 = 0,
			商业分类1 = 0,
			武器染色组 = {
				[1.0] = 4,
				[2.0] = 0
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 103,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "兔子怪",
			名称 = "流氓兔",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			方向 = 0,
			Y = 40,
			小地图名称颜色 = 0,
			模型 = "僵尸",
			名称 = "血之魅",
			变异 = true,
			X = 11,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			方向 = 3,
			Y = 40,
			小地图名称颜色 = 0,
			模型 = "蛤蟆精",
			名称 = "奔波儿灞",
			变异 = true,
			X = 128,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1008 then
		假人[#假人 + 1] = {
			Y = 36,
			商业分类3 = 0,
			武器染色方案 = 20113,
			执行事件 = "不执行",
			方向 = 0,
			X = 59,
			武器 = "弑皇",
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "龙太子",
			名称 = "赵云",
			商业分类4 = 0,
			商业分类1 = 0,
			武器染色组 = {
				[1.0] = 5,
				[2.0] = 0
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 103,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "兔子怪",
			名称 = "流氓兔",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			方向 = 0,
			Y = 32,
			小地图名称颜色 = 0,
			模型 = "僵尸",
			名称 = "森之魅",
			变异 = true,
			X = 51,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1090 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 44,
			方向 = 0,
			X = 70,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "风伯",
			名称 = "大雁塔塔主",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1009 then
		假人[#假人 + 1] = {
			模型 = "男人_将军",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 29,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "镇塔之神",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			染色方案 = 74,
			Y = 23,
			执行事件 = "不执行",
			方向 = 1,
			X = 58,
			商业分类3 = 0,
			商业分类2 = 0,
			小地图名称颜色 = 3,
			模型 = "强盗",
			名称 = "狂盗",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇",
			染色组 = {
				1,
				1
			}
		}
	elseif 地图ID == 1528 then
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 23,
			方向 = 0,
			X = 14,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "慧明",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 3,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "空度禅师",
			名称 = "法明长老",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
	elseif 地图ID == 1043 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 7,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "空度禅师",
			名称 = "空度禅师",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1017 then
		假人[#假人 + 1] = {
			模型 = "女人_赵姨娘",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "饰品店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1022 then
		假人[#假人 + 1] = {
			模型 = "男人_服装店老板",
			商业分类3 = 0,
			Y = 19,
			方向 = 1,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "服装店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1092 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 135,
			方向 = 0,
			X = 188,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "船夫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送东海湾"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 51,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_诗中仙",
			名称 = "仙岛引路人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送蓬莱仙岛"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 67,
			方向 = 0,
			X = 63,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安城"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 119,
			方向 = 0,
			X = 53,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 98,
			方向 = 0,
			X = 67,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蝴蝶仙子",
			名称 = "蝴蝶妹妹",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
		假人[#假人 + 1] = {
			模型 = "九头精怪",
			商业分类3 = 0,
			Y = 64,
			方向 = 0,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "九头精怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 59,
			方向 = 2,
			X = 144,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "雨师",
			名称 = "报名官",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "游泳比赛"
		}
		假人[#假人 + 1] = {
			模型 = "兔子怪",
			商业分类3 = 0,
			Y = 42,
			方向 = 1,
			X = 107,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "偷偷怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 6,
			方向 = 0,
			X = 202,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "马猴",
			名称 = "金毛猿",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "幻域迷宫"
		}
		假人[#假人 + 1] = {
			模型 = "珍品商人",
			商业分类3 = 0,
			Y = 38,
			方向 = 1,
			X = 56,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "傲来珍品商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 46,
			方向 = 1,
			X = 180,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "傲来商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 41,
			方向 = 1,
			X = 87,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "傲来货商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "马猴",
			商业分类3 = 0,
			Y = 47,
			方向 = 0,
			X = 57,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "红毛猿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 143,
			方向 = 0,
			X = 150,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_钓鱼",
			名称 = "渔夫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "钓鱼"
		}
		假人[#假人 + 1] = {
			Y = 128,
			染色方案 = 73,
			模型 = "古代瑞兽",
			名称 = "蓝火兽",
			方向 = 0,
			X = 197,
			称谓 = "旭梦篇",
			染色组 = {
				1,
				1
			}
		}
		假人[#假人 + 1] = {
			Y = 90,
			染色方案 = 66,
			模型 = "大蝙蝠",
			名称 = "吸血蝙蝠",
			方向 = 0,
			X = 188,
			称谓 = "旭梦篇",
			染色组 = {
				1,
				0
			}
		}
		假人[#假人 + 1] = {
			Y = 86,
			染色方案 = 68,
			模型 = "狼",
			名称 = "肾宝狼",
			方向 = 0,
			X = 115,
			称谓 = "旭梦篇",
			染色组 = {
				1,
				0
			}
		}
	elseif 地图ID == 1093 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 21,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_酒店老板",
			名称 = "王福来",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			模型 = "考官1",
			商业分类3 = 0,
			Y = 18,
			方向 = 0,
			X = 44,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "慕容先生",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1104 then
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 28,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "沈妙衣",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1100 then
		假人[#假人 + 1] = {
			Y = 30,
			小地图名称颜色 = 0,
			模型 = "少女",
			名称 = "小紫",
			方向 = 3,
			X = 30,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1105 then
		假人[#假人 + 1] = {
			模型 = "男人_巫医",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "杂货店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1101 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 18,
			方向 = 1,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "杜天",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1095 then
		假人[#假人 + 1] = {
			模型 = "男人_服装店老板",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 27,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "牛师傅",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1142 then
		假人[#假人 + 1] = {
			模型 = "女人_翠花",
			商业分类3 = 0,
			Y = 96,
			方向 = 0,
			X = 73,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "翠花",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_栗栗娘",
			商业分类3 = 0,
			Y = 56,
			方向 = 0,
			X = 102,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "栗栗娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 98,
			方向 = 0,
			X = 11,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "柳飞絮",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_绿儿",
			商业分类3 = 0,
			Y = 68,
			方向 = 1,
			X = 77,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "绿儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_绿儿",
			商业分类3 = 0,
			Y = 70,
			方向 = 1,
			X = 34,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "翠儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 14,
			方向 = 0,
			X = 24,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_丫鬟",
			名称 = "接引女使",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1143 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "孙婆婆",
			名称 = "孙婆婆",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1137 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 30,
			方向 = 1,
			X = 45,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "菩提祖师",
			名称 = "菩提祖师",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1111 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 154,
			方向 = 0,
			X = 242,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "天兵",
			名称 = "守门天将",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长寿郊外"
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 149.5,
			方向 = 0,
			X = 231.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "执法天兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 146,
			方向 = 0,
			X = 238.8,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门天兵",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 109.8,
			方向 = 0,
			X = 148.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "芙蓉仙子",
			名称 = "接引仙女",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "男人_道童",
			商业分类3 = 0,
			Y = 146.5,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门道童",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道童",
			商业分类3 = 0,
			Y = 144,
			方向 = 0,
			X = 32,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门道童",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 102,
			方向 = 0,
			X = 175,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "千里眼",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 113,
			方向 = 0,
			X = 117,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "顺风耳",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 95,
			方向 = 0,
			X = 229,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_诗中仙",
			名称 = "马真人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "修炼任务"
		}
		假人[#假人 + 1] = {
			模型 = "天将",
			商业分类3 = 0,
			Y = 25,
			方向 = 0,
			X = 228,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天牢守卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_将军",
			商业分类3 = 0,
			Y = 28,
			方向 = 1,
			X = 175,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "水兵统领",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "风伯",
			商业分类3 = 0,
			Y = 39,
			方向 = 2,
			X = 19,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "大力神灵",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6035 then
		假人[#假人 + 1] = {
			染色方案 = 10,
			Y = 76,
			执行事件 = "不执行",
			方向 = 4,
			X = 89,
			武器 = "弑皇",
			商业分类2 = 0,
			商业分类3 = 0,
			小地图名称颜色 = 0,
			模型 = "龙太子",
			名称 = "秋风的回忆",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇",
			染色组 = {
				3,
				3,
				4
			}
		}
	elseif 地图ID == 6040 then
		假人[#假人 + 1] = {
			染色方案 = 10,
			Y = 10,
			执行事件 = "不执行",
			方向 = 4,
			X = 117,
			武器 = "弑皇",
			商业分类2 = 0,
			商业分类3 = 0,
			小地图名称颜色 = 0,
			模型 = "龙太子",
			名称 = "秋风的回忆",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇",
			染色组 = {
				3,
				3,
				4
			}
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 128,
			方向 = 0,
			X = 193,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "太白金星",
			名称 = "太白金星",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 6041 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_太上老君",
			名称 = "太上老君",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "灵鹤",
			名称 = "三清",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 6042 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 33,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_玉帝",
			名称 = "玉皇大帝",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "旭梦篇"
		}
	elseif 地图ID == 1112 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 53.4,
			方向 = 0,
			X = 54.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_杨戬",
			名称 = "杨戬",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "降妖伏魔"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 43,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "李靖",
			名称 = "李靖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
		假人[#假人 + 1] = {
			模型 = "男人_玉帝",
			商业分类3 = 0,
			Y = 34.8,
			方向 = 0,
			X = 29.8,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "玉皇大帝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_王母",
			商业分类3 = 0,
			Y = 31.5,
			方向 = 0,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "王母娘娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_哪吒",
			商业分类3 = 0,
			Y = 46.8,
			方向 = 0,
			X = 65.7,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "哪吒",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1113 then
		假人[#假人 + 1] = {
			模型 = "男人_太上老君",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 14,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "太上老君",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道士",
			商业分类3 = 0,
			Y = 23,
			方向 = 1,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "炼丹道士",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道童",
			商业分类3 = 0,
			Y = 23,
			方向 = 0,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "金童子",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1114 then
		假人[#假人 + 1] = {
			模型 = "男人_打铁",
			商业分类3 = 0,
			Y = 60,
			方向 = 0,
			X = 12,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "吴刚",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_满天星",
			商业分类3 = 0,
			Y = 30,
			方向 = 1,
			X = 116,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "嫦娥",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天兵",
			商业分类3 = 0,
			Y = 35,
			方向 = 3,
			X = 104,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "康太尉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			Y = 33,
			小地图名称颜色 = 0,
			模型 = "普陀_接引仙女",
			名称 = "月香侍女",
			方向 = 1,
			X = 109,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1512 then
		假人[#假人 + 1] = {
			模型 = "牛妖",
			商业分类3 = 0,
			Y = 75,
			方向 = 1,
			X = 13,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门牛妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "牛妖",
			商业分类3 = 0,
			Y = 78,
			方向 = 1,
			X = 17,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守门牛妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 13,
			方向 = 1,
			X = 87,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "牛妖",
			名称 = "传送牛妖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "九头精怪",
			商业分类3 = 0,
			Y = 65,
			方向 = 1,
			X = 113,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "九头精怪",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1145 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 1,
			X = 33,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 0,
			模型 = "牛魔王",
			名称 = "牛魔王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1146 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 37,
			方向 = 1,
			X = 46.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_道童",
			名称 = "接引道童",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "男人_道童",
			商业分类3 = 0,
			Y = 43,
			方向 = 1,
			X = 60,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "清风",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 17,
			方向 = 1,
			X = 88,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "幽灵虎",
			名称 = "幽灵虎",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1147 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20.5,
			方向 = 1,
			X = 25.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "镇元大仙",
			名称 = "镇元大仙",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1131 then
		假人[#假人 + 1] = {
			模型 = "雷鸟人",
			商业分类3 = 0,
			Y = 8,
			方向 = 1,
			X = 114,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守山小妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "雷鸟人",
			商业分类3 = 0,
			Y = 12.5,
			方向 = 1,
			X = 119.2,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "守山小妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 71,
			方向 = 1,
			X = 111,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "雷鸟人",
			名称 = "传送小妖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1132 then
		假人[#假人 + 1] = {
			模型 = "二大王",
			商业分类3 = 0,
			Y = 19,
			方向 = 1,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "二大王",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1133 then
		假人[#假人 + 1] = {
			模型 = "三大王",
			商业分类3 = 0,
			Y = 21,
			方向 = 1,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "三大王",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1134 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 19.2,
			方向 = 0,
			X = 29.2,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "大大王",
			名称 = "大大王",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师父"
		}
	elseif 地图ID == 1513 then
		假人[#假人 + 1] = {
			模型 = "芙蓉仙子",
			商业分类3 = 0,
			Y = 104,
			方向 = 1,
			X = 110,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "女妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "如意仙子",
			商业分类3 = 0,
			Y = 81,
			方向 = 0,
			X = 64.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "金琉璃",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 85,
			方向 = 2,
			X = 73,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "栗栗儿",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "树怪",
			商业分类3 = 0,
			Y = 27.5,
			方向 = 1,
			X = 171.8,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "看门小妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "树怪",
			商业分类3 = 0,
			Y = 33,
			方向 = 1,
			X = 180,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "看门小妖",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 22,
			方向 = 1,
			X = 180,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蝴蝶仙子",
			名称 = "引路小妖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1144 then
		假人[#假人 + 1] = {
			模型 = "春十三娘",
			商业分类3 = 0,
			Y = 42,
			方向 = 1,
			X = 30,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "春十三娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 13,
			方向 = 1,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "白晶晶",
			名称 = "白晶晶",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1138 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 92,
			方向 = 0,
			X = 54,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "巫师",
			名称 = "引路族民",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			模型 = "巫师",
			商业分类3 = 0,
			Y = 68,
			方向 = 0,
			X = 22,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "云中月",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_云小奴",
			商业分类3 = 0,
			Y = 48,
			方向 = 0,
			X = 17,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "云小奴",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_满天星",
			商业分类3 = 0,
			Y = 37,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "满天星",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1154 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 32,
			方向 = 0,
			X = 33.5,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "巫奎虎",
			名称 = "巫奎虎",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
	elseif 地图ID == 1228 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 173,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_土地",
			名称 = "碗子山土地",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送无底洞"
		}
	elseif 地图ID == 1139 then
		假人[#假人 + 1] = {
			模型 = "幽萤娃娃",
			商业分类3 = 0,
			Y = 49,
			方向 = 1,
			X = 85,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "璎珞",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "修罗傀儡妖",
			商业分类3 = 0,
			Y = 54,
			方向 = 0,
			X = 4,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "墨衣",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "修罗傀儡妖",
			商业分类3 = 0,
			Y = 15,
			方向 = 1,
			X = 29,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "红莲",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 120,
			方向 = 0,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "幽萤娃娃",
			名称 = "接引小妖",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
	elseif 地图ID == 1156 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 27.6,
			方向 = 1,
			X = 49.6,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "地涌夫人",
			名称 = "地涌夫人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
		假人[#假人 + 1] = {
			模型 = "女人_灵鼠娃娃",
			商业分类3 = 0,
			Y = 33,
			方向 = 1,
			X = 55,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "灵鼠娃娃",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1235 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 92,
			方向 = 3,
			X = 464,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送西梁女国"
		}
	elseif 地图ID == 1210 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 140,
			方向 = 2,
			X = 70,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送宝象国"
		}
	elseif 地图ID == 1207 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 101.8,
			方向 = 2,
			X = 9.2,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_驿站老板",
			名称 = "驿站老板",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送傲来国"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 44,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "玄武",
			名称 = "玄武",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1232 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 7,
			方向 = 0,
			X = 125,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "剑魂",
			名称 = "剑魂",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1231 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 7,
			方向 = 0,
			X = 125,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "剑魂",
			名称 = "剑魂",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1920 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 26,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "魔化毗舍童子",
			名称 = "魔化毗舍童子",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "战宠获赠"
		}
	elseif 地图ID == 1070 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 141,
			方向 = 0,
			X = 120,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_胖和尚",
			名称 = "慧觉和尚",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "车迟斗法副本"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 185,
			方向 = 0,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_老书生",
			名称 = "陆萧然",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "任务链"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 71,
			方向 = 1,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "蝴蝶仙子",
			名称 = "蝴蝶女",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "通天河副本"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 194,
			方向 = 1,
			X = 53,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "太白金星",
			名称 = "太白金星",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "仙族任务"
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 175,
			方向 = 0,
			X = 107,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "海老先生",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 51,
			方向 = 2,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "钟书生",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "少女",
			商业分类3 = 0,
			Y = 35,
			方向 = 0,
			X = 76,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "许姑娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "仓库保管员",
			商业分类3 = 0,
			Y = 149,
			方向 = 0,
			X = 100,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "仓库管理员",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 22,
			方向 = 1,
			X = 107,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "南极仙翁",
			名称 = "南极仙翁",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "剧情技能"
		}
		假人[#假人 + 1] = {
			模型 = "珍品商人",
			商业分类3 = 0,
			Y = 158,
			方向 = 0,
			X = 109,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长寿珍品商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_特产商人",
			商业分类3 = 0,
			Y = 41,
			方向 = 1,
			X = 141,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长寿商人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 168,
			方向 = 1,
			X = 54,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长寿货商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_王大嫂",
			商业分类3 = 0,
			Y = 144,
			方向 = 1,
			X = 80,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "许大娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 101,
			方向 = 1,
			X = 126,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			模型 = "男人_巫医",
			名称 = "超级巫医",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "召唤兽治疗师"
		}
		假人[#假人 + 1] = {
			模型 = "男人_老伯",
			商业分类3 = 0,
			Y = 82,
			方向 = 1,
			X = 76,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "毛驴张",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 103,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "凤凰姑娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 140,
			方向 = 1,
			X = 43,
			商业分类2 = 0,
			小地图名称颜色 = 2,
			模型 = "女人_孟婆",
			名称 = "马婆婆",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "领养孩子"
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 169,
			方向 = 0,
			X = 16,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "长寿村村长",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 113,
			方向 = 1,
			X = 50,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_兰虎",
			名称 = "PK申请人",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "不服就干"
		}
		假人[#假人 + 1] = {
			模型 = "男人_药店老板",
			商业分类3 = 0,
			Y = 192,
			方向 = 0,
			X = 89,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "药店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1083 then
		假人[#假人 + 1] = {
			模型 = "男人_服装店老板",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 23.2,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "裁缝张",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1213 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 47,
			方向 = 0,
			X = 114,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "鼠先锋",
			名称 = "子鼠",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二生肖"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 38,
			方向 = 0,
			X = 113,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "超级神牛",
			名称 = "丑牛",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二生肖"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 28,
			方向 = 0,
			X = 115,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "超级神虎",
			名称 = "寅虎",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二生肖"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 117,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "超级神兔",
			名称 = "卯兔",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "十二生肖"
		}
	elseif 地图ID == 1085 then
		假人[#假人 + 1] = {
			模型 = "男人_武器店老板",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 19,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "武器店老板",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1204 then
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 48,
			方向 = 0,
			X = 22,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "丹青生",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1875 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 22,
			方向 = 0,
			X = 23,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "帮派总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "黑色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1865 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 19,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "青龙总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 19,
			方向 = 1,
			X = 30,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "橙色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1855 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 16,
			方向 = 1,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "男人_药店老板",
			名称 = "药房总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "红色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1845 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 18,
			方向 = 0,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "厢房总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 23,
			方向 = 0,
			X = 16,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "绿色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1835 then
		假人[#假人 + 1] = {
			模型 = "帮派妖兽",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 20,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "帮派守护兽",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 22,
			方向 = 0,
			X = 35,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "青色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1825 then
		假人[#假人 + 1] = {
			模型 = "男人_师爷",
			商业分类3 = 0,
			Y = 17,
			方向 = 0,
			X = 15,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "帮派师爷",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 21,
			方向 = 0,
			X = 33,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "蓝色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1815 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 22,
			方向 = 0,
			X = 22,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "金库总管",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "帮派机关人",
			商业分类3 = 0,
			Y = 20,
			方向 = 0,
			X = 27,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "紫色机关人",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6021 then
		假人[#假人 + 1] = {
			模型 = "道观",
			商业分类3 = 0,
			Y = 28,
			方向 = 0,
			X = 88,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "道观",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6024 then
		假人[#假人 + 1] = {
			模型 = "男人_方丈",
			商业分类3 = 0,
			Y = 61,
			方向 = 0,
			X = 38,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "道场督僧",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_胖和尚",
			商业分类3 = 0,
			Y = 86,
			方向 = 0,
			X = 4,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "道场童子",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6025 then
		假人[#假人 + 1] = {
			模型 = "男人_马副将",
			商业分类3 = 0,
			Y = 6,
			方向 = 0,
			X = 501,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_师爷",
			商业分类3 = 0,
			Y = 125,
			方向 = 1,
			X = 483,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "代笔师爷",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老伯",
			商业分类3 = 0,
			Y = 119,
			方向 = 1,
			X = 478,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "瓜农",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_染色师",
			商业分类3 = 0,
			Y = 162,
			方向 = 0,
			X = 459,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "绣娘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 147,
			方向 = 0,
			X = 483,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "喜轿轿夫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 182,
			方向 = 0,
			X = 430,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卖艺者",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 184,
			方向 = 1,
			X = 455,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "乞丐乙",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 192,
			方向 = 1,
			X = 470,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "阿咪",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "珍品商人",
			商业分类3 = 0,
			Y = 211,
			方向 = 1,
			X = 407,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "马商",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_绿儿",
			商业分类3 = 0,
			Y = 203,
			方向 = 1,
			X = 401,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小顽童",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_绿儿",
			商业分类3 = 0,
			Y = 219,
			方向 = 1,
			X = 420,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卖花童",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 222,
			方向 = 1,
			X = 424,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "丫鬟",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "普陀_接引仙女",
			商业分类3 = 0,
			Y = 225,
			方向 = 1,
			X = 431,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "富家小姐",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 229,
			方向 = 1,
			X = 442,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "卖鱼人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_苦力",
			商业分类3 = 0,
			Y = 223,
			方向 = 1,
			X = 443,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "面点师傅",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_王大嫂",
			商业分类3 = 0,
			Y = 240,
			方向 = 1,
			X = 464,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "针线娘子",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "樵夫",
			商业分类3 = 0,
			Y = 262,
			方向 = 0,
			X = 462,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "樵夫",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_老财",
			商业分类3 = 0,
			Y = 228,
			方向 = 2,
			X = 427,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "大财主",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_衙役",
			商业分类3 = 0,
			Y = 225,
			方向 = 2,
			X = 421,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "曾衙役",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_村长",
			商业分类3 = 0,
			Y = 243,
			方向 = 0,
			X = 370,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "布陈太医",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 234,
			方向 = 0,
			X = 389,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "游方郎中",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1249 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 29,
			方向 = 1,
			X = 86,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_云小奴",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送至长安"
		}
	elseif 地图ID == 1250 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 46,
			方向 = 1,
			X = 137,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_云小奴",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送至长安"
		}
	elseif 地图ID == 1251 then
		假人[#假人 + 1] = {
			模型 = "孙悟空",
			商业分类3 = 0,
			Y = 16,
			方向 = 1,
			X = 91,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "齐天大圣",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 24,
			方向 = 1,
			X = 90,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "女人_云小奴",
			名称 = "传送侍卫",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送至长安"
		}
		假人[#假人 + 1] = {
			Y = 74,
			小地图名称颜色 = 0,
			模型 = "进阶长眉灵猴",
			名称 = "流元帅",
			方向 = 0,
			X = 40,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 63,
			小地图名称颜色 = 0,
			模型 = "长眉灵猴",
			名称 = "崩将军",
			方向 = 0,
			X = 82,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 111,
			小地图名称颜色 = 0,
			模型 = "巨力神猿",
			名称 = "芭将军",
			方向 = 0,
			X = 106,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 34,
			小地图名称颜色 = 0,
			模型 = "进阶巨力神猿",
			名称 = "幻境戍守",
			方向 = 2,
			X = 38,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 33,
			小地图名称颜色 = 0,
			模型 = "进阶巨力神猿",
			名称 = "幻境戍守",
			方向 = 2,
			X = 44,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 35,
			小地图名称颜色 = 0,
			模型 = "生肖猴",
			名称 = "马元帅",
			方向 = 1,
			X = 27,
			执行事件 = "不执行"
		}
	elseif 地图ID == 1252 then
		假人[#假人 + 1] = {
			模型 = "天女魃",
			商业分类3 = 0,
			Y = 16,
			方向 = 1,
			X = 41,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天女魃",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1253 then
		假人[#假人 + 1] = {
			模型 = "小夫子",
			商业分类3 = 0,
			Y = 127,
			方向 = 1,
			X = 58,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小夫子",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1332 then
		假人[#假人 + 1] = {
			模型 = "女人_丫鬟",
			商业分类3 = 0,
			Y = 44,
			方向 = 3,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "女佣",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_师爷",
			商业分类3 = 0,
			Y = 49,
			方向 = 2,
			X = 46,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "管家",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1340 then
		假人[#假人 + 1] = {
			Y = 26,
			执行事件 = "不执行",
			模型 = "进阶超级神龙",
			名称 = "看门爬虫",
			方向 = 1,
			X = 16
		}
		假人[#假人 + 1] = {
			Y = 32,
			执行事件 = "不执行",
			模型 = "进阶超级神龙",
			名称 = "看门爬虫",
			方向 = 1,
			X = 24
		}
	elseif 地图ID == 6037 then
		假人[#假人 + 1] = {
			模型 = "男人_判官",
			商业分类3 = 0,
			Y = 65,
			方向 = 0,
			X = 47,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "判官",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "阎罗王",
			商业分类3 = 0,
			Y = 53,
			方向 = 0,
			X = 31,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "阎王",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6038 then
		假人[#假人 + 1] = {
			模型 = "男人_玉帝",
			商业分类3 = 0,
			Y = 108,
			方向 = 0,
			X = 152,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "玉皇大帝",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "猪八戒",
			商业分类3 = 0,
			Y = 104,
			方向 = 3,
			X = 247,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "天蓬元帅",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6039 then
		假人[#假人 + 1] = {
			模型 = "男人_将军",
			商业分类3 = 0,
			Y = 24,
			方向 = 0,
			X = 25,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "镇塔之神",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 1532 then
		假人[#假人 + 1] = {
			模型 = "男人_小白龙",
			商业分类3 = 0,
			Y = 8,
			方向 = 1,
			X = 46,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "小白龙",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 2007 then
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 100,
			方向 = 1,
			X = 80,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "刑天",
			名称 = "刑天",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "门派师傅"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 44,
			方向 = 0,
			X = 74,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "风祖飞廉",
			名称 = "风祖飞廉",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "传送长安"
		}
		假人[#假人 + 1] = {
			执行事件 = "不执行",
			商业分类3 = 0,
			Y = 94,
			方向 = 1,
			X = 82,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			模型 = "食铁兽",
			名称 = "食铁兽",
			商业分类4 = 0,
			商业分类1 = 0,
			称谓 = "铸斧转换"
		}
	elseif 地图ID == 34470 then
		假人[#假人 + 1] = {
			模型 = "骷髅怪",
			变异 = true,
			商业分类3 = 0,
			Y = 20,
			方向 = 1,
			X = 306,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "猪头七",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "牛头",
			变异 = true,
			商业分类3 = 0,
			Y = 39,
			方向 = 1,
			X = 339,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "哨探头领",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "天将",
			变异 = true,
			商业分类3 = 0,
			Y = 84,
			方向 = 1,
			X = 370,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "山门守将",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "猪八戒",
			商业分类3 = 0,
			Y = 66,
			方向 = 1,
			X = 404,
			商业分类2 = 0,
			显示饰品 = true,
			小地图名称颜色 = 3,
			执行事件 = "不执行",
			名称 = "天蓬元帅",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 34471 then
		假人[#假人 + 1] = {
			模型 = "女人_万圣公主",
			商业分类3 = 0,
			Y = 50,
			方向 = 1,
			X = 18,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "万圣公主",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 34480 then
		假人[#假人 + 1] = {
			模型 = "唐僧",
			商业分类3 = 0,
			Y = 13,
			方向 = 1,
			X = 55,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "玄奘",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_镖头",
			商业分类3 = 0,
			Y = 16,
			方向 = 1,
			X = 64,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "镇山太保刘伯钦",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "女人_孟婆",
			商业分类3 = 0,
			Y = 18,
			方向 = 1,
			X = 71,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "婆婆",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 34482 then
		假人[#假人 + 1] = {
			模型 = "男人_兰虎",
			商业分类3 = 0,
			Y = 17,
			方向 = 1,
			X = 173,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "黑汉",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_道士",
			商业分类3 = 0,
			Y = 22,
			方向 = 3,
			X = 162,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "道人",
			商业分类4 = 0,
			商业分类1 = 0
		}
		假人[#假人 + 1] = {
			模型 = "男人_书生",
			商业分类3 = 0,
			Y = 15,
			方向 = 0,
			X = 164,
			商业分类2 = 0,
			小地图名称颜色 = 0,
			执行事件 = "不执行",
			名称 = "白衣秀士",
			商业分类4 = 0,
			商业分类1 = 0
		}
	elseif 地图ID == 6032 then
		假人[#假人 + 1] = {
			Y = 84,
			变异 = true,
			小地图名称颜色 = 0,
			模型 = "护卫",
			名称 = "造酒仙官",
			方向 = 0,
			X = 10,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 85,
			变异 = true,
			小地图名称颜色 = 0,
			模型 = "雨师",
			名称 = "运水道人",
			方向 = 1,
			X = 81,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 45,
			变异 = true,
			小地图名称颜色 = 0,
			模型 = "小魔头",
			名称 = "烧火童子",
			方向 = 0,
			X = 90,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 70,
			变异 = true,
			小地图名称颜色 = 0,
			模型 = "风伯",
			名称 = "盘槽力士",
			方向 = 0,
			X = 114,
			执行事件 = "不执行"
		}
	elseif 地图ID == 6031 then
		假人[#假人 + 1] = {
			Y = 41,
			小地图名称颜色 = 0,
			模型 = "樵夫",
			名称 = "锄树力士",
			方向 = 0,
			X = 89,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 40,
			小地图名称颜色 = 0,
			模型 = "至尊宝",
			名称 = "运水力士",
			方向 = 1,
			X = 103,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 49,
			小地图名称颜色 = 0,
			模型 = "男人_打铁",
			名称 = "修桃力士",
			方向 = 3,
			X = 94,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 17,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "一千年桃树",
			方向 = 0,
			X = 77,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 33,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "两千年桃树",
			方向 = 0,
			X = 14,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 60,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "三千年桃树",
			方向 = 0,
			X = 10,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 102,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "四千年桃树",
			方向 = 0,
			X = 73,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 84,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "五千年桃树",
			方向 = 0,
			X = 134,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 53,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "六千年桃树",
			方向 = 0,
			X = 149,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 25,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "七千年桃树",
			方向 = 0,
			X = 143,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 62,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "八千年桃树",
			方向 = 0,
			X = 83,
			执行事件 = "不执行"
		}
		假人[#假人 + 1] = {
			Y = 35,
			小地图名称颜色 = 0,
			模型 = "桃树",
			名称 = "九千年桃树",
			方向 = 0,
			X = 78,
			执行事件 = "不执行"
		}
	end

	if 假人ID == nil then
		if 名称 ~= nil then
			for i = 1, #假人 do
				if 假人[i].名称 == 名称 then
					return {
						X = qz1(假人[i].X),
						Y = qz1(假人[i].Y)
					}
				end
			end
		end

		return nil
	else
		return 假人[假人ID]
	end
end
