取明雷 = function(map)
	local ems = nil

	if map == 1004 then
		ems = {
			"羊头怪",
			"赌徒",
			"强盗",
			"骷髅怪",
			"蛤蟆精",
			"狐狸精"
		}
	elseif map == 1005 then
		ems = {
			"羊头怪",
			"赌徒",
			"强盗",
			"骷髅怪",
			"蛤蟆精",
			"狐狸精"
		}
	elseif map == 1006 then
		ems = {
			"羊头怪",
			"花妖",
			"骷髅怪",
			"蛤蟆精",
			"狐狸精"
		}
	elseif map == 1007 then
		ems = {
			"羊头怪",
			"花妖",
			"骷髅怪",
			"蛤蟆精",
			"狐狸精"
		}
	elseif map == 1008 then
		ems = {
			"羊头怪",
			"花妖",
			"骷髅怪",
			"蛤蟆精",
			"狐狸精"
		}
	elseif map == 1090 then
		ems = {
			"羊头怪",
			"花妖",
			"大蝙蝠",
			"蛤蟆精",
			"狐狸精"
		}
	end

	return ems
end

取野怪 = function(map, 天气)
	local ems, lvs = nil

	if map == 1231 then
		ems = {
			"金乌虫",
			"长眉灵猴",
			"巨力神猿",
			"混沌兽"
		}

		if 取随机数() <= 20 then
			ems[#ems + 1] = "执音"
		end
	elseif map == 1235 then
		ems = {
			"沙虫",
			"沙狸",
			"牛妖",
			"牛妖x",
			"小龙女",
			"小龙女x",
			"狼",
			"狼x",
			"蜘蛛精",
			"蜘蛛精x",
			"兔子怪",
			"兔子怪x",
			"黑熊精",
			"黑熊精x",
			"黑山老妖",
			"黑山老妖x",
			"雷鸟人",
			"雷鸟人x",
			"古代瑞兽",
			"古代瑞兽x"
		}

		if 取随机数() <= 10 then
			ems[#ems + 1] = "阿宝"
		end

		if 取随机数() <= 30 then
			ems[#ems + 1] = "龙鲤"
		end
	elseif map == 1221 then
		ems = {
			"阴阳伞",
			"机关人",
			"机关兽",
			"机关鸟",
			"连弩车",
			"巴蛇"
		}
	elseif map == 1228 then
		ems = {
			"日游神",
			"葫芦宝贝",
			"蝎子精"
		}
	elseif map == 1229 then
		ems = {
			"毗舍童子",
			"暗黑毗舍童子",
			"真陀护法",
			"持国巡守"
		}

		if 取随机数() <= 5 then
			ems[#ems + 1] = "黑白狂豹人形"
		end
	elseif map == 1204 then
		ems = {
			"阴阳伞",
			"雾中仙",
			"雾中仙x",
			"灵鹤",
			"灵鹤x"
		}

		if 取随机数() <= 5 then
			ems[#ems + 1] = "大力金刚"
		elseif 取随机数() <= 5 then
			ems[#ems + 1] = "大力金刚x"
		end
	elseif map == 1201 then
		ems = {
			"灵符女娲",
			"律法女娲",
			"阴阳伞",
			"净瓶女娲"
		}
	elseif map == 1042 then
		ems = {
			"毗舍童子",
			"暗黑毗舍童子",
			"真陀护法",
			"持国巡守"
		}
	elseif map == 1233 then
		ems = {
			"日游神",
			"修罗傀儡鬼",
			"藤蔓妖花",
			"蜃气妖"
		}
	elseif map == 1004 then
		ems = {
			"强盗",
			"强盗x",
			"赌徒",
			"赌徒x",
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"骷髅怪",
			"骷髅怪x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1005 then
		ems = {
			"强盗",
			"强盗x",
			"赌徒",
			"赌徒x",
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"骷髅怪",
			"骷髅怪x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1006 then
		ems = {
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"花妖",
			"花妖x",
			"骷髅怪",
			"骷髅怪x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1007 then
		ems = {
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"花妖",
			"花妖x",
			"骷髅怪",
			"骷髅怪x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1008 then
		ems = {
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"花妖",
			"花妖x",
			"骷髅怪",
			"骷髅怪x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1090 then
		ems = {
			"大蝙蝠",
			"狐狸精",
			"狐狸精x",
			"羊头怪",
			"羊头怪x",
			"花妖",
			"花妖x",
			"蛤蟆精",
			"蛤蟆精x"
		}
	elseif map == 1091 then
		ems = {
			"云龟",
			"竹笋虫",
			"小龙女",
			"小龙女x",
			"狼",
			"狼x"
		}
	elseif map == 1110 then
		ems = {
			"护卫",
			"沙狸",
			"纵火狸",
			"强盗狸",
			"强盗",
			"强盗x",
			"山贼",
			"山贼x",
			"赌徒",
			"赌徒x"
		}
	elseif map == 1173 then
		ems = {
			"岩龟",
			"花妖",
			"花妖x",
			"老虎",
			"老虎x",
			"黑熊",
			"黑熊x"
		}
	elseif map == 1512 then
		ems = {
			"熔岩龟",
			"熔火虫",
			"蛤蟆精",
			"蛤蟆精x",
			"牛妖",
			"牛妖x"
		}
	elseif map == 1131 then
		ems = {
			"蝴蝶仙子",
			"蝴蝶仙子x",
			"雷鸟人",
			"雷鸟人x"
		}
	elseif map == 1210 then
		ems = {
			"野猪精",
			"百足将军",
			"鼠先锋",
			"泪妖",
			"镜妖"
		}
	elseif map == 1207 then
		ems = {
			"阴阳伞",
			"琴仙",
			"踏云兽",
			"红萼仙子"
		}

		if 取随机数() <= 10 then
			ems[#ems + 1] = "龙龟"
		end
	elseif map == 1203 then
		ems = {
			"阴阳伞",
			"夜罗刹",
			"夜罗刹x",
			"炎魔神",
			"炎魔神x",
			"噬天虎",
			"噬天虎x",
			"金铙僧"
		}
	elseif map == 1041 then
		ems = {
			"蚌精",
			"鲛人",
			"碧水夜叉"
		}
	elseif map == 1140 then
		ems = {
			"黑熊精",
			"黑熊精x"
		}
	elseif map == 1513 then
		ems = {
			"狐狸精",
			"狐狸精x",
			"花妖",
			"花妖x",
			"蜘蛛精",
			"蜘蛛精x"
		}
	elseif map == 1506 then
		ems = {
			"大海龟",
			"海星",
			"海狸"
		}
	elseif map == 1507 then
		ems = {
			"大海龟",
			"巨蛙",
			"章鱼",
			"海星"
		}
	elseif map == 1193 then
		ems = {
			"草龟",
			"草叶虫",
			"积水蛙",
			"树怪",
			"狸",
			"野猪",
			"野猪x"
		}
	elseif map == 1126 then
		ems = {
			"大海龟",
			"巨蛙",
			"海狸",
			"海毛虫"
		}
	elseif map == 1508 then
		ems = {
			"巨蛙",
			"章鱼",
			"海星",
			"海毛虫"
		}
	elseif map == 1514 then
		ems = {
			"老虎",
			"老虎x",
			"黑熊",
			"黑熊x",
			"小龙女",
			"小龙女x"
		}
	elseif map == 1118 then
		ems = {
			"虾兵",
			"虾兵x"
		}
	elseif map == 1120 then
		ems = {
			"龟丞相",
			"龟丞相x"
		}
	elseif map == 1121 then
		ems = {
			"蟹将",
			"蟹将x",
			"龟丞相",
			"龟丞相x"
		}
	elseif map == 1532 then
		ems = {
			"虾兵",
			"虾兵x",
			"蟹将",
			"蟹将x",
			"龟丞相",
			"龟丞相x",
			"蚌精"
		}
	elseif map == 1119 then
		ems = {
			"蟹将",
			"蟹将x"
		}
	elseif map == 1127 then
		ems = {
			"熔岩龟",
			"熔火虫",
			"熔火蛙",
			"鬼蛙",
			"鬼狸",
			"野鬼",
			"野鬼x",
			"僵尸",
			"僵尸x"
		}
	elseif map == 1128 then
		ems = {
			"熔火蛙",
			"鬼蛙",
			"鬼狸",
			"骷髅怪",
			"骷髅怪x",
			"野鬼",
			"野鬼x"
		}
	elseif map == 1129 then
		ems = {
			"牛头",
			"牛头x",
			"马面",
			"马面x",
			"僵尸",
			"僵尸x"
		}
	elseif map == 1130 then
		ems = {
			"骷髅怪",
			"骷髅怪x",
			"僵尸",
			"僵尸x"
		}
	elseif map == 1202 then
		ems = {
			"吸血鬼",
			"吸血鬼x",
			"幽灵",
			"幽灵x",
			"阴阳伞",
			"鬼将",
			"鬼将x",
			"幽萤娃娃",
			"画魂"
		}
	elseif map == 1174 then
		ems = {
			"冰龟",
			"雪蛙",
			"雪狸",
			"白熊",
			"白熊x",
			"古代瑞兽",
			"古代瑞兽x",
			"天将",
			"天将x"
		}
	elseif map == 1177 then
		ems = {
			"雪狸",
			"黑山老妖",
			"黑山老妖x",
			"古代瑞兽",
			"古代瑞兽x"
		}
	elseif map == 1178 then
		ems = {
			"黑山老妖",
			"黑山老妖x",
			"白熊",
			"白熊x"
		}
	elseif map == 1179 then
		ems = {
			"天兵",
			"天兵x",
			"风伯",
			"风伯x"
		}
	elseif map == 1180 then
		ems = {
			"风伯",
			"风伯x",
			"蛟龙",
			"蛟龙x"
		}
	elseif map == 1181 then
		ems = {
			"地狱战神",
			"地狱战神x",
			"蛟龙",
			"蛟龙x"
		}
	elseif map == 1182 then
		ems = {
			"雨师",
			"雨师x",
			"巡游天神",
			"巡游天神x"
		}
	elseif map == 1183 then
		ems = {
			"地狱战神",
			"地狱战神x",
			"蛟龙",
			"蛟龙x",
			"星灵仙子",
			"星灵仙子x",
			"巡游天神",
			"巡游天神x",
			"阴阳伞",
			"虬龙"
		}
	elseif map == 1186 then
		ems = {
			"黑山老妖",
			"黑山老妖x",
			"天将",
			"天将x"
		}
	elseif map == 1187 then
		ems = {
			"雷鸟人",
			"雷鸟人x",
			"天兵",
			"天兵x"
		}
	elseif map == 1188 then
		ems = {
			"天兵",
			"天兵x",
			"地狱战神",
			"地狱战神x",
			"金翼"
		}
	elseif map == 1189 then
		ems = {
			"天将",
			"天将x",
			"凤凰",
			"凤凰x",
			"金翼"
		}
	elseif map == 1190 then
		ems = {
			"天将",
			"天将x",
			"凤凰",
			"凤凰x",
			"金翼"
		}
	elseif map == 1191 then
		ems = {
			"风伯",
			"风伯x",
			"芙蓉仙子",
			"芙蓉仙子x"
		}
	elseif map == 1192 then
		ems = {
			"风伯",
			"风伯x",
			"凤凰",
			"凤凰x",
			"芙蓉仙子",
			"芙蓉仙子x",
			"如意仙子",
			"如意仙子x",
			"阴阳伞"
		}
	elseif map == 1114 then
		ems = {
			"云龟",
			"月光虫",
			"金乌虫",
			"望月蛙",
			"兔子怪",
			"兔子怪x",
			"月影仙",
			"炼丹童子"
		}
	elseif map == 16050 then
		ems = {}
	elseif map == 1242 then
		ems = {
			"毗舍童子",
			"暗黑毗舍童子",
			"真陀护法",
			"持国巡守"
		}
	elseif map == 1232 then
		ems = {
			"月光虫",
			"望月蛙",
			"兔子怪",
			"兔子怪x",
			"蝴蝶仙子",
			"蝴蝶仙子x",
			"阿宝",
			"花铃",
			"星灵仙子",
			"星灵仙子x",
			"芙蓉仙子",
			"芙蓉仙子x",
			"镜妖",
			"日游神",
			"雾中仙",
			"雾中仙x",
			"藤蔓妖花",
			"修罗傀儡妖",
			"金身罗汉",
			"曼珠沙华"
		}

		if 取随机数() <= 50 then
			ems = 列表2加入到列表1(ems, {
				"狐不归",
				"涂山瞳",
				"月魅",
				"有苏鸩",
				"涂山雪"
			})

			if 取随机数() <= 5 then
				ems[#ems + 1] = "觉醒涂山雪"
			end
		end
	elseif map == 1233 then
		ems = {
			"日游神",
			"修罗傀儡鬼",
			"藤蔓妖花",
			"蜃气妖"
		}
	elseif map == 1920 then
		ems = {
			"毗舍童子",
			"暗黑毗舍童子",
			"灵灯侍者",
			"增长巡守"
		}

		if 取随机数() <= 1 then
			ems[#ems + 1] = "魔化毗舍童子"
		end
	elseif map == 1223 then
		ems = {
			"老虎",
			"老虎x",
			"黑熊",
			"黑熊x",
			"蜘蛛精",
			"蜘蛛精x",
			"龙鲤"
		}
	elseif map == 1876 then
		ems = {
			"岩龟",
			"沙虫",
			"树怪",
			"花妖",
			"花妖x",
			"兔子怪",
			"兔子怪x",
			"蝴蝶仙子",
			"蝴蝶仙子x",
			"巡游天神",
			"巡游天神x",
			"如意仙子",
			"如意仙子x",
			"雾中仙",
			"雾中仙x",
			"灵鹤",
			"灵鹤x"
		}

		if 取随机数() <= 5 then
			ems[#ems + 1] = "多闻巡守"
		end
	elseif map == 1258 then
		ems = {
			"云游火",
			"玄珠灵仙",
			"雷龙"
		}

		if 昼夜参数 == 1 then
			ems = 列表2加入到列表1(ems, {
				"毒花龟(夜)",
				"食魂虫(夜)",
				"巨石守卫(夜)"
			})
		else
			ems = 列表2加入到列表1(ems, {
				"毒花龟(日)",
				"食魂虫(日)",
				"巨石守卫(昼)"
			})
		end
	elseif map == 2007 then
		ems = {
			"云龟",
			"金乌虫",
			"积水蛙",
			"炼丹童子",
			"如意仙子",
			"如意仙子x",
			"五行山神(金)",
			"五行山神(木)",
			"五行山神(水)",
			"五行山神(火)",
			"五行山神(土)",
			"雾中仙",
			"雾中仙x",
			"金铙僧",
			"自在心猿"
		}

		if 取随机数() <= 10 then
			ems[#ems + 1] = "司辰侍者(未来)"
		elseif 取随机数() <= 10 then
			ems[#ems + 1] = "司辰侍者(过去)"
		end
	elseif map == 2004 then
		ems = {
			"毗舍童子",
			"暗黑毗舍童子",
			"真陀护法",
			"般若天女",
			"广目巡守",
			"妙华天女"
		}
	elseif map == 2001 then
		ems = {
			"牛头",
			"牛头x",
			"马面",
			"马面x",
			"地狱战神",
			"地狱战神x",
			"独角鬼王",
			"炼丹童子",
			"日游神",
			"幽灵",
			"幽灵x",
			"阴阳伞",
			"夜游神",
			"幻姬",
			"无常鬼差(白)",
			"无常鬼差(黑)"
		}

		if 取随机数() <= 2 then
			ems[#ems + 1] = "谛听"

			if 取随机数() <= 10 then
				ems[#ems + 1] = "暗黑谛听"
			end
		end
	elseif map == 1216 then
		ems = {
			"草龟",
			"岩龟",
			"草叶虫",
			"积水蛙",
			"树怪",
			"花妖",
			"花妖x",
			"蝴蝶仙子",
			"蝴蝶仙子x",
			"芙蓉仙子",
			"芙蓉仙子x",
			"藤蔓妖花"
		}

		if 取随机数() <= 5 then
			ems[#ems + 1] = "长乐灵仙"
		end
	end

	local tqgl = 20

	if 天气 == 1 then
		if ygsj() <= tqgl then
			ems[#ems + 1] = "沙暴"
		end

		if ygsj() <= tqgl then
			ems[#ems + 1] = "司风"
		end
	elseif 天气 == 2 then
		if ygsj() <= tqgl then
			ems[#ems + 1] = "司雨"
		end
	elseif 天气 == 3 and ygsj() <= tqgl then
		ems[#ems + 1] = "司雪"
	end

	for i = 1, #ems do
		ems[i] = 野怪对应编号[ems[i]]
	end

	return ems
end

特殊野怪列表 = {
	"泡泡灵仙·剑侠客",
	"泡泡灵仙·巫蛮儿",
	"泡泡灵仙·杀破狼",
	"泡泡灵仙·神天兵",
	"泡泡灵仙·羽灵神",
	"泡泡灵仙·飞燕女",
	"泡泡灵仙·骨精灵",
	"泡泡灵仙·龙太子",
	"恶魔泡泡",
	"恶魔泡泡(哭泣)",
	"恶魔泡泡(困惑)",
	"恶魔泡泡(奸笑)",
	"恶魔泡泡(白眼)",
	"元宝龟",
	"天机虫",
	"泡泡",
	"燧明兽",
	"九色鹿",
	"雪人",
	"狐狸",
	"小欣",
	"神武雨师",
	"萼华仙子",
	"蚩尤武魂",
	"神武风伯",
	"幽灵虎",
	"龙虾骑士",
	"战神罗成",
	"死亡骑士",
	"贪狼",
	"小肥羊",
	"月影兔",
	"玄武",
	"金钱龟",
	"金麟鹿",
	"吉祥",
	"嵩鼠",
	"龙须豹",
	"杨二郎",
	"小雪人",
	"团团",
	"龙仙",
	"武罗仙子",
	"暗黑龙",
	"剑灵双子",
	"太极捶童子",
	"暗雷豹",
	"黑灵猫",
	"红衣战锤使",
	"美猴王",
	"火熔石",
	"三尾火狐",
	"骏天马",
	"鲛人鱼",
	"狗头人",
	"巨灵狼",
	"黑翼弓使",
	"无名上仙",
	"光辉女神",
	"四翼上仙",
	"大象精",
	"四臂魔神",
	"老鹰精",
	"氪金大佬",
	"超级三眼娃",
	"太极真君",
	"托塔娃",
	"巨斧猛男",
	"齐天大圣",
	"酷炫佬",
	"酷炫老逼登",
	"风火轮器灵",
	"月宫仙子",
	"夜莺",
	"蓝凤凰",
	"熊猫大侠",
	"白無常",
	"拽王",
	"萌狗",
	"小红孩儿",
	"月仙",
	"狮仙",
	"剑仙",
	"判官",
	"龙羽",
	"罗汉",
	"龙王",
	"天师",
	"战将",
	"狂狮",
	"佛子",
	"葫仙",
	"法僧",
	"金衣仙",
	"龙剑士",
	"龙剑女",
	"水龙",
	"画仙",
	"天帝",
	"镇元",
	"鬼君",
	"鹿君",
	"火女",
	"福禄仙",
	"天后",
	"太极老君",
	"天兵统领",
	"阎王爷",
	"赵云",
	"紫霞仙子",
	"阿朱",
	"白子画",
	"貂蝉",
	"凤九",
	"关羽",
	"Q版魔化毗舍童子",
	"花无缺",
	"剑圣",
	"巨灵神",
	"李蓉蓉",
	"怜星",
	"光明战神",
	"洛神",
	"赤炎战神",
	"神僧",
	"青霞仙子",
	"火龙骑士",
	"杀阡陌",
	"通臂猿猴",
	"白龙骑士",
	"尉迟恭",
	"蓝人龙",
	"邀月",
	"太极神君",
	"赵敏",
	"大蛇丸",
	"干柿鬼鲛",
	"佩恩",
	"李洛克",
	"小南",
	"春野樱",
	"宇智波带土",
	"宇智波鼬",
	"宇智波佐助",
	"女仙",
	"斧魂",
	"剑魂",
	"枪魂",
	"月皇",
	"鬼妃",
	"月灵",
	"琴鹤",
	"晶怪",
	"魂女猫",
	"金凤凰",
	"砍刀猴",
	"金长毛猪",
	"蓝衣剑魂",
	"鸟妖仙",
	"龙魂仙女",
	"黑悟空",
	"孙行者",
	"白衣剑客",
	"猫女",
	"莲女",
	"绿衣女神",
	"五彩神女",
	"红衣仙女",
	"葫芦小金刚",
	"路飞",
	"部落勇士",
	"部落酋长",
	"幼狮",
	"嘲风",
	"吕布",
	"魔化吕布",
	"神射手",
	"黑猫警长",
	"惊奇队长",
	"灭霸",
	"绿巨人",
	"钢铁侠",
	"雷神托尔",
	"智慧女神",
	"龙女",
	"呆枭",
	"怒鳞",
	"紫焰妖姬",
	"白素贞",
	"彩蝶依依",
	"春岚蔷薇",
	"剑姬",
	"小青",
	"妖星",
	"女飞贼",
	"白娘子",
	"貂裘红衣",
	"小魔女",
	"小狐狸",
	"蓝仙女",
	"女捕头",
	"女狐妖",
	"三尾妖狐",
	"蝠女",
	"男狐妖",
	"婚纱女",
	"红娘子",
	"蝶妖",
	"鬼魅",
	"六道带土",
	"大筒木辉夜",
	"鼬",
	"佐助",
	"小佐助",
	"旗木卡卡西",
	"鸣人",
	"小鸣人",
	"带土",
	"我爱罗",
	"六道斑",
	"镜子变脸",
	"手铃变脸",
	"三叉变脸",
	"长鞭变脸",
	"金锤变脸",
	"喷火变脸",
	"关羽变脸",
	"黑脸判官",
	"青衣",
	"卧龙",
	"小蓝",
	"虎王",
	"白脸京剧",
	"黑脸京剧"
}

取特殊野怪名称 = function(代号)
	return 特殊野怪列表[ygsj(#特殊野怪列表)]
end

取特殊野怪 = function()
	local fh = ""

	if 取随机数(1, 10000) <= 野外特殊宝宝概率 then
		local aaa = {
			"战神罗成",
			"小肥羊",
			"吉祥",
			"嵩鼠",
			"萌狗",
			"小雪人",
			"团团",
			"小欣"
		}
		fh = aaa[取随机数(1, #aaa)]
	elseif 取随机数(1, 10000) <= 野外特殊宝宝概率 then
		fh = 特殊野怪列表[ygsj(#特殊野怪列表)]
	elseif 取随机数(1, 10000) <= 野外特殊宝宝概率 * 5 then
		fh = "泡泡"
	end

	if fh == "" then
		return nil
	else
		return 野怪对应编号[fh]
	end
end
