染色1方案 = {
	{
		id = 64,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 0,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 83,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 106,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 114,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 77,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 60,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2051,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2065,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 56,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 54,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 67,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 52,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 82,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 107,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 76,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 80,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2057,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 53,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 85,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 69,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 119,
		方案 = {
			[1.0] = 2
		}
	},
	{
		id = 2069,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 101,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 58,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2000,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	{
		id = 2078,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	{
		id = 2079,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	{
		id = 2042,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 75,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 95,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 108,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 81,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 70,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 55,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 63,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 89,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 66,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	{
		id = 74,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 111,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 2062,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 112,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 98,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 94,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 110,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 102,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	{
		id = 61,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 59,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 51,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 68,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 78,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 93,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 62,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 103,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 71,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 20104,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	{
		id = 92,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 20103,
		方案 = {
			[1.0] = 0,
			[2.0] = 3
		}
	},
	{
		id = 65,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 91,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 97,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 96,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 87,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 105,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 99,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 104,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 88,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 20306,
		方案 = {
			[1.0] = 1
		}
	},
	{
		id = 100,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 73,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	{
		id = 79,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 57,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 2059,
		方案 = {
			[1.0] = 1
		}
	},
	{
		id = 84,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 109,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	{
		id = 20230,
		方案 = {
			[1.0] = 3,
			[2.0] = 0
		}
	},
	{
		id = 3000,
		方案 = {
			[1.0] = 1,
			[2.0] = 2
		}
	}
}
染色信息 = {
	野猪 = {
		id = 52,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	野猪x = {
		id = 52,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	巨蛙 = {
		id = 70,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	大海龟 = {
		id = 69,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	树怪 = {
		id = 56,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	赌徒 = {
		id = 76,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	赌徒x = {
		id = 76,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	大蝙蝠 = {
		id = 66,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	强盗 = {
		id = 74,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	强盗x = {
		id = 74,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	山贼 = {
		id = 75,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	山贼x = {
		id = 75,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	海毛虫 = {
		id = 67,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	护卫 = {
		id = 2051,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	海星 = {
		id = 119,
		方案 = {
			[1.0] = 0
		}
	},
	章鱼 = {
		id = 119,
		方案 = {
			[1.0] = 2
		}
	},
	狸 = {
		id = 2079,
		方案 = {
			[1.0] = 5
		}
	},
	骷髅怪 = {
		id = 60,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	骷髅怪x = {
		id = 60,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	羊头怪 = {
		id = 54,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	羊头怪x = {
		id = 54,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	黑熊 = {
		id = 65,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	黑熊x = {
		id = 65,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蛤蟆精 = {
		id = 61,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蛤蟆精x = {
		id = 61,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	狐狸精 = {
		id = 81,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	狐狸精x = {
		id = 81,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	花妖 = {
		id = 58,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	花妖x = {
		id = 58,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	老虎 = {
		id = 64,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	老虎x = {
		id = 64,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	牛妖 = {
		id = 87,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	牛妖x = {
		id = 87,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	小龙女 = {
		id = 63,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	小龙女x = {
		id = 63,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	野鬼 = {
		id = 80,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	野鬼x = {
		id = 80,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	狼 = {
		id = 68,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	狼x = {
		id = 68,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	虾兵 = {
		id = 83,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	虾兵x = {
		id = 83,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蟹将 = {
		id = 84,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蟹将x = {
		id = 84,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	兔子怪 = {
		id = 51,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	兔子怪x = {
		id = 51,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蜘蛛精 = {
		id = 80,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蜘蛛精x = {
		id = 80,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	僵尸 = {
		id = 79,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	僵尸x = {
		id = 79,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	黑熊精 = {
		id = 53,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	黑熊精x = {
		id = 53,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	龟丞相 = {
		id = 85,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	龟丞相x = {
		id = 85,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	牛头 = {
		id = 77,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	牛头x = {
		id = 77,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	马面 = {
		id = 78,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	马面x = {
		id = 78,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	古代瑞兽 = {
		id = 73,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	古代瑞兽x = {
		id = 73,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	雷鸟人 = {
		id = 62,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	雷鸟人x = {
		id = 62,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蝴蝶仙子 = {
		id = 57,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蝴蝶仙子x = {
		id = 57,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	白熊 = {
		id = 72,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	白熊x = {
		id = 72,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	黑山老妖 = {
		id = 93,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	黑山老妖x = {
		id = 93,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	天兵 = {
		id = 82,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	天兵x = {
		id = 82,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	天将 = {
		id = 71,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	天将x = {
		id = 71,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	地狱战神 = {
		id = 94,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	地狱战神x = {
		id = 94,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	风伯 = {
		id = 89,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	风伯x = {
		id = 89,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	凤凰 = {
		id = 91,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	凤凰x = {
		id = 91,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	碧水夜叉 = {
		id = 2059,
		方案 = {
			[1.0] = 1
		}
	},
	雨师 = {
		id = 114,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	雨师x = {
		id = 114,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蚌精 = {
		id = 20306,
		方案 = {
			[1.0] = 1
		}
	},
	鲛人 = {
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	蛟龙 = {
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	蛟龙x = {
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	巡游天神 = {
		id = 92,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	巡游天神x = {
		id = 92,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	芙蓉仙子 = {
		id = 55,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	芙蓉仙子x = {
		id = 55,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	星灵仙子 = {
		id = 88,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	星灵仙子x = {
		id = 88,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	如意仙子 = {
		id = 59,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	如意仙子x = {
		id = 59,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	锦毛貂精 = {
		id = 20103,
		方案 = {
			[1.0] = 0,
			[2.0] = 3
		}
	},
	千年蛇魅 = {
		id = 20104,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	百足将军 = {
		id = 108,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	犀牛将军人形 = {
		id = 3000,
		方案 = {
			0,
			0,
			0
		}
	},
	犀牛将军兽形 = {
		id = 20104,
		方案 = {
			[1.0] = 0,
			[2.0] = 5
		}
	},
	野猪精 = {
		id = 107,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	鼠先锋 = {
		id = 109,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	泪妖 = {
		id = 20113,
		方案 = {
			[1.0] = 6
		}
	},
	镜妖 = {
		id = 2062,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	阴阳伞 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	律法女娲 = {
		id = 99,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	炎魔神 = {
		id = 105,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	炎魔神x = {
		id = 105,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	画魂 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	灵符女娲 = {
		id = 98,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	吸血鬼 = {
		id = 96,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	吸血鬼x = {
		id = 96,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	巴蛇 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	净瓶女娲 = {
		id = 100,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	踏云兽 = {
		id = 110,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	龙龟 = {
		id = 112,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	红萼仙子 = {
		id = 111,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	噬天虎 = {
		id = 106,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	噬天虎x = {
		id = 106,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	灵鹤 = {
		id = 103,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	灵鹤x = {
		id = 103,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	大力金刚 = {
		id = 101,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	大力金刚x = {
		id = 101,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	机关鸟 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	鬼将 = {
		id = 95,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	鬼将x = {
		id = 95,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	葫芦宝贝 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	机关人 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	幽灵 = {
		id = 97,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	幽灵x = {
		id = 97,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	幽萤娃娃 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	雾中仙 = {
		id = 102,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	雾中仙x = {
		id = 102,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	夜罗刹 = {
		id = 104,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	夜罗刹x = {
		id = 104,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	连弩车 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	机关兽 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	琴仙 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	金铙僧 = {
		id = 2069,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	混沌兽 = {
		id = 2078,
		方案 = {
			[1.0] = 6,
			[2.0] = 0
		}
	},
	猫灵人形 = {
		id = 2042,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	猫灵兽形 = {
		id = 2057,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	狂豹人形 = {
		id = 20230,
		方案 = {
			[1.0] = 3,
			[2.0] = 0
		}
	},
	狂豹兽形 = {
		id = 2065,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蝎子精 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	蜃气妖 = {
		id = 2079,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	曼珠沙华 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	长眉灵猴 = {
		id = 2051,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	巨力神猿 = {
		id = 2079,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	金身罗汉 = {
		id = 2000,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	藤蔓妖花 = {
		id = 2042,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	修罗傀儡鬼 = {
		id = 2065,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	修罗傀儡妖 = {
		id = 2078,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	毗舍童子 = {
		id = 20113,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	持国巡守 = {
		id = 20113,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	真陀护法 = {
		id = 20113,
		方案 = {
			[1.0] = 3,
			[2.0] = 0
		}
	},
	增长巡守 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	灵灯侍者 = {
		id = 20113,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	般若天女 = {
		id = 20113,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	进阶古代瑞兽 = {
		id = 73,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶雷鸟人 = {
		id = 62,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶蝴蝶仙子 = {
		id = 57,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶白熊 = {
		id = 72,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶黑山老妖 = {
		id = 93,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶天兵 = {
		id = 82,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶天将 = {
		id = 71,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶地狱战神 = {
		id = 94,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶风伯 = {
		id = 89,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶凤凰 = {
		id = 91,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶碧水夜叉 = {
		id = 2059,
		方案 = {
			[1.0] = 1
		}
	},
	进阶雨师 = {
		id = 114,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶蚌精 = {
		id = 20306,
		方案 = {
			[1.0] = 1
		}
	},
	进阶鲛人 = {
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶蛟龙 = {
		id = 90,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶巡游天神 = {
		id = 92,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶芙蓉仙子 = {
		id = 55,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶星灵仙子 = {
		id = 88,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶如意仙子 = {
		id = 59,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶锦毛貂精 = {
		id = 20103,
		方案 = {
			[1.0] = 0,
			[2.0] = 3
		}
	},
	进阶千年蛇魅 = {
		id = 20104,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	进阶百足将军 = {
		id = 108,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶犀牛将军人形 = {
		id = 3000,
		方案 = {
			0,
			0,
			0
		}
	},
	进阶犀牛将军兽形 = {
		id = 20104,
		方案 = {
			[1.0] = 0,
			[2.0] = 5
		}
	},
	进阶野猪精 = {
		id = 107,
		方案 = {
			[1.0] = 1,
			[2.0] = 1
		}
	},
	进阶鼠先锋 = {
		id = 109,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶泪妖 = {
		id = 20113,
		方案 = {
			[1.0] = 6
		}
	},
	进阶镜妖 = {
		id = 2062,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶阴阳伞 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶律法女娲 = {
		id = 99,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶炎魔神 = {
		id = 105,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶画魂 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	进阶灵符女娲 = {
		id = 98,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶吸血鬼 = {
		id = 96,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶巴蛇 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶净瓶女娲 = {
		id = 100,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶踏云兽 = {
		id = 110,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶龙龟 = {
		id = 112,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶红萼仙子 = {
		id = 111,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶噬天虎 = {
		id = 106,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶灵鹤 = {
		id = 103,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶大力金刚 = {
		id = 101,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶机关鸟 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶鬼将 = {
		id = 95,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶葫芦宝贝 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶机关人 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶幽灵 = {
		id = 97,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶幽萤娃娃 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	进阶雾中仙 = {
		id = 102,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶夜罗刹 = {
		id = 104,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶连弩车 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶机关兽 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶琴仙 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶金铙僧 = {
		id = 2069,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶混沌兽 = {
		id = 2078,
		方案 = {
			[1.0] = 6,
			[2.0] = 0
		}
	},
	进阶猫灵人形 = {
		id = 2042,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶猫灵兽形 = {
		id = 2057,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶狂豹人形 = {
		id = 20230,
		方案 = {
			[1.0] = 3,
			[2.0] = 0
		}
	},
	进阶狂豹兽形 = {
		id = 2065,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶蝎子精 = {
		id = 2071,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶蜃气妖 = {
		id = 2079,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	进阶曼珠沙华 = {
		id = 2070,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶长眉灵猴 = {
		id = 2051,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶巨力神猿 = {
		id = 2079,
		方案 = {
			[1.0] = 0,
			[2.0] = 1
		}
	},
	进阶金身罗汉 = {
		id = 2000,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	进阶藤蔓妖花 = {
		id = 2042,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶修罗傀儡鬼 = {
		id = 2065,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶修罗傀儡妖 = {
		id = 2078,
		方案 = {
			[1.0] = 5,
			[2.0] = 0
		}
	},
	进阶毗舍童子 = {
		id = 20113,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶持国巡守 = {
		id = 20113,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	进阶真陀护法 = {
		id = 20113,
		方案 = {
			[1.0] = 3,
			[2.0] = 0
		}
	},
	进阶增长巡守 = {
		id = 20113,
		方案 = {
			[1.0] = 4,
			[2.0] = 0
		}
	},
	进阶灵灯侍者 = {
		id = 20113,
		方案 = {
			[1.0] = 1,
			[2.0] = 0
		}
	},
	进阶般若天女 = {
		id = 20113,
		方案 = {
			[1.0] = 2,
			[2.0] = 0
		}
	},
	地涌夫人 = 染色1方案[8],
	二郎神 = 染色1方案[12],
	巫奎虎 = 染色1方案[22],
	程咬金 = 染色1方案[6],
	东海龙王 = 染色1方案[18],
	孙婆婆 = 染色1方案[5],
	牛魔王 = 染色1方案[23],
	镇元大仙 = 染色1方案[59],
	菩提祖师 = 染色1方案[15],
	白晶晶 = 染色1方案[51],
	李靖 = 染色1方案[6],
	地藏王 = 染色1方案[42],
	大大王 = 染色1方案[78],
	观音姐姐 = 染色1方案[34],
	空度禅师 = 染色1方案[70],
	周杰伦 = 染色1方案[26],
	飞天 = 染色1方案[62],
	进阶飞天 = 染色1方案[18],
	谛听 = 染色1方案[54],
	进阶谛听 = 染色1方案[10],
	狐不归 = 染色1方案[46],
	进阶狐不归 = 染色1方案[2],
	花铃 = 染色1方案[38],
	进阶花铃 = 染色1方案[74],
	涂山雪 = 染色1方案[30],
	进阶涂山雪 = 染色1方案[66],
	月魅 = 染色1方案[22],
	进阶月魅 = 染色1方案[58],
	云游火 = 染色1方案[14],
	进阶云游火 = 染色1方案[50],
	鲲鹏 = 染色1方案[6],
	进阶鲲鹏 = 染色1方案[42],
	老夫子 = 染色1方案[78],
	进阶老夫子 = 染色1方案[34],
	琴瑟仙女 = 染色1方案[70],
	进阶琴瑟仙女 = 染色1方案[26],
	二大王 = 染色1方案[62],
	进阶二大王 = 染色1方案[18],
	红孩儿 = 染色1方案[54],
	进阶红孩儿 = 染色1方案[42],
	春十三娘 = 染色1方案[78],
	进阶春十三娘 = 染色1方案[34],
	白骨精 = 染色1方案[70],
	进阶白骨精 = 染色1方案[26],
	广目天王 = 染色1方案[62],
	进阶广目天王 = 染色1方案[18],
	新猪八戒 = 染色1方案[54],
	进阶新猪八戒 = 染色1方案[10],
	紫霞 = 染色1方案[46],
	进阶紫霞 = 染色1方案[2],
	新孙悟空 = 染色1方案[38],
	进阶新孙悟空 = 染色1方案[74],
	逍遥神牛 = 染色1方案[30],
	进阶逍遥神牛 = 染色1方案[66],
	龙仙 = 染色1方案[22],
	进阶龙仙 = 染色1方案[58],
	龙鲤 = 染色1方案[14],
	进阶龙鲤 = 染色1方案[50],
	涂山瞳 = 染色1方案[6],
	进阶涂山瞳 = 染色1方案[42],
	武罗仙子 = 染色1方案[78],
	进阶武罗仙子 = 染色1方案[34],
	月影仙 = 染色1方案[70],
	进阶月影仙 = 染色1方案[26],
	暗黑龙 = 染色1方案[62],
	进阶暗黑龙 = 染色1方案[18],
	剑灵双子 = 染色1方案[54],
	进阶剑灵双子 = 染色1方案[10],
	太极捶童子 = 染色1方案[46],
	进阶太极捶童子 = 染色1方案[2],
	暗雷豹 = 染色1方案[38],
	进阶暗雷豹 = 染色1方案[74],
	黑灵猫 = 染色1方案[30],
	进阶黑灵猫 = 染色1方案[66],
	红衣战锤使 = 染色1方案[22],
	进阶红衣战锤使 = 染色1方案[58],
	美猴王 = 染色1方案[14],
	进阶美猴王 = 染色1方案[50],
	火熔石 = 染色1方案[6],
	进阶火熔石 = 染色1方案[74],
	三尾火狐 = 染色1方案[30],
	进阶三尾火狐 = 染色1方案[66],
	骏天马 = 染色1方案[22],
	进阶骏天马 = 染色1方案[58],
	鲛人鱼 = 染色1方案[14],
	进阶鲛人鱼 = 染色1方案[50],
	狗头人 = 染色1方案[6],
	进阶狗头人 = 染色1方案[42],
	巨灵狼 = 染色1方案[78],
	进阶巨灵狼 = 染色1方案[34],
	黑翼弓使 = 染色1方案[70],
	进阶黑翼弓使 = 染色1方案[26],
	无名上仙 = 染色1方案[62],
	进阶无名上仙 = 染色1方案[18],
	光辉女神 = 染色1方案[54],
	进阶光辉女神 = 染色1方案[9],
	四翼上仙 = 染色1方案[37],
	进阶四翼上仙 = 染色1方案[73],
	大象精 = 染色1方案[29],
	进阶大象精 = 染色1方案[65],
	四臂魔神 = 染色1方案[21],
	进阶四臂魔神 = 染色1方案[57],
	老鹰精 = 染色1方案[13],
	进阶老鹰精 = 染色1方案[49],
	氪金大佬 = 染色1方案[5],
	进阶氪金大佬 = 染色1方案[41],
	超级三眼娃 = 染色1方案[77],
	进阶超级三眼娃 = 染色1方案[33],
	太极真君 = 染色1方案[69],
	进阶太极真君 = 染色1方案[25],
	托塔娃 = 染色1方案[61],
	进阶托塔娃 = 染色1方案[17],
	巨斧猛男 = 染色1方案[53],
	进阶巨斧猛男 = 染色1方案[9],
	齐天大圣 = 染色1方案[45],
	进阶齐天大圣 = 染色1方案[1],
	酷炫佬 = 染色1方案[69],
	进阶酷炫佬 = 染色1方案[25],
	酷炫老逼登 = 染色1方案[61],
	进阶酷炫老逼登 = 染色1方案[17],
	风火轮器灵 = 染色1方案[53],
	进阶风火轮器灵 = 染色1方案[9],
	蚩尤武魂 = 染色1方案[36],
	进阶蚩尤武魂 = 染色1方案[18],
	神武风伯 = 染色1方案[36],
	进阶神武风伯 = 染色1方案[20],
	幽灵虎 = 染色1方案[70],
	进阶幽灵虎 = 染色1方案[62],
	龙虾骑士 = 染色1方案[75],
	进阶龙虾骑士 = 染色1方案[20],
	战神罗成 = 染色1方案[46],
	进阶战神罗成 = 染色1方案[72],
	死亡骑士 = 染色1方案[17],
	进阶死亡骑士 = 染色1方案[43],
	贪狼 = 染色1方案[25],
	进阶贪狼 = 染色1方案[50],
	仙兽翼龙 = 染色1方案[76],
	进阶仙兽翼龙 = 染色1方案[21],
	小肥羊 = 染色1方案[47],
	进阶小肥羊 = 染色1方案[73],
	神兽小龙人 = 染色1方案[18],
	进阶神兽小龙人 = 染色1方案[44],
	神兽雪精灵 = 染色1方案[70],
	进阶神兽雪精灵 = 染色1方案[15],
	月影兔 = 染色1方案[41],
	进阶月影兔 = 染色1方案[67],
	神兽时光叽 = 染色1方案[12],
	进阶神兽时光叽 = 染色1方案[38],
	玄武 = 染色1方案[64],
	进阶玄武 = 染色1方案[9],
	金钱龟 = 染色1方案[35],
	进阶金钱龟 = 染色1方案[61],
	金麟鹿 = 染色1方案[6],
	进阶金麟鹿 = 染色1方案[32],
	吉祥 = 染色1方案[58],
	进阶吉祥 = 染色1方案[3],
	嵩鼠 = 染色1方案[29],
	进阶嵩鼠 = 染色1方案[55],
	龙须豹 = 染色1方案[81],
	进阶龙须豹 = 染色1方案[26],
	熊猫大侠 = 染色1方案[52],
	进阶熊猫大侠 = 染色1方案[78],
	白無常 = 染色1方案[23],
	进阶白無常 = 染色1方案[49],
	拽王 = 染色1方案[75],
	进阶拽王 = 染色1方案[20],
	神兽百灵羊 = 染色1方案[50],
	进阶神兽百灵羊 = 染色1方案[50],
	齐天小圣 = 染色1方案[3],
	进阶齐天小圣 = 染色1方案[51],
	萌狗 = 染色1方案[13],
	进阶萌狗 = 染色1方案[18],
	小红孩儿 = 染色1方案[57],
	进阶小红孩儿 = 染色1方案[54],
	月仙 = 染色1方案[23],
	进阶月仙 = 染色1方案[15],
	狮仙 = 染色1方案[28],
	进阶狮仙 = 染色1方案[54],
	剑仙 = 染色1方案[79],
	进阶剑仙 = 染色1方案[24],
	判官 = 染色1方案[50],
	进阶判官 = 染色1方案[76],
	龙羽 = 染色1方案[21],
	进阶龙羽 = 染色1方案[47],
	罗汉 = 染色1方案[73],
	进阶罗汉 = 染色1方案[18],
	龙王 = 染色1方案[44],
	进阶龙王 = 染色1方案[70],
	天师 = 染色1方案[15],
	进阶天师 = 染色1方案[41],
	战将 = 染色1方案[23],
	进阶战将 = 染色1方案[49],
	狂狮 = 染色1方案[75],
	进阶狂狮 = 染色1方案[20],
	佛子 = 染色1方案[46],
	进阶佛子 = 染色1方案[72],
	葫仙 = 染色1方案[17],
	进阶葫仙 = 染色1方案[43],
	法僧 = 染色1方案[69],
	进阶法僧 = 染色1方案[14],
	金衣仙 = 染色1方案[40],
	进阶金衣仙 = 染色1方案[66],
	龙剑士 = 染色1方案[11],
	进阶龙剑士 = 染色1方案[37],
	龙剑女 = 染色1方案[63],
	进阶龙剑女 = 染色1方案[8],
	水龙 = 染色1方案[34],
	进阶水龙 = 染色1方案[60],
	画仙 = 染色1方案[5],
	进阶画仙 = 染色1方案[31],
	天帝 = 染色1方案[57],
	进阶天帝 = 染色1方案[2],
	镇元 = 染色1方案[28],
	进阶镇元 = 染色1方案[54],
	鬼君 = 染色1方案[80],
	进阶鬼君 = 染色1方案[25],
	鹿君 = 染色1方案[51],
	进阶鹿君 = 染色1方案[77],
	火女 = 染色1方案[22],
	进阶火女 = 染色1方案[48],
	福禄仙 = 染色1方案[74],
	进阶福禄仙 = 染色1方案[19],
	天后 = 染色1方案[45],
	进阶天后 = 染色1方案[71],
	太极老君 = 染色1方案[16],
	进阶太极老君 = 染色1方案[42],
	天兵统领 = 染色1方案[68],
	进阶天兵统领 = 染色1方案[13],
	阎王爷 = 染色1方案[39],
	进阶阎王爷 = 染色1方案[21],
	大蛇丸 = 染色1方案[15],
	进阶大蛇丸 = 染色1方案[21],
	干柿鬼鲛 = 染色1方案[6],
	进阶干柿鬼鲛 = 染色1方案[32],
	佩恩 = 染色1方案[3],
	进阶佩恩 = 染色1方案[81],
	李洛克 = 染色1方案[50],
	进阶李洛克 = 染色1方案[42],
	小南 = 染色1方案[55],
	进阶小南 = 染色1方案[81],
	春野樱 = 染色1方案[26],
	进阶春野樱 = 染色1方案[52],
	宇智波带土 = 染色1方案[78],
	进阶宇智波带土 = 染色1方案[23],
	宇智波鼬 = 染色1方案[49],
	进阶宇智波鼬 = 染色1方案[75],
	宇智波佐助 = 染色1方案[20],
	进阶宇智波佐助 = 染色1方案[46],
	女仙 = 染色1方案[28],
	进阶女仙 = 染色1方案[54],
	斧魂 = 染色1方案[80],
	进阶斧魂 = 染色1方案[25],
	剑魂 = 染色1方案[51],
	进阶剑魂 = 染色1方案[77],
	枪魂 = 染色1方案[22],
	进阶枪魂 = 染色1方案[48],
	魔化毗舍童子 = 染色1方案[73],
	进阶魔化毗舍童子 = 染色1方案[17],
	暗黑谛听 = 染色1方案[42],
	进阶暗黑谛听 = 染色1方案[65],
	暗黑毗舍童子 = 染色1方案[31],
	进阶暗黑毗舍童子 = 染色1方案[73],
	黑白狂豹人形 = 染色1方案[75],
	进阶黑白狂豹人形 = 染色1方案[54],
	妙华天女 = 染色1方案[18],
	进阶妙华天女 = 染色1方案[12],
	月皇 = 染色1方案[38],
	进阶月皇 = 染色1方案[64],
	日游神 = 染色1方案[61],
	进阶日游神 = 染色1方案[43],
	鬼妃 = 染色1方案[69],
	进阶鬼妃 = 染色1方案[14],
	玄珠灵仙 = 染色1方案[63],
	进阶玄珠灵仙 = 染色1方案[8],
	夜游神 = 染色1方案[34],
	进阶夜游神 = 染色1方案[60],
	月灵 = 染色1方案[5],
	进阶月灵 = 染色1方案[31],
	独角鬼王 = 染色1方案[57],
	进阶独角鬼王 = 染色1方案[2],
	赵云 = 染色1方案[28],
	进阶赵云 = 染色1方案[54],
	紫霞仙子 = 染色1方案[80],
	进阶紫霞仙子 = 染色1方案[25],
	阿朱 = 染色1方案[51],
	进阶阿朱 = 染色1方案[77],
	白子画 = 染色1方案[22],
	进阶白子画 = 染色1方案[48],
	貂蝉 = 染色1方案[74],
	进阶貂蝉 = 染色1方案[19],
	凤九 = 染色1方案[45],
	进阶凤九 = 染色1方案[71],
	关羽 = 染色1方案[16],
	进阶关羽 = 染色1方案[42],
	Q版魔化毗舍童子 = 染色1方案[68],
	进阶Q版魔化毗舍童子 = 染色1方案[13],
	花无缺 = 染色1方案[39],
	进阶花无缺 = 染色1方案[65],
	剑圣 = 染色1方案[10],
	进阶剑圣 = 染色1方案[36],
	巨灵神 = 染色1方案[62],
	进阶巨灵神 = 染色1方案[7],
	李蓉蓉 = 染色1方案[33],
	进阶李蓉蓉 = 染色1方案[59],
	雷龙 = 染色1方案[41],
	进阶雷龙 = 染色1方案[67],
	怜星 = 染色1方案[12],
	进阶怜星 = 染色1方案[38],
	光明战神 = 染色1方案[64],
	进阶光明战神 = 染色1方案[9],
	执音 = 染色1方案[35],
	进阶执音 = 染色1方案[61],
	洛神 = 染色1方案[6],
	进阶洛神 = 染色1方案[32],
	赤炎战神 = 染色1方案[58],
	进阶赤炎战神 = 染色1方案[3],
	神僧 = 染色1方案[29],
	进阶神僧 = 染色1方案[55],
	青霞仙子 = 染色1方案[81],
	进阶青霞仙子 = 染色1方案[26],
	火龙骑士 = 染色1方案[52],
	进阶火龙骑士 = 染色1方案[78],
	杀阡陌 = 染色1方案[23],
	进阶杀阡陌 = 染色1方案[49],
	通臂猿猴 = 染色1方案[75],
	进阶通臂猿猴 = 染色1方案[20],
	白龙骑士 = 染色1方案[46],
	进阶白龙骑士 = 染色1方案[72],
	尉迟恭 = 染色1方案[17],
	进阶尉迟恭 = 染色1方案[43],
	蓝人龙 = 染色1方案[69],
	进阶蓝人龙 = 染色1方案[14],
	邀月 = 染色1方案[40],
	进阶邀月 = 染色1方案[66],
	太极神君 = 染色1方案[11],
	进阶太极神君 = 染色1方案[37],
	赵敏 = 染色1方案[63],
	进阶赵敏 = 染色1方案[8],
	琴鹤 = 染色1方案[32],
	进阶琴鹤 = 染色1方案[30],
	晶怪 = 染色1方案[1],
	进阶晶怪 = 染色1方案[25],
	魂女猫 = 染色1方案[45],
	进阶魂女猫 = 染色1方案[61],
	金凤凰 = 染色1方案[40],
	进阶金凤凰 = 染色1方案[53],
	砍刀猴 = 染色1方案[79],
	进阶砍刀猴 = 染色1方案[24],
	金长毛猪 = 染色1方案[50],
	进阶金长毛猪 = 染色1方案[76],
	蓝衣剑魂 = 染色1方案[21],
	进阶蓝衣剑魂 = 染色1方案[47],
	鸟妖仙 = 染色1方案[73],
	进阶鸟妖仙 = 染色1方案[18],
	龙魂仙女 = 染色1方案[56],
	进阶龙魂仙女 = 染色1方案[58],
	黑悟空 = 染色1方案[11],
	进阶黑悟空 = 染色1方案[53],
	孙行者 = 染色1方案[55],
	进阶孙行者 = 染色1方案[34],
	白衣剑客 = 染色1方案[47],
	进阶白衣剑客 = 染色1方案[73],
	猫女 = 染色1方案[18],
	进阶猫女 = 染色1方案[44],
	莲女 = 染色1方案[26],
	进阶莲女 = 染色1方案[52],
	绿衣女神 = 染色1方案[78],
	进阶绿衣女神 = 染色1方案[23],
	五彩神女 = 染色1方案[49],
	进阶五彩神女 = 染色1方案[75],
	红衣仙女 = 染色1方案[20],
	进阶红衣仙女 = 染色1方案[46],
	["巨石守卫(昼)"] = 染色1方案[61],
	["进阶巨石守卫(昼)"] = 染色1方案[60],
	["无常鬼差(白)"] = 染色1方案[34],
	["进阶无常鬼差(白)"] = 染色1方案[37],
	["无常鬼差(黑)"] = 染色1方案[16],
	["进阶无常鬼差(黑)"] = 染色1方案[29],
	沙暴 = 染色1方案[76],
	进阶沙暴 = 染色1方案[66],
	自在心猿 = 染色1方案[19],
	进阶自在心猿 = 染色1方案[60],
	辛丑神牛 = 染色1方案[63],
	进阶辛丑神牛 = 染色1方案[42],
	超级离火兽 = 染色1方案[55],
	进阶超级离火兽 = 染色1方案[81],
	癸卯神兔 = 染色1方案[26],
	进阶癸卯神兔 = 染色1方案[52],
	超级红孩儿 = 染色1方案[78],
	进阶 = 染色1方案[23],
	超级飞超级红孩儿廉 = 染色1方案[49],
	进阶超级飞廉 = 染色1方案[75],
	["泡泡灵仙·剑侠客"] = 染色1方案[20],
	["进阶泡泡灵仙·剑侠客"] = 染色1方案[46],
	恶魔泡泡 = 染色1方案[72],
	进阶恶魔泡泡 = 染色1方案[54],
	部落勇士 = 染色1方案[80],
	进阶部落勇士 = 染色1方案[25],
	司雪 = 染色1方案[58],
	进阶司雪 = 染色1方案[16],
	觉醒涂山雪 = 染色1方案[72],
	进阶觉醒涂山雪 = 染色1方案[4],
	有苏鸩 = 染色1方案[30],
	进阶有苏鸩 = 染色1方案[56],
	幼狮 = 染色1方案[1],
	进阶幼狮 = 染色1方案[27],
	虬龙 = 染色1方案[70],
	进阶虬龙 = 染色1方案[44],
	幻姬 = 染色1方案[61],
	进阶幻姬 = 染色1方案[52],
	["泡泡灵仙·骨精灵"] = 染色1方案[34],
	["进阶泡泡灵仙·骨精灵"] = 染色1方案[52],
	["泡泡灵仙·羽灵神"] = 染色1方案[36],
	["进阶泡泡灵仙·羽灵神"] = 染色1方案[5],
	["泡泡灵仙·神天兵"] = 染色1方案[78],
	["进阶泡泡灵仙·神天兵"] = 染色1方案[10],
	龙女 = 染色1方案[29],
	进阶龙女 = 染色1方案[18],
	呆枭 = 染色1方案[24],
	进阶呆枭 = 染色1方案[37],
	怒鳞 = 染色1方案[37],
	进阶怒鳞 = 染色1方案[11],
	嘲风 = 染色1方案[15],
	进阶嘲风 = 染色1方案[66],
	超级神柚 = 染色1方案[17],
	进阶超级神柚 = 染色1方案[31],
	长乐灵仙 = 染色1方案[32],
	进阶长乐灵仙 = 染色1方案[8],
	紫焰妖姬 = 染色1方案[71],
	进阶紫焰妖姬 = 染色1方案[34],
	白素贞 = 染色1方案[70],
	进阶白素贞 = 染色1方案[62],
	彩蝶依依 = 染色1方案[75],
	进阶彩蝶依依 = 染色1方案[20],
	春岚蔷薇 = 染色1方案[46],
	进阶春岚蔷薇 = 染色1方案[72],
	剑姬 = 染色1方案[17],
	进阶剑姬 = 染色1方案[43],
	小青 = 染色1方案[69],
	进阶小青 = 染色1方案[14],
	妖星 = 染色1方案[40],
	进阶妖星 = 染色1方案[66],
	女飞贼 = 染色1方案[11],
	进阶女飞贼 = 染色1方案[37],
	白娘子 = 染色1方案[63],
	进阶白娘子 = 染色1方案[8],
	貂裘红衣 = 染色1方案[34],
	进阶貂裘红衣 = 染色1方案[60],
	小魔女 = 染色1方案[5],
	进阶小魔女 = 染色1方案[31],
	小狐狸 = 染色1方案[57],
	进阶小狐狸 = 染色1方案[2],
	蓝仙女 = 染色1方案[28],
	进阶蓝仙女 = 染色1方案[10],
	女捕头 = 染色1方案[36],
	进阶女捕头 = 染色1方案[62],
	女狐妖 = 染色1方案[7],
	进阶女狐妖 = 染色1方案[33],
	三尾妖狐 = 染色1方案[59],
	进阶三尾妖狐 = 染色1方案[4],
	蝠女 = 染色1方案[30],
	进阶蝠女 = 染色1方案[56],
	男狐妖 = 染色1方案[1],
	进阶男狐妖 = 染色1方案[27],
	婚纱女 = 染色1方案[53],
	进阶婚纱女 = 染色1方案[79],
	红娘子 = 染色1方案[24],
	进阶红娘子 = 染色1方案[50],
	蝶妖 = 染色1方案[76],
	进阶蝶妖 = 染色1方案[21],
	鬼魅 = 染色1方案[47],
	进阶鬼魅 = 染色1方案[73],
	镜子变脸 = 染色1方案[18],
	进阶镜子变脸 = 染色1方案[44],
	手铃变脸 = 染色1方案[70],
	进阶手铃变脸 = 染色1方案[15],
	三叉变脸 = 染色1方案[41],
	进阶三叉变脸 = 染色1方案[67],
	长鞭变脸 = 染色1方案[12],
	进阶长鞭变脸 = 染色1方案[38],
	金锤变脸 = 染色1方案[64],
	进阶金锤变脸 = 染色1方案[9],
	喷火变脸 = 染色1方案[35],
	进阶喷火变脸 = 染色1方案[61],
	关羽变脸 = 染色1方案[6],
	进阶关羽变脸 = 染色1方案[32],
	黑脸判官 = 染色1方案[58],
	进阶黑脸判官 = 染色1方案[3],
	青衣 = 染色1方案[29],
	进阶青衣 = 染色1方案[55],
	卧龙 = 染色1方案[81],
	进阶卧龙 = 染色1方案[26],
	小蓝 = 染色1方案[8],
	进阶小蓝 = 染色1方案[34],
	虎王 = 染色1方案[60],
	进阶虎王 = 染色1方案[5],
	白脸京剧 = 染色1方案[31],
	进阶白脸京剧 = 染色1方案[57],
	黑脸京剧 = 染色1方案[2],
	进阶黑脸京剧 = 染色1方案[28],
	小彩蝶 = 染色1方案[54],
	进阶小彩蝶 = 染色1方案[80],
	小蓝娥 = 染色1方案[25],
	进阶小蓝娥 = 染色1方案[51],
	小浪鼓 = 染色1方案[77],
	进阶小浪鼓 = 染色1方案[22],
	小绅士 = 染色1方案[48],
	进阶小绅士 = 染色1方案[74],
	小圣斗士 = 染色1方案[19],
	进阶小圣斗士 = 染色1方案[45],
	小兔兔 = 染色1方案[70],
	进阶小兔兔 = 染色1方案[15],
	小熊熊 = 染色1方案[41],
	进阶小熊熊 = 染色1方案[67],
	小DJ = 染色1方案[12],
	进阶小DJ = 染色1方案[38],
	小卷发 = 染色1方案[64],
	进阶小卷发 = 染色1方案[9],
	小羊角 = 染色1方案[35],
	进阶小羊角 = 染色1方案[61],
	部落酋长 = 染色1方案[79],
	进阶部落酋长 = 染色1方案[60],
	吕布 = 染色1方案[75],
	进阶吕布 = 染色1方案[80],
	魔化吕布 = 染色1方案[65],
	进阶魔化吕布 = 染色1方案[33],
	神射手 = 染色1方案[25],
	进阶神射手 = 染色1方案[38],
	小战神 = 染色1方案[64],
	进阶小战神 = 染色1方案[9],
	小神女 = 染色1方案[35],
	进阶小神女 = 染色1方案[61],
	黑猫警长 = 染色1方案[6],
	进阶黑猫警长 = 染色1方案[32],
	惊奇队长 = 染色1方案[14],
	进阶惊奇队长 = 染色1方案[40],
	灭霸 = 染色1方案[66],
	进阶灭霸 = 染色1方案[11],
	绿巨人 = 染色1方案[37],
	进阶绿巨人 = 染色1方案[63],
	钢铁侠 = 染色1方案[8],
	进阶钢铁侠 = 染色1方案[34],
	雷神托尔 = 染色1方案[60],
	进阶雷神托尔 = 染色1方案[5],
	智慧女神 = 染色1方案[31],
	进阶智慧女神 = 染色1方案[57],
	九色鹿 = 染色1方案[9],
	云游火 = 染色1方案[26],
	云龟 = 染色1方案[34],
	["五行山神(土)"] = 染色1方案[23],
	["五行山神(木)"] = 染色1方案[31],
	["五行山神(水)"] = 染色1方案[46],
	["五行山神(火)"] = 染色1方案[25],
	["五行山神(金)"] = 染色1方案[38],
	元宝龟 = 染色1方案[64],
	冰火龟 = 染色1方案[9],
	冰龟 = 染色1方案[35],
	["司辰侍者(未来)"] = 染色1方案[61],
	["司辰侍者(过去)"] = 染色1方案[6],
	司雨 = 染色1方案[32],
	司雪 = 染色1方案[58],
	司风 = 染色1方案[3],
	多闻巡守 = 染色1方案[29],
	夜游神 = 染色1方案[55],
	天机虫 = 染色1方案[81],
	妙华天女 = 染色1方案[26],
	小泡泡 = 染色1方案[52],
	岩冰龟 = 染色1方案[78],
	岩龟 = 染色1方案[23],
	["巨石守卫(夜)"] = 染色1方案[49],
	["巨石守卫(昼)"] = 染色1方案[75],
	幻姬 = 染色1方案[20],
	幻魔_人 = 染色1方案[46],
	幻魔_蛇 = 染色1方案[72],
	幻魔_鸟 = 染色1方案[17],
	广目巡守 = 染色1方案[80],
	强盗沙狸 = 染色1方案[25],
	强盗狸 = 染色1方案[51],
	强盗鬼狸 = 染色1方案[77],
	恶魔泡泡 = 染色1方案[22],
	["恶魔泡泡(哭泣)"] = 染色1方案[48],
	["恶魔泡泡(困惑)"] = 染色1方案[74],
	["恶魔泡泡(奸笑)"] = 染色1方案[19],
	["恶魔泡泡(白眼)"] = 染色1方案[45],
	执音 = 染色1方案[71],
	["无常鬼差(白)"] = 染色1方案[16],
	["无常鬼差(黑)"] = 染色1方案[42],
	日游神 = 染色1方案[68],
	月光虫 = 染色1方案[13],
	月光金乌虫 = 染色1方案[39],
	月光雪蛙 = 染色1方案[65],
	月影仙 = 染色1方案[10],
	月魅 = 染色1方案[36],
	有苏鸩 = 染色1方案[62],
	望月蛙 = 染色1方案[7],
	木桩 = 染色1方案[33],
	毒云龟 = 染色1方案[59],
	["毒花龟(夜)"] = 染色1方案[4],
	["毒花龟(日)"] = 染色1方案[30],
	沙暴 = 染色1方案[56],
	沙狸 = 染色1方案[1],
	沙虫 = 染色1方案[27],
	["泡泡灵仙·剑侠客"] = 染色1方案[53],
	["泡泡灵仙·巫蛮儿"] = 染色1方案[79],
	["泡泡灵仙·杀破狼"] = 染色1方案[24],
	["泡泡灵仙·神天兵"] = 染色1方案[50],
	["泡泡灵仙·羽灵神"] = 染色1方案[76],
	["泡泡灵仙·飞燕女"] = 染色1方案[21],
	["泡泡灵仙·骨精灵"] = 染色1方案[47],
	["泡泡灵仙·龙太子"] = 染色1方案[73],
	海狸 = 染色1方案[18],
	涂山瞳 = 染色1方案[44],
	涂山雪 = 染色1方案[70],
	火云龟 = 染色1方案[15],
	火月蛙 = 染色1方案[78],
	火沙虫 = 染色1方案[23],
	炼丹童子 = 染色1方案[49],
	熔岩龟 = 染色1方案[75],
	熔火虫 = 染色1方案[20],
	熔火蛙 = 染色1方案[46],
	燧明兽 = 染色1方案[72],
	狐不归 = 染色1方案[17],
	独角鬼王 = 染色1方案[43],
	玄珠灵仙 = 染色1方案[69],
	积水蛙 = 染色1方案[14],
	积水鬼蛙 = 染色1方案[40],
	稻草人 = 染色1方案[66],
	竹笋虫 = 染色1方案[11],
	纵火狸 = 染色1方案[37],
	胖海狸 = 染色1方案[63],
	自在心猿 = 染色1方案[8],
	芭将军 = 染色1方案[34],
	花铃 = 染色1方案[60],
	草叶虫 = 染色1方案[5],
	草叶魂虫 = 染色1方案[31],
	草龟 = 染色1方案[57],
	虬龙 = 染色1方案[2],
	觉醒涂山雪 = 染色1方案[27],
	谛听 = 染色1方案[53],
	进阶云游火 = 染色1方案[79],
	["进阶五行山神(土)"] = 染色1方案[24],
	["进阶五行山神(木)"] = 染色1方案[50],
	["进阶五行山神(水)"] = 染色1方案[76],
	["进阶五行山神(火)"] = 染色1方案[21],
	["进阶五行山神(金)"] = 染色1方案[47],
	["进阶司辰侍者(未来)"] = 染色1方案[73],
	["进阶司辰侍者(过去)"] = 染色1方案[18],
	进阶司雨 = 染色1方案[44],
	进阶司雪 = 染色1方案[70],
	进阶司风 = 染色1方案[15],
	进阶哮天犬 = 染色1方案[41],
	进阶多闻巡守 = 染色1方案[67],
	进阶夜游神 = 染色1方案[12],
	["进阶巨石守卫(夜)"] = 染色1方案[75],
	["进阶巨石守卫(昼)"] = 染色1方案[20],
	进阶幻姬 = 染色1方案[46],
	进阶广目巡守 = 染色1方案[72],
	进阶执音 = 染色1方案[17],
	["进阶无常鬼差(白)"] = 染色1方案[43],
	["进阶无常鬼差(黑)"] = 染色1方案[69],
	进阶日游神 = 染色1方案[14],
	进阶月影仙 = 染色1方案[40],
	进阶月魅 = 染色1方案[66],
	进阶有苏鸩 = 染色1方案[11],
	进阶沙暴 = 染色1方案[37],
	进阶涂山瞳 = 染色1方案[63],
	进阶涂山雪 = 染色1方案[8],
	进阶炼丹童子 = 染色1方案[34],
	进阶狐不归 = 染色1方案[60],
	进阶独角鬼王 = 染色1方案[5],
	进阶玄珠灵仙 = 染色1方案[31],
	进阶自在心猿 = 染色1方案[57],
	进阶花铃 = 染色1方案[2],
	进阶虬龙 = 染色1方案[28],
	进阶觉醒涂山雪 = 染色1方案[54],
	进阶谛听 = 染色1方案[80],
	进阶金翼 = 染色1方案[25],
	进阶长乐灵仙 = 染色1方案[51],
	进阶阿宝 = 染色1方案[77],
	进阶雷龙 = 染色1方案[22],
	进阶魔化毗舍童子 = 染色1方案[48],
	进阶龙鲤 = 染色1方案[74],
	金乌月光虫 = 染色1方案[19],
	金乌火虫 = 染色1方案[45],
	金乌虫 = 染色1方案[71],
	金翼 = 染色1方案[16],
	长乐灵仙 = 染色1方案[42],
	阿宝 = 染色1方案[68],
	雪人 = 染色1方案[13],
	雪月蛙 = 染色1方案[39],
	雪狸 = 染色1方案[65],
	雪蛙 = 染色1方案[10],
	雷龙 = 染色1方案[36],
	["食魂虫(夜)"] = 染色1方案[18],
	["食魂虫(日)"] = 染色1方案[44],
	鬼火狸 = 染色1方案[70],
	鬼狸 = 染色1方案[15],
	鬼蛙 = 染色1方案[41],
	魔化有苏鸩 = 染色1方案[67],
	魔化毗舍童子 = 染色1方案[12],
	魔化涂山瞳 = 染色1方案[38],
	魔化涂山雪 = 染色1方案[64],
	龙鲤 = 染色1方案[9]
}
