取随机法术 = function(数量)
	local 法术 = {
		"荆棘舞",
		"水攻",
		"雷击",
		"烈火",
		"落岩",
		"奔雷咒",
		"碎星诀",
		"推气过宫",
		"金刚护体",
		"落叶萧萧",
		"裂石",
		"地涌金莲",
		"推拿",
		"夺魄令",
		"地涌金莲",
		"催眠符",
		"失心符",
		"含情脉脉",
		"似玉生香",
		"横扫千军",
		"唧唧歪歪",
		"金刚护法",
		"五雷咒",
		"龙卷雨击",
		"浪涌",
		"龙吟",
		"龙腾",
		"天雷斩",
		"烟雨剑法",
		"五雷轰顶",
		"飞砂走石",
		"三昧真火",
		"狮搏",
		"鹰击",
		"连环击",
		"反间之计"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机攻击法术 = function(数量)
	local 法术 = {
		"上古灵符",
		"叱咤风云",
		"天降灵葫",
		"八凶法阵",
		"天罗地网",
		"夺命咒",
		"落叶萧萧",
		"荆棘舞",
		"唧唧歪歪",
		"五雷咒",
		"落雷符",
		"五雷轰顶",
		"雷霆万钧",
		"龙卷雨击",
		"二龙戏珠",
		"龙腾",
		"三昧真火",
		"飞砂走石",
		"死亡召唤",
		"剑荡四方",
		"猛击",
		"百爪狂杀",
		"鸿渐于陆",
		"翩鸿一击",
		"天命剑法",
		"长驱直入",
		"断岳势",
		"裂石",
		"满天花雨",
		"破血狂攻",
		"破碎无双",
		"弱点击破",
		"善恶有报",
		"惊心一剑",
		"壁垒击破",
		"横扫千军",
		"狮搏",
		"狮搏",
		"象形",
		"连环击",
		"鹰击",
		"烟雨剑法",
		"飘渺式",
		"天雷斩",
		"裂石",
		"断岳势",
		"浪涌",
		"惊涛怒",
		"力劈华山",
		"蚩尤之搏",
		"先发制人",
		"判官令",
		"阎罗令",
		"判官令",
		"阎罗令",
		"尘土刃",
		"龙吟",
		"雨落寒沙",
		"水攻",
		"烈火",
		"落岩",
		"雷击",
		"食指大动",
		"流沙轻音",
		"泰山压顶",
		"水漫金山",
		"地狱烈火",
		"奔雷咒",
		"冥王爆杀",
		"琴音三叠"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机法术 = function(数量)
	local 法术 = {
		"上古灵符",
		"叱咤风云",
		"天降灵葫",
		"八凶法阵",
		"天罗地网",
		"夺命咒",
		"落叶萧萧",
		"荆棘舞",
		"唧唧歪歪",
		"五雷咒",
		"落雷符",
		"五雷轰顶",
		"雷霆万钧",
		"龙卷雨击",
		"二龙戏珠",
		"龙腾",
		"三昧真火",
		"飞砂走石",
		"水攻",
		"烈火",
		"落岩",
		"雷击",
		"食指大动",
		"流沙轻音",
		"泰山压顶",
		"水漫金山",
		"地狱烈火",
		"奔雷咒",
		"冥王爆杀",
		"琴音三叠"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机辅助法术 = function(数量, 传入)
	local 法术 = {
		"杀气诀",
		"安神诀",
		"红袖添香",
		"逆鳞",
		"幻镜术",
		"碎星诀",
		"明光宝烛",
		"圣灵之甲",
		"魔兽之印",
		"达摩护体",
		"金刚护体",
		"一苇渡江",
		"神龙摆尾",
		"生命之泉",
		"普渡众生",
		"定心术"
	}
	local 返回组 = {
		"金刚护法",
		"韦陀护法"
	}

	if 传入 ~= nil and #传入 > 0 then
		返回组 = 列表2加入到列表1(传入, 返回组)
	end

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机恢复法术 = function(数量)
	local 法术 = {
		{
			"我佛慈悲",
			"杨柳甘露",
			"起死回生"
		},
		{
			"地涌金莲",
			"推气过宫",
			"妙悟"
		},
		{
			"活血",
			"推拿"
		}
	}
	local 返回组 = {
		"回魂咒"
	}
	local 指定 = {
		1,
		2,
		3
	}

	for n = 1, math.min(math.max(数量, 3), 7) do
		if 指定[n] ~= nil then
			local aa = 法术[指定[n]]
			local i = ygsj(#aa)
			返回组[#返回组 + 1] = aa[i]

			table.remove(aa, i)
		else
			local aa = 法术[ygsj(#法术)]

			while #aa == 0 do
				aa = 法术[ygsj(#法术)]
			end

			local i = ygsj(#aa)
			返回组[#返回组 + 1] = aa[i]

			table.remove(aa, i)
		end
	end

	return 夜光随机辅助法术(1, 返回组)
end

夜光随机物理法术 = function(数量)
	local 法术 = {
		"死亡召唤",
		"剑荡四方",
		"猛击",
		"百爪狂杀",
		"鸿渐于陆",
		"翩鸿一击",
		"天命剑法",
		"长驱直入",
		"断岳势",
		"裂石",
		"满天花雨",
		"破血狂攻",
		"破碎无双",
		"弱点击破",
		"善恶有报",
		"惊心一剑",
		"壁垒击破",
		"横扫千军",
		"狮搏",
		"狮搏",
		"象形",
		"连环击",
		"鹰击",
		"烟雨剑法",
		"飘渺式",
		"天雷斩",
		"裂石",
		"断岳势",
		"浪涌",
		"惊涛怒",
		"力劈华山",
		"蚩尤之搏",
		"先发制人"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机固伤法术 = function(数量)
	local 法术 = {
		"判官令",
		"夺命咒",
		"阎罗令",
		"天罗地网",
		"巨岩破",
		"苍茫树",
		"地裂火",
		"日光华",
		"靛沧海",
		"龙吟",
		"尘土刃",
		"雨落寒沙"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

夜光随机封印法术 = function(数量)
	local 法术 = {
		{
			"失心符",
			"失魂符",
			"落魄符",
			"离魂符",
			"错乱",
			"莲步轻舞",
			"夺魄令"
		},
		{
			"定身符",
			"追魂符",
			"如花解语",
			"百万神兵"
		},
		{
			"似玉生香",
			"含情脉脉",
			"日月乾坤",
			"反间之计"
		}
	}
	local 返回组 = {}
	local 指定 = {
		3,
		1,
		2
	}

	for n = 1, 数量 do
		if 指定[n] ~= nil then
			local aa = 法术[指定[n]]
			local i = ygsj(#aa)
			返回组[n] = aa[i]

			table.remove(aa, i)
		else
			local aa = 法术[ygsj(#法术)]

			while #aa == 0 do
				aa = 法术[ygsj(#法术)]
			end

			local i = ygsj(#aa)
			返回组[n] = aa[i]

			table.remove(aa, i)
		end
	end

	return 返回组
end

取随机物理法术 = function(数量)
	local 法术 = {
		"裂石",
		"横扫千军",
		"浪涌",
		"天雷斩",
		"烟雨剑法",
		"满天花雨",
		"后发制人",
		"破釜沉舟",
		"翻江搅海",
		"天崩地裂",
		"善恶有报",
		"剑荡四方",
		"力劈华山"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

取随机法术新 = function(数量)
	local 法术 = {
		"水漫金山",
		"地狱烈火",
		"奔雷咒",
		"泰山压顶",
		"龙卷雨击",
		"飞砂走石",
		"落叶萧萧",
		"三昧真火",
		"龙腾",
		"烈火",
		"水攻",
		"落岩",
		"雷击",
		"五行制化",
		"五雷咒",
		"阎罗令",
		"雨落寒沙",
		"月光"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

取随机法术鬼 = function(数量)
	local 法术 = {
		"尸腐毒",
		"地涌金莲",
		"夺命咒",
		"阎罗令",
		"判官令",
		"百爪狂杀"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

取随机辅助法术 = function(数量)
	local 法术 = {
		"水漫金山",
		"地狱烈火",
		"奔雷咒",
		"泰山压顶",
		"龙卷雨击",
		"飞砂走石",
		"落叶萧萧",
		"三昧真火",
		"龙腾",
		"烈火",
		"水攻",
		"落岩",
		"雷击",
		"五行制化",
		"五雷咒",
		"阎罗令",
		"雨落寒沙",
		"月光"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

取随机法术1 = function(数量)
	local 法术 = {
		"横扫千军",
		"唧唧歪歪",
		"金刚护法",
		"五雷咒",
		"雨落寒沙",
		"龙卷雨击",
		"龙吟",
		"龙腾",
		"天雷斩",
		"苍茫树",
		"地裂火",
		"靛沧海",
		"日光华",
		"紧箍咒",
		"烟雨剑法",
		"五雷轰顶",
		"飞砂走石",
		"三昧真火",
		"狮搏",
		"鹰击",
		"连环击",
		"天罗地网",
		"阎罗令",
		"判官令",
		"尸腐毒",
		"反间之计"
	}
	local 返回组 = {}

	for n = 1, 数量 do
		local i = 取随机数(1, #法术)
		返回组[n] = 法术[i]

		table.remove(法术, i)
	end

	return 返回组
end

取法术技能 = function(jn)
	local jns = {}

	if jn == "灵性" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3949490866.0
		jns[8] = 3143201775.0
	elseif jn == "金刚伏魔" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2566898861.0
		jns[8] = 3862994147.0
	elseif jn == "失忆符" then
		jns[1] = "令对手一定回合无法使用特技"
		jns[3] = 4
		jns[4] = "55点魔法"
		jns[5] = "符之术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562829683
		jns[8] = 2704552245.0
	elseif jn == "龙腾" then
		jns[1] = "施展法术攻击对方单人"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "龙腾术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2093346600
		jns[8] = 3650312562.0
	elseif jn == "高级慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 242180125
		jns[8] = 4174265955.0
	elseif jn == "混天术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3643496130.0
		jns[8] = 481805567
	elseif jn == "龙腾术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3471484278.0
		jns[8] = 2151837087.0
	elseif jn == "驱尸" then
		jns[1] = "解除各类中毒状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "周易学技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1226417381
		jns[8] = 546827248
	elseif jn == "水攻" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法伤"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 85059369
		jns[8] = 2415441344.0
	elseif jn == "尸腐毒" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*4+自身力量的20%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 49094427
		jns[8] = 2328293467.0
	elseif jn == "闭月羞花" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3321056507.0
		jns[8] = 0xFB265F9E
	elseif jn == "无敌牛虱" then
		jns[1] = "召唤牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "40点魔法"
		jns[5] = "牛虱阵技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3889342201.0
		jns[8] = 901977927
	elseif jn == "百毒不侵" then
		jns[1] = "解毒并在一定回合内避免中毒"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "玉质冰肌技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 45388430
		jns[8] = 938983833
	elseif jn == "养生之道" then
		jns[1] = "修身养性固本清元之术\n学习可以增加活力上限"
		jns[3] = 80
		jns[6] = "物品图标.wdf"
		jns[7] = 968832765
		jns[8] = 1635371623
	elseif jn == "乘风破浪" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "游龙术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 90073709
		jns[8] = 3228417140.0
	elseif jn == "烟雨剑法" then
		jns[1] = "使用后可以连续攻击对手两次"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "潇湘仙雨技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3124546025.0
		jns[8] = 3643055813.0
	elseif jn == "定心术" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*3"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "阴阳二气诀技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3988224797.0
		jns[8] = 99592343
	elseif jn == "百万神兵" then
		jns[1] = "令对方无法使用物理攻击"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "混天术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3140668291.0
		jns[8] = 0xFF5FCC5F
	elseif jn == "神兵护法" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "神道无念技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1217133207
		jns[8] = 3100160960.0
	elseif jn == "巨岩破" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到12级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3218559640.0
		jns[8] = 3817801025.0
	elseif jn == "乾坤塔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 646614501
		jns[8] = 3014813769.0
	elseif jn == "轻如鸿毛" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "香飘兰麝技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 33492847
		jns[8] = 367093981
	elseif jn == "灵通术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 695584869
		jns[8] = 577240546
	elseif jn == "魔王回首" then
		jns[1] = "使用后可以在受到物理攻击的时候自动反击"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "回身击技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 995890213
		jns[8] = 3043919056.0
	elseif jn == "飘渺式" then
		jns[1] = "物理攻击对方多个目标"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "潇湘仙雨技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3268745174.0
		jns[8] = 3398385178.0
	elseif jn == "达摩护体" then
		jns[1] = "战斗中临时提高自己或队友的气血上限\n#Y血气数值=目标等级*3.5+目标灵力的20%"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415107827
		jns[8] = 3131800459.0
	elseif jn == "高级法术抵抗" then
		jns[1] = "减少10%所受的法伤，但同时物理伤害能力减少10%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3908900845.0
		jns[8] = 3908900845.0
	elseif jn == "高级反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1907422702
		jns[8] = 511662384
	elseif jn == "灵动九天" then
		jns[1] = "战斗中临时提高队友和自己的法伤\n#Y提升法伤数值=等级*4"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "人物飞升且“金刚经”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2299324564.0
		jns[8] = 1921901005
	elseif jn == "迷情大法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2410267095.0
		jns[8] = 3102396352.0
	elseif jn == "紧箍咒" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续伤害\n#Y伤害数值=技能等级*4+自身灵力的20%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "观音咒技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1573115441
		jns[8] = 956876360
	elseif jn == "苍茫树" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到13级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1228860567
		jns[8] = 2355974251.0
	elseif jn == "周易学" then
		jns[1] = "按技能等级提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 951717916
		jns[8] = 3182787390.0
	elseif jn == "五行学说" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3646722626.0
		jns[8] = 733606302
	elseif jn == "诵经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1921499236
		jns[8] = 3515981629.0
	elseif jn == "离魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降速度\n#Y降低速度数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 30806
		jns[8] = 3355342391.0
	elseif jn == "五雷轰顶" then
		jns[1] = [[
对目标造成法伤
#P技能使用成功:
#Y造成目标当前血量的25%伤害
#P技能使用失败:
#Y造成目标当前血量的5%伤害
#S数值不会超过(技能等级*50)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFC7CEE47
		jns[8] = 1825724039
	elseif jn == "六道轮回" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2191025103.0
		jns[8] = 1761343362
	elseif jn == "九幽阴魂" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2427286393.0
		jns[8] = 2803361004.0
	elseif jn == "佛门普渡" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "渡世步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2996697873.0
		jns[8] = 3423122163.0
	elseif jn == "傲世诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3001127144.0
		jns[8] = 1049195070
	elseif jn == "天神护体" then
		jns[1] = "战斗中增加队友和自己的法伤\n#Y法伤数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "天罡气技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2173852985.0
		jns[8] = 0xFA64E7B9
	elseif jn == "镇妖" then
		jns[1] = "使用它后可以降低怪物的伤害\n#Y伤害数值=技能等级*3"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "乾坤塔技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2821624851.0
		jns[8] = 251203682
	elseif jn == "生死搏" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3136073986.0
		jns[8] = 1362791032
	elseif jn == "天罗地网" then
		jns[1] = [[
固定伤害攻击多目标
有几率使目标:
无法使用普通攻击和降低目标速度
#Y固伤伤害数值加成:
#Y技能等级*4+自身敏捷的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "30点魔法*人数"
		jns[5] = "移形换影技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1653509465
		jns[8] = 1457394081
	elseif jn == "天神护法" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "天罡气技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 4053425914.0
		jns[8] = 3750198819.0
	elseif jn == "乾天罡气" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y(魔法=技能等级*2+自身灵力的10%)*0.5"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%的气血"
		jns[6] = "物品图标.wdf"
		jns[7] = 3309202999.0
		jns[8] = 2018341630
	elseif jn == "高级防御" then
		jns[1] = "增加(自身等级×0.8)的防御，但法伤能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1616189465
		jns[8] = 3783015310.0
	elseif jn == "否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3345212313.0
		jns[8] = 3002471686.0
	elseif jn == "盘丝阵" then
		jns[1] = "战斗中增加队友和自己的防御\n#Y防御数值=技能等级*5"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2395356970.0
		jns[8] = 1769215086
	elseif jn == "无敌牛妖" then
		jns[1] = "召唤使用法术的牛妖前来协助战斗"
		jns[3] = 66
		jns[4] = "150点魔法"
		jns[5] = "牛虱阵技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 526953932
		jns[8] = 2771934779.0
	elseif jn == "法术暴击" then
		jns[1] = "使用法术攻击目标时会有一定几率使法伤值加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1389982585
		jns[8] = 1108386617
	elseif jn == "尸气漫天" then
		jns[1] = "打造后为帽子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "拘魂诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3830562709.0
		jns[8] = 3540479557.0
	elseif jn == "雷霆万钧" then
		jns[1] = "攻击性法术，使用后攻击对方多个目标"
		jns[3] = 4
		jns[4] = "35点魔法×作用人数"
		jns[5] = "人物飞升且“天罡气”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1167105764
		jns[8] = 2063612274
	elseif jn == "佛法无边" then
		jns[1] = "使目标施展某些攻击性法术时一定几率出现连续两次攻击(不包括需停回合的法术及群体攻击性法术，如横扫千军、鹰击、后发制人、连环击)"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“金刚伏魔”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2286663605.0
		jns[8] = 3100187427.0
	elseif jn == "移形换影" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "清歌妙舞技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "情天恨海" then
		jns[1] = "克制五庄观弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "沉鱼落雁技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1898550998
		jns[8] = 2472450541.0
	elseif jn == "自在心法" then
		jns[1] = "清除己方队员身上普渡众生效果，同时将该回合剩余回合可增加的当前气血与气血上限结算进行回复。"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "灵性技能达到60级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1199130784
		jns[8] = 3420028880.0
	elseif jn == "高级偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震，物理攻击效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4012815828.0
		jns[8] = 1555617599
	elseif jn == "阴阳二气诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 683331190
		jns[8] = 0xFC7EDF4C
	elseif jn == "佛光普照" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341.0
		jns[8] = 921854792
	elseif jn == "飞砂走石" then
		jns[1] = "使用后可以攻击对方多个对象\n#Y技能附带5%法暴几率"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "火云术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 706133968
		jns[8] = 746568918
	elseif jn == "呼风唤雨" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 438165716
		jns[8] = 1919875705
	elseif jn == "修罗隐身" then
		jns[1] = [[
战斗中隐藏自己或队友的身形
令对手无法攻击
隐身状态下不能施展法术
#Y该技能夜晚不能使用]]
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "尸腐恶技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 557290721
		jns[8] = 3076118166.0
	elseif jn == "天地同寿" then
		jns[1] = [[
为友方和自己加上一个状态
吸收全部法伤
但目标降低50%防御
且所受物理伤害会加倍]]
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFBC5D873
		jns[8] = 3294906395.0
	elseif jn == "倾国倾城" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 594113044
		jns[8] = 3862994147.0
	elseif jn == "莲华妙法" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "金刚经技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4050867699.0
		jns[8] = 2277699794.0
	elseif jn == "游龙术" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1730135660
		jns[8] = 316450658
	elseif jn == "潇湘仙雨" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3541032788.0
		jns[8] = 2723035390.0
	elseif jn == "日月乾坤" then
		jns[1] = "令对手一定回合内无法行动\n法术,特技,物攻都无法使用"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "乾坤袖技能达到20级，不能用在某些特殊任务的战斗中使用成功"
		jns[6] = "物品图标.wdf"
		jns[7] = 3902929414.0
		jns[8] = 3489253938.0
	elseif jn == "高级冥思" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1718714912
		jns[8] = 2174943999.0
	elseif jn == "追魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1021060099
		jns[8] = 2404071232.0
	elseif jn == "唧唧歪歪" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人\n#Y该技能额外有自身50%的灵力加成"
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "诵经技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1856916618
		jns[8] = 2374732908.0
	elseif jn == "歧黄之术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2055755507
		jns[8] = 93243227
	elseif jn == "金刚护体" then
		jns[1] = "战斗中临时提高自己或队友的防御力\n#Y防御数值=技能等级*3.5"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1377178114
		jns[8] = 3453377621.0
	elseif jn == "训兽诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1184160039
		jns[8] = 3128610907.0
	elseif jn == "龙吟" then
		jns[1] = "减少对方全体队员一定的气血和魔法值\n#Y伤害数值=技能等级*2"
		jns[3] = 4
		jns[4] = "300点魔法"
		jns[5] = "龙附技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1318499395
		jns[8] = 2137943042
	elseif jn == "裂石步" then
		jns[1] = "按技能等级提高躲避"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFF7AB8FE
		jns[8] = 3339537828.0
	elseif jn == "杨柳甘露" then
		jns[1] = [[
使用后可以复活已经死亡的队友
可以复活处在
“锢魂术”或者“死亡召唤”状态下
剩余回合小于等于2的队友
#Y复活血量=技能等级*3+自身灵力的10%]]
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "观音咒技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3757213330.0
		jns[8] = 794491517
	elseif jn == "香飘兰麝" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3531606030.0
		jns[8] = 1383632532
	elseif jn == "判官令" then
		jns[1] = [[
固定伤害攻击单目标
#Y固伤伤害数值加成:
#Y技能等级*5+自身力量的10%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)
#Y天黑状态提高伤害+技能等级*1.5]]
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "拘魂诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1671969153
		jns[8] = 3702239149.0
	elseif jn == "救死扶伤" then
		jns[1] = "重复技能无效果,请用推气过宫"
		jns[3] = 5
		jns[4] = "无介绍"
		jns[5] = "歧黄之术技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265.0
	elseif jn == "舍身取义" then
		jns[1] = "将目标当前气血恢复到满"
		jns[3] = 5
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“歧黄之术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2043895215
		jns[8] = 4157454265.0
	elseif jn == "龙附术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3715378746.0
		jns[8] = 3758617445.0
	elseif jn == "神龙摆尾" then
		jns[1] = "持续一定回合的防御性法术，拥有该效果时施法者防御和法防提高30%"
		jns[3] = 5
		jns[4] = "100点魔法"
		jns[5] = "人物飞升且“破浪诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1562612473
		jns[8] = 2539345287.0
	elseif jn == "健身术" then
		jns[1] = "由华佗所创的五禽戏发展而来\n学习可以增加体力上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3589295296.0
		jns[8] = 3157390677.0
	elseif jn == "变身" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*5"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFF4048E9
		jns[8] = 3667711762.0
	elseif jn == "狂怒" then
		jns[1] = "临时提高伤害力\n#Y提升伤害数值=技能等级*2"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1848955562
		jns[8] = 1848955562
	elseif jn == "爪印特效" then
		jns[1] = "临时提高伤害力\n是象形、鹰击、狮搏和连环击的前提\n#Y提升伤害数值=技能等级*2"
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFF4048E9
		jns[8] = 3667711762.0
	elseif jn == "披坚执锐" then
		jns[1] = "法术追加套装的触发\n几率提高100%，持续1回合"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1928159649
		jns[8] = 1928159649
	elseif jn == "莲花宝座" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 37911440
		jns[8] = 2202511971.0
	elseif jn == "天雷斩" then
		jns[1] = "使用后可以给予多个敌人重击"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "傲世诀技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 315619009
		jns[8] = 958381035
	elseif jn == "驱魔" then
		jns[1] = "解除并避免方寸山封类法术的影响"
		jns[3] = 6
		jns[4] = "45点魔法"
		jns[5] = "周易学技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1284415330
		jns[8] = 656352481
	elseif jn == "掌心雷" then
		jns[1] = "使用它后可以使对手不能使用主动法宝。效果可与其他封系效果叠加。成功几率等同封印成功率，受法术攻击修炼影响"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 763772202
		jns[8] = 1576485465
	elseif jn == "五行错位" then
		jns[1] = "克制女儿村弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "五行扭转技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 322760356
		jns[8] = 3739244200.0
	elseif jn == "失心符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1506622772
		jns[8] = 3407760722.0
	elseif jn == "斩龙诀" then
		jns[1] = "克制龙宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "紫薇之术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 40028053
		jns[8] = 1152390271
	elseif jn == "强力" then
		jns[1] = "增加(自身等级×0.4)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1458903425
		jns[8] = 707555275
	elseif jn == "如花解语" then
		jns[1] = "令对手一定回合无法使用普通攻击"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "闭月羞花技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1912374008
		jns[8] = 1283470548
	elseif jn == "拈花妙指" then
		jns[1] = "打造后为鞋子提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "佛光普照技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 177955034
		jns[8] = 2841407500.0
	elseif jn == "复苏" then
		jns[1] = "解除并避免天宫封类法术的影响"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "盘丝大法技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 141266175
		jns[8] = 2870523056.0
	elseif jn == "凝神术" then
		jns[1] = "10回合内增加15%自身的封系命中几率"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "归元心法技能达到100级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3869803971.0
		jns[8] = 3077203266.0
	elseif jn == "含情脉脉" then
		jns[1] = "令对手一定回合内概率\n无法使用物理和法术攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "魔兽神功技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4111305818.0
		jns[8] = 2589491420.0
	elseif jn == "龙卷雨击" then
		jns[1] = "施展法术攻击对方\n技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "25点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "冥思" then
		jns[1] = "战斗中每回合自动恢复(自身等级四分之一)的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 622128415
		jns[8] = 3554832714.0
	elseif jn == "催眠符" then
		jns[1] = "令对手在受到伤害前无法行动"
		jns[3] = 4
		jns[4] = "45点魔法"
		jns[5] = "符之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3523869082.0
		jns[8] = 104771547
	elseif jn == "高级雷属性吸收" then
		jns[1] = "30%的几率免受雷属性法伤，并按应受伤害的大小恢复气血，吸收失败也可减少法伤的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1654409054
		jns[8] = 119787649
	elseif jn == "雷属性吸收" then
		jns[1] = "30%的几率免受雷属性法伤，并按应受伤害的大小恢复气血，吸收失败也可减少法伤的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2803729932.0
		jns[8] = 2803729932.0
	elseif jn == "分身术" then
		jns[1] = "在一场回合内里\n闪避每回合受到的首次攻击\n持续3回合"
		jns[3] = 66
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“神道无念”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2099222596
		jns[8] = 1436233235
	elseif jn == "姊妹相随" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3177731283.0
		jns[8] = 597142503
	elseif jn == "云霄步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 276418186
		jns[8] = 3893284871.0
	elseif jn == "奔雷咒" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法伤，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2858620755.0
		jns[8] = 3666293224.0
	elseif jn == "玉质冰肌" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3438751351.0
		jns[8] = 2264853140.0
	elseif jn == "高级法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有较大幅度的上下波动"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2322584044.0
		jns[8] = 3668919080.0
	elseif jn == "地裂火" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到14级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4132171079.0
		jns[8] = 75104423
	elseif jn == "狂兽诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1661790658
		jns[8] = 2338433754.0
	elseif jn == "我佛慈悲" then
		jns[1] = "可以复活死亡的队友\n#Y复活血量=技能等级*3+自身灵力的10%"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "大慈大悲技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1545297145
		jns[8] = 266298194
	elseif jn == "破釜沉舟" then
		jns[1] = "同时攻击对方四个目标"
		jns[3] = 4
		jns[4] = "消耗上限气血的10%"
		jns[5] = "人物飞升且“十方无敌”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1580308746
		jns[8] = 619017033
	elseif jn == "金刚护法" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害数值=技能等级*3"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "佛光普照技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 479962043
		jns[8] = 3700736796.0
	elseif jn == "莲步轻舞" then
		jns[1] = "令对手一定回合无法使用法术攻击"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3508375370.0
		jns[8] = 0xFCF44944
	elseif jn == "三星灭魔" then
		jns[1] = "克制魔王寨弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "黄庭经技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1209970630
		jns[8] = 84450076
	elseif jn == "十方无敌" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1137925403
		jns[8] = 4107877611.0
	elseif jn == "解毒" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "歧黄之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1966642136
		jns[8] = 546423120
	elseif jn == "摄魄" then
		jns[1] = "减少对方一定的魔法\n从而恢复自身魔法\n#Y数值=技能等级*2+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941.0
		jns[8] = 103370656
	elseif jn == "修仙术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3726980014.0
		jns[8] = 1673560698
	elseif jn == "幽冥鬼眼" then
		jns[1] = "使用后可以看到隐身的目标\n#Y并增加抵抗封印等级100点"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "九幽阴魂技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1975607386
		jns[8] = 2807639015.0
	elseif jn == "高级再生" then
		jns[1] = "战斗中每回合自动恢复气血，恢复数值与自身等级相同"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 468221024
		jns[8] = 3809634425.0
	elseif jn == "振翅千里" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "大鹏展翅技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3512079122.0
		jns[8] = 4160807473.0
	elseif jn == "逆鳞" then
		jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "逆鳞技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1493556934
		jns[8] = 3804853170.0
	elseif jn == "龙骇龙腾" then
		jns[1] = "战斗中增加队友和自己的伤害力\n#Y伤害数值=技能等级*2"
		jns[3] = 5
		jns[4] = "40点魔法"
		jns[5] = "逆鳞技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1493556934
		jns[8] = 3804853170.0
	elseif jn == "浩然正气" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "天罡气技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3449922467.0
		jns[8] = 567769462
	elseif jn == "天诛地灭" then
		jns[1] = "克制地府弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "天罡气技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3016239004.0
		jns[8] = 3701201548.0
	elseif jn == "火云术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4166858964.0
		jns[8] = 909252202
	elseif jn == "永恒" then
		jns[1] = "受到治疗效果提高30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1988160424
		jns[8] = 1508625069
	elseif jn == "雨落寒沙" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*2+自身伤害的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "作用人数*20点魔法"
		jns[5] = "沉鱼落雁技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2465624576.0
		jns[8] = 562574867
	elseif jn == "高级吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的30%，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1364867245
		jns[8] = 2545117654.0
	elseif jn == "碎甲符" then
		jns[1] = "降低3个目标的防御和灵力\n#Y数值=自身等级*4"
		jns[3] = 4
		jns[4] = "50点魔法*目标数"
		jns[5] = "人物飞升且“符之术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 417555669
		jns[8] = 3175526110.0
	elseif jn == "安神诀" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y伤害加成=技能等级*5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "技能达到109级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3150617611.0
		jns[8] = 2204689180.0
	elseif jn == "无双一击" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2203124248.0
		jns[8] = 2998720398.0
	elseif jn == "巧匠之术" then
		jns[1] = "该技能无效,无需学习"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 1296624794
		jns[8] = 1296624794
	elseif jn == "兵器谱" then
		jns[1] = "能够鉴定武器和铠甲，学习后也可在长安书店制作相应等级的“神兵图鉴”"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "神兵鉴赏技能等级达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1814276494
		jns[8] = 0xFE16E718
	elseif jn == "清明自在" then
		jns[1] = "按技能等级提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3231066014.0
		jns[8] = 3842629365.0
	elseif jn == "水漫金山" then
		jns[1] = "水属性的攻击法术，按召唤兽等级附加一定的法伤，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2637597442.0
		jns[8] = 3867686033.0
	elseif jn == "追捕技巧" then
		jns[1] = "可以降低对手逃跑的成功率\n但最低不小于10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 123566127
		jns[8] = 902425300
	elseif jn == "逃离技巧" then
		jns[1] = "学习后可以提高战斗逃跑的成功率\n但最高不超过90%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1198324882
		jns[8] = 1820394508
	elseif jn == "烹饪技巧" then
		jns[1] = "传自商代名厨伊尹的技能\n可以提高制作食物的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2019196942
		jns[8] = 3782401606.0
	elseif jn == "中药医理" then
		jns[1] = "精通歧黄之术往往\n可以提高炼制丹药的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3878607199.0
		jns[8] = 642378453
	elseif jn == "沉鱼落雁" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 370722733
		jns[8] = 1052773261
	elseif jn == "紫薇之术" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3941011754.0
		jns[8] = 1942519774
	elseif jn == "炼金术" then
		jns[1] = "秘术士私传的炼金之术\n可以提高制作饰品、靴子和腰带的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "攻击修炼" then
		jns[1] = "可以提升角色攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "防御修炼" then
		jns[1] = "可以提升角色防御效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法术修炼" then
		jns[1] = "可以提升角色法术攻击效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "法抗修炼" then
		jns[1] = "可以提升角色法防效果。修炼等级越高效果明显"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1324974820
		jns[8] = 333902768
	elseif jn == "满天花雨" then
		jns[1] = [[
对目标造成单体物理攻击
使用后增加自己的10%攻击力
并有30%几率使对手#Y中毒
(#Z该中毒没特效但有效果#)
#Y攻击力加成可以叠加三层
#Y可获得最高20%攻击力加成
#Y持续到战斗结束]]
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "沉鱼落雁技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2270504354.0
		jns[8] = 1714354841
	elseif jn == "符之术" then
		jns[1] = "无效果"
		jns[3] = 1
		jns[6] = "物品图标.wdf"
		jns[7] = 3599571341.0
		jns[8] = 921854792
	elseif jn == "舍身取义" then
		jns[1] = "将目标当前气血恢复到满"
		jns[3] = 3
		jns[4] = "150点魔法，且每次使用时会降低自身5%物理防御及3%灵力"
		jns[5] = "人物飞升且“歧黄之术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1135928864
		jns[8] = 1707332905
	elseif jn == "剑荡四方" then
		jns[1] = "使用时可攻击多人。指定的目标受到一定伤害，并造成其他任意两个目标少量伤害。"
		jns[3] = 4
		jns[4] = "当前气血的百分之十"
		jns[6] = "物品图标.wdf"
		jns[7] = 1668746823
		jns[8] = 1668746823
	elseif jn == "金刚镯" then
		jns[1] = "大幅提升自己的伤害力\n#Y数值=伤害+自身等级*5"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“混天术”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4185507078.0
		jns[8] = 1737815847
	elseif jn == "裁缝技巧" then
		jns[1] = "从天衣无缝针法演化而来\n可提高缝制头盔和铠甲的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1071853506
		jns[8] = 1758794729
	elseif jn == "落岩" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法伤"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFBEEDD94
		jns[8] = 300977089
	elseif jn == "生命之泉" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y气血数值=技能等级*0.5+自身灵力的10%"
		jns[3] = 3
		jns[4] = "作用人数*30点魔法"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1093047199
		jns[8] = 2757069702.0
	elseif jn == "韦陀护法" then
		jns[1] = "战斗中临时提高自己或队友的法伤\n#Y法伤数值=技能等级*3"
		jns[3] = 3
		jns[4] = "35点魔法"
		jns[5] = "佛光普照技能等级达到20级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2121060262
		jns[8] = 2888289425.0
	elseif jn == "暗器技巧" then
		jns[1] = "暗器名家的家传秘笈\n学习后可以增加使用暗器的伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2101102727
		jns[8] = 1473796032
	elseif jn == "冥想" then
		jns[1] = "通过冥想凝聚强大的精神力量\n学习可以提高魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 97139368
		jns[8] = 903007607
	elseif jn == "弱点土" then
		jns[1] = "弱点为土，受到土属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2234852568.0
		jns[8] = 910396241
	elseif jn == "冤魂不散" then
		jns[1] = "克制大唐官府弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "九幽阴魂技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3587078621.0
		jns[8] = 376661686
	elseif jn == "强化法防" then
		jns[1] = "提高法防能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化气血上限" then
		jns[1] = "提高气血上限\n数值加成=技能等级*200"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化物理防御" then
		jns[1] = "提高物理防御能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化魔法上限" then
		jns[1] = "提高魔法上限\n数值加成=技能等级*100"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "抵抗封印等级" then
		jns[1] = "提高抵抗封印能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化伤害" then
		jns[1] = "提高物理伤害能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化固定伤害" then
		jns[1] = "提高固定伤害能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化封印命中等级" then
		jns[1] = "提高封印命中等级\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化治疗能力" then
		jns[1] = "提示治疗能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强化法伤" then
		jns[1] = "提示法伤能力\n数值加成=技能等级*20"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强身术" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3597995533.0
		jns[8] = 732966867
	elseif jn == "强壮" then
		jns[1] = "强身健体是习武之人的根本\n学习后可以提高15点人物基础气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2458245611.0
		jns[8] = 1870892091
	elseif jn == "神速" then
		jns[1] = "神速习武之人的根本，学习后可以提高1.5点人物基础速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 440987942
		jns[8] = 3473412458.0
	elseif jn == "敏捷" then
		jns[1] = "提高自身速度的10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3132756451.0
		jns[8] = 0xFFAC3F6A
	elseif jn == "盘丝舞" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "蛛丝阵法技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2082714040
		jns[8] = 382164728
	elseif jn == "火属性吸收" then
		jns[1] = "30%的几率免受火属性法伤，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4098020456.0
		jns[8] = 4092454521.0
	elseif jn == "落魄符" then
		jns[1] = "令对手一定回合内无法使用法术攻击\n并出现攻击偏差"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "符之术技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1553239295
		jns[8] = 2036240644
	elseif jn == "驱怪" then
		jns[1] = "法术攻击时该被动技能无效，对怪物(不包含NPC和鬼魂类怪物)造成伤害增加10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3713855072.0
		jns[8] = 3945460783.0
	elseif jn == "泰山压顶" then
		jns[1] = "土属性的攻击法术，按召唤兽等级附加一定的法伤，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 463605150
		jns[8] = 463605150
	elseif jn == "观音咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1410587972
		jns[8] = 1911562650
	elseif jn == "牛虱阵" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1129585606
		jns[8] = 2492840335.0
	elseif jn == "杀气诀" then
		jns[1] = "战斗中临时提高自己或队友的伤害\n#Y伤害加成=技能等级*5"
		jns[3] = 3
		jns[4] = "40点魔法"
		jns[5] = "为官之道技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1673396685
		jns[8] = 1326507976
	elseif jn == "高级毒" then
		jns[1] = "自身对毒免疫，物理攻击时有20%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 589320553
		jns[8] = 1086230366
	elseif jn == "高级反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击的伤害与正常攻击相同"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3922527672.0
		jns[8] = 3922527672.0
	elseif jn == "解封" then
		jns[1] = "单次解除女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "60点魔法"
		jns[5] = "九龙诀技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2555181368.0
		jns[8] = 1807191850
	elseif jn == "高级神迹" then
		jns[1] = "不受除日月乾坤外的所有异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 705701591
		jns[8] = 0xFC717CFD
	elseif jn == "火甲术" then
		jns[1] = "此状态维持期间遭受普通物理攻击、法术时将自动使用三味真火进行反击。"
		jns[3] = 66
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“火云术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2418820008.0
		jns[8] = 3223806685.0
	elseif jn == "地狱烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法伤，攻击人数为(自身等级除以15+1)，最多为3人"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFBBBE334
		jns[8] = 3042874244.0
	elseif jn == "高级飞行" then
		jns[1] = "伤害和灵力提高5%,但防御力降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFEF30F0D
		jns[8] = 3853120636.0
	elseif jn == "龙啸九天" then
		jns[1] = "克制盘丝洞弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "龙附技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3644673853.0
		jns[8] = 2124753589
	elseif jn == "高级强力" then
		jns[1] = "增加(自身等级×0.715)的攻击，如果对方有防御或高级防御技能，伤害结果会减少20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3563500497.0
		jns[8] = 2177485118.0
	elseif jn == "乙木仙遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "斜月步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 71432172
		jns[8] = 436091648
	elseif jn == "魔兽啸天" then
		jns[1] = "克制天宫弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "魔兽神功技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 950759216
		jns[8] = 1124928283
	elseif jn == "夺命蛛丝" then
		jns[1] = "克制方寸山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "蛛丝阵法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 227632678
		jns[8] = 3268216546.0
	elseif jn == "腾云驾雾" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "云霄步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1924869232
		jns[8] = 906709372
	elseif jn == "弱点水" then
		jns[1] = "弱点为水，受到水属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 803997825
		jns[8] = 1114088245
	elseif jn == "慧根" then
		jns[1] = "使用法术时所消耗的魔法降低为正常的75%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1457451798
		jns[8] = 3365576412.0
	elseif jn == "摇头摆尾" then
		jns[1] = [[
攻击目标时有70%几率触发飞砂走石
30%几率触发多目标三昧真火
(最多5个目标)
触发飞沙走石时有20%几率给对方
留下灼烧效果
每回合减少固定血量!]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“牛虱阵”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3051115375.0
		jns[8] = 1777991632
	elseif jn == "高级鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2436724533.0
		jns[8] = 3547941491.0
	elseif jn == "高级驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法伤效果加倍，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 72429538
		jns[8] = 72429538
	elseif jn == "幻镜术" then
		jns[1] = "自身有40%的概率反弹法术攻击"
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“移形换影”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1134668132
		jns[8] = 605963427
	elseif jn == "高级幸运" then
		jns[1] = "被法术和物理暴击几率降低50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1781077356
		jns[8] = 481753720
	elseif jn == "高级法术暴击" then
		jns[1] = "使用法术攻击目标时会有较大几率使法伤值加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2071863113
		jns[8] = 1628140681
	elseif jn == "瘴气" then
		jns[1] = "降低3个目标50%的被治疗效果\n持续4回合"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "人物飞升且“迷情大法”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3039047760.0
		jns[8] = 3862934535.0
	elseif jn == "高级魔之心" then
		jns[1] = "对敌人的法伤效果提高20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2586072698.0
		jns[8] = 2875710379.0
	elseif jn == "迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788.0
		jns[8] = 274661895
	elseif jn == "高级迟钝" then
		jns[1] = "天生行动缓慢，速度效果会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2619272788.0
		jns[8] = 274661895
	elseif jn == "高级夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1048702203
		jns[8] = 1048702203
	elseif jn == "七星遁" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 923985229
		jns[8] = 2400021580.0
	elseif jn == "高级敏捷" then
		jns[1] = "提升自身速度的20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1248152147
		jns[8] = 2061355872
	elseif jn == "楚楚可怜" then
		jns[1] = "停止行动并保护自己免受伤害"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3842255938.0
		jns[8] = 952615752
	elseif jn == "精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，但自己的物理攻击效果也会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4141937856.0
		jns[8] = 2799682055.0
	elseif jn == "清心" then
		jns[1] = "使用后可以解除中毒的状态"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "九龙诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 22613468
		jns[8] = 3563353856.0
	elseif jn == "防御" then
		jns[1] = "增加(自身等级×0.6)的防御，但法伤能力会降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 91393867
		jns[8] = 4101692183.0
	elseif jn == "感知" then
		jns[1] = "可以破解地府的修罗隐身、女儿村的楚楚可怜法术效果"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3677043818.0
		jns[8] = 4012137980.0
	elseif jn == "龙魂" then
		jns[1] = "每成功使用三次法术都可以临时增加自身法伤,持续2回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 16772866
		jns[8] = 16772865
	elseif jn == "魔兽反噬" then
		jns[1] = "按技能等级提高防御"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 512391647
		jns[8] = 1359532967
	elseif jn == "招架" then
		jns[1] = "受到物理伤害抵消10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2387844026.0
		jns[8] = 3512730332.0
	elseif jn == "弱点雷" then
		jns[1] = "弱点为雷，受到雷属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2886112942.0
		jns[8] = 2605672758.0
	elseif jn == "弱点火" then
		jns[1] = "弱点为火，受到火属性法术攻击时伤害增加50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1546100078
		jns[8] = 4005696838.0
	elseif jn == "逆鳞术" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3104091414.0
		jns[8] = 3406230011.0
	elseif jn == "靛沧海" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到11级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2679663466.0
		jns[8] = 1783445565
	elseif jn == "苍鸾怒击" then
		jns[1] = "普通物理攻击发生必杀或连击时，临时提升10%伤害力随机攻击另一个目标，每回合最多触发一次。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3329378845.0
		jns[8] = 3329378845.0
	elseif jn == "夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3713855072.0
		jns[8] = 3713855072.0
	elseif jn == "高级夜战" then
		jns[1] = "具备夜战能力，不受夜间攻防能力下降的影响，夜间躲避能力提高20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3713855072.0
		jns[8] = 3713855072.0
	elseif jn == "天蚕丝" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "移形换影技能达到1级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1283246148
		jns[8] = 1806917376
	elseif jn == "乾坤袖" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2256743052.0
		jns[8] = 3443276818.0
	elseif jn == "烈火" then
		jns[1] = "火属性的攻击法术，按召唤兽等级附加一定的法伤"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2966154175.0
		jns[8] = 1668132272
	elseif jn == "踏山裂石" then
		jns[1] = "克制化生寺弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "震天诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4060498152.0
		jns[8] = 2813097952.0
	elseif jn == "破浪诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4132491653.0
		jns[8] = 3313121721.0
	elseif jn == "高级土属性吸收" then
		jns[1] = "30%的几率免受土属性法伤，并按应受伤害的大小恢复气血，吸收失败也可减少法伤的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2639364118.0
		jns[8] = 751839372
	elseif jn == "二龙戏珠" then
		jns[1] = "施展法术攻击对方两个目标"
		jns[3] = 4
		jns[4] = "70点魔法"
		jns[5] = "人物飞升且“九龙诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1266218218
		jns[8] = 630766288
	elseif jn == "太极生化" then
		jns[1] = "克制狮驼岭弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "修仙术技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1665649019
		jns[8] = 1661704448
	elseif jn == "五雷咒" then
		jns[1] = "施展法术攻击对方单人\n#Y对鬼魂术、高级鬼魂术敌人伤害增加30%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "霹雳咒技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3103307429.0
		jns[8] = 1116134864
	elseif jn == "高级感知" then
		jns[1] = "破解地府的修罗隐身、女儿村的楚楚可怜法术效果，躲避能力提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 675296013
		jns[8] = 1822711583
	elseif jn == "高级水属性吸收" then
		jns[1] = "30%的几率免受水属性法伤，并按应受伤害的大小恢复气血，吸收失败也可减少法伤的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2532360260.0
		jns[8] = 1312179231
	elseif jn == "须弥真言" then
		jns[1] = "增加魔力值*0.4的法伤力"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438666.0
		jns[8] = 2864438666.0
	elseif jn == "土属性吸收" then
		jns[1] = "30%的几率免受土属性法伤，并按应受伤害的大小恢复气血，但受到雷属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 134325226
		jns[8] = 3503123353.0
	elseif jn == "拘魂诀" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1622524729
		jns[8] = 3403104810.0
	elseif jn == "高级必杀" then
		jns[1] = "物理攻击时的必杀几率增加20%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1672890477
		jns[8] = 1282412196
	elseif jn == "从天而降" then
		jns[1] = "超级神鸡专属技能，大大提高攻击时造成的伤害，但攻击时有一定几率腾空失败。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438671.0
		jns[8] = 2864438671.0
	elseif jn == "大快朵颐" then
		jns[1] = "超级神猴专属技能，出手前有一定几率触发，大大提升几率性技能(连击、必杀)的触发几率。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438670.0
		jns[8] = 2864438670.0
	elseif jn == "千钧一怒" then
		jns[1] = "超级神羊专属技能，普通物理攻击造成的伤害≧目标气血伤害*10%时，使自己的主人获得10点愤怒。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438669.0
		jns[8] = 2864438669.0
	elseif jn == "浮云神马" then
		jns[1] = "超级神马专属技能，在场时，提高自己及主人10%的速度，最多持续5回合。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438668.0
		jns[8] = 2864438668.0
	elseif jn == "再生" then
		jns[1] = "战斗中每回合自动恢复(自身等级一半)的气血"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287776911.0
		jns[8] = 2264480315.0
	elseif jn == "连击" then
		jns[1] = "45%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1161065019
		jns[8] = 834880568
	elseif jn == "毒" then
		jns[1] = "物理攻击时有15%的几率使敌人中毒，中毒后每回合减少10%的气血和5%的魔法"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 142259178
		jns[8] = 3804526840.0
	elseif jn == "杳无音讯" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "无常步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2049632078
		jns[8] = 739072521
	elseif jn == "鬼魂术" then
		jns[1] = "死亡5回合后自动复活，不受异常状态影响，但也不能使用药品和食物恢复气血(可以食用包子)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813494718
		jns[8] = 0xFEE50FAB
	elseif jn == "法术波动" then
		jns[1] = "使用法术攻击目标时伤害在原有伤害值基础上会有大幅度的波动"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 762242741
		jns[8] = 267613400
	elseif jn == "坐莲" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10魔法"
		jns[5] = "莲花宝座技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2462764859.0
		jns[8] = 3850121742.0
	elseif jn == "后发制人" then
		jns[1] = [[
休息一回合后攻击指定目标
休息期间:
#Y提高自身防御=技能等级*3.5
#Y法防自身降低=技能等级*0.4]]
		jns[3] = 4
		jns[4] = "最大气血的5%"
		jns[5] = "无双一击技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3809037555.0
		jns[8] = 1112380505
	elseif jn == "阎罗令" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*3+自身力量的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)
#Y天黑状态提高伤害+技能等级*1.5]]
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "幽冥术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2806354228.0
		jns[8] = 3446923388.0
	elseif jn == "魔之心" then
		jns[1] = "对敌人的法伤效果提高10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 718604442
		jns[8] = 2278038627.0
	elseif jn == "神佑复生" then
		jns[1] = "战斗死亡时有15%的几率复活为正常状态，如果同时拥有鬼魂术(普通或高级)，神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1409514751
		jns[8] = 2943632069.0
	elseif jn == "偷袭" then
		jns[1] = "身手灵敏，不会受到反击和反震。攻击效果增加5%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3049408565.0
		jns[8] = 205675459
	elseif jn == "必杀" then
		jns[1] = "物理攻击时的必杀几率增加10%，出现必杀时伤害结果会加倍"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3789166294.0
		jns[8] = 1107454372
	elseif jn == "驱鬼" then
		jns[1] = "对鬼魂类怪物的物理、法伤效果增加50%，如果将鬼魂类怪物打死，对方将飞出场外而不能复活"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 416049958
		jns[8] = 2077703648
	elseif jn == "三昧真火" then
		jns[1] = "使用后可以攻击对方单个对象\n#Y技能附带10%法暴几率"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "火云术技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 626159438
		jns[8] = 290397996
	elseif jn == "高级火属性吸收" then
		jns[1] = "30%的几率免受火属性法伤，并按应受伤害的大小恢复气血，吸收失败也可减少法伤的30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2898051336.0
		jns[8] = 1343324785
	elseif jn == "高级永恒" then
		jns[1] = "受到的治疗效果提高50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 4168001168.0
		jns[8] = 3963828674.0
	elseif jn == "横扫千军" then
		jns[1] = [[
能连续攻击对方3次
但使用后需休息一回合
休息时不能使用战斗指令
也不会受封类法术影响
休息期间:
#Y自身防御和法防降低10%]]
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427.0
	elseif jn == "紫气东来" then
		jns[1] = "克制普陀山弟子的必杀技"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "小乘佛法技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3576748561.0
		jns[8] = 3918273363.0
	elseif jn == "炼气化神" then
		jns[1] = "一定回合内补充自己和队友的魔法\n#Y魔法数值=技能等级%2"
		jns[3] = 3
		jns[4] = "技能等级%2的气血"
		jns[5] = "修仙术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2394667501.0
		jns[8] = 1686425132
	elseif jn == "毒经" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3161058590.0
		jns[8] = 1458078261
	elseif jn == "嗜血" then
		jns[1] = "打造后为项链提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "文韬武略技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 2341356120.0
		jns[8] = 831906636
	elseif jn == "推拿" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y回血数值=技能等级*5+自身灵力的10%"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "歧黄之术技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 404486915
		jns[8] = 0xFFA56FD1
	elseif jn == "火牛阵" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1917391753
		jns[8] = 1358009688
	elseif jn == "反震" then
		jns[1] = "受到物理攻击时有30%几率给予对方反震，反震伤害为所受伤害的25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3941065708.0
		jns[8] = 3754360316.0
	elseif jn == "牛刀小试" then
		jns[1] = "初入江湖必备技能"
		jns[3] = 4
		jns[4] = "20魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3416022732.0
		jns[8] = 3416022732.0
	elseif jn == "一笑倾城" then
		jns[1] = "令多个目标一定回合无法使用法术"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“倾国倾城”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3266381545.0
		jns[8] = 522280593
	elseif jn == "穿云破空" then
		jns[1] = "为腰带附加提升物理攻击伤害结果的临时效果。"
		jns[3] = 9
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“啸傲”技能达到35级，人物等级达到30级。 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3294906395.0
		jns[8] = 3294906395.0
	elseif jn == "鹰击" then
		jns[1] = "攻击对方多人，使用后需要休息1回合"
		jns[3] = 4
		jns[4] = "30点魔法，攻击多人时消耗增加"
		jns[5] = "生死搏技能达到30级，不允许连续两回合使用"
		jns[6] = "物品图标.wdf"
		jns[7] = 3219722580.0
		jns[8] = 1443303401
	elseif jn == "娉婷袅娜" then
		jns[1] = "使对手一定回合无法使用装备特技"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "闭月羞花技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 768000231
		jns[8] = 1404049159
	elseif jn == "高级招架" then
		jns[1] = "受到物理伤害抵消20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 450878763
		jns[8] = 1018872745
	elseif jn == "幸运" then
		jns[1] = "被法术和物理暴击几率降低25%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3640080474.0
		jns[8] = 1085801234
	elseif jn == "金刚经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2444843522.0
		jns[8] = 4122844852.0
	elseif jn == "霹雳咒" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 53930907
		jns[8] = 300592749
	elseif jn == "魂飞魄散" then
		jns[1] = "使用后驱散目标因门派法术获得的所有良性状态(变身除外)。 "
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "“六道轮回”技能达到50级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 1594584941
		jns[8] = 2719875429.0
	elseif jn == "妙手回春" then
		jns[1] = "重复技能无效果,请用推气过宫"
		jns[3] = 6
		jns[4] = "无介绍"
		jns[5] = "歧黄之术技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 416089174
		jns[8] = 2939581056.0
	elseif jn == "堪察令" then
		jns[1] = "鉴定头盔、饰品、腰带、靴子等类装备，学习后也可在长安书店制作相应等级的“灵宝图鉴”。"
		jns[3] = 12
		jns[4] = "一定的活力，视装备等级而定"
		jns[5] = "灵通术技能达到5级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4073909039.0
		jns[8] = 2150653771.0
	elseif jn == "渡世步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2399184502.0
		jns[8] = 2261339260.0
	elseif jn == "姐妹同心" then
		jns[1] = "减少对方一定的魔法\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "姊妹相随技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 42398851
		jns[8] = 502149406
	elseif jn == "飞行" then
		jns[1] = "伤害和灵力提高5%,但防御力降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 813574344
		jns[8] = 1190813269
	elseif jn == "尸腐恶" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3997271777.0
		jns[8] = 22951667
	elseif jn == "天外魔音" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3819811307.0
		jns[8] = 2331712128.0
	elseif jn == "吸血" then
		jns[1] = "物理攻击时，吸取对方所掉气血的25%, 如果对方有异常状态，吸血后会中毒，攻击鬼魂类怪物时无效"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 668285297
		jns[8] = 156592686
	elseif jn == "一气化三清" then
		jns[1] = "打造后为衣服提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "修仙术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFDC44BC0
		jns[8] = 2501870432.0
	elseif jn == "乾坤妙法" then
		jns[1] = [[
保护队友和自己
使其不受任何负面影响
但也无法进行任何行动
血量必须大于50%才能使用]]
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“乾坤袖”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1736041428
		jns[8] = 3294906395.0
	elseif jn == "失魂符" then
		jns[1] = "有几率令对手一定回合内\n无法使用法术攻击并降防御\n#Y降低防御数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2029120895
		jns[8] = 2414938178.0
	elseif jn == "护法金刚" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 223144262
		jns[8] = 84328029
	elseif jn == "定身符" then
		jns[1] = "有几率令对手一定回合内\n无法使用物理攻击并降法防\n#Y降低法防数值=技能等级*2"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "符之术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 170590832
		jns[8] = 2539497909.0
	elseif jn == "颠倒五行" then
		jns[1] = "提高自身和队友50%的五行法术吸收几率\n并且受到法伤降低30%"
		jns[3] = 3
		jns[4] = "80点魔法"
		jns[5] = "人物飞升且“五行扭转”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1849998950
		jns[8] = 3616521026.0
	elseif jn == "回身击" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1224508814
		jns[8] = 2667913913.0
	elseif jn == "嗜血追击" then
		jns[1] = "使用物理攻击目标时，会有一定几率攻击另一个目标一次。此效果每回合只会触发一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3287596045.0
		jns[8] = 3287596045.0
	elseif jn == "反间之计" then
		jns[1] = "令怪物处于混乱状态\n不能用于玩家对战"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "文韬武略技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 146786390
		jns[8] = 841319996
	elseif jn == "小乘佛法" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2925047058.0
		jns[8] = 1573500785
	elseif jn == "一苇渡江" then
		jns[1] = "战斗中临时提高自己或队友的速度\n#Y速度数值=技能等级*2.5"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "佛光普照技能等级达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2822966564.0
		jns[8] = 1136663058
	elseif jn == "九龙诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 140291603
		jns[8] = 923894374
	elseif jn == "活血" then
		jns[1] = "使用后可以恢复队友和自己的气血\n#Y回血数值=技能等级*5+自身敏捷的10%"
		jns[3] = 3
		jns[4] = "70点魔法"
		jns[5] = "歧黄之术技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2432822176.0
		jns[8] = 2865439591.0
	elseif jn == "疾风步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2104231936
		jns[8] = 552299472
	elseif jn == "错乱" then
		jns[1] = "令对手无法使用法术\n并在物理攻击时出现目标偏差"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "乾坤塔技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3622268205.0
		jns[8] = 0xFFB5624B
	elseif jn == "兵解符" then
		jns[1] = "在战斗中立即传送回自己门派\n溜之大吉"
		jns[3] = 66
		jns[4] = "无消耗"
		jns[5] = "符之术技能等级达到10级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 1268134129
		jns[8] = 2026082073
	elseif jn == "神兵鉴赏" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 743065692
		jns[8] = 0xFCF64BB4
	elseif jn == "神力无穷" then
		jns[1] = "打造后为腰带提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "狂兽诀技能达到35级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3809438015.0
		jns[8] = 3884615585.0
	elseif jn == "宁气诀" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1979452270
		jns[8] = 3573433154.0
	elseif jn == "还阳术" then
		jns[1] = "复活倒地的队友，提高攻击力，降低防御力"
		jns[3] = 3
		jns[4] = "150点魔法"
		jns[5] = "人物飞升且“拘魂诀”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2874709055.0
		jns[8] = 485361049
	elseif jn == "文韬武略" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1708888521
		jns[8] = 3150772814.0
	elseif jn == "神道无念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1749937072
		jns[8] = 3852659463.0
	elseif jn == "牛逼神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3975126128.0
		jns[8] = 2741787302.0
	elseif jn == "极度疯狂" then
		jns[1] = "受到物理攻击时会自动反击敌人"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "魔兽反噬技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 363599535
		jns[8] = 2884919862.0
	elseif jn == "大慈大悲" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1267473253
		jns[8] = 3966881348.0
	elseif jn == "归元咒" then
		jns[1] = "消耗魔法值来补充自己的气血\n#Y回血数值=技能等级*2+自身灵力的10%"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%点魔法"
		jns[5] = "归元心法技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2473529751.0
		jns[8] = 3090930843.0
	elseif jn == "普渡众生" then
		jns[1] = "一定回合内补充自己和队友的气血\n#Y气血数值=技能等级*2+自身灵力的10%"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "金刚经技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 688650727
		jns[8] = 3407231441.0
	elseif jn == "混元道果" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 675093303
		jns[8] = 3799123064.0
	elseif jn == "飞花摘叶" then
		jns[1] = [[
吸取敌方多人魔法为我方队员所使用
且敌方受到女儿村封印技能
命中几率提高5%
持续3回合]]
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "人物飞升且“清歌妙舞”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4065673057.0
		jns[8] = 1962869359
	elseif jn == "秋波暗送" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1698608098
		jns[8] = 975668103
	elseif jn == "魔王护持" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "牛逼神功技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 937481251
		jns[8] = 3778438121.0
	elseif jn == "反击" then
		jns[1] = "受到物理攻击时有30%几率自动反击，反击伤害为正常伤害的50%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2574462722.0
		jns[8] = 326702364
	elseif jn == "黄庭经" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2680262225.0
		jns[8] = 1501050246
	elseif jn == "五行扭转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3256679059.0
		jns[8] = 3457635171.0
	elseif jn == "魔兽神功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2952870578.0
		jns[8] = 10218458
	elseif jn == "大鹏展翅" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1243494819
		jns[8] = 2200620761.0
	elseif jn == "推气过宫" then
		jns[1] = "战斗中恢复多人气血\n#Y回血数值=技能等级*2.5+自身灵力的10%"
		jns[3] = 3
		jns[4] = "50点魔法*人数"
		jns[5] = "歧黄之术技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 971215069
		jns[8] = 2227035198.0
	elseif jn == "归元心法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3444112895.0
		jns[8] = 2996031232.0
	elseif jn == "飞行符" then
		jns[1] = "学习后也可在长安书店制作飞行符"
		jns[3] = 0
		jns[4] = "消耗一定的体力"
		jns[5] = "符之术技能达到21级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1788221468
		jns[8] = 1798664293
	elseif jn == "蛛丝阵法" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 487492946
		jns[8] = 2233726885.0
	elseif jn == "红袖添香" then
		jns[1] = "战斗中增加自己或队友的速度\n#Y速度数值=技能等级*2"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "倾国倾城技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 547746768
		jns[8] = 1757842178
	elseif jn == "连环击" then
		jns[1] = "疯狂地连续的攻击敌人"
		jns[3] = 4
		jns[4] = "可连击次数×30点魔法"
		jns[5] = "狂兽诀技能达到30级，使用后解除当前所有增益状态"
		jns[6] = "物品图标.wdf"
		jns[7] = 3608703815.0
		jns[8] = 673541382
	elseif jn == "高级连击" then
		jns[1] = "55%的几率连续两次物理攻击，如果对方有反震技能，只能攻击一次"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1321871887
		jns[8] = 3016140514.0
	elseif jn == "隐身" then
		jns[1] = "自动附加地府修罗隐身法术2～3回合，拥有此技能物理攻击能力会降低20%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1508147758
		jns[8] = 3007875758.0
	elseif jn == "高级隐身" then
		jns[1] = "自动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2491734238.0
		jns[8] = 2948130962.0
	elseif jn == "似玉生香" then
		jns[1] = "令对手一定回合不能法术和普通攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "闭月羞花技能等级达到40级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 2732466496.0
		jns[8] = 3524410344.0
	elseif jn == "斜月步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 769022309
		jns[8] = 2124205828
	elseif jn == "日光华" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "五行学技能达到10级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2064123225
		jns[8] = 877019458
	elseif jn == "寡欲令" then
		jns[1] = "解除并避免盘丝洞封类法术的影响。"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "灵通术技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 653757983
		jns[8] = 482656655
	elseif jn == "法术连击" then
		jns[1] = "使用法术攻击目标时会有一定几率出现连续2次攻击敌人"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2200246844.0
		jns[8] = 345682085
	elseif jn == "黄泉之息" then
		jns[1] = "攻击对方单人，并减少10%的速度，夜间使用会增加50%的技能伤害"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "人物飞升且“幽冥术”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3536984715.0
		jns[8] = 1893059881
	elseif jn == "魔音摄魂" then
		jns[1] = "让敌方\n受到治疗效果降低100%\n持续4回合"
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[5] = "人物飞升且“天外魔音”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 32064057
		jns[8] = 1554838399
	elseif jn == "锢魂术" then
		jns[1] = "使用后可使目标5个回合内\n在死亡状态下无法被复活"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "幽冥术技能达到75级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1727365486
		jns[8] = 784403165
	elseif jn == "牛屎遁" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "裂石步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2481624731.0
		jns[8] = 668274006
	elseif jn == "高级法术连击" then
		jns[1] = "使用法术攻击目标时会有较大几率出现连续2次攻击敌人"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3484714916.0
		jns[8] = 1890987017
	elseif jn == "高级神佑复生" then
		jns[1] = "战斗死亡时有30%的几率复活为正常状态，如果同时拥有鬼魂术(普通或高级)，神佑复生的效果将取消。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2040400078
		jns[8] = 3049938323.0
	elseif jn == "牛劲" then
		jns[1] = "战斗中暂时提高自己的法伤力\n#Y提升法伤数值=技能等级*3.5"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[5] = "火牛阵技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3521936089.0
		jns[8] = 1080213476
	elseif jn == "无常步" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2772099555.0
		jns[8] = 71871380
	elseif jn == "为官之道" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2338752455.0
		jns[8] = 2050205097
	elseif jn == "狮搏" or jn == "狮搏 " then
		jns[1] = "以高于平时的伤害力攻击对方单人"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "生死搏技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3700481839.0
		jns[8] = 1627374280
	elseif jn == "威慑" then
		jns[1] = "令怪物或玩家召唤兽无法行动\n不能对玩家使用"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "训兽诀技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 81423983
		jns[8] = 894640149
	elseif jn == "盘丝步" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3406981495.0
		jns[8] = 337337940
	elseif jn == "磐龙灭法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 423192983
		jns[8] = 1962038233
	elseif jn == "清歌妙舞" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1027945253
		jns[8] = 2444515719.0
	elseif jn == "魔息术" then
		jns[1] = "一定回合内恢复自身的魔法 "
		jns[3] = 5
		jns[4] = "50点气血"
		jns[5] = "人物飞升且“阴阳二气诀”技能达到120级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3643037170.0
		jns[8] = 787252900
	elseif jn == "三花聚顶" then
		jns[1] = "消耗气血来补充自己的魔法值\n#Y(魔法=技能等级*2+自身灵力的10%)*0.5"
		jns[3] = 5
		jns[4] = "等级*2+自身灵力的10%的气血"
		jns[5] = "明性修身技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3813527840.0
		jns[8] = 3150915326.0
	elseif jn == "幽冥术" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2105426613
		jns[8] = 414994835
	elseif jn == "龙附" then
		jns[1] = "打造后为武器提高一定的属性"
		jns[3] = 12
		jns[4] = "和技能等级数相同的活力"
		jns[5] = "龙附技能达到35级，人物等级达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2888970157.0
		jns[8] = 1784954158
	elseif jn == "勾魂" then
		jns[1] = "减少对方一定的气血\n从而恢复自身气血\n#Y数值=技能等级*4+自身敏捷的10%"
		jns[3] = 4
		jns[4] = "40点魔法"
		jns[5] = "秋波暗送技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3333121941.0
		jns[8] = 802455732
	elseif jn == "盘丝大法" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2544956347.0
		jns[8] = 136964443
	elseif jn == "知己知彼" then
		jns[1] = "使用后可以查看敌方的信息"
		jns[3] = 4
		jns[4] = "80点魔法"
		jns[5] = "清明自在达到35级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 196316992
		jns[8] = 2448181313.0
	elseif jn == "天罡气" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFBCA1857
		jns[8] = 517623127
	elseif jn == "高级隐身" then
		jns[1] = "动附加地府修罗隐身法术3～5回合，拥有此技能物理攻击能力会降低15%，隐身状态下无法使用法术"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2491734238.0
		jns[8] = 2948130962.0
	elseif jn == "落雷符" then
		jns[1] = "法术攻击多个目标\n#Y对鬼魂术、高级鬼魂术敌人伤害增加20%"
		jns[3] = 4
		jns[4] = "作用人数*30点魔法"
		jns[5] = "“符之术”技能达到20级 "
		jns[6] = "物品图标.wdf"
		jns[7] = 3476452217.0
		jns[8] = 3226830020.0
	elseif jn == "象形" then
		jns[1] = "攻击敌人并令其下回合无法行动\n但使用后自己也将在下回合停止行动\n且取消变身状态"
		jns[3] = 4
		jns[4] = "80魔法"
		jns[5] = "生死搏技能达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 3175084157.0
		jns[8] = 108912467
	elseif jn == "天魔解体" then
		jns[1] = "使用后持续一定回合\n数将自身的物理防御降低50%\n防御值的10%转化为临时伤害"
		jns[3] = 5
		jns[4] = "当前角色最大魔法的80%"
		jns[5] = "人物飞升且“生死搏”技能达到120级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2713209956.0
		jns[8] = 2477360209.0
	elseif jn == "水遁" then
		jns[1] = "平时或战斗中使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "战斗时消耗当前所有魔法，非战斗时消耗10点气血、魔法"
		jns[5] = "游龙术技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 596614171
		jns[8] = 2671300567.0
	elseif jn == "震天诀" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1449209742
		jns[8] = 1917106392
	elseif jn == "斗转星移" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "七星遁技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2019188530
		jns[8] = 655674701
	elseif jn == "水属性吸收" then
		jns[1] = "30%的几率免受水属性法伤，并按应受伤害的大小恢复气血，但受到火属性法术攻击时伤害会增加30%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 92545119
		jns[8] = 1756512785
	elseif jn == "宁心" then
		jns[1] = "解除并避免女儿村封类法术的影响"
		jns[3] = 3
		jns[4] = "30点魔法"
		jns[5] = "宁气诀技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585090388.0
		jns[8] = 1957863037
	elseif jn == "明性修身" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4104116990.0
		jns[8] = 3074583809.0
	elseif jn == "打造技巧" then
		jns[1] = "铸造名家欧冶子传下的技能\n可以提高打造武器的能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3866239213.0
		jns[8] = 1635206107
	elseif jn == "千里神行" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派"
		jns[3] = 0
		jns[4] = "消耗10点气血和10点魔法"
		jns[5] = "疾风步技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 13494159
		jns[8] = 1717996623
	elseif jn == "神通广大" then
		jns[1] = "齐天大圣降妖伏魔，嫉恶如仇，其法术之高，神通广大，无所不能。通晓此技能，是本门修行的基础。"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682629.0
		jns[8] = 3878682629.0
	elseif jn == "如意金箍" then
		jns[1] = "学习效果:提高角色的伤害"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682628.0
		jns[8] = 3878682628.0
	elseif jn == "齐天逞胜" then
		jns[1] = "齐天大圣之名方可遂悟空之意，闹凌霄、撼东海、戏阎王，无一不为逞胜之举。花果山弟子均继承了此等威仪自信。"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682625.0
		jns[8] = 3878682625.0
	elseif jn == "金刚之躯" then
		jns[1] = "学习效果:提高角色的防御"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682626.0
		jns[8] = 3878682626.0
	elseif jn == "灵猴九窍" then
		jns[1] = "学习效果:提高角色的命中"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682627.0
		jns[8] = 3878682627.0
	elseif jn == "七十二变" then
		jns[1] = "学习效果:提高角色的法伤和法防"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682633.0
		jns[8] = 3878682633.0
	elseif jn == "腾云驾霧" then
		jns[1] = "以云雾飞行于天穹，自在无穷。"
		jns[3] = 8
		jns[6] = "jntb.wdf"
		jns[7] = 3878682640.0
		jns[8] = 3878682640.0
	elseif jn == "如意神通" then
		jns[1] = "#Y【效果】每回合开始时，花果山弟子只能使用随机的3个如意神通类技能。\n#P与NPC的战斗中，普通攻击将会额外攻击一个目标。"
		jns[3] = 55
		jns[6] = "jntb.wdf"
		jns[7] = 3878682649.0
		jns[8] = 3878682649.0
	elseif jn == "威震凌霄" then
		jns[1] = "灵霄宝殿惊玉皇，十万天军无可挡。被大圣选定的攻击目标，其勇气和攻势将大大减弱。对目标造成伤害，并降低目标物理/法术暴击等级。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[5] = "“神通广大”技能达到120级且角色飞升。"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682646.0
		jns[8] = 3878682646.0
	elseif jn == "气慑天军" then
		jns[1] = "大闹天宫之际，虽有天军名将，仍震慑于大圣之气势，众人攻势均不能近其要害。对自己使用，大量提升抗物理/法术暴击等级。"
		jns[3] = 2
		jns[4] = "100点魔法"
		jns[5] = "“神通广大”技能达到120级且角色飞升。"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682659.0
		jns[8] = 3878682659.0
	elseif jn == "当头一棒" then
		jns[1] = "【如意神通】临时提升伤害攻击一个敌方单位，若目标气血百分比若处于60%至70%之间，则伤害加倍。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[5] = "“如意金箍”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682663.0
		jns[8] = 3878682663.0
		jns[9] = 1
	elseif jn == "神针撼海" then
		jns[1] = "【如意神通】对敌方5个目标发动物理攻击。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[5] = "“如意金箍”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682665.0
		jns[8] = 3878682665.0
		jns[9] = 1
	elseif jn == "杀威铁棒" then
		jns[1] = "【如意神通】临时提高伤害，攻击敌方单个目标，并降低目标对自身造成的伤害，持续1回合。不会触发金甲仙衣、蟠龙玉璧等法宝效果。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[5] = "“如意金箍”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682661.0
		jns[8] = 3878682661.0
		jns[9] = 1
	elseif jn == "泼天乱棒" then
		jns[1] = "【如意神通】临时提高伤害，攻击敌方单个目标，若目标未阵亡。则额外溅射敌方3个单位，该效果不会触发保护。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[5] = "“如意金箍”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682662.0
		jns[8] = 3878682662.0
		jns[9] = 1
	elseif jn == "九幽除名" then
		jns[1] = "【如意神通】回合结束时，若自身处于倒地状态，则有几率复活(不受锢魂术影响)。成功率与技能等级相关。"
		jns[3] = 2
		jns[4] = "75点魔法"
		jns[5] = "“齐天逞胜”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682660.0
		jns[8] = 3878682660.0
		jns[9] = 1
	elseif jn == "移星换斗" then
		jns[1] = "消耗气血恢复自身的魔法。"
		jns[3] = 3
		jns[4] = "30点气血"
		jns[5] = "“齐天逞胜”技能达到15级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682664.0
		jns[8] = 3878682664.0
	elseif jn == "云暗天昏" then
		jns[1] = "对敌方多个目标造成固定伤害，并提高自身的速度，持续2回合。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[5] = "“齐天逞胜”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682656.0
		jns[8] = 3878682656.0
		jns[9] = 1
	elseif jn == "担山赶月" then
		jns[1] = "力拔山河，肩挑日月，以盖世之力为项链附加力量。"
		jns[3] = 3
		jns[4] = "和技能等级相同点数的活力"
		jns[5] = "“金刚之躯”技能达到35级且角色等级达到30级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682672.0
		jns[8] = 3878682672.0
	elseif jn == "铜头铁臂" then
		jns[1] = "为自身施加一个护盾。护盾存在时间内，提高自身的伤害结果；通天行者流派效：提高自身的法术伤害结果。"
		jns[3] = 2
		jns[4] = "75点魔法"
		jns[5] = "“金刚之躯”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682631.0
		jns[8] = 3878682631.0
		jns[9] = 1
	elseif jn == "无所遁形" then
		jns[1] = "效果:提高自身的暴击率和忽视防御的能力；通天行者行者流派:提高自身的法术暴击几率和忽视法术减免的能力。可叠加，持续6回合。"
		jns[3] = 2
		jns[4] = "75点魔法"
		jns[5] = "“灵猴九窍”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682641.0
		jns[8] = 3878682641.0
		jns[9] = 1
	elseif jn == "除光息焰" then
		jns[1] = "克制女魅墓弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“灵猴九窍”技能达到25级且角色等级达到20级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682642.0
		jns[8] = 3878682642.0
	elseif jn == "呼子唤孙" then
		jns[1] = "拔下一撮毫毛，一口仙气吹去，猴子猴孙纷纷来助。"
		jns[3] = 2
		jns[4] = "30点魔法"
		jns[5] = "“七十二变”技能达到10级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682657.0
		jns[8] = 3878682657.0
	elseif jn == "八戒上身" then
		jns[1] = "使敌方单个目标变身成一只可爱的小猪，并驱散目标的一个良性状态。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“七十二变”技能达到45级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682658.0
		jns[8] = 3878682658.0
	elseif jn == "筋斗云" then
		jns[1] = "一个筋斗十万八千里，无论在三界任一角落均可瞬间回到门派。"
		jns[3] = 0
		jns[4] = "10点气血、10点魔法"
		jns[5] = "“腾云驾雾”技能达到1级"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682643.0
		jns[8] = 3878682643.0
	elseif jn == "天地洞明" then
		jns[1] = "(场地法术)使双方所有目标的气血条对敌方可见并缩短双方下达指令的时间。"
		jns[3] = 2
		jns[4] = "50点魔法，消耗一个金鸦火羽"
		jns[5] = "化圣技能"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682647.0
		jns[8] = 3878682647.0
		jns[12] = "16回合"
	elseif jn == "棒掀北斗" then
		jns[1] = "【如意神通】大圣举棒掀翻北斗宫,回首振开南极院。霸道神威令对手闻风丧胆。【功效】对敌方单个目标造成法术伤害,暴击时额外造成伤害。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 301989888
		jns[8] = 301989888
		jns[9] = 1
	elseif jn == "灵彻太虚" then
		jns[1] = "【功效】对敌方单个目标造成法术伤害,并降低其物理暴击等级和法术暴击等级,持续3回合。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682648.0
		jns[8] = 3878682648.0
	elseif jn == "兴风作浪" then
		jns[1] = "【功效】对敌方5个目标造成法术伤害,对首目标造成额外伤害。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 1392508928
		jns[8] = 1392508928
		jns[9] = 1
	elseif jn == "棍打诸神" then
		jns[1] = "【功效】对所有敌方单位造成法术伤害。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682644.0
		jns[8] = 3878682644.0
		jns[9] = 1
	elseif jn == "意马心猿" then
		jns[1] = "【功效】对敌方单个目标造成法术伤害,并驱散1个持续回合最短的增益状态。若目标未阵亡,则额外对敌方3个单位造成溅射伤害。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 3878682645.0
		jns[8] = 3878682645.0
		jns[9] = 1
	elseif jn == "棒打雄风" then
		jns[1] = "【如意神通】替换技能:杀威铁棒。临时提升伤害力攻击一个敌方单位，同时驱散目标的─个持续时间最短的增益状态。"
		jns[3] = 4
		jns[4] = "75点魔法"
		jns[6] = "jntb.wdf"
		jns[7] = 1660944384
		jns[8] = 1660944384
		jns[9] = 1
	elseif jn == "齐天神通" then
		jns[1] = "花果山弟子逆天而立，战天斗地，每回合使用如意神通均有50%的几率额外释放—次，但临时降低30%的抵抗封印能力，状态持续4回合。(此技能为法术技能，受封印法术限制)"
		jns[3] = 2
		jns[4] = "60点愤怒"
		jns[6] = "jntb.wdf"
		jns[7] = 2013265920
		jns[8] = 2013265920
		jns[12] = "8回合"
	elseif jn == "九黎战歌" then
		jns[1] = "战鼓铿锵，战魂不息，九黎之歌荡涤天地，激昂族人之志。#R其他派技能的等级不能高于本技能。\n#P【学习效果】无效果"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435457
		jns[8] = 268435458
	elseif jn == "魂枫战舞" then
		jns[1] = "魂枫蹁跹，奕奕如战，英气磅礴，永不止息。\n#P【学习效果】按技能等级提高伤害"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435459
		jns[8] = 268435460
	elseif jn == "兵铸乾坤" then
		jns[1] = "九黎魔息，燎天之焰，铸魂成兵，乾坤在握。\n#P【学习效果】按技能等级提高法伤和法防"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435461
		jns[8] = 268435462
	elseif jn == "燃铁飞花" then
		jns[1] = "战意如火，叱咤生花，九黎之子，铁士无畏。\n#P【学习效果】按技能等级提高命中"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435463
		jns[8] = 268435464
	elseif jn == "战火雄魂" then
		jns[1] = "九黎之魂，犹燎原之火，燃万丈烈焰，指胜利之巅。\n#P【学习效果】按技能等级提高防御"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435465
		jns[8] = 268435472
	elseif jn == "魔神降世" then
		jns[1] = "聆听兵主密命，得赐魔神之力，战无不胜，天地可征。\n#P【学习效果】无效果"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435473
		jns[8] = 268435474
	elseif jn == "风行九黎" then
		jns[1] = "风所行处，九黎无阻，越古穿今，无迹不至。\n#P【学习效果】按技能等级提高躲避"
		jns[3] = 8
		jns[6] = "jmtb.wdf"
		jns[7] = 268435475
		jns[8] = 268435476
	elseif jn == "黎魂" then
		jns[1] = "每回合可以释放2-3个师门技能。"
		jns[3] = 8
		jns[5] = "九黎战歌技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435477
		jns[8] = 268435478
	elseif jn == "战鼓" then
		jns[1] = "使用师门技能攻击敌人时会累加连击值，连击值越大，下回合“黎魂”触发3个技能概率越高。"
		jns[3] = 8
		jns[5] = "九黎战歌技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435479
		jns[8] = 268435480
	elseif jn == "怒哮" then
		jns[1] = "使用一斧开天后如果目标没有处于浮空状态，45%概率获得“怒哮”：下一次使用一斧开天和三荒尽灭令目标进入浮空成功率大幅度增加。当使用一斧开天或三荒尽灭令目标成功浮空时，移除该效果。"
		jns[3] = 8
		jns[5] = "九黎战歌技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435481
		jns[8] = 268435488
		jns[66] = "下一次使用‘一斧开天’和‘三荒尽灭’令目标进入浮空成功率大幅度增加"
	elseif jn == "炎魂" then
		jns[1] = "全部种族的属性点加成属性统一按照魔族成长。每回合首次使用师门技能前会临时将自身防御的5%-10%转为伤害力。"
		jns[3] = 8
		jns[5] = "九黎战歌技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435489
		jns[8] = 268435490
	elseif jn == "枫影二刃" then
		jns[1] = "战歌鸣，怒啸起，枫林迎战舞，英魂影重重。\n#G【功效】对敌方单个目标连续发动2次物理攻击，使用后有概率令自己获得“怒哮”"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "魂枫战舞技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435491
		jns[8] = 268435492
	elseif jn == "一斧开天" then
		jns[1] = "一斧开天，气破乾坤，以往昔之魂，凝今时之志。\n#G【功效】对敌方目标连续发动2次物理攻击，使用后有概率令目标进入“浮空”状态，持续到你的行动结束。"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "兵铸乾坤技能达到30级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435495
		jns[8] = 268435496
	elseif jn == "三荒尽灭" then
		jns[1] = "横空霹雳，惊三荒， 煞四野，昭吾九黎之威。\n#G【功效】对敌方3个目标发动物理攻击，并令所有目标有概率进入“浮空”状态，持续到你的行动结束。"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "燃铁飞花技能达到30级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435493
		jns[8] = 268435494
	elseif jn == "铁血生风" then
		jns[1] = "铁血凝矣，挟风而起，敌逢吾威，食尘饮悔。\n#G【功效】对敌方单个目标连续物理攻击，如果目标处于“浮空”状态，额外发动1-2次物理攻击。"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "战火雄魂技能达到30级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435497
		jns[8] = 268435504
	elseif jn == "力辟苍穹" then
		jns[1] = "魔神垂祉，上古魔息浩若狂澜。兵主赐威，穹顶之下为吾独行。\n#G【功效】对敌方全部“浮空”目标连续发动2-3次物理攻击，然后取消全部目标的“浮空”状态。"
		jns[3] = 4
		jns[4] = "20点魔法"
		jns[5] = "魔神降世技能达到30级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435505
		jns[8] = 268435506
	elseif jn == "故壤归心" then
		jns[1] = "疾风骤起，寻归故里，不问天涯，九黎归心。\n#G【功效】平常状态下使用，可以瞬间回到自己的门派，成功率受技能等级影响。"
		jns[3] = 0
		jns[4] = "10点气血、10点魔法"
		jns[5] = "风行九黎技能达到1级"
		jns[6] = "jmtb.wdf"
		jns[7] = 268435507
		jns[8] = 268435508
	elseif jn == "天地无极" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2616462789.0
		jns[8] = 3629430297.0
	elseif jn == "九转玄功" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1837364177
		jns[8] = 1720159516
	elseif jn == "武神显圣" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3229675127.0
		jns[8] = 2285367568.0
	elseif jn == "啸傲" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1753145086
		jns[8] = 796505945
	elseif jn == "气吞山河" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4005775594.0
		jns[8] = 1613219782
	elseif jn == "诛魔" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 150136690
		jns[8] = 2802612826.0
	elseif jn == "法天象地" then
		jns[1] = "按技能等级提高命中"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2858795509.0
		jns[8] = 3937616310.0
	elseif jn == "踏山裂石" then
		jns[1] = "临时提升必杀几率对单个敌人进行物理攻击"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4108120975.0
		jns[8] = 476069806
	elseif jn == "裂石" then
		jns[1] = "对单个敌人进行物理攻击\n#Y技能附带20%必杀几率\n#S增加1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 4108120975.0
		jns[8] = 476069806
	elseif jn == "断岳势" then
		jns[1] = "对单个敌人进行2次物理攻击\n#Y技能附带10%必杀几率\n#S消耗1点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、1点战意"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1520781641
		jns[8] = 1553313601
	elseif jn == "天崩地裂" then
		jns[1] = "对单个敌人进行3次物理攻击\n#Y技能附带10%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "50点魔法、3点战意"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2598038144.0
		jns[8] = 1068512144
	elseif jn == "浪涌" then
		jns[1] = [[
对单个敌人进行物理攻击
#Y攻击怪物个数=3个
#Y技能附带5%必杀几率
#S增加1点战意值]]
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3462519068.0
		jns[8] = 438868970
	elseif jn == "惊涛怒" then
		jns[1] = [[
对多个敌人进行物理攻击
#Y攻击怪物个数=3个
#Y技能附带5%必杀几率
#S消耗1点战意值]]
		jns[3] = 4
		jns[4] = "个数*20点魔法"
		jns[5] = "“气吞山河”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3105646931.0
		jns[8] = 3188815772.0
	elseif jn == "翻江搅海" then
		jns[1] = "多个敌人进行物理攻击\n#Y技能附带3%必杀几率\n#S消耗3点战意值"
		jns[3] = 4
		jns[4] = "个数*30点魔法"
		jns[5] = "“气吞山河”技能达到45级"
		jns[6] = "物品图标.wdf"
		jns[7] = 641834001
		jns[8] = 294096936
	elseif jn == "腾雷" then
		jns[1] = "对目标造成法伤\n有几率降低目标#Y50%治疗恢复效果"
		jns[3] = 4
		jns[4] = "60点魔法"
		jns[5] = "“诛魔”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 1453130231
		jns[8] = 2506858658.0
	elseif jn == "指地成钢" then
		jns[1] = "克制无底洞弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“诛魔”技能达到25级，人物等级达到20级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 1253475100
		jns[8] = 476069806
	elseif jn == "不动如山" then
		jns[1] = "减少自身受到的法伤与物理伤害\n#Y提升防御数值=技能等级*3\n#Y提升法防数值=技能等级*2"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[5] = "“九转玄功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3647939377.0
		jns[8] = 952398480
	elseif jn == "碎星诀" then
		jns[1] = "提升自己或队友的物理伤害结果\n不能与镇魂诀同时存在\n#Y提升伤害数值=技能等级*5"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“武神显圣”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 325337792
		jns[8] = 1603107125
	elseif jn == "镇魂诀" then
		jns[1] = "提升自己或者队友的#Y24%必杀几率\n不能与碎星诀同时存在\n#Y提升伤害数值=技能等级*3"
		jns[3] = 3
		jns[4] = "5%的当前气血"
		jns[5] = "“武神显圣”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 2652209322.0
		jns[8] = 4161330374.0
	elseif jn == "无穷妙道" then
		jns[1] = "一定几率解除无底洞封印法术。"
		jns[3] = 5
		jns[4] = "60点魔法"
		jns[5] = "“法天象地”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2950398372.0
		jns[8] = 1996209900
	elseif jn == "纵地金光" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“法天象地”技能达到1级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 3869420121.0
		jns[8] = 0xFEF5D678
	elseif jn == "瞬息万变" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 91138644
		jns[8] = 3611723828.0
	elseif jn == "万灵诸念" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1673295044
		jns[8] = 3633730222.0
	elseif jn == "巫咒" then
		jns[1] = "按技能等级提高伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1387740863
		jns[8] = 3945429798.0
	elseif jn == "万物轮转" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 236054114
		jns[8] = 3548374182.0
	elseif jn == "天人庇护" then
		jns[1] = "按技能等级提高躲避力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 466502506
		jns[8] = 2656066797.0
	elseif jn == "神木恩泽" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1911264426
		jns[8] = 785936658
	elseif jn == "驭灵咒" then
		jns[1] = "按技能等级提高最大魔法上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3018347230.0
		jns[8] = 1524159458
	elseif jn == "落叶萧萧" then
		jns[1] = "使用法术攻击敌方多个目标\n#Y技能附带10%法连几率"
		jns[3] = 4
		jns[4] = "30点魔法*作用人数"
		jns[5] = "“瞬息万变”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 779308957
		jns[8] = 193786785
	elseif jn == "荆棘舞" then
		jns[1] = "使用法术攻击敌方，造成较高伤害。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3710564504.0
		jns[8] = 1784968560
	elseif jn == "尘土刃" then
		jns[1] = [[
使用法术攻击敌方单体目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身法伤的10%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1071742512
		jns[8] = 1908512688
	elseif jn == "冰川怒" then
		jns[1] = "使用法术攻击敌方单体目标\n#Y有20%概率冻结目标使其无法行动\n#S有80%几率使目标所有伤害降低10%"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“万灵诸念”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3992461142.0
		jns[8] = 991087896
	elseif jn == "雾杀" then
		jns[1] = "使用法术攻击敌方单人目标\n对敌人造成持续毒性伤害\n#Y伤害数值=技能等级*2+自身灵力的20%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 518348092
		jns[8] = 228776159
	elseif jn == "血雨" then
		jns[1] = "对目标造成大量单体法伤"
		jns[3] = 4
		jns[4] = "150"
		jns[5] = "“巫咒”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 309039919
		jns[8] = 2102575873
	elseif jn == "星月之惠" then
		jns[1] = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的10%"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[5] = "“巫咒”技能达到40级"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFF613346
		jns[8] = 8287795
	elseif jn == "炎护" then
		jns[1] = "抵御50%的气血伤害\n#Y每抵御1点伤害消耗1点魔法"
		jns[3] = 5
		jns[4] = "30点魔法"
		jns[5] = "“天人庇护”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2719344454.0
		jns[8] = 3319216516.0
	elseif jn == "叶隐" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“天人庇护”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1694409636
		jns[8] = 1366702211
	elseif jn == "神木呓语" then
		jns[1] = "打造后为鞋子临时增加一定的魔法值。"
		jns[3] = 12
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“神木恩泽”技能达到35级，人物等级达到30级。"
		jns[6] = "物品图标.wdf"
		jns[7] = 2541704741.0
		jns[8] = 869009976
	elseif jn == "蜜润" then
		jns[1] = "提升自己或队友的灵力法伤\n#Y提升伤害数值=技能等级*2.5"
		jns[3] = 5
		jns[4] = "25点魔法"
		jns[5] = "“驭灵咒”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 93250406
		jns[8] = 4164821618.0
	elseif jn == "蝼蚁蚀天" then
		jns[1] = "克制凌波城弟子的必杀技。"
		jns[3] = 4
		jns[4] = "150点愤怒值"
		jns[5] = "“驭灵咒”技能达到25级，人物等级达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2886437729.0
		jns[8] = 2891400295.0
	elseif jn == "枯骨心法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3947876534.0
		jns[8] = 3256658495.0
	elseif jn == "阴风绝章" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 580599606
		jns[8] = 2376753741.0
	elseif jn == "鬼蛊灵蕴" then
		jns[1] = "按技能等级提高灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2137124880
		jns[8] = 642299714
	elseif jn == "燃灯灵宝" then
		jns[1] = "按技能等级提高防御力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2206649654.0
		jns[8] = 2011054851
	elseif jn == "地冥妙法" then
		jns[1] = "无效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2066772317
		jns[8] = 1202816090
	elseif jn == "混元神功" then
		jns[1] = "按技能等级提伤害力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3367413411.0
		jns[8] = 2065734785
	elseif jn == "秘影迷踪" then
		jns[1] = "按技能等级提高速度"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4041502466.0
		jns[8] = 2278980523.0
	elseif jn == "移魂化骨" then
		jns[1] = "使目标获得吸血效果\n持续一定回合"
		jns[3] = 3
		jns[4] = "高于最大气血的30%才能使用"
		jns[5] = "“枯骨心法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 389027246
		jns[8] = 303745236
	elseif jn == "夺魄令" then
		jns[1] = "令目标一定回合内无法使用法术。"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[5] = "“阴风绝章”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1646402390
		jns[8] = 124692570
	elseif jn == "煞气诀" then
		jns[1] = "使目标一定回合无法做出行动\n并且该目标不会受到攻击\n可作用于敌人或友方"
		jns[3] = 88
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到30级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3226486277.0
		jns[8] = 685169880
		jns[12] = "5回合"
	elseif jn == "惊魂掌" then
		jns[1] = "使用后使对手在持续回合内无法被他人保护"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[5] = "“阴风绝章”技能达到50级"
		jns[6] = "物品图标.wdf"
		jns[7] = 3258098305.0
		jns[8] = 1899003170
	elseif jn == "摧心术" then
		jns[1] = "使敌方2个目标30%速度降低\n持续一定回合"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[5] = "“阴风绝章”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 482521264
		jns[8] = 3601183244.0
	elseif jn == "夺命咒" then
		jns[1] = [[
固定伤害攻击多目标
#Y固伤伤害数值加成:
#Y技能等级*4+自身灵力的20%
#Y暗器技巧等级*2
#Y固定伤害=(敏捷*0.7+武器伤害*0.46)]]
		jns[3] = 4
		jns[4] = "20点魔法*人数"
		jns[5] = "“鬼蛊灵蕴”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 708737596
		jns[8] = 2846858866.0
	elseif jn == "明光宝烛" then
		jns[1] = "战斗中大幅增加队友和自己的防御\n#Y防御数值=技能等级*4"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到35级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1423666398
		jns[8] = 1507345156
	elseif jn == "金身舍利" then
		jns[1] = "战斗中大幅增加队友和自己的法防\n#Y法防数值=技能等级*4"
		jns[3] = 3
		jns[4] = "100点魔法"
		jns[5] = "“燃灯灵宝”技能达到120级，且人物飞升"
		jns[6] = "物品图标.wdf"
		jns[7] = 467870386
		jns[8] = 0xFE884980
	elseif jn == "地涌金莲" then
		jns[1] = "回复自身一定的气血值\n#Y回血数值=技能等级*4+自身灵力的20%"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[5] = "“地冥妙法”技能达到20级"
		jns[6] = "物品图标.wdf"
		jns[7] = 1090221639
		jns[8] = 4097296943.0
	elseif jn == "万木凋枯" then
		jns[1] = "克制神木林弟子的技能"
		jns[3] = 4
		jns[4] = "150点愤怒"
		jns[5] = "“地冥妙法”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 57361221
		jns[8] = 4074793720.0
	elseif jn == "元阳护体" then
		jns[1] = "打造后为武器提升一定的气血"
		jns[3] = 12
		jns[4] = "和技能等级相同的活力"
		jns[5] = "“混元神功”技能达到25级"
		jns[6] = "物品图标.wdf"
		jns[7] = 2882895250.0
		jns[8] = 787842086
	elseif jn == "遁地术" then
		jns[1] = "平时状态下使用，可以瞬间回到自己的门派。"
		jns[3] = 0
		jns[4] = "10点气血和10点魔法"
		jns[5] = "“秘影迷踪”技能达到1级"
		jns[6] = "物品图标.wdf"
		jns[7] = 487888522
		jns[8] = 886071751
	elseif jn == "惊心一剑" then
		jns[1] = "对敌人造成巨大的物理伤害并"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 472040976
		jns[8] = 376561149
	elseif jn == "力劈华山" then
		jns[1] = "无视对方的防御使对方造成巨大的伤害"
		jns[3] = 4
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3633016146.0
		jns[8] = 2223068576.0
	elseif jn == "移花接木" then
		jns[1] = "每次吸收30%的气血伤害"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1485240275
		jns[8] = 1485240275
	elseif jn == "壁垒击破" then
		jns[1] = "忽视防御的攻击。攻击的目标防御，则会受到更大伤害。用此技能攻击时，会忽视“高级防御”和“防御”这两个召唤兽技能产生的技能效果。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4057305690.0
		jns[8] = 4057305690.0
	elseif jn == "神迹" then
		jns[1] = "每回合结束时自动解除一切异常状态"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1245429649
		jns[8] = 1198707975
	elseif jn == "雷击" then
		jns[1] = "雷属性的攻击法术，按召唤兽等级附加一定的法伤"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3336994935.0
		jns[8] = 2495588313.0
	elseif jn == "上古灵符" then
		jns[1] = "给予对手巨大的法术波动伤害"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2853388719.0
		jns[8] = 2853388719.0
	elseif jn == "善恶有报" then
		jns[1] = "攻击时有一定几率给予对手造成双倍的伤害，也有可能为对方恢复一定气血"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 641427651
		jns[8] = 1898344999
	elseif jn == "死亡召唤" then
		jns[1] = "给予对手巨大的伤害，并且使对手处于死亡禁锢状态下，该状态存在时使鬼魂术无效并且不能使用药品进行复活"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 1218594609
		jns[8] = 0xFF0E4570
	elseif jn == "夜舞倾城" then
		jns[1] = "造成速度6倍的巨大伤害，不受高级强力、高级敏捷以外的技能加成，并且不可暴击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 387579012
		jns[8] = 1832394806
	elseif jn == "灵能激发" then
		jns[1] = "进入战斗后，临时提高自己的法伤能力。(法力点数越高效果越好，持续5回合)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1074787883
		jns[8] = 230274660
	elseif jn == "盾气" then
		jns[1] = "进入战斗后，临时提高其等级*1.2的防御能力(持续6回合)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 78907828
		jns[8] = 78907828
	elseif jn == "高级盾气" then
		jns[1] = "进入战斗后，则提高其等级*1.5的防御能力(持续6回合)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2395092917.0
		jns[8] = 2395092917.0
	elseif jn == "合纵" then
		jns[1] = "本方每有一种与其不同的召唤兽，则提高其等级#W//5.5的物理伤害结果。同时，灵降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 2840432618.0
		jns[8] = 2840432618.0
	elseif jn == "高级合纵" then
		jns[1] = "本方每有一种与其不同的召唤兽，则提高其等级#W//4的物理伤害结果。同时，灵力降低10%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1319969279
		jns[8] = 1319969279
	elseif jn == "高级否定信仰" then
		jns[1] = "不受异常、辅助效果影响，受法伤减少20%，受到鬼魂类怪物攻击时伤害增加20%，不能同时拥有某些信仰类技能"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 484689261
		jns[8] = 2449787202.0
	elseif jn == "高级精神集中" then
		jns[1] = "精神集中，可以抵御封类异常状态，躲避力提高10%，但物理攻击能力会降低20%"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 3121640283.0
		jns[8] = 3049938323.0
	elseif jn == "月光" then
		jns[1] = "召唤数道月光攻击敌人，同一个人可以被多道月光攻击。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438667.0
		jns[8] = 2864438667.0
	elseif jn == "气疗术" then
		jns[1] = "恢复(上限3%+200)的气血，对单人使用"
		jns[3] = 3
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 175234791
		jns[8] = 2394534448.0
	elseif jn == "心疗术" then
		jns[1] = "恢复(上限6%+400)的气血，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1936940204
		jns[8] = 0xFD3187C7
	elseif jn == "命疗术" then
		jns[1] = "恢复(上限9%+600)的气血，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2327070966.0
		jns[8] = 1214582243
	elseif jn == "凝气诀" then
		jns[1] = "恢复上限(15%+200)的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2234398453.0
		jns[8] = 0xFC3656C8
	elseif jn == "凝神诀" then
		jns[1] = "恢复上限(15%+400)的魔法，对单人使用"
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3010398248.0
		jns[8] = 3594183195.0
	elseif jn == "气归术" then
		jns[1] = "自身恢复四分之一的气血"
		jns[3] = 5
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1743955726
		jns[8] = 1501636093
	elseif jn == "命归术" then
		jns[1] = "自身恢复二分之一的气血"
		jns[3] = 5
		jns[4] = "130点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2585363944.0
		jns[8] = 1305176222
	elseif jn == "四海升平" then
		jns[1] = "全体恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "135点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2015850288
		jns[8] = 2239024625.0
	elseif jn == "回魂咒" then
		jns[1] = "单体复活"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3815030652.0
		jns[8] = 2541979797.0
	elseif jn == "起死回生" then
		jns[1] = "单体复活并恢复二分之一的气血"
		jns[3] = 3
		jns[4] = "120点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2205777788.0
		jns[8] = 3279499363.0
	elseif jn == "水清诀" then
		jns[1] = "单体解除异常状态"
		jns[3] = 3
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1988393110
		jns[8] = 2231990553.0
	elseif jn == "冰清诀" then
		jns[1] = "单体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFE796634
		jns[8] = 994373130
	elseif jn == "玉清诀" then
		jns[1] = "全体解除异常状态"
		jns[3] = 3
		jns[4] = "125点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2317466220.0
		jns[8] = 1064948127
	elseif jn == "晶清诀" then
		jns[1] = "全体解除异常状态并恢复四分之一的气血"
		jns[3] = 3
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4162645482.0
		jns[8] = 2183757094.0
	elseif jn == "罗汉金钟" then
		jns[1] = "全体队友受到的法伤减半，效果为3回合"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1
		jns[8] = 2
	elseif jn == "圣灵之甲" then
		jns[1] = "提升我方全体10%的防御\n效果持续到战斗结束"
		jns[3] = 66
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3
		jns[8] = 4
	elseif jn == "魔兽之印" then
		jns[1] = "提升我方全体10%的伤害力\n效果持续到战斗结束 "
		jns[3] = 66
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 5
		jns[8] = 6
	elseif jn == "光辉之甲" then
		jns[1] = "提升队友的20%的防御\n效果持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 7
		jns[8] = 8
	elseif jn == "太极护法" then
		jns[1] = "受到的法伤减半，效果为6回合 "
		jns[3] = 3
		jns[4] = "90点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 9
		jns[8] = 16
	elseif jn == "野兽之力" then
		jns[1] = "提升队友20%的伤害力\n效果持续到战斗结束 "
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 17
		jns[8] = 18
	elseif jn == "慈航普渡" then
		jns[1] = "复活我方全体队友。"
		jns[3] = 66
		jns[4] = "150点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 19
		jns[8] = 20
	elseif jn == "八凶法阵" then
		jns[1] = "超级赤焰兽专属技能，发动法术攻击4个敌人。"
		jns[3] = 4
		jns[4] = "作用目标*30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 21
		jns[8] = 22
	elseif jn == "叱咤风云" then
		jns[1] = "水系法术攻击3个目标，并提高法术连击的概率。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 23
		jns[8] = 24
	elseif jn == "净台妙谛" then
		jns[1] = "增加自身体质*成长*2的气血。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 25
		jns[8] = 32
	elseif jn == "法术防御" then
		jns[1] = "极强的法术防御技能。可以防御法术攻击，减少65%的法伤，但无法防御物理攻击。"
		jns[3] = 66
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 33
		jns[8] = 34
	elseif jn == "理直气壮" then
		jns[1] = "普通攻击时，40%的几率攻击3次；但物理伤害效果降低20%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 35
		jns[8] = 36
	elseif jn == "天降灵葫" then
		jns[1] = "群体法术攻击，随机攻击1~5个目标，最多5人。"
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 37
		jns[8] = 38
	elseif jn == "灵能激发" then
		jns[1] = "进入战斗后，提高自己的法伤能力。(魔力点数越高效果越好，持续到战斗结束)"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 39
		jns[8] = 40
	elseif jn == "高级法术抵抗" then
		jns[1] = "减少10%所受的法伤，但同时物理伤害能力减少10%。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 41
		jns[8] = 48
	elseif jn == "灵山禅语" then
		jns[1] = "增加自身魔力*(成长-0.3)的法防。"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 49
		jns[8] = 50
	elseif jn == "观照万象" then
		jns[1] = "使用所有主动技能进攻目标,冷却回合10回合。"
		jns[3] = 4
		jns[4] = "200点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 51
		jns[8] = 52
	elseif jn == "弱点击破" then
		jns[1] = "单体无视一半防御攻击"
		jns[3] = 4
		jns[4] = "50点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4136547665.0
		jns[8] = 2136234800
	elseif jn == "冥王爆杀" then
		jns[1] = "减少对方气血，最小伤害为50"
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1507579696
		jns[8] = 1507579696
	elseif jn == "破血狂攻" then
		jns[1] = "狂性大发，可以连续攻击两次"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD99EDE1
		jns[8] = 326320655
	elseif jn == "破碎无双" then
		jns[1] = "攻击目标使目标受到伤害\n同时减少相同伤害的蓝量"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD99EDE1
		jns[8] = 326320655
	elseif jn == "破甲术" then
		jns[1] = "单体防-20%持续到战斗结束"
		jns[3] = 4
		jns[4] = "35点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "碎甲术" then
		jns[1] = "全体防-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1415639395
		jns[8] = 752055472
	elseif jn == "放下屠刀" then
		jns[1] = "降低敌人的20%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "30点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884.0
		jns[8] = 441260658
	elseif jn == "笑里藏刀" then
		jns[1] = "减少敌方单体目标70点愤怒"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3659778884.0
		jns[8] = 441260658
	elseif jn == "绝幻魔音" then
		jns[1] = "减少敌方全体目标20点愤怒"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1208650365
		jns[8] = 388686304
	elseif jn == "流云诀" then
		jns[1] = "单体速+20%持续到战斗结束"
		jns[3] = 3
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2534799922.0
		jns[8] = 2823898790.0
	elseif jn == "啸风诀" then
		jns[1] = "全体速+10%持续到战斗结束"
		jns[3] = 3
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1746071611
		jns[8] = 2520189186.0
	elseif jn == "河东狮吼" then
		jns[1] = "降低敌方全体10%物理攻击力\n效果持续到战斗结束"
		jns[3] = 4
		jns[4] = "100点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 4154480125.0
		jns[8] = 1389260370
	elseif jn == "修罗咒" then
		jns[1] = "单体反弹50%的物理伤害3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2692943252.0
		jns[8] = 352259103
	elseif jn == "天衣无缝" then
		jns[1] = "单体反弹50%的法伤3回合"
		jns[3] = 3
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1760886315
		jns[8] = 1995890078
	elseif jn == "凝滞术" then
		jns[1] = "单体速-10%持续到战斗结束"
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2415123250.0
		jns[8] = 642620104
	elseif jn == "停陷术" then
		jns[1] = "全体速-5%,持续到战斗结束"
		jns[3] = 4
		jns[4] = "70点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2036437377
		jns[8] = 1583884046
	elseif jn == "苦缠" then
		jns[1] = "失魂符、失心符、定身符降低属性的效果增加3%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3919486102.0
		jns[8] = 3919486102.0
	elseif jn == "雷动" then
		jns[1] = "使用落雷符时增加100点伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3524791333.0
		jns[8] = 3524791333.0
	elseif jn == "奔雷" then
		jns[1] = "使用五雷咒时，额外攻击另一个敌方目标。自身封印命中率下降15%。霹雳咒等级≥125时，首目标额外提高10%伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3029384489.0
		jns[8] = 3029384489.0
	elseif jn == "黄粱" then
		jns[1] = "敌方目标被自己催眠时。必须受到100点以上的伤害才会苏醒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3553565342.0
		jns[8] = 3553565342.0
	elseif jn == "不舍" then
		jns[1] = "每受到大于气血上限20%的物理伤害后，会自动使用归元咒，被封印时无法触发。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3054130714.0
		jns[8] = 3054130714.0
	elseif jn == "鬼惧" then
		jns[1] = "五雷咒提升对含有鬼魂术的敌人伤害提高30%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3024855134.0
		jns[8] = 3024855134.0
	elseif jn == "补缺" then
		jns[1] = "回合开始时，若自身魔法小于魔法上限30%时，有35%几率回复乾天罡气同等量的魔法"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 976483021
		jns[8] = 976483021
	elseif jn == "不倦" then
		jns[1] = "催眠符命中效果增加20%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2734285189.0
		jns[8] = 2734285189.0
	elseif jn == "集中" then
		jns[1] = "提升(武器伤害/命中)*24的灵力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2734285189.0
		jns[8] = 2734285189.0
	elseif jn == "不灭" then
		jns[1] = "每次使用完封印类法术时，有15%的几率自动使用技能归元咒并在一定回合内提高自身10%的防御和灵力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2926742289.0
		jns[8] = 2926742289.0
	elseif jn == "化身" then
		jns[1] = "分身术持续回合数提高1回合"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3914340397.0
		jns[8] = 3914340397.0
	elseif jn == "批亢" then
		jns[1] = "带有分身术状态时，所受伤害降低15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 537856128
		jns[8] = 537856128
	elseif jn == "斗法" then
		jns[1] = "增加10%的封印命中率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 518668792
		jns[8] = 518668792
	elseif jn == "吐纳" then
		jns[1] = "主动使用的归元咒将额外恢复气血上限*20%的气血，但额外消耗对应值*25%的魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1203544843
		jns[8] = 1203544843
	elseif jn == "飞符炼魂" then
		jns[1] = [[
一道法力强大的符咒
能在攻击敌人的同时附加封印效果
由于效果惊人
菩提祖师禁止弟子随意使用
使用法术攻击目标后
70%几率追加使用法术落魄符
并额外造成300点伤害]]
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1281623499
		jns[8] = 1281623499
		jns[12] = "冷却5回合"
	elseif jn == "鬼念" then
		jns[1] = "含有鬼魂术(包括高级鬼魂术)类的敌人降低对自身造成伤害的15%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 389027246
		jns[8] = 389027246
	elseif jn == "碎甲" then
		jns[1] = "使碎甲符作用人数提高3人，持续回合数增加1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4144088501.0
		jns[8] = 4144088501.0
	elseif jn == "摧心" then
		jns[1] = "当自身对目标造成物理伤害之后，目标概率会在之后的3回合内进入虚弱状态，降低10%的伤害力、灵力和物理防御。该效果的持续回合可以被刷新。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4072341234.0
		jns[8] = 4072341234.0
	elseif jn == "顺势而为" then
		jns[1] = [[
#S伏魔天师#:
精于封印的方寸弟子
可以耗费一定的愤怒值
对目标施加强大的法力
在下一次使用#Y封系符咒#时
#G100%封印目标效果
#Z持续3回合]]
		jns[3] = 66
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 2658140006.0
		jns[8] = 2658140006.0
		jns[12] = "冷却6回合"
	elseif jn == "钟馗论道" then
		jns[1] = [[
#S伏魔天师#:
方寸弟子乃鬼魂生物的噩梦
他们甚至能够临时将
自己善于对付鬼魂生物的能力
#G赋予全队单位
附加#Y驱鬼技能#状态
#Z持续5回合]]
		jns[3] = 66
		jns[4] = "40点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3083712170.0
		jns[8] = 3083712170.0
	elseif jn == "自矜" then
		jns[1] = "每次使用单体封印技能失败时，使得下次单体封印时成功率提高30%。到下一次命中时清空该效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 581401155
		jns[8] = 581401155
	elseif jn == "暗伤" then
		jns[1] = "雨落寒沙增加武器伤害*18%的固定伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1357109560
		jns[8] = 1357109560
	elseif jn == "杏花" then
		jns[1] = "使用雨落寒沙技能攻击时对方中毒几率增加4%。并且能对带有“高级毒”的单位起效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 816940765
		jns[8] = 816940765
	elseif jn == "花舞" then
		jns[1] = "每回合开始时提升自身6%的初始速度,持续到战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3580271332.0
		jns[8] = 3580271332.0
	elseif jn == "倩影" then
		jns[1] = "提升自己50点速度。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2261170415.0
		jns[8] = 2261170415.0
	elseif jn == "淬芒" then
		jns[1] = "每一次你使对方中毒，都可以为自己增加4%的封印命中率，封印对方时，封印命中率将重置"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 543561622
		jns[8] = 543561622
	elseif jn == "傲娇" then
		jns[1] = "使用特技时，愤怒消耗减少5点。使用笑里藏刀时，愤怒消耗额外减少6点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1406844756
		jns[8] = 1406844756
	elseif jn == "花护" then
		jns[1] = "使用水清诀、冰清诀、晶清诀、玉清诀时，愤怒消耗减少8点，并且可以使目标100%抵抗封类法术，持续一回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3289556160.0
		jns[8] = 3289556160.0
	elseif jn == "天香" then
		jns[1] = "每次使对方中毒，你回复5点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 718797064
		jns[8] = 718797064
	elseif jn == "国色" then
		jns[1] = "召唤兽进入战斗时速度增加12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 225547331
		jns[8] = 225547331
	elseif jn == "鸿影" then
		jns[1] = "若处于被封印状态，仍然可以使用雨落寒沙技能。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 623251268
		jns[8] = 623251268
	elseif jn == "轻霜" then
		jns[1] = "任何企图攻击你的对手都有30%在攻击时受到毒的影响，每回合损失毒经技能等级*3的气血，持续4回合，该状态不可叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2223913807.0
		jns[8] = 2223913807.0
	elseif jn == "机巧" then
		jns[1] = "每次你的封印成功时，敌方会受到毒的影响，每回合损失毒经技能等级*3的气血，持续4回合，该状态不可叠加。(仅封印回合有效)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3874429884.0
		jns[8] = 3874429884.0
	elseif jn == "毒引" then
		jns[1] = "对手主动解除由女儿村弟子产生的毒效果时，会额外受到600点气血损失，但最低将对手气血降为1点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1472040217
		jns[8] = 1472040217
	elseif jn == "毒雾" then
		jns[1] = "使用封印技能时，有30%几率使目标中毒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2749418111.0
		jns[8] = 2749418111.0
	elseif jn == "嫣然" then
		jns[1] = "一笑倾城和似玉生香的命中率提高12%，对每个目标的持续回合有60%的几率提升1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1178450451
		jns[8] = 1178450451
	elseif jn == "磐石" then
		jns[1] = "一个回合中，受到一个目标的伤害后，之后每次所受其他目标的伤害会递减50点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1327910442
		jns[8] = 1327910442
	elseif jn == "花殇" then
		jns[1] = "飞花摘叶目标人数提高3人，持续回合提高一回合，且命中几率提高5%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 898672612
		jns[8] = 898672612
	elseif jn == "碎玉弄影" then
		jns[1] = [[
#S绝代妖娆#:
“宁为玉碎，不为瓦全”
又有多少对手可以从
女儿村弟子曼妙的舞姿
身影中体味那一份决绝呢？
对2个目标使用#Y似玉生香
且#G100%封印命中目标]]
		jns[3] = 4
		jns[4] = "40点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 880637277
		jns[8] = 880637277
		jns[12] = "冷却8回合"
	elseif jn == "额外能力" then
		jns[1] = "学习“碎玉弄影”以后，每个额外乾元丹会增加40点封印命中等级，学习“鸿渐于陆”以后，每个额外的乾元丹会增加80点抵抗封妖等级。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2718548930.0
		jns[8] = 2718548930.0
	elseif jn == "鸿渐于陆" then
		jns[1] = [[
#S绝代妖娆#:
伤其十指，不如断其一指
必要的时刻可以将伤害凝聚起来
给予对手一次致命的攻击
造成比#Y满天花雨#更高的伤害
并且使目标有#G100%几率中毒
(#Z该中毒没特效但有效果#)]]
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 416888466
		jns[8] = 416888466
		jns[12] = "冷却4回合"
	elseif jn == "风灵" then
		jns[1] = "每次使用落叶萧萧攻击时，每命中一个目标都有48%的几率使施法者获得风灵效果，风灵效果持续到战斗结束，最高可叠加10层；施法者进行法术攻击时额外增加风灵层数*瞬息万变技能等级*0.1的法术攻击伤害力。"
		jns[6] = "物品图标.wdf"
		jns[7] = 1270320749
		jns[8] = 1270320749
	elseif jn == "法身" then
		jns[1] = "你的落叶萧萧在对目标施放时会额外作用一个单位。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3286418984.0
		jns[8] = 3286418984.0
	elseif jn == "咒术" then
		jns[1] = "同时被落叶萧萧命中的目标有25%几率获得“雾杀”效果。如果目标带有雾杀效果，且目标雾杀效果消失时会为施法者附加一层“雾痕”的效果，雾痕会使施法者增加雾痕层数*0.1*巫咒技能等级的法伤，但雾痕效果最高叠加6层"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3690857218.0
		jns[8] = 3690857218.0
	elseif jn == "灵压" then
		jns[1] = "法术攻击类技能伤害结果提高8%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2347140888.0
		jns[8] = 2347140888.0
	elseif jn == "咒法" then
		jns[1] = "巫咒等级≥人物等级时，增加60点法伤力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3783203886.0
		jns[8] = 3783203886.0
	elseif jn == "蔓延" then
		jns[1] = "使用荆棘舞时会消耗自身所有的雾痕，每层雾痕额外增加30点伤害效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3659605837.0
		jns[8] = 3659605837.0
	elseif jn == "鞭挞" then
		jns[1] = "荆棘舞会额外增加“万灵诸念”等级*风灵层数*0.3的法伤力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 715864647
		jns[8] = 715864647
	elseif jn == "月影" then
		jns[1] = "携带月影法宝时，增加月影百分之六法连几率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2515549035.0
		jns[8] = 2515549035.0
	elseif jn == "不侵" then
		jns[1] = "星月之惠效果增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1371685310
		jns[8] = 1371685310
	elseif jn == "风魂" then
		jns[1] = "战斗中提升自身风灵层数*10的防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3577357180.0
		jns[8] = 3577357180.0
	elseif jn == "冰锥" then
		jns[1] = "当使用冰川怒成功冰冻目标时有几率将是施法者身上的雾痕层数提高一倍；当冰川怒对触发过“高级神佑复生”或“神佑复生”的目标时将附加风灵层数*15的伤害值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2211572230.0
		jns[8] = 2211572230.0
	elseif jn == "血契" then
		jns[1] = "使用血雨时有50%几率对目标造成双倍伤害,且不消耗气血!"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 445225677
		jns[8] = 445225677
	elseif jn == "滋养" then
		jns[1] = "使用蜜润时，会为目标额外回复自身一定的魔法"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2195594160.0
		jns[8] = 2195594160.0
	elseif jn == "纯净" then
		jns[1] = "进入战斗时临时提高万物轮转等级*2的气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2389395090.0
		jns[8] = 2389395090.0
	elseif jn == "破杀" then
		jns[1] = "“雾杀”在消失时会发生爆炸，爆炸产生的伤害为最后回合本应造成伤害的150%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3848780459.0
		jns[8] = 3848780459.0
	elseif jn == "追击" then
		jns[1] = "当使用尘土刃时有风灵层数*5%的几率对额外的一个目标造成50%的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3459181353.0
		jns[8] = 3459181353.0
	elseif jn == "灵能" then
		jns[1] = "使用落叶萧萧将有30%的几率对目标额外造成(施法者灵力#W//瞬息万变技能等级)*5的伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4078367126.0
		jns[8] = 4078367126.0
	elseif jn == "寄生" then
		jns[1] = "使用尘土刃时将会引爆目标身上的所有雾痕印记，每层印记造成75点的固定伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2466121084.0
		jns[8] = 2466121084.0
	elseif jn == "风卷残云" then
		jns[1] = [[
神木林在觉醒,风在咆哮
大风带着神木林弟子的怒意
无情的打击面前的敌人
对目标造成#Y大量伤害
#Z固定秒7且大量消耗魔法值]]
		jns[3] = 4
		jns[4] = "1050点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 930629757
		jns[8] = 930629757
		jns[12] = "5回合"
	elseif jn == "凋零之歌" then
		jns[1] = [[
歌声飘进敌人的耳中
颤动着敌人心窝
在无形中侵袭着敌阵的斗志
埋下毁灭之种
如果目标身上有#Y雾杀效果
他将受到#G爆炸性伤害
并且有几率对目标施#Y放雾效果
#Z该技能固定秒3]]
		jns[3] = 4
		jns[4] = "100点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 673084202
		jns[8] = 673084202
		jns[12] = "8回合"
	elseif jn == "止戈" then
		jns[1] = "在原恢复技能的治疗量上再增加自身武器伤害*18%的治疗量。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2523336456.0
		jns[8] = 2523336456.0
	elseif jn == "销武" then
		jns[1] = "唧唧歪歪所造成的伤害将提高与人物等级同等的伤害量"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2591128756.0
		jns[8] = 2591128756.0
	elseif jn == "佛屠" then
		jns[1] = "金刚护法的的增益效果将在原始效果上再次增加武器伤害的9%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 851322379
		jns[8] = 851322379
	elseif jn == "佛誉" then
		jns[1] = "活血效果提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4069297938.0
		jns[8] = 4069297938.0
	elseif jn == "仁心" then
		jns[1] = "使用活血时有20%的几率使活血的功效增加100%，但会额外消耗100点魔法。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 643318438
		jns[8] = 643318438
	elseif jn == "聚气" then
		jns[1] = "每次使用恢复类门派技能时，都将会获得一层聚气印记，每层聚气印记将额外提高辅助类门派技能的功效9%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2257009561.0
		jns[8] = 2257009561.0
	elseif jn == "佛显" then
		jns[1] = "推气过宫治疗效果提升10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2371026576.0
		jns[8] = 2371026576.0
	elseif jn == "心韧" then
		jns[1] = "在使用推气过宫时有15%的几率使治疗效果增加100%，但同时也将额外消耗150点魔法。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2185091473.0
		jns[8] = 2185091473.0
	elseif jn == "归气" then
		jns[1] = "自身所有的治疗类技能都将额外增加10%的消耗，但是治疗效果将增加8%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 916183371
		jns[8] = 916183371
	elseif jn == "天照" then
		jns[1] = "每次使用舍身取义时都将有20%的几率恢复75点魔法，但将额外扣除75点气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3784378927.0
		jns[8] = 3784378927.0
	elseif jn == "舍利" then
		jns[1] = "自身死亡后，己方队员随机一名队员将增加自身与自身愤怒同等的愤怒量，但是最高不会超过120点，一场战斗最多触发3次此效果."
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3994825274.0
		jns[8] = 3994825274.0
	elseif jn == "感念" then
		jns[1] = "使用舍身取义时，临时提升目标物理防御及法防10%，持续3回合，不可叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3694256424.0
		jns[8] = 3694256424.0
	elseif jn == "慈针" then
		jns[1] = "使用我佛慈悲可以使自身获得30点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD3253DA
		jns[8] = 0xFD3253DA
	elseif jn == "佛性" then
		jns[1] = "我佛慈悲可以增加目标80点物理防御及法防，持续5回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1564996084
		jns[8] = 1564996084
	elseif jn == "妙悟" then
		jns[1] = "恢复3个目标的气血及魔法\n每次使用还会增加0.5%的速度\n可叠加!"
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 792435329
		jns[8] = 792435329
		jns[12] = "5回合"
	elseif jn == "慈心" then
		jns[1] = "使用慈航普度时消耗的愤怒减少40点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1477887830
		jns[8] = 1477887830
	elseif jn == "映法" then
		jns[1] = "金刚护法、金刚护体、一苇渡江有50%几率对所有单位起效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3369725472.0
		jns[8] = 3369725472.0
	elseif jn == "流刚" then
		jns[1] = "金刚护法、金刚护体、一苇渡江的效果增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 108881195
		jns[8] = 108881195
	elseif jn == "渡劫金身" then
		jns[1] = [[
使用治疗类技能有10%的几率
实现双倍恢复
且治疗效果将增加15%
2回合后受到法术影响的单位恢复满血]]
		jns[3] = 3
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 941207826
		jns[8] = 941207826
		jns[12] = "6回合"
	elseif jn == "额外能力" then
		jns[1] = "学习“渡劫金身”以后，每个额外能力的乾元丹会增加30点治疗能力，学习“诸天看护”以后，每个额外的乾元丹会增加80点法防。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2718548930.0
		jns[8] = 2718548930.0
	elseif jn == "诸天看护" then
		jns[1] = [[
给目标附加一个状态
该状态使目标将受到的
所有伤害减少50%
并为目标附加反震状态
持续5回合。]]
		jns[3] = 3
		jns[4] = "5点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3976671753.0
		jns[8] = 3976671753.0
		jns[12] = "10回合"
	elseif jn == "目空" then
		jns[1] = "大唐官府，使用特技翩鸿一击、后发制人时无视对手10%的防御"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1928159649
		jns[8] = 1928159649
	elseif jn == "风刃" then
		jns[1] = "大唐官府，普通攻击时可以对其他任意三个单位造成等级*3的伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4185550995.0
		jns[8] = 4185550995.0
	elseif jn == "扶阵" then
		jns[1] = "大唐官府，使队伍每个人的阵法加成效果在原数值提升3%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3574799983.0
		jns[8] = 3574799983.0
	elseif jn == "翩鸿一击" then
		jns[1] = "兵贵神速，对敌人造成大量伤害\n并且提高下回合15%的速度"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 819986900
		jns[8] = 819986900
		jns[12] = "6回合"
	elseif jn == "勇武" then
		jns[1] = "后发制人将获得以下额外效果：额外增加防御值40%的伤害结果；使用时不消耗气血，转而使自己增加气血上限*15%的气血(最高为人物等级*8)；使用时增加自身10点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 643318438
		jns[8] = 643318438
	elseif jn == "长驱直入" then
		jns[1] = [[
#S浴血豪侠#:
电光火石之间令对手甚至
来不及做出反应
造成#Y120%伤害并#有60%几率
造成#G双倍伤害
无法被保护
并且让对手#G重创
#Y治疗效果降低70%
持续3回合]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2876155828.0
		jns[8] = 2876155828.0
		jns[12] = "4回合"
	elseif jn == "杀意" then
		jns[1] = "#S浴血豪侠#:\n触发物理必杀时\n必杀伤害增加50%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3147181502.0
		jns[8] = 3147181502.0
	elseif jn == "念心" then
		jns[1] = "#S浴血豪侠#:\n额外增加20%必杀率"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2875517135.0
		jns[8] = 2875517135.0
	elseif jn == "静岳" then
		jns[1] = "处于后发制人或者横扫千军，破釜沉舟的休息状态时，所受伤害减少150点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3009627550.0
		jns[8] = 3009627550.0
	elseif jn == "干将" then
		jns[1] = "使用破釜沉舟技能时有20%的几率额外增加一个伤害目标。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 29850044
		jns[8] = 29850044
	elseif jn == "勇念" then
		jns[1] = "使用横扫千军时，忽略目标10%防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 787717356
		jns[8] = 787717356
	elseif jn == "神凝" then
		jns[1] = "自身提高10%抗封印率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2520827568.0
		jns[8] = 2520827568.0
	elseif jn == "狂狷" then
		jns[1] = "将自身(力量属性/耐力属性)*16转化为伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2946907040.0
		jns[8] = 2946907040.0
	elseif jn == "不惊" then
		jns[1] = "额外忽视目标自身武器宝石锻造等级*5的防御。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2406224851.0
		jns[8] = 2406224851.0
	elseif jn == "突进" then
		jns[1] = "每回合开始时有45%的几率触发，提升自身防御值8%的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2822355920.0
		jns[8] = 2822355920.0
	elseif jn == "破空" then
		jns[1] = "使用破釜沉舟时，对目标造成目标防御*0.3的额外伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 136424903
		jns[8] = 136424903
	elseif jn == "历战" then
		jns[1] = "带有“安神决”时，受到的法伤降低50%。安神诀有70%几率抵抗驱散效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1133198289
		jns[8] = 1133198289
	elseif jn == "连破" then
		jns[1] = "横扫千军有18%几率不进入休息状态。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2385612871.0
		jns[8] = 2385612871.0
	elseif jn == "无敌" then
		jns[1] = "横扫千军变为4次攻击，气血消耗额外增加10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1178654556
		jns[8] = 1178654556
	elseif jn == "破军" then
		jns[1] = "使用横扫千军时每次攻击时额外增加受击目标气血最大上限的1%*攻击次序+200的伤害结果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3693352744.0
		jns[8] = 3693352744.0
	elseif jn == "判官" then
		jns[1] = "判官令造成的伤害增加10%、魔法损耗增加50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3298968727.0
		jns[8] = 3298968727.0
	elseif jn == "回旋" then
		jns[1] = "受到包括固定伤害在内的所有法伤减少60点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 698139490
		jns[8] = 698139490
	elseif jn == "夜行" then
		jns[1] = "夜间增加人物40点速度、40点伤害、50点阎罗令伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1823786481
		jns[8] = 1823786481
	elseif jn == "入骨" then
		jns[1] = "尸腐毒被解除时，使目标减少5%当前气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3117443073.0
		jns[8] = 3117443073.0
	elseif jn == "聚魂" then
		jns[1] = "摄魂的所有基础效果增加4%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 251056386
		jns[8] = 251056386
	elseif jn == "六道无量" then
		jns[1] = [[
#S勾魂阎罗#:
地府弟子将六道轮回之力
附着在单体的物理攻击之上
令敌人避无可避
#Z该技能被动加成
#Y六道无量#和#Y百爪狂杀#的
#G15%无视防御效果]]
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3157120366.0
		jns[8] = 3157120366.0
	elseif jn == "索魂" then
		jns[1] = "锢魂术命中目标后，如果目标在此锢魂术状态下死亡，都可以增加施法者锢魂术2%的命中率，上限为10%，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4065975600.0
		jns[8] = 4065975600.0
	elseif jn == "伤魂" then
		jns[1] = "你对带有尸腐毒的单位提高100点封印命中等级、80点物理伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3987423439.0
		jns[8] = 3987423439.0
	elseif jn == "百炼" then
		jns[1] = "武器耐久度消耗降低50%。使用百爪狂杀时临时增加武器命中*30%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 563581579
		jns[8] = 563581579
	elseif jn == "黄泉" then
		jns[1] = "黄泉之息的减速效果增加50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 295748014
		jns[8] = 295748014
	elseif jn == "毒印" then
		jns[1] = "六道无量和判官令将额外对一个单位起效"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1238616134
		jns[8] = 1238616134
	elseif jn == "百爪狂杀" then
		jns[1] = [[
#S勾魂阎罗#:
地府弟子吸收冥界阴气
进而激发自身的暴戾之气
将对敌方进行疯狂的连击
可以#Y攻击4个目标]]
		jns[3] = 4
		jns[4] = "35点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2412643774.0
		jns[8] = 2412643774.0
	elseif jn == "幽光" then
		jns[1] = "九幽的每回合回复当前气血值的上限增加120点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 863397107
		jns[8] = 863397107
	elseif jn == "泉爆" then
		jns[1] = "每场战斗的第一次黄泉之息将造成400%的伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 346780433
		jns[8] = 346780433
	elseif jn == "鬼火" then
		jns[1] = "每次使用特技后回复10点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2477670008.0
		jns[8] = 2477670008.0
	elseif jn == "魂飞" then
		jns[1] = "你的魂飞魄散首目标若为玩家且当回合死亡，则附加锢魂术，持续2回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3289766738.0
		jns[8] = 3289766738.0
	elseif jn == "汲魂" then
		jns[1] = "每次对方玩家单位死亡，恢复自身等级*2的气血并且增加10点伤害力，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2156789957.0
		jns[8] = 2156789957.0
	elseif jn == "击破" then
		jns[1] = "攻击防御的目标额外增加50%伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3080504140.0
		jns[8] = 3080504140.0
	elseif jn == "魑魅缠身" then
		jns[1] = [[
#S勾魂阎罗#:
地府弟子可以招来地狱深处的魑魅魍魉
被附身的敌人将具备鬼魂精魄特质
在擅于驱鬼的对手面前无所遁形
让#Y目标受到所有#的#G伤害提高80%
#Z持续3回合]]
		jns[4] = "消耗40点愤怒"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 725080355
		jns[8] = 725080355
		jns[12] = "冷却8回合"
	elseif jn == "夜之王者" then
		jns[1] = "黑夜是属于我的！技能“百爪狂杀”附加六道轮回技能等级*60%的伤害结果。夜晚的必杀几率增加10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1368582886
		jns[8] = 1368582886
	elseif jn == "鼓乐" then
		jns[1] = "魔音摄魂的命中率增加20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3246029398.0
		jns[8] = 3246029398.0
	elseif jn == "妖气" then
		jns[1] = "增加武器伤害*12%的封印命中等级。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3012912277.0
		jns[8] = 3012912277.0
	elseif jn == "怜心" then
		jns[1] = "姐妹同心的命中率增加12%。队伍中只有一个盘丝洞弟子时：每场战斗的第一次姐妹同心必中。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 953711595
		jns[8] = 953711595
	elseif jn == "迷瘴" then
		jns[1] = "使用含情脉脉命中目标后，吸取目标5项属性中最高项所对应的主能力4%给自己，持续5回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1712943329
		jns[8] = 1712943329
	elseif jn == "粘附" then
		jns[1] = "增加武器伤害*18%的天罗地网伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3524791333.0
		jns[8] = 3524791333.0
	elseif jn == "意乱" then
		jns[1] = "使用魔音摄魂命中目标时，目标不能回复魔法值。(当与其他封印效果叠加时，回魔效果变为40%。)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 194370157
		jns[8] = 194370157
	elseif jn == "绝殇" then
		jns[1] = "被自己封印的目标在解除封印时获得的气血回复降低100%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1924434656
		jns[8] = 1924434656
	elseif jn == "安抚" then
		jns[1] = "战斗中使用药品的效果增加15%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1970071331
		jns[8] = 1970071331
	elseif jn == "忘忧" then
		jns[1] = "封印住目标后，每回合开始时目标损失60点魔法值，直到封印解除。若因此效果导致魔法值为0，则额外受到目标等级*3的气血伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1508737039
		jns[8] = 1508737039
	elseif jn == "忘川" then
		jns[1] = "当目标力量点大于等级*4或者魔力点大于等级*4时，含情脉脉额外增加8%的命中几率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3131682608.0
		jns[8] = 3131682608.0
	elseif jn == "迷梦" then
		jns[1] = "幻镜术可以将法术反弹两次给敌方任意目标，并且减少2个冷却回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3608399832.0
		jns[8] = 3608399832.0
	elseif jn == "倾情" then
		jns[1] = "使用姐妹同心成功后，如果目标的魔法值为0，则有45%的几率额外施放一次含情脉脉技能。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4069297938.0
		jns[8] = 4069297938.0
	elseif jn == "情劫" then
		jns[1] = "瘴气持续回合数增加3。同时带有瘴气的目标在解除瘴气时获得的气血恢复受瘴气影响。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2493191732.0
		jns[8] = 2493191732.0
	elseif jn == "脱壳" then
		jns[1] = "自身所受到敌方任意持续回合≥5的负面持续性法术时，持续回合变为5回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFF0081A3
		jns[8] = 0xFF0081A3
	elseif jn == "迷意" then
		jns[1] = "带有瘴气的目标受到的回魔效果降低30%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 443351614
		jns[8] = 443351614
	elseif jn == "结阵" then
		jns[1] = "你的盘丝阵效果增加200%，但持续回合数减少3。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2477670008.0
		jns[8] = 2477670008.0
	elseif jn == "媚态" then
		jns[1] = "你的勾魂、摄魄必定命中；你使用瘴气时，清除目标身上的寡欲令。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 648285294
		jns[8] = 648285294
	elseif jn == "利刃" then
		jns[1] = "对敌方所有目标造成减益效果\n每回合减少30点魔法\n持续到战斗结束"
		jns[3] = 4
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2189608913.0
		jns[8] = 2189608913.0
	elseif jn == "落花成泥" then
		jns[1] = [[
#S百媚魔姝#:
靡靡之音进入敌人耳际
#Y必定#让目标#G无法任何行动
#Z持续2回合]]
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 1301591667
		jns[8] = 1301591667
	elseif jn == "偷龙转凤" then
		jns[1] = [[
这是集天地玄妙的大成之技
修习此技
不仅要有绝代风华的女儿身
更要有一颗玲珑剔透的七窍心
施法后减少敌方当前血量和魔法的10%
从而恢复自身血量和魔法数值为:
敌方目标的血量上限和魔法上限的100%]]
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3284086247.0
		jns[8] = 3284086247.0
		jns[12] = "冷却8回合"
	elseif jn == "金莲" then
		jns[1] = "地涌金莲额外作用一个目标。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 860292467
		jns[8] = 860292467
	elseif jn == "追魂" then
		jns[1] = "敏捷点数≥人物等级*2.2时，对目标使用的夺命咒伤害结果增加“枯骨心法”等级100%。你的夺魄令会封印目标的物理攻击。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1128641892
		jns[8] = 1128641892
	elseif jn == "回敬" then
		jns[1] = "当前气血≤气血上限*50%时，封印命中率增加15%*(1-当前HP/最大HP)。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2385293818.0
		jns[8] = 2385293818.0
	elseif jn == "由己渡人" then
		jns[1] = [[
#S妙谛金莲#:
复活一名队友
复活的#G血气等于等级*18
复活后临时增加#Y目标的法防和防御
数值等于#Z法防防御+等级*2.5]]
		jns[3] = 3
		jns[6] = "物品图标.wdf"
		jns[7] = 3730346570.0
		jns[8] = 3730346570.0
	elseif jn == "自愈" then
		jns[1] = "地涌金莲的恢复自身的气血量增加50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1331166982
		jns[8] = 1331166982
	elseif jn == "陷阱" then
		jns[1] = "夺魄令被解除时，自身回复自身等级*1点气血。当前气血≤气血上限*50%时，该效果额外增加200%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1048293849
		jns[8] = 1048293849
	elseif jn == "化莲" then
		jns[1] = "地涌金莲增加武器伤害*30%点治疗能力"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1090221639
		jns[8] = 1090221639
	elseif jn == "风墙" then
		jns[1] = "受到攻击时，额外抵挡人物等级*16的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2740099511.0
		jns[8] = 2740099511.0
	elseif jn == "御兽" then
		jns[1] = "自身携带的召唤兽(及孩子)进入战斗时，如果速度≥召唤兽等级*3，则增加召唤兽等级*1.6的速度。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1232258449
		jns[8] = 1232258449
	elseif jn == "精进" then
		jns[1] = "明光宝烛、金身舍利效果增加200%\n但持续回合数减半"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 986241986
		jns[8] = 986241986
	elseif jn == "救人" then
		jns[1] = "煞气决对队友使用必定命中，且会额外回复地冥妙法等级*5的气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD01D3AD
		jns[8] = 0xFD01D3AD
	elseif jn == "灵身" then
		jns[1] = "当前气血≤气血上限*50%时，自身获得的金身舍利和明光宝烛持续回合数增加4、效果增加200%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2422352128.0
		jns[8] = 2422352128.0
	elseif jn == "持戒" then
		jns[1] = [[
使用惊魂掌成功命中目标后
会额外大幅降低目标的法防和防御
自身法防和防御越高
下降幅度越大]]
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2067450451
		jns[8] = 2067450451
	elseif jn == "内伤" then
		jns[1] = "夺命咒攻击目标时\n对目标额外造成50+技能等级*150%的伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1895674260
		jns[8] = 1895674260
	elseif jn == "反先" then
		jns[1] = "摧心术的目标额外减少阴风绝章*40%点速度，同时减少8%封印命中率、物理暴击率、法术暴击率。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFB48D5CC
		jns[8] = 0xFB48D5CC
	elseif jn == "忍辱" then
		jns[1] = "每当你被对方封印时，无论是否成功，都有100%概率获得6点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2972012404.0
		jns[8] = 2972012404.0
	elseif jn == "暗潮" then
		jns[1] = "愤怒在90以下时，每回合结束获得4点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 648285294
		jns[8] = 648285294
	elseif jn == "噬魂" then
		jns[1] = "你的“移魂化骨”吸取生命值的40%会转化为你的生命值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 389027246
		jns[8] = 389027246
	elseif jn == "同舟共济" then
		jns[1] = [[
#S妙谛金莲#:
使自己和随机友方单位
获得保护受到#Y所有伤害降低50%
#G持续3回合
期间你的#Y地涌金莲#治疗效果翻倍
并且让你的
#Z夺命咒有50%几率秒10]]
		jns[3] = 3
		jns[4] = "1000点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1463178294
		jns[8] = 1463178294
		jns[12] = "8回合"
	elseif jn == "妖风四起" then
		jns[1] = [[
#S妙谛金莲#:
驱动妖风封印敌人
使其#Y无法行动
#G命中率为50%
可#Z封印4个目标
#Z持续3回合]]
		jns[3] = 4
		jns[4] = "1000点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2190861152.0
		jns[8] = 2190861152.0
		jns[12] = "冷却6回合"
	elseif jn == "充沛" then
		jns[1] = "战斗内临时提高10%的气血和气血上限"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2315731100.0
		jns[8] = 2315731100.0
	elseif jn == "炙烤" then
		jns[1] = "你的牛劲附加感知效果,且效果提升3%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3131458903.0
		jns[8] = 3131458903.0
	elseif jn == "震怒" then
		jns[1] = "飞砂走石在对目标使用时有10%的几率会额外作用一个单位。。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1077928207
		jns[8] = 1077928207
	elseif jn == "蚀天" then
		jns[1] = "受到大于等于气血上限20%的伤害则进入激怒状态，法伤增加150点，持续3回合。效果不能叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2887229908.0
		jns[8] = 2887229908.0
	elseif jn == "敛恨" then
		jns[1] = "受到物理暴击、法术暴击伤害后，本次所受与后面所受到的所有伤害减少20%。当回合有效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1865842416
		jns[8] = 1865842416
	elseif jn == "赤暖" then
		jns[1] = "使用三味真火将恢复气血，恢复效果为本次造成伤害#W//50。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 918464086
		jns[8] = 918464086
	elseif jn == "火神" then
		jns[1] = "飞砂走石造成的伤害将额外增加火云术等级*1.5的伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3208959336.0
		jns[8] = 3208959336.0
	elseif jn == "震天" then
		jns[1] = "震天诀等级≥人物等级时，增加60点法伤力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 112595037
		jns[8] = 112595037
	elseif jn == "神焰" then
		jns[1] = "飞砂走石造成的伤害将受自身气血影响，气血越低，附加伤害将越高"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2642734179.0
		jns[8] = 2642734179.0
	elseif jn == "神炎" then
		jns[1] = "三味真火造成的伤害将受自身气血影响，气血越低，附加的伤害将越高"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3208959336.0
		jns[8] = 3208959336.0
	elseif jn == "返火" then
		jns[1] = "火甲术反馈的伤害效果增加70%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 20800341
		jns[8] = 20800341
	elseif jn == "坚甲" then
		jns[1] = "物理防御提升百分之十。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1228268859
		jns[8] = 1228268859
	elseif jn == "魔冥" then
		jns[1] = "每次使用完飞沙走石或三味真火后，可以恢复自身魔法上限*5%的魔法量。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2348220816.0
		jns[8] = 2348220816.0
	elseif jn == "燃魂" then
		jns[1] = "#W/增加50点灵力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2036346807
		jns[8] = 2036346807
	elseif jn == "狂月" then
		jns[1] = "战斗内额增加10%的魔法值"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 178143576
		jns[8] = 178143576
	elseif jn == "威吓" then
		jns[1] = "自身处于牛劲状态时，对目标的伤害增加12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 941023996
		jns[8] = 941023996
	elseif jn == "连营" then
		jns[1] = "牛劲技能持续回合数加一。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2431558133.0
		jns[8] = 2431558133.0
	elseif jn == "魔心" then
		jns[1] = "使用三昧真火或飞砂走石时10概率使伤害翻倍"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3667982292.0
		jns[8] = 3667982292.0
	elseif jn == "魔焰滔天" then
		jns[1] = [[
#S平天大圣:
魔王寨的弟子是不怕赌上自己运气的
攻击有#G70%几率#造成#Y三昧真火#的#P100%伤害
#G30%几率造成#Y三昧真火#的#P200%伤害
被动#Z永久增加20%法术暴击]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1381735856
		jns[8] = 1381735856
		jns[12] = "5回合"
	elseif jn == "烈焰真诀" then
		jns[1] = [[
#S平天大圣:
烈焰缠身此时他们不再是
普通的魔王寨弟子
他们具有更强大的#Y法术暴击能力
使用后增加#G100%的魔法暴击
持续4回合
被动#Z永久增加10%法术暴击]]
		jns[3] = 66
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 312059257
		jns[8] = 312059257
		jns[12] = "8回合"
	elseif jn == "爪印" then
		jns[1] = "每次攻击敌人或被敌人攻击后，在敌人身上留下爪印，每个印记使得自己在下次攻击对手时增加人物等级*0.5伤害结果。印记只有在每回合的第一次攻击中有效，印记持续5回合或至对手死亡后消失，印记可叠加，最多叠加10个。持续回合效果可被刷新。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1848955562
		jns[8] = 1848955562
	elseif jn == "翼展" then
		jns[1] = "你的鹰击攻击伤害增加生死薄技能等级*1.2"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 900294417
		jns[8] = 900294417
	elseif jn == "驭兽" then
		jns[1] = "提升全队伍所有在场召唤兽的能力：你的训兽诀等级*0.4的伤害，你的训兽诀等级*0.4的防御，你的训兽诀等级*0.2的灵力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2549029860.0
		jns[8] = 2549029860.0
	elseif jn == "化血" then
		jns[1] = "在攻击中有30%几率吸收造成伤害的16%的气血。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3190075468.0
		jns[8] = 3190075468.0
	elseif jn == "宁息" then
		jns[1] = "变身的持续回合数加2，且效果提升3%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4038271160.0
		jns[8] = 4038271160.0
	elseif jn == "兽王" then
		jns[1] = "使用完变身技能后，所有攻击类技能对目标造成变身技能等级*2的额外伤害(无变身状态无效)。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 679084424
		jns[8] = 679084424
	elseif jn == "狮吼" then
		jns[1] = "狮搏伤害提高15%；狮搏击倒目标时，额外触发一次狮搏。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3507352031.0
		jns[8] = 3507352031.0
	elseif jn == "怒象" then
		jns[1] = "当气血少于上限的30%时，有70%的几率在使用象形时保留变身状态并延长变身1回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2094954669
		jns[8] = 2094954669
	elseif jn == "鹰啸" then
		jns[1] = "鹰击可以使目标造成的伤害降低15%，持续2回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 494868337
		jns[8] = 494868337
	elseif jn == "乱破" then
		jns[1] = "使用连环击时，每次击打有45%几率附加狂兽决技能等级×100%的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1832332393
		jns[8] = 1832332393
	elseif jn == "魔息" then
		jns[1] = "魔息术效果提升50%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3360184266.0
		jns[8] = 3360184266.0
	elseif jn == "威震" then
		jns[1] = "你对目标使用的狮搏有10%几率\n附带持续2回合的\n“威慑”效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2635775390.0
		jns[8] = 2635775390.0
	elseif jn == "狂袭" then
		jns[1] = "攻击时减少被反震的概率20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1364520294
		jns[8] = 1364520294
	elseif jn == "失心" then
		jns[1] = "使用狮搏或鹰击有15%的几率让目标1回合无法行动。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1137637222
		jns[8] = 1137637222
	elseif jn == "羁绊" then
		jns[1] = "你召唤兽的伤害将提高10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1545015186
		jns[8] = 1545015186
	elseif jn == "死地" then
		jns[1] = "死亡时将提升你下一次鹰击(100+损失愤怒*3)的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 339372930
		jns[8] = 339372930
	elseif jn == "乱击" then
		jns[1] = "你的连环击额外增加一次特殊的攻击。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 686808232
		jns[8] = 686808232
	elseif jn == "悲恸" then
		jns[1] = "当你血量小于10%时\n你召唤兽的伤害将提高100%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 487555174
		jns[8] = 487555174
	elseif jn == "背水" then
		jns[1] = [[
虽千万人吾亦往矣不胜则死
牺牲自身50%的当前气血
对目标造成巨额伤害
有1%的几率直接秒杀对手
使用后休息一回合]]
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 186064635
		jns[8] = 186064635
		jns[12] = "8回合"
	elseif jn == "肝胆" then
		jns[1] = [[
在场所有单位,召唤兽
伤害提高10%
防御提高10%
灵力提高10%]]
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 73402182
		jns[8] = 73402182
	elseif jn == "威赫" then
		jns[1] = "五雷轰顶成功时造成的伤害比例在基础上增加8%并且目标本回合内不再增加愤怒值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1313787260
		jns[8] = 1313787260
	elseif jn == "疾雷" then
		jns[1] = "使用天雷斩攻击NPC时，额外增加0.6*(敏捷点数-人物等级)的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1731349859
		jns[8] = 1731349859
	elseif jn == "轰鸣" then
		jns[1] = "使用五雷轰顶技能成功时使目标减少240点物理防御，效果持续3回合，效果不能叠加，不能刷新。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 299610468
		jns[8] = 299610468
	elseif jn == "趁虚" then
		jns[1] = "每次使用特技之后，在接下来两个回合的封印成功率提高8%，效果不可叠加，可以被刷新。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1424560347
		jns[8] = 1424560347
	elseif jn == "余韵" then
		jns[1] = "魔兽之印，河东狮吼，圣灵之甲\n碎甲术，停陷术，啸风诀\n的效果增加50%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2148130737.0
		jns[8] = 2148130737.0
	elseif jn == "驭意" then
		jns[1] = "增加自身魔力属性点5%的速度；自身封印命中率降低5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 750413248
		jns[8] = 750413248
	elseif jn == "震慑" then
		jns[1] = "使用错乱成功封印对手后，使目标同时附有掌心雷的封印效果；自身法伤力降低10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3318455227.0
		jns[8] = 3318455227.0
	elseif jn == "神念" then
		jns[1] = "使用法宝时，额外获得10点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2812074128.0
		jns[8] = 2812074128.0
	elseif jn == "伏魔" then
		jns[1] = "附魔天书的效果增加50%；自身封印命中率降低5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2102720861
		jns[8] = 2102720861
	elseif jn == "苏醒" then
		jns[1] = "在一回合内掉血量达到自身气血上限的40%，回合结束时自动移除自身封印类异常状态，人物死亡时则失效。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3371137798.0
		jns[8] = 3371137798.0
	elseif jn == "护佑" then
		jns[1] = "增加50点防御力及法术防御力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFEAD9161
		jns[8] = 0xFEAD9161
	elseif jn == "电芒" then
		jns[1] = "被雷霆万钧击中的目标，身上将缠绕着电流。带有此电流的目标再次受到雷霆万钧打击时额外承受5%的伤害，持续3回合，不可叠加，可以被刷新。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2073497449
		jns[8] = 2073497449
	elseif jn == "月桂" then
		jns[1] = "增加武器伤害*12%的封印命中等级，但不再增加法伤力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1909554922
		jns[8] = 1909554922
	elseif jn == "怒气" then
		jns[1] = "当因气血损失而增加＞10的愤怒时，可以额外增加5点愤怒"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1488447947
		jns[8] = 1488447947
	elseif jn == "灵光" then
		jns[1] = "装备上的宝石舍利子效果增加25%；自身封印命中率降低5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2507272354.0
		jns[8] = 2507272354.0
	elseif jn == "神律" then
		jns[1] = "天神护体法防效果增加100%，额外增加云霄步等级*0.3的速度，但不再增加法伤。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3930504561.0
		jns[8] = 3930504561.0
	elseif jn == "洞察" then
		jns[1] = "你的知己知彼额外提高自身等级*2的伤害、防御、法伤、法防、封印等级、抗封等级，持续3回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2254481353.0
		jns[8] = 2254481353.0
	elseif jn == "雷波" then
		jns[1] = "雷霆万钧对首目标造成的伤害提高8%，“电芒”产生的电流增加1持续回合数。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2808102089.0
		jns[8] = 2808102089.0
	elseif jn == "画地为牢" then
		jns[1] = [[
#S踏雷天尊#:
天宫弟子随手布下的囚牢
却是无数穷凶极恶之徒的饮恨之所
#Z该经脉被动加成:
使得#Y天雷斩#额外#G多秒2个目标
#Z该经脉主动释放:
降低目标100%的#Y封印命中#几率
#G持续回合为5回合]]
		jns[3] = 4
		jns[4] = "60点愤怒"
		jns[6] = "物品图标.wdf"
		jns[7] = 3136762362.0
		jns[8] = 3136762362.0
	elseif jn == "风雷韵动" then
		jns[1] = [[
#S踏雷天尊#:
以风为弦、以雷为钟
其鸣如黄钟大吕般的攻击
不仅能击溃对方的躯体
也能摧毁抵抗的意志
#Y降低目标100点愤怒
该技能#G受到武器伤害影响
#Z数值=法伤伤害+自身武器伤害*3.5]]
		jns[3] = 4
		jns[4] = "500点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 378540233
		jns[8] = 378540233
	elseif jn == "化戈" then
		jns[1] = "增加武器伤害*25%的治疗量。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2414131711.0
		jns[8] = 2414131711.0
	elseif jn == "推衍" then
		jns[1] = "自身敏捷≥等级*2.2时，五行法术对目标伤害增加21%，。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2104567427
		jns[8] = 2104567427
	elseif jn == "借灵" then
		jns[1] = "武器伤害的24%转化为五行法伤。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2618104923.0
		jns[8] = 2618104923.0
	elseif jn == "莲花心音" then
		jns[1] = [[
普陀弟子以莲花苞为躯
引魂入体
则可以复活在战斗中死亡且
拥有鬼魂术的召唤兽
被复活目标获得60%的气血上限]]
		jns[3] = 3
		jns[4] = "60点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 132038479
		jns[8] = 132038479
	elseif jn == "生克" then
		jns[1] = "队伍内成员的五行克制能力增加4%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 474303889
		jns[8] = 474303889
	elseif jn == "默诵" then
		jns[1] = "紧箍咒造成的伤害增加100%，同时如果目标处于紧箍咒时每回合结束时增加自身6点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1790122231
		jns[8] = 1790122231
	elseif jn == "劳心" then
		jns[1] = "当前气血≤气血上限*30%时，使用普渡众生或者杨柳甘露技能带来的气血恢复效果额外增加100%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 12060238
		jns[8] = 12060238
	elseif jn == "普渡" then
		jns[1] = "普渡众生的气血恢复效果增加12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2433809284.0
		jns[8] = 2433809284.0
	elseif jn == "化怨" then
		jns[1] = "当前气血≤气血上限*30%时，受到的所有伤害减少25%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3150508706.0
		jns[8] = 3150508706.0
	elseif jn == "甘露" then
		jns[1] = "对目标使用杨柳甘露法术成功时，有50%的几率附带普渡众生效果4回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2943344279.0
		jns[8] = 2943344279.0
	elseif jn == "法印" then
		jns[1] = "颠倒五行法术吸收几率与上限增加10%、躲避率增加8%，持续回合数增加3。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1259625251
		jns[8] = 1259625251
	elseif jn == "秘术" then
		jns[1] = "使用五行法术时，将波动150点伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4043942732.0
		jns[8] = 4043942732.0
	elseif jn == "灵动" then
		jns[1] = "灵动九天效果增加30点，持续回合数增加3。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1305304900
		jns[8] = 1305304900
	elseif jn == "雨润" then
		jns[1] = "当队伍中成员的普渡众生效果消失时，目标会额外恢复灵性等级*0.7的气血"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1116781755
		jns[8] = 1116781755
	elseif jn == "莲心剑意" then
		jns[1] = [[
#S五行咒师#:
普陀山的弟子情系众生、虔心不染
如一朵莲花绽放在凡尘中
但江湖险恶、妖风魔雨
为了护佑苍生
她们不得不常怀剑意惩恶除奸
使用此技能后#Z进入进攻状态
增加#Y30%的固定伤害
但降低自身#G50%被治疗的效果]]
		jns[3] = 66
		jns[4] = "30点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3268852691.0
		jns[8] = 3268852691.0
	elseif jn == "玉帛" then
		jns[1] = "护法金刚技能所为人物增加伤害的8%转化为普渡众生气血恢复效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2842589814.0
		jns[8] = 2842589814.0
	elseif jn == "道衍" then
		jns[1] = "普渡众生的作用对象额外增加2个。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3457740833.0
		jns[8] = 3457740833.0
	elseif jn == "法咒" then
		jns[1] = "五行法术有20%的几率使伤害增加50%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 708413304
		jns[8] = 708413304
	elseif jn == "波澜不惊" then
		jns[1] = [[
#S五行咒师#:
普陀山弟子由于精通五行造化
方可布下这吸收一切伤害的结界阵法
让#Y友方受到的所有伤害
转化成#G治疗量
持续3回合
#Z被动加成:
增加自身#Y20%的法术连击效果]]
		jns[4] = "60点魔法"
		jns[3] = 3
		jns[6] = "物品图标.wdf"
		jns[7] = 2932930865.0
		jns[8] = 2932930865.0
		jns[12] = "冷却10回合"
	elseif jn == "五行制化" then
		jns[1] = [[
#S五行咒师#:
随机使用#Y五行法术#中的任意一个
可#G攻击10个目标
#Z且伤害增加10%]]
		jns[3] = 4
		jns[4] = "70点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 4100894877.0
		jns[8] = 4100894877.0
		jns[12] = "冷却8回合"
	elseif jn == "山破" then
		jns[1] = "使用天崩地裂后，自身恢复气血上限5%的血量。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1731736516
		jns[8] = 1731736516
	elseif jn == "战诀" then
		jns[1] = "使用碎星诀和镇魂诀时，额外提高10%的必杀率，不可叠加，持续到战斗结束。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3111802231.0
		jns[8] = 3111802231.0
	elseif jn == "抗击" then
		jns[1] = "不动如山增加100%反击效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 939308164
		jns[8] = 939308164
	elseif jn == "暴气" then
		jns[1] = "使用天崩地裂和翻江搅海\n有20%几率使自己获得\n不动如山效果"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1611258118
		jns[8] = 1611258118
	elseif jn == "神诀" then
		jns[1] = "使用天崩地裂与翻江倒海的技能时，刷新自身碎星诀或镇魂诀状态的回合数到初始值，并增加25%的效果，最多增加100%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2098007467
		jns[8] = 2098007467
	elseif jn == "魂聚" then
		jns[1] = "每次使用攻击类技能，增加6点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3082616851.0
		jns[8] = 3082616851.0
	elseif jn == "神躯" then
		jns[1] = "受到大于等于气血上限20%的伤害时，超过20%的部分会降低30%。。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3478836873.0
		jns[8] = 3478836873.0
	elseif jn == "斩魔" then
		jns[1] = "碎星诀和镇魂诀效果提升12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3801155078.0
		jns[8] = 3801155078.0
	elseif jn == "不动" then
		jns[1] = "若在不动如山的状态下死亡，会额外保留80点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2540241436.0
		jns[8] = 2540241436.0
	elseif jn == "力战" then
		jns[1] = "天崩地裂最后一击额外造成360点伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 235956364
		jns[8] = 235956364
	elseif jn == "破击" then
		jns[1] = "裂石，断岳势，天崩地裂出现必杀的几率翻倍，但产生必杀时只会造成1.6倍的伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1845562641
		jns[8] = 1845562641
	elseif jn == "怒涛" then
		jns[1] = "浪涌，惊涛怒，翻江搅海的每一次攻击有70%几率降低目标人物自身等级/2的防御，持续2回合。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3916509214.0
		jns[8] = 3916509214.0
	elseif jn == "海沸" then
		jns[1] = "增加人物力量*8%的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3169041209.0
		jns[8] = 3169041209.0
	elseif jn == "怒火释放" then
		jns[1] = "自身伤害提升15%\n防御降低10%"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3740063528.0
		jns[8] = 3740063528.0
	elseif jn == "煞气" then
		jns[1] = "使用攻击类技能时附加100点伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 864759872
		jns[8] = 864759872
	elseif jn == "强袭" then
		jns[1] = "每次使用不动如山后，都会使攻击类技能伤害提升12%，持续3回合。状态不可刷新，不叠加。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3333256837.0
		jns[8] = 3333256837.0
	elseif jn == "雷附" then
		jns[1] = "提升腾雷的命中率10%，被腾雷附上致死状态的单位若在2回合内死亡，有50%的概率回复人物气血上限5%的血量。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2134428028
		jns[8] = 2134428028
	elseif jn == "再战" then
		jns[1] = "每次使用断岳势造成一个单位的死亡都会使下回合的断岳势伤害结果提高10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1617324489
		jns[8] = 1617324489
	elseif jn == "天神怒斩" then
		jns[1] = "天神盛怒，以开天辟地之势，挥刀怒斩，天崩地裂的攻击次数变为4次，但气血消耗将加倍。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2830056896.0
		jns[8] = 2830056896.0
	elseif jn == "真君显灵" then
		jns[1] = [[
敲动战鼓，一鼓作气拿下敌人
进入“真君显灵”状态
持续3回合
提升自身#Y100%伤害
降低自身#Y50%防御
被动激活#Y翻江搅海#G目标数+2
并且#Z有10%几率可以秒10]]
		jns[3] = 66
		jns[4] = "100魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 1075265615
		jns[8] = 1075265615
		jns[12] = "6回合"
	elseif jn == "体恤" then
		jns[1] = "当生命之泉的作用目标气血≤30%时，生命之泉恢复效果增加150点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4053544243.0
		jns[8] = 4053544243.0
	elseif jn == "锤炼" then
		jns[1] = "武器耐久损失速度降低40%，增加3%武器伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 404172087
		jns[8] = 404172087
	elseif jn == "神附" then
		jns[1] = "增加人物力量*8%的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1140221833
		jns[8] = 1140221833
	elseif jn == "心浪" then
		jns[1] = "回合结束时，若你愤怒少于50点，随机增加1~15点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 676315116
		jns[8] = 676315116
	elseif jn == "养生" then
		jns[1] = "当你气血降低到50%以下，且没有生命之泉时，获得生命之泉效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3475875951.0
		jns[8] = 3475875951.0
	elseif jn == "强击" then
		jns[1] = "攻击时忽视召唤兽10%的防御值；自身封印命中率降低5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2827732076.0
		jns[8] = 2827732076.0
	elseif jn == "归本" then
		jns[1] = "日月乾坤命中时，60%取消对方主动法宝增加的持续效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1936446202
		jns[8] = 1936446202
	elseif jn == "修心" then
		jns[1] = "使用除“慈航普度”以外的特技时，若愤怒不足将使用(所需愤怒*20)点魔法代替。每场战斗限一次。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 353633762
		jns[8] = 353633762
	elseif jn == "混元" then
		jns[1] = "当你气血≥70%时，临时提升5%的伤害力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 56847053
		jns[8] = 56847053
	elseif jn == "修身" then
		jns[1] = "力量、体质、魔力、耐力、敏捷均增加14点。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1203544843
		jns[8] = 1203544843
	elseif jn == "同辉" then
		jns[1] = "天地同寿状态下的目标防御值降低变为35%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3211480204.0
		jns[8] = 3211480204.0
	elseif jn == "雨杀" then
		jns[1] = "使用烟雨剑法需要的气血要求降低5%。烟雨剑法第二次攻击的必杀率提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2827732076.0
		jns[8] = 3066333240.0
	elseif jn == "乾坤" then
		jns[1] = "如果你连续2回合及以上没有使用日月乾坤，则你下一次使用日月乾坤成功率提高12%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2253668264.0
		jns[8] = 2253668264.0
	elseif jn == "意境" then
		jns[1] = "本方所有目标每回合结束时回复24点魔法值、1点愤怒。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3316629472.0
		jns[8] = 3316629472.0
	elseif jn == "傲视" then
		jns[1] = "当攻击出现必杀时，下一次使用日月乾坤的成功率提高20%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3066333240.0
		jns[8] = 3066333240.0
	elseif jn == "陌宝" then
		jns[1] = "日月乾坤将附加无法使用道具的效果。自身物理伤害结果降低15%，封印命中率提升2%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2827732076.0
		jns[8] = 2827732076.0
	elseif jn == "心随意动" then
		jns[1] = "这是五庄弟子的最高心境，于此心法下施展“日月乾坤”，令人陶陶乎直入另一个世界。激活后(再次使用关闭此状态)，持续8回合后自动关闭。持续回合内：1.提升七星遁等级*1.5的封印命中等级、伤害力；2.使用日月乾坤封印成功后自己下回合不能使用日月乾坤；消耗：30点MP。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFD5AC0B0
		jns[8] = 0xFD5AC0B0
	elseif jn == "致命" then
		jns[1] = "被你攻击的目标在回合结束时，若目标的气血小于气血上限的10%则直接暴毙。(对NPC最多造成等级*10点伤害)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2353330316.0
		jns[8] = 2353330316.0
	elseif jn == "清风望月" then
		jns[1] = [[
#S乾坤力士#:
五庄观的弟子可以于
乾坤腾挪之中领悟妙法
#Y解除所有队友的封印状态#
但会使自己#G进入疯狂状态]]
		jns[3] = 66
		jns[4] = "1000点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2414442436.0
		jns[8] = 2414442436.0
		jns[12] = "4回合"
	elseif jn == "天命剑法" then
		jns[1] = [[
#S乾坤力士#:
率意而行、道法自然
在五庄弟子出手之际
他自身也道不出
这一招之中蕴含了多少剑意
或许只有冥冥之中的三清可知吧？
以无人能够预知的剑术攻击目标
对其随机发动#Y3~7次物理攻击]]
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 820654511
		jns[8] = 820654511
		jns[12] = "5回合"
	elseif jn == "波涛" then
		jns[1] = "龙腾造成的伤害将额外增加破浪诀等级*1.5的固定伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1192544787
		jns[8] = 1192544787
	elseif jn == "破浪" then
		jns[1] = "每次使用技能时有概率额外提高100点临时法伤(只用于本次出手)"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2784187578.0
		jns[8] = 2784187578.0
	elseif jn == "云霄" then
		jns[1] = "龙卷雨击造成伤害的时候，将概率额外增加100点临时伤害"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2319380720.0
		jns[8] = 2319380720.0
	elseif jn == "逐浪" then
		jns[1] = "龙卷雨击造成的伤害将额外增加破浪诀等级*0.5的固定伤害。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2299233175.0
		jns[8] = 2299233175.0
	elseif jn == "踏涛" then
		jns[1] = "破浪诀等级≥人物等级时，增加60点法伤。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1159958467
		jns[8] = 1159958467
	elseif jn == "清吟" then
		jns[1] = "龙吟技能额外将减少目标50-100点的气血值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2704647206.0
		jns[8] = 2704647206.0
	elseif jn == "天龙" then
		jns[1] = "每3次使用技能都能激发龙宫弟子的潜力，使得下一次法术攻击时临时提升150法伤力。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1307527941
		jns[8] = 1307527941
	elseif jn == "龙珠" then
		jns[1] = "每次使用二龙戏珠时，有8%的几率额外增加一个目标。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 4109580353.0
		jns[8] = 4109580353.0
	elseif jn == "龙骇" then
		jns[1] = "任何门派伤害法术造成的伤害增加40点伤害结果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3757105771.0
		jns[8] = 3757105771.0
	elseif jn == "龙慑" then
		jns[1] = "对敌人额外增加100点法术伤害结果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2851993433.0
		jns[8] = 2851993433.0
	elseif jn == "傲翔" then
		jns[1] = "神龙摆尾持续回合增加1回合，效果增加10%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2837829237.0
		jns[8] = 2837829237.0
	elseif jn == "飞龙" then
		jns[1] = "受到大于等于气血上限25%的伤害都有70%的几率触发神龙摆尾技能。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1168635161
		jns[8] = 1168635161
	elseif jn == "戏珠" then
		jns[1] = "增加二龙戏珠伤害，数值为目标(1-当前气血#W//目标气血上限)*1000。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1261413788
		jns[8] = 1261413788
	elseif jn == "回魔" then
		jns[1] = "每回合回复魔法上限与当前灵力的差值的5%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3994825274.0
		jns[8] = 3994825274.0
	elseif jn == "月魂" then
		jns[1] = "装备上的月亮石效果增加40%。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 3211480204.0
		jns[8] = 3211480204.0
	elseif jn == "汹涌" then
		jns[1] = "当目标处于法术减免状态下，忽视8%的减免效果。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 1999967416
		jns[8] = 1999967416
	elseif jn == "龙魄" then
		jns[1] = "龙卷雨击有10%几率额外作用3人。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2546297002.0
		jns[8] = 2546297002.0
	elseif jn == "摧意" then
		jns[1] = "龙腾造成的伤害≥目标气血上限*20%时，减少目标300点魔法值。"
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 333441080
		jns[8] = 333441080
	elseif jn == "亢龙归海" then
		jns[1] = [[
#S海中蛟虬#:
矫健的神龙翻腾四海的英姿
很少有人目睹
而之后更无人能够道出其中的神威
造成的#Y伤害为龙腾的150%
固定作用于#G7个目标
该技能消耗#Y大量蓝量
#Z7目标消耗1400的蓝]]
		jns[3] = 4
		jns[4] = "1700点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3456596269.0
		jns[8] = 3456596269.0
		jns[12] = "6回合"
	elseif jn == "雷浪穿云" then
		jns[1] = [[
当那天地间卷起的
白浪与电闪中的云彩揉成一片
任谁都无力承当神龙
见首不见尾的后续打击
造成的#Y伤害为龙卷雨击的150%
固定作用于#G10个目标
该技能消耗#Y大量蓝量
#Z10目标消耗2000的蓝]]
		jns[3] = 4
		jns[4] = "2000点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2011972683
		jns[8] = 2011972683
		jns[12] = "10回合"
	elseif jn == "额外能力" then
		jns[1] = ""
		jns[3] = 8
		jns[6] = "物品图标.wdf"
		jns[7] = 2718548930.0
		jns[8] = 2718548930.0
	elseif jn == "调息 " then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定气血值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 2486209387.0
		jns[8] = 1498822781
	elseif jn == "打坐" then
		jns[1] = "非战斗情况下使用，可以按技能等级恢复一定魔法值。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 3078289996.0
		jns[8] = 2698086705.0
	elseif jn == "妙手空空" then
		jns[1] = "战斗中使用的法术，可从怪物身上偷来银两或宝物。#G/(每次使用都将消耗目标等级*4点魔法)"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 3565246840.0
		jns[8] = 2221335414.0
	elseif jn == "宝石工艺" then
		jns[1] = "提高合成宝石的成功率。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 1083003095
		jns[8] = 1486446714
	elseif jn == "奇门遁甲" then
		jns[1] = "在特定场景使用道具“导标旗”做标记，用以传送。1级时可以在长寿村做标记，2级时增加傲来国，3级增加长安城，4级增加朱紫国。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 0xFDB72ACA
		jns[8] = 4024694802.0
	elseif jn == "仙灵店铺" then
		jns[1] = "平时使用，能够呼出购买界面直接购买商品。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 1200061075
		jns[8] = 4084308088.0
	elseif jn == "建筑之术" then
		jns[1] = "提高建造房屋的能力，玩家拥有较高的技能后，可以建造更高级的房屋，并获得更多的室内空间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 2670591414.0
		jns[8] = 373394834
	elseif jn == "变化之术" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 3625026692.0
		jns[8] = 3872040289.0
	elseif jn == "火眼金睛" then
		jns[1] = "学习后可以使用特殊的变身卡片变换造型，变身后可以获得相应的附加效果，而且不会被他人PK。技能等级提高后可以使用更为高级的卡片，并延长一定的变身时间。"
		jns[3] = 108
		jns[6] = "物品图标.wdf"
		jns[7] = 3922753875.0
		jns[8] = 1137422236
	elseif jn == "还魂咒" then
		jns[1] = "施展法术复活死去的同伴\n同时恢复其一定气血\n大概为孩子等级x2的血量"
		jns[3] = 5
		jns[4] = "150点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2558201582.0
		jns[8] = 2558201582.0
	elseif jn == "仙人指路" then
		jns[1] = "恢复目标队友气血\n并解除其封类异常状态"
		jns[3] = 5
		jns[4] = "20点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 2403051314.0
		jns[8] = 2403051314.0
	elseif jn == "四面埋伏" then
		jns[1] = "提升目标队友11%的封印命中率\n只在该队友气血≤40%时才生效\n效果持续4回合"
		jns[3] = 5
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3805139411.0
		jns[8] = 3805139411.0
	elseif jn == "赴汤蹈火" then
		jns[1] = "提高孩子最大气血540点\n提高法防162点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 498794492
		jns[8] = 498794492
	elseif jn == "开门见山" then
		jns[1] = "提高孩子最大气血38O点\n提高物理攻击结果100点"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 1860385343
		jns[8] = 1860385343
	elseif jn == "张弛有道" then
		jns[1] = "增加魔力值*0.5的法伤"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 3697992326.0
		jns[8] = 3697992326.0
	elseif jn == "峰回路转" then
		jns[1] = "当你进场时，立即为全体队友恢复HP"
		jns[3] = 7
		jns[4] = "50点魔法"
		jns[6] = "物品图标.wdf"
		jns[7] = 193326389
		jns[8] = 193326389
	elseif jn == "武神怒击" then
		jns[1] = "能连续攻击对方3次。但使用后需休息一回合，休息时不能使用战斗指令，也不会受封类法术影响。"
		jns[3] = 4
		jns[4] = "消耗10%最大气血"
		jns[5] = "十方无敌技能达到30级以上"
		jns[6] = "物品图标.wdf"
		jns[7] = 151046561
		jns[8] = 2967724427.0
	elseif jn == "刀光剑影" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "毁灭之光" then
		jns[1] = "施展法术攻击对方，技能达到一定等级后可攻击多人"
		jns[3] = 4
		jns[4] = "20点魔法，攻击多人时消耗增加"
		jns[5] = "呼风唤雨技能达到15级"
		jns[6] = "物品图标.wdf"
		jns[7] = 201672841
		jns[8] = 842454497
	elseif jn == "其疾如风" then
		jns[1] = [[
官府弟子多善战者
行军当迅疾如风
攻其无备
使用后大幅度提高我方所有30%速度
持续6回合]]
		jns[3] = 66
		jns[4] = "200点魔法"
		jns[12] = "冷却16回合"
		jns[6] = "物品图标.wdf"
		jns[8] = 407794048
		jns[7] = 2718476462.0
	elseif jn == "其徐如林" then
		jns[1] = [[
兵者以势制权
徐徐如林出手则必有所得
使用后解除我方所有异常状态
恢复5%友方气血上限]]
		jns[3] = 66
		jns[4] = "200点魔法"
		jns[12] = "冷却16回合"
		jns[6] = "物品图标.wdf"
		jns[8] = 2424291766.0
		jns[7] = 1241199591
	elseif jn == "不动如山 " then
		jns[1] = [[
实而备之
强而避之
防御驻守合该岿然如山
使用后大幅度降低我方所有受到30%的伤害
持续6回合]]
		jns[3] = 66
		jns[4] = "200点魔法"
		jns[12] = "冷却16回合"
		jns[6] = "物品图标.wdf"
		jns[8] = 40250350
		jns[7] = 1055337578
	elseif jn == "侵掠如火" then
		jns[1] = [[
善用兵者
攻则侵掠如火
战无不克
使用后大幅度提高我方所有30%伤害
持续6回合]]
		jns[3] = 66
		jns[4] = "200点魔法"
		jns[12] = "冷却16回合"
		jns[6] = "物品图标.wdf"
		jns[8] = 1650371514
		jns[7] = 1989203646
	elseif jn == "进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,提升本身必杀几率的百分之5"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 159
		jns[8] = 159
	elseif jn == "进击法爆" then
		jns[1] = "宠物技能必须有法爆或者高级法爆的时候才能生效,提升本身必杀几率的百分之5"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 160
		jns[8] = 160
	elseif jn == "高级进击必杀" then
		jns[1] = "宠物技能必须有,必杀或者高级必杀的时候才能生效,提升本身必杀几率的百分之10"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 164
		jns[8] = 164
	elseif jn == "高级进击法爆" then
		jns[1] = "宠物技能必须有法爆或者高级法爆的时候才能生效,提升本身必杀几率的百分之10"
		jns[3] = 7
		jns[6] = "物品图标.wdf"
		jns[7] = 163
		jns[8] = 163
	elseif jn == "扶摇万里" then
		jns[1] = "超级鲲鹏专属技能，出场时会对敌方所有目标造成伤害！"
		jns[3] = 4
		jns[6] = "物品图标.wdf"
		jns[7] = 2864438689.0
		jns[8] = 2864438689.0
	elseif jn == "凝光炼彩" then
		jns[1] = "受伤时有25%的概率获得护盾，护盾值为所受伤害的50%"
		jns[3] = 7
		jns[6] = "护盾括号.wdf"
		jns[7] = 8781259
		jns[8] = 8781259
	elseif jn == "琴音三叠" then
		jns[1] = "使用3次法术攻击敌人,按次数增加伤害"
		jns[3] = 4
		jns[4] = "80点愤怒"
		jns[6] = "路飞.wdf"
		jns[7] = 2684354562.0
		jns[8] = 2684354561.0
	elseif jn == "舍身一搏" then
		jns[1] = "临时提高攻击力(50%)攻击敌人，自身损耗相应伤害结果20%的气血，若速度比攻击目标快，则再额外根据力量点数*0.3提高攻击力。(气血低于上限15%时无法使用)"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 25
		jns[8] = 34
	elseif jn == "水击三千" then
		jns[1] = "临时提升物理伤害结果(50%)和暴击倍率(30%)进行一次物理攻击。——鹏之徙于南冥，水击三千里。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 55
		jns[8] = 56
	elseif jn == "剑气四射" then
		jns[1] = "群体物理攻击法术（每20级增加一个目标，最多作用4个目标）。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 81
		jns[8] = 82
	elseif jn == "剑气四射·觉醒" then
		jns[1] = "群体物理攻击法术（每20级增加一个目标，最多作用4个目标）。#R并吸收所有目标所掉气血的15%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 268435520
		jns[8] = 268435521
	elseif jn == "饕餮盛宴" then
		jns[1] = "对多个目标造成法术伤害（每20级增加一个目标，最多作用4个目标），目标气血比例越高伤害越高。并吸收所有目标所掉气血的25%"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 268435510
		jns[8] = 268435511
	elseif jn == "饕餮盛宴·觉醒" then
		jns[1] = "对多个目标造成法术伤害（每20级增加一个目标，最多作用4个目标），目标气血比例越高伤害越高。并吸收所有目标所掉气血的25%。#R若气血溢出则转化为护盾。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 268435512
		jns[8] = 268435513
	elseif jn == "荒古破击" then
		jns[1] = "物理主动攻击技能，根据力量临时提高自身攻击力，若受击方速度低于自身并且非玩家，对其造成140%伤害结果。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 69
		jns[8] = 70
	elseif jn == "双星闪" then
		jns[1] = "物理主动攻击技能，对单个目标造成连续两次物理伤害（伤害结果降低15%）。"
		jns[3] = 4
		jns[4] = "50点魔法"
		jns[6] = "新加图标.wdf"
		jns[7] = 65
		jns[8] = 66
	end

	return jns
end
