Q_乾坤袋 = {
	人 = {
		"中原一点红",
		"草上飞前帽",
		"水上飘李达",
		"无影神偷刘欢"
	},
	魔 = {
		"千年老妖",
		"南海不死怪",
		"百年小妖",
		"魔眼吸精妖"
	},
	仙 = {
		"无上真人",
		"通广上仙",
		"紫金洞大仙",
		"南部大仙"
	}
}
Q_随机人物 = {
	{
		地图 = 1003,
		名称 = {
			"夏大叔",
			"窑窑",
			"彤彤",
			"萍儿",
			"桃源仙女",
			"雨画师",
			"玄大夫",
			"谭村长",
			"郭大哥",
			"狸",
			"刘大婶",
			"小绿",
			"清清",
			"孙猎户",
			"野猪",
			"霞姑娘",
			"新手接待师"
		}
	},
	{
		地图 = 1001,
		名称 = {
			"陈员外",
			"张老财",
			"刘副将",
			"御林军右统领",
			"御林军左统领",
			"怜儿姑娘",
			"月老",
			"小宝",
			"说书先生",
			"马副将",
			"杜少海",
			"皇宫护卫",
			"兰虎",
			"李捕头",
			"建房吏",
			"仓库管理员",
			"礼部侍郎",
			"帮派管理员",
			"红线童子",
			"王夫人",
			"花香香",
			"老花农",
			"染色师",
			"龙孙",
			"长安导游",
			"门派传送人",
			"宝石商人",
			"轿夫",
			"五行大师"
		}
	},
	{
		地图 = 1044,
		名称 = {
			"魏征",
			"李世民",
			"房玄龄"
		}
	},
	{
		地图 = 1033,
		名称 = {
			"罗百万",
			"陈妈妈",
			"小桃红"
		}
	},
	{
		地图 = 1501,
		名称 = {
			"张来福",
			"教书先生",
			"飞儿",
			"吹牛王",
			"戏班班主",
			"宠物仙子",
			"管家",
			"符全",
			"迎客僧",
			"马全有",
			"雷黑子",
			"赵捕头",
			"王大嫂",
			"小花",
			"赵元宝",
			"牛大胆",
			"罗招弟",
			"陈长寿",
			"老孙头"
		}
	},
	{
		地图 = 1226,
		名称 = {
			"镖局学童"
		}
	},
	{
		地图 = 1208,
		名称 = {
			"朱紫校尉",
			"端木娘子",
			"紫阳药师",
			"朱紫侍卫"
		}
	},
	{
		地图 = 1049,
		名称 = {
			"殷丞相",
			"殷夫人"
		}
	},
	{
		地图 = 1198,
		名称 = {
			"程夫人",
			"丫鬟",
			"程府护卫"
		}
	},
	{
		地图 = 1070,
		名称 = {
			"海老先生",
			"许姑娘",
			"凤凰姑娘",
			"许大娘",
			"钟书生",
			"蝴蝶女",
			"慧觉和尚",
			"南极仙翁",
			"长寿村村长",
			"毛驴张"
		}
	},
	{
		地图 = 1083,
		名称 = {
			"裁缝张"
		}
	},
	{
		地图 = 1081,
		名称 = {
			"钱庄老板"
		}
	},
	{
		地图 = 1085,
		名称 = {
			"武器店老板"
		}
	},
	{
		地图 = 1135,
		名称 = {
			"觉明",
			"灵儿"
		}
	},
	{
		地图 = 1173,
		名称 = {
			"山贼头子",
			"牛将军",
			"白衣人",
			"云游僧",
			"姚太尉",
			"阿紫",
			"玉面狐狸",
			"白鹿精",
			"野猪王",
			"冤魂",
			"偷尸鬼",
			"李彪",
			"刘洪"
		}
	},
	{
		地图 = 1513,
		名称 = {
			"女妖",
			"金琉璃",
			"栗栗儿"
		}
	},
	{
		地图 = 1092,
		名称 = {
			"蝴蝶妹妹",
			"偷偷怪",
			"金毛猿",
			"报名官"
		}
	},
	{
		地图 = 1093,
		名称 = {
			"慕容先生",
			"王福来"
		}
	},
	{
		地图 = 1095,
		名称 = {
			"牛师傅"
		}
	},
	{
		地图 = 1104,
		名称 = {
			"沈妙衣"
		}
	},
	{
		地图 = 1105,
		名称 = {
			"杂货店老板"
		}
	},
	{
		地图 = 1101,
		名称 = {
			"杜天"
		}
	},
	{
		地图 = 1100,
		名称 = {
			"小紫"
		}
	},
	{
		地图 = 1099,
		名称 = {
			"钱庄老板"
		}
	},
	{
		地图 = 1514,
		名称 = {
			"老马猴",
			"老猕猴",
			"猴医仙"
		}
	},
	{
		地图 = 1146,
		名称 = {
			"清风"
		}
	},
	{
		地图 = 1140,
		名称 = {
			"龙女宝宝",
			"黑熊怪"
		}
	},
	{
		地图 = 1138,
		名称 = {
			"云中月",
			"云小奴",
			"满天星"
		}
	},
	{
		地图 = 1139,
		名称 = {
			"墨衣",
			"红莲",
			"璎珞"
		}
	},
	{
		地图 = 1150,
		名称 = {
			"破碎星",
			"伏断星",
			"天瘟星",
			"反吟星",
			"刀砧星",
			"荒芜星"
		}
	},
	{
		地图 = 1002,
		名称 = {
			"慧海",
			"慧静",
			"慧悲"
		}
	},
	{
		地图 = 1512,
		名称 = {
			"守门牛妖"
		}
	},
	{
		地图 = 1131,
		名称 = {
			"守山小妖"
		}
	},
	{
		地图 = 1506,
		名称 = {
			"楚恋依",
			"玉面公主",
			"牛二",
			"海盗头子",
			"林老汉"
		}
	},
	{
		地图 = 1507,
		名称 = {
			"螃蟹精",
			"蛤蟆精"
		}
	},
	{
		地图 = 1508,
		名称 = {
			"虾精",
			"妖风"
		}
	},
	{
		地图 = 1116,
		名称 = {
			"万圣公主",
			"龟太尉",
			"虾将军",
			"蛤蟆勇士",
			"龟千岁",
			"小龙女"
		}
	},
	{
		地图 = 1142,
		名称 = {
			"柳飞絮",
			"栗栗娘",
			"绿儿",
			"翠花"
		}
	},
	{
		地图 = 1174,
		名称 = {
			"青琉璃",
			"莽汉",
			"龙女妹妹",
			"白熊怪",
			"翻天怪",
			"北俱商人",
			"北俱货商",
			"雷鸟精",
			"江湖奸商"
		}
	},
	{
		地图 = 1111,
		名称 = {
			"守门天兵",
			"顺风耳",
			"天牢守卫",
			"水兵统领",
			"千里眼",
			"大力神灵",
			"执法天兵"
		}
	},
	{
		地图 = 1114,
		名称 = {
			"吴刚",
			"嫦娥",
			"康太尉",
			"月香侍女"
		}
	},
	{
		地图 = 1110,
		名称 = {
			"山神",
			"白琉璃",
			"小二",
			"者释和尚",
			"业释和尚",
			"海释和尚",
			"虾兵"
		}
	},
	{
		地图 = 1122,
		名称 = {
			"孟婆",
			"追梦鬼",
			"马面"
		}
	},
	{
		地图 = 1091,
		名称 = {
			"路人甲",
			"鬼谷道人"
		}
	},
	{
		地图 = 1127,
		名称 = {
			"幽冥鬼"
		}
	},
	{
		地图 = 1173,
		名称 = {
			"山贼头子",
			"牛将军",
			"白衣人",
			"云游僧",
			"姚太尉",
			"阿紫",
			"玉面狐狸",
			"白鹿精",
			"野猪王",
			"冤魂",
			"偷尸鬼",
			"李彪",
			"刘洪",
			"至尊宝",
			"二帮主",
			"土地公公",
			"天蓬元帅",
			"天兵飞剑",
			"卷帘大将"
		}
	},
	{
		地图 = 1170,
		名称 = {
			"高老先生"
		}
	},
	{
		地图 = 1171,
		名称 = {
			"高翠兰"
		}
	},
	{
		地图 = 1110,
		名称 = {
			"山神",
			"白琉璃",
			"婆婆",
			"赌徒喽啰",
			"小二",
			"者释和尚",
			"业释和尚",
			"海释和尚",
			"虾兵",
			"小芸芸",
			"接引仙女",
			"文秀",
			"吴老爹",
			"吴文彩",
			"衙役"
		}
	},
	{
		地图 = 1116,
		名称 = {
			"万圣公主",
			"龟太尉",
			"虾将军",
			"蛤蟆勇士",
			"龟千岁",
			"小龙女"
		}
	},
	{
		地图 = 1168,
		名称 = {
			"殷温娇",
			"江州县令",
			"刘洪"
		}
	},
	{
		地图 = 1017,
		名称 = {
			"饰品店老板"
		}
	},
	{
		地图 = 1022,
		名称 = {
			"服装店老板"
		}
	},
	{
		地图 = 1020,
		名称 = {
			"武器店老板",
			"武器店掌柜"
		}
	},
	{
		地图 = 1016,
		名称 = {
			"药店老板"
		}
	},
	{
		地图 = 1028,
		名称 = {
			"店小二",
			"酒店老板"
		}
	},
	{
		地图 = 1025,
		名称 = {
			"冯铁匠"
		}
	},
	{
		地图 = 1024,
		名称 = {
			"郑镖头"
		}
	},
	{
		地图 = 1013,
		名称 = {
			"钱庄老板"
		}
	},
	{
		地图 = 1523,
		名称 = {
			"当铺老板"
		}
	},
	{
		地图 = 1502,
		名称 = {
			"武器店老板",
			"武器店掌柜"
		}
	},
	{
		地图 = 1534,
		名称 = {
			"李善人"
		}
	},
	{
		地图 = 1537,
		名称 = {
			"衙役",
			"简师爷",
			"建邺县令"
		}
	},
	{
		地图 = 1505,
		名称 = {
			"杂货店老板"
		}
	},
	{
		地图 = 1503,
		名称 = {
			"服装店老板"
		}
	},
	{
		地图 = 1526,
		名称 = {
			"周猎户"
		}
	},
	{
		地图 = 1504,
		名称 = {
			"药店老板"
		}
	},
	{
		地图 = 1524,
		名称 = {
			"钱庄老板"
		}
	},
	{
		地图 = 1026,
		名称 = {
			"吴举人"
		}
	},
	{
		地图 = 1150,
		名称 = {
			"二郎神"
		}
	},
	{
		地图 = 1141,
		名称 = {
			"观音姐姐"
		}
	},
	{
		地图 = 1124,
		名称 = {
			"地藏王"
		}
	},
	{
		地图 = 1117,
		名称 = {
			"东海龙王"
		}
	},
	{
		地图 = 1054,
		名称 = {
			"程咬金"
		}
	},
	{
		地图 = 1002,
		名称 = {
			"慧海"
		}
	},
	{
		地图 = 1043,
		名称 = {
			"空度禅师"
		}
	},
	{
		地图 = 1143,
		名称 = {
			"孙婆婆"
		}
	},
	{
		地图 = 1137,
		名称 = {
			"菩提祖师"
		}
	},
	{
		地图 = 1112,
		名称 = {
			"李靖"
		}
	},
	{
		地图 = 1145,
		名称 = {
			"牛魔王"
		}
	},
	{
		地图 = 1147,
		名称 = {
			"镇元大仙"
		}
	},
	{
		地图 = 1134,
		名称 = {
			"大大王"
		}
	},
	{
		地图 = 1154,
		名称 = {
			"巫奎虎"
		}
	},
	{
		地图 = 1156,
		名称 = {
			"地涌夫人",
			"灵鼠娃娃"
		}
	},
	{
		地图 = 1144,
		名称 = {
			"白晶晶",
			"春十三娘"
		}
	}
}
Q_随机模型 = {
	"剑侠客",
	"逍遥生",
	"飞燕女",
	"英女侠",
	"巫蛮儿",
	"神天兵",
	"龙太子",
	"舞天姬",
	"玄彩娥",
	"桃夭夭",
	"虎头怪",
	"巨魔王",
	"狐美人",
	"骨精灵",
	"杀破狼",
	"羽灵神",
	"偃无师",
	"鬼潇潇"
}
Q_星宿名称 = {
	"角木蛟",
	"亢金龙",
	"氐土貉",
	"房日兔",
	"心月狐",
	"尾火虎",
	"箕水豹",
	"井木犴",
	"鬼金羊",
	"柳土獐",
	"星日马",
	"张月鹿",
	"翼火蛇",
	"轸水蚓",
	"奎木狼",
	"娄金狗",
	"胃土雉",
	"昴日鸡",
	"毕月乌",
	"觜火猴",
	"参水猿",
	"斗木獬",
	"牛金牛",
	"女土蝠",
	"虚日鼠",
	"危月燕",
	"室火猪",
	"壁水貐"
}
