随机灵饰 = {
	"手镯",
	"佩饰",
	"戒指",
	"耳饰"
}
幻化属性值 = {
	"伤害",
	"防御",
	"气血",
	"速度",
	"法伤",
	"抗封印等级",
	"法术伤害结果",
	"法术暴击等级",
	"抗法术暴击等级",
	"治疗能力",
	"抗物理暴击等级",
	"格挡值",
	"气血回复效果",
	"封印命中等级",
	"固定伤害",
	"狂暴等级",
	"穿刺等级",
	"物理暴击等级"
}
幻化战斗属性 = {
	"抗封印等级",
	"法术伤害结果",
	"法术暴击等级",
	"抗法术暴击等级",
	"治疗能力",
	"抗物理暴击等级",
	"格挡值",
	"气血回复效果",
	"封印命中等级",
	"固定伤害",
	"狂暴等级",
	"穿刺等级",
	"物理暴击等级"
}
灵饰属性 = {
	手镯 = {
		主属性 = {
			"封印命中等级",
			"抵抗封印等级"
		},
		副属性 = {
			"气血回复效果",
			"气血",
			"防御",
			"抵抗封印等级",
			"抗法术暴击等级",
			"格挡值",
			"法防",
			"抗物理暴击等级"
		}
	},
	佩饰 = {
		主属性 = {
			"速度"
		},
		副属性 = {
			"气血回复效果",
			"气血",
			"防御",
			"抵抗封印等级",
			"抗法术暴击等级",
			"格挡值",
			"法防",
			"抗物理暴击等级"
		}
	},
	戒指 = {
		主属性 = {
			"伤害",
			"防御"
		},
		副属性 = {
			"固定伤害",
			"法伤",
			"伤害",
			"封印命中等级",
			"法术暴击等级",
			"物理暴击等级",
			"狂暴等级",
			"穿刺等级",
			"法术伤害结果",
			"治疗能力",
			"速度"
		}
	},
	耳饰 = {
		主属性 = {
			"法伤",
			"法防"
		},
		副属性 = {
			"固定伤害",
			"法伤",
			"伤害",
			"封印命中等级",
			"法术暴击等级",
			"物理暴击等级",
			"狂暴等级",
			"穿刺等级",
			"法术伤害结果",
			"治疗能力",
			"速度"
		}
	}
}
灵饰战斗属性 = {
	"气血回复效果",
	"抗法术暴击等级",
	"格挡值",
	"法防",
	"抗物理暴击等级",
	"封印命中等级",
	"抵抗封印等级",
	"固定伤害",
	"法伤",
	"法术暴击等级",
	"物理暴击等级",
	"狂暴等级",
	"穿刺等级",
	"法术伤害结果",
	"治疗能力"
}
灵饰正常属性 = {
	"伤害",
	"防御",
	"气血",
	"速度"
}
灵饰正常属性1 = {
	"命中",
	"伤害",
	"灵力",
	"防御",
	"速度",
	"躲避",
	"气血",
	"魔法",
	"力量",
	"魔力",
	"耐力",
	"体质",
	"敏捷"
}
灵饰属性.基础 = {
	封印命中等级 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	抵抗封印等级 = {
		[0] = 4,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	防御 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	气血回复效果 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	气血 = {
		[0] = 28,
		[160] = {
			b = 168,
			a = 112
		},
		[140] = {
			b = 147,
			a = 98
		},
		[120] = {
			b = 126,
			a = 84
		},
		[100] = {
			b = 105,
			a = 70
		},
		[80] = {
			b = 84,
			a = 56
		},
		[60] = {
			b = 63,
			a = 42
		}
	},
	抗法术暴击等级 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	格挡值 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	法防 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	抗物理暴击等级 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	速度 = {
		[0] = 3,
		[160] = {
			b = 17,
			a = 11
		},
		[140] = {
			b = 15,
			a = 10
		},
		[120] = {
			b = 13,
			a = 9
		},
		[100] = {
			b = 12,
			a = 8
		},
		[80] = {
			b = 10,
			a = 7
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	法伤 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	伤害 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	固定伤害 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	法术暴击等级 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	物理暴击等级 = {
		[0] = 4,
		[160] = {
			b = 24,
			a = 16
		},
		[140] = {
			b = 21,
			a = 14
		},
		[120] = {
			b = 18,
			a = 12
		},
		[100] = {
			b = 15,
			a = 10
		},
		[80] = {
			b = 12,
			a = 8
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	狂暴等级 = {
		[0] = 3,
		[160] = {
			b = 17,
			a = 11
		},
		[140] = {
			b = 15,
			a = 10
		},
		[120] = {
			b = 13,
			a = 9
		},
		[100] = {
			b = 12,
			a = 8
		},
		[80] = {
			b = 10,
			a = 7
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	穿刺等级 = {
		[0] = 4,
		[160] = {
			b = 17,
			a = 11
		},
		[140] = {
			b = 15,
			a = 10
		},
		[120] = {
			b = 13,
			a = 9
		},
		[100] = {
			b = 12,
			a = 8
		},
		[80] = {
			b = 10,
			a = 7
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	法术伤害结果 = {
		[0] = 3,
		[160] = {
			b = 17,
			a = 11
		},
		[140] = {
			b = 15,
			a = 10
		},
		[120] = {
			b = 13,
			a = 9
		},
		[100] = {
			b = 12,
			a = 8
		},
		[80] = {
			b = 10,
			a = 7
		},
		[60] = {
			b = 9,
			a = 6
		}
	},
	治疗能力 = {
		[0] = 3,
		[160] = {
			b = 17,
			a = 11
		},
		[140] = {
			b = 15,
			a = 10
		},
		[120] = {
			b = 13,
			a = 9
		},
		[100] = {
			b = 12,
			a = 8
		},
		[80] = {
			b = 10,
			a = 7
		},
		[60] = {
			b = 9,
			a = 6
		}
	}
}
灵饰属性.基础1 = {
	封印命中等级 = {
		[0] = 4,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	抵抗封印等级 = {
		[0] = 4,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	防御 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	法防 = {
		[0] = 8,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	速度 = {
		[0] = 3,
		[160] = {
			b = 33,
			a = 22
		},
		[140] = {
			b = 30,
			a = 20
		},
		[120] = {
			b = 27,
			a = 18
		},
		[100] = {
			b = 24,
			a = 16
		},
		[80] = {
			b = 21,
			a = 14
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	法伤 = {
		[0] = 4,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	},
	伤害 = {
		[0] = 4,
		[160] = {
			b = 48,
			a = 32
		},
		[140] = {
			b = 42,
			a = 28
		},
		[120] = {
			b = 36,
			a = 24
		},
		[100] = {
			b = 30,
			a = 20
		},
		[80] = {
			b = 24,
			a = 16
		},
		[60] = {
			b = 18,
			a = 12
		}
	}
}
光武拓印 = {
	{
		"暗夜",
		"梨花",
		"霹雳",
		"刑天之逆",
		"五虎断魂",
		"飞龙在天",
		"天龙破城",
		"弑皇"
	},
	{
		"破魄",
		"肃魂",
		"无敌",
		"五丁开山",
		"元神禁锢",
		"护法灭魔",
		"碧血干戚",
		"裂天"
	},
	{
		"鱼肠",
		"倚天",
		"湛卢",
		"魏武青虹",
		"灵犀神剑",
		"四法青云",
		"霜冷九州",
		"擒龙"
	},
	{
		"阴阳",
		"月光双剑",
		"灵蛇",
		"金龙双剪",
		"连理双树",
		"祖龙对剑",
		"紫电青霜",
		"浮犀"
	},
	{
		"彩虹",
		"流云",
		"碧波",
		"秋水落霞",
		"晃金仙绳",
		"此最相思",
		"揽月摘星",
		"九霄"
	},
	{
		"撕天",
		"毒牙",
		"胭脂",
		"九阴勾魂",
		"雪蚕之刺",
		"贵霜之牙",
		"忘川三途",
		"离钩"
	},
	{
		"太极",
		"玉龙",
		"秋风",
		"画龙点睛",
		"秋水人家",
		"逍遥江湖",
		"浩气长舒",
		"星瀚"
	},
	{
		"沧海",
		"红莲",
		"盘龙",
		"降魔玉杵",
		"青藤玉树",
		"墨玉骷髅",
		"丝萝乔木",
		"醍醐"
	},
	{
		"八卦",
		"鬼牙",
		"雷神",
		"混元金锤",
		"九瓣莲花",
		"鬼王蚀日",
		"狂澜碎岳",
		"碎寂"
	},
	{
		"龙筋",
		"百花",
		"吹雪",
		"游龙惊鸿",
		"仙人指路",
		"血之刺藤",
		"牧云清歌",
		"霜陨"
	},
	{
		"如意",
		"乾坤",
		"月光双环",
		"别情离恨",
		"金玉双环",
		"九天金线",
		"无关风月",
		"朝夕"
	},
	{
		"冷月",
		"屠龙",
		"血刃",
		"偃月青龙",
		"晓风残月",
		"斩妖泣血",
		"业火三灾",
		"鸣鸿"
	},
	{
		"业焰",
		"玉辉",
		"鹿鸣",
		"庄周梦蝶",
		"凤翼流珠",
		"雪蟒霜寒",
		"碧海潮生",
		"弦月"
	},
	{
		"非攻",
		"幽篁",
		"百鬼",
		"冥火薄天",
		"龙鸣寒水",
		"太极流光",
		"九霄风雷",
		"若木"
	},
	{
		"离火",
		"飞星",
		"月华",
		"回风舞雪",
		"紫金葫芦",
		"裂云啸日",
		"云雷万里",
		"赤明"
	},
	{
		"鸦九",
		"昆吾",
		"弦歌",
		"墨骨枯麟",
		"腾蛇郁刃",
		"秋水澄流",
		"百辟镇魂",
		"长息"
	},
	{
		"鬼骨",
		"云梦",
		"枕霞",
		"碧火琉璃",
		"雪羽穿云",
		"月影星痕",
		"浮生归梦",
		"晴雪"
	},
	{
		"蟠龙",
		"云鹤",
		"风荷",
		"金风玉露",
		"凰火燎原",
		"月露清愁",
		"夭桃秾李",
		"荒尘"
	}
}

取五行 = function()
	local 五行_ = {
		"金",
		"木",
		"水",
		"火",
		"土"
	}

	return 五行_[ygsj(5)]
end

取宝石 = function()
	local 宝石 = {
		"红玛瑙",
		"太阳石",
		"舍利子",
		"黑宝石",
		"月亮石",
		"神秘石",
		"光芒石",
		"昆仑玉"
	}

	return 宝石[取随机数(1, #宝石)]
end

取强化石 = function()
	local 宝石 = {
		"青龙石",
		"白虎石",
		"朱雀石",
		"玄武石"
	}

	return 宝石[取随机数(1, #宝石)]
end

取符石 = function(名称)
	if 名称 == "二级未激活符石" or 名称 == 2 then
		名称 = 2
	elseif 名称 == "一级未激活符石" or 名称 == 1 then
		名称 = 1
	else
		名称 = 3
	end

	local 符石 = {}

	if 名称 == 2 then
		符石 = {
			"碧玉符石",
			"金光符石",
			"天神符石",
			"飘渺符石",
			"天仙符石",
			"霞光符石",
			"逍遥符石"
		}
	elseif 名称 == 1 then
		符石 = {
			"冰符石",
			"土符石",
			"雷符石",
			"电符石",
			"风符石",
			"炎符石",
			"火符石"
		}
	else
		符石 = {
			"虹珀符石",
			"陌影符石",
			"北冥符石",
			"灵月符石",
			"锦瑟符石",
			"银光符石",
			"清心符石",
			"星辰符石",
			"雪月符石",
			"玄魂符石",
			"乾坤符石",
			"珍珀符石",
			"银竹符石",
			"神川符石",
			"玲珑符石",
			"暮影符石",
			"天珍符石",
			"九影符石",
			"百冥符石",
			"莫念符石",
			"醉魂符石",
			"玄羽符石",
			"霸风符石",
			"无相符石",
			"无极符石",
			"紫晶符石",
			"圣火符石",
			"昔光符石",
			"子蚀符石",
			"流风符石",
			"地炎符石",
			"素影符石",
			"燕灵符石",
			"降龙符石",
			"苍玉符石",
			"流魂符石",
			"九凤符石",
			"墨陀符石",
			"南夕符石",
			"引幽符石",
			"波涛符石",
			"铃星符石",
			"狂念符石",
			"乱花符石",
			"幽月符石",
			"两仪符石",
			"七情符石",
			"召影符石"
		}
	end

	return 符石[取随机数(1, #符石)]
end

取内丹 = function(类型)
	local 普通内丹 = {
		"迅敏",
		"狂怒",
		"阴伤",
		"静岳",
		"擅咒",
		"灵身",
		"矫健",
		"深思",
		"钢化",
		"坚甲",
		"慧心",
		"撞击",
		"无畏",
		"愤恨",
		"淬毒",
		"狙刺",
		"连环",
		"圣洁",
		"灵光"
	}
	local 高级内丹 = {
		"腾挪劲",
		"玄武躯",
		"龙胄铠",
		"玉砥柱",
		"碎甲刃",
		"舍身击",
		"通灵法",
		"双星爆",
		"催心浪",
		"隐匿击",
		"生死决",
		"血债偿",
		"神机步",
		"电魂闪"
	}

	if 类型 == "高级" then
		return 高级内丹[取随机数(1, #高级内丹)]
	else
		return 普通内丹[取随机数(1, #普通内丹)]
	end
end

绑定等级物品80 = function()
	local n = {
		{
			"红缨枪",
			"曲尖枪",
			"锯齿矛",
			"乌金三叉戟",
			"火焰枪",
			"墨杆金钩",
			"玄铁矛",
			"金蛇信",
			"丈八点钢矛"
		},
		{
			"青铜斧",
			"开山斧",
			"双面斧",
			"双弦钺",
			"精钢禅钺",
			"黄金钺",
			"乌金鬼头镰",
			"狂魔镰",
			"恶龙之齿"
		},
		{
			"青铜短剑",
			"铁齿剑",
			"吴越剑",
			"青锋剑",
			"龙泉剑",
			"黄金剑",
			"游龙剑",
			"北斗七星剑",
			"碧玉剑"
		},
		{
			"双短剑",
			"镔铁双剑",
			"龙凤双剑",
			"竹节双剑",
			"狼牙双剑",
			"鱼骨双剑",
			"赤焰双剑",
			"墨玉双剑",
			"梅花双剑"
		},
		{
			"五色缎带",
			"幻彩银纱",
			"金丝彩带",
			"无极丝",
			"天蚕丝带",
			"云龙绸带",
			"七彩罗刹",
			"缚神绫",
			"九天仙绫"
		},
		{
			"铁爪",
			"天狼爪",
			"幽冥鬼爪",
			"青龙牙",
			"勾魂爪",
			"玄冰刺",
			"青刚刺",
			"华光刺",
			"龙鳞刺"
		},
		{
			"折扇",
			"铁骨扇",
			"精钢扇",
			"铁面扇",
			"百折扇",
			"劈水扇",
			"神火扇",
			"阴风扇",
			"风云雷电"
		},
		{
			"细木棒",
			"金丝魔棒",
			"玉如意",
			"点金棒",
			"云龙棒",
			"幽路引魂",
			"满天星",
			"水晶棒",
			"日月光华"
		},
		{
			"松木锤",
			"镔铁锤",
			"八棱金瓜",
			"狼牙锤",
			"烈焰锤",
			"破甲战锤",
			"震天锤",
			"巨灵神锤",
			"天崩地裂"
		},
		{
			"牛皮鞭",
			"牛筋鞭",
			"乌龙鞭",
			"钢结鞭",
			"蛇骨鞭",
			"玉竹金铃",
			"青藤柳叶鞭",
			"雷鸣嗜血鞭",
			"混元金钩"
		},
		{
			"黄铜圈",
			"精钢日月圈",
			"离情环",
			"金刺轮",
			"风火圈",
			"赤炎环",
			"蛇形月",
			"子母双月",
			"斜月狼牙"
		},
		{
			"柳叶刀",
			"苗刀",
			"夜魔弯刀",
			"金背大砍刀",
			"雁翅刀",
			"破天宝刀",
			"狼牙刀",
			"龙鳞宝刀",
			"黑炎魔刀"
		},
		{
			"曲柳杖",
			"红木杖",
			"白椴杖",
			"墨铁拐",
			"玄铁牛角杖",
			"鹰眼法杖",
			"腾云杖",
			"引魂杖",
			"碧玺杖"
		},
		{
			"硬木弓",
			"铁胆弓",
			"紫檀弓",
			"宝雕长弓",
			"錾金宝弓",
			"玉腰弯弓",
			"连珠神弓",
			"游鱼戏珠",
			"灵犀望月"
		},
		{
			"琉璃珠",
			"水晶珠",
			"珍宝珠",
			"翡翠珠",
			"莲华珠",
			"夜灵珠",
			"如意宝珠",
			"沧海明珠",
			"无量玉璧"
		},
		{
			"钝铁重剑",
			"桃印铁刃",
			"赭石巨剑",
			"壁玉长铗",
			"青铜古剑",
			"金错巨刃",
			"惊涛雪",
			"醉浮生",
			"沉戟天戊"
		},
		{
			"油纸伞",
			"红罗伞",
			"紫竹伞",
			"锦绣椎",
			"幽兰帐",
			"琳琅盖",
			"孔雀羽",
			"金刚伞",
			"落梅伞"
		},
		[18] = {
			"素纸灯",
			"竹骨灯",
			"红灯笼",
			"鲤鱼灯",
			"芙蓉花灯",
			"如意宫灯",
			"玲珑盏",
			"玉兔盏",
			"冰心盏"
		},
		[19] = {
			{
				"方巾",
				"簪子"
			},
			{
				"布帽",
				"玉钗"
			},
			{
				"面具",
				"梅花簪子"
			},
			{
				"纶巾",
				"珍珠头带"
			},
			{
				"缨络丝带",
				"凤头钗"
			},
			{
				"羊角盔",
				"媚狐头饰"
			},
			{
				"水晶帽",
				"玉女发冠"
			},
			{
				"乾坤帽",
				"魔女发冠"
			},
			{
				"黑魔冠",
				"七彩花环"
			}
		},
		[20] = {
			"护身符",
			"五色飞石",
			"珍珠链",
			{
				"骷髅吊坠",
				"苍魂珠"
			},
			{
				"江湖夜雨",
				"九宫坠"
			},
			{
				"荧光坠子",
				"高速之星"
			},
			{
				"风月宝链",
				"八卦坠"
			},
			{
				"碧水青龙",
				"鬼牙攫魂"
			},
			{
				"万里卷云",
				"疾风之铃"
			}
		},
		[21] = {
			{
				"布裙",
				"布衣"
			},
			{
				"丝绸长裙",
				"皮衣"
			},
			{
				"五彩裙",
				"鳞甲"
			},
			{
				"龙鳞羽衣",
				"锁子甲"
			},
			{
				"天香披肩",
				"紧身衣"
			},
			{
				"金缕羽衣",
				"钢甲"
			},
			{
				"霓裳羽衣",
				"夜魔披风"
			},
			{
				"流云素裙",
				"龙骨甲"
			},
			{
				"七宝天衣",
				"死亡斗篷"
			}
		},
		[22] = {
			"腰带",
			"缎带",
			"银腰带",
			{
				"水晶腰带",
				"玉树腰带"
			},
			{
				"琥珀腰链",
				"白面狼牙"
			},
			{
				"乱牙咬",
				"魔童大牙"
			},
			{
				"攫魂铃",
				"双魂引"
			},
			{
				"兽王腰带",
				"百窜云"
			},
			{
				"八卦锻带",
				"圣王坠"
			}
		},
		[23] = {
			"布鞋",
			"牛皮靴",
			"马靴",
			"侠客履",
			"神行靴",
			"绿靴",
			"追星踏月",
			"九州履",
			"万里追云履"
		},
		[24] = {
			"竹编护腕",
			"皮腕",
			"针腕",
			"骨镯",
			"青铜护腕",
			"玛瑙护腕",
			"琉璃护腕",
			"镂空银镯",
			"笼玉镯"
		},
		[25] = {
			"竹编脖环",
			"钢圈",
			"荆棘环",
			"骨环",
			"青铜颈环",
			"玛瑙石环",
			"琉璃环",
			"九曲环",
			"笼玉环"
		},
		[26] = {
			"竹藤甲",
			"皮甲",
			"刺甲",
			"骨排甲",
			"青铜披甲",
			"玛瑙软甲",
			"琉璃罩甲",
			"连环铠甲",
			"笼玉甲"
		}
	}

	return n
end

绑定等级物品 = function()
	local n = {
		{
			"红缨枪",
			"曲尖枪",
			"锯齿矛",
			"乌金三叉戟",
			"火焰枪",
			"墨杆金钩",
			"玄铁矛",
			"金蛇信",
			"丈八点钢矛",
			"暗夜",
			"梨花",
			"霹雳",
			"刑天之逆",
			"五虎断魂",
			"飞龙在天",
			"天龙破城",
			"弑皇"
		},
		{
			"青铜斧",
			"开山斧",
			"双面斧",
			"双弦钺",
			"精钢禅钺",
			"黄金钺",
			"乌金鬼头镰",
			"狂魔镰",
			"恶龙之齿",
			"破魄",
			"肃魂",
			"无敌",
			"五丁开山",
			"元神禁锢",
			"护法灭魔",
			"碧血干戚",
			"裂天"
		},
		{
			"青铜短剑",
			"铁齿剑",
			"吴越剑",
			"青锋剑",
			"龙泉剑",
			"黄金剑",
			"游龙剑",
			"北斗七星剑",
			"碧玉剑",
			"鱼肠",
			"倚天",
			"湛卢",
			"魏武青虹",
			"灵犀神剑",
			"四法青云",
			"霜冷九州",
			"擒龙"
		},
		{
			"双短剑",
			"镔铁双剑",
			"龙凤双剑",
			"竹节双剑",
			"狼牙双剑",
			"鱼骨双剑",
			"赤焰双剑",
			"墨玉双剑",
			"梅花双剑",
			"阴阳",
			"月光双剑",
			"灵蛇",
			"金龙双剪",
			"连理双树",
			"祖龙对剑",
			"紫电青霜",
			"浮犀"
		},
		{
			"五色缎带",
			"幻彩银纱",
			"金丝彩带",
			"无极丝",
			"天蚕丝带",
			"云龙绸带",
			"七彩罗刹",
			"缚神绫",
			"九天仙绫",
			"彩虹",
			"流云",
			"碧波",
			"秋水落霞",
			"晃金仙绳",
			"此最相思",
			"揽月摘星",
			"九霄"
		},
		{
			"铁爪",
			"天狼爪",
			"幽冥鬼爪",
			"青龙牙",
			"勾魂爪",
			"玄冰刺",
			"青刚刺",
			"华光刺",
			"龙鳞刺",
			"撕天",
			"毒牙",
			"胭脂",
			"九阴勾魂",
			"雪蚕之刺",
			"贵霜之牙",
			"忘川三途",
			"离钩"
		},
		{
			"折扇",
			"铁骨扇",
			"精钢扇",
			"铁面扇",
			"百折扇",
			"劈水扇",
			"神火扇",
			"阴风扇",
			"风云雷电",
			"太极",
			"玉龙",
			"秋风",
			"画龙点睛",
			"秋水人家",
			"逍遥江湖",
			"浩气长舒",
			"星瀚"
		},
		{
			"细木棒",
			"金丝魔棒",
			"玉如意",
			"点金棒",
			"云龙棒",
			"幽路引魂",
			"满天星",
			"水晶棒",
			"日月光华",
			"沧海",
			"红莲",
			"盘龙",
			"降魔玉杵",
			"青藤玉树",
			"墨玉骷髅",
			"丝萝乔木",
			"醍醐"
		},
		{
			"松木锤",
			"镔铁锤",
			"八棱金瓜",
			"狼牙锤",
			"烈焰锤",
			"破甲战锤",
			"震天锤",
			"巨灵神锤",
			"天崩地裂",
			"八卦",
			"鬼牙",
			"雷神",
			"混元金锤",
			"九瓣莲花",
			"鬼王蚀日",
			"狂澜碎岳",
			"碎寂"
		},
		{
			"牛皮鞭",
			"牛筋鞭",
			"乌龙鞭",
			"钢结鞭",
			"蛇骨鞭",
			"玉竹金铃",
			"青藤柳叶鞭",
			"雷鸣嗜血鞭",
			"混元金钩",
			"龙筋",
			"百花",
			"吹雪",
			"游龙惊鸿",
			"仙人指路",
			"血之刺藤",
			"牧云清歌",
			"霜陨"
		},
		{
			"黄铜圈",
			"精钢日月圈",
			"离情环",
			"金刺轮",
			"风火圈",
			"赤炎环",
			"蛇形月",
			"子母双月",
			"斜月狼牙",
			"如意",
			"乾坤",
			"月光双环",
			"别情离恨",
			"金玉双环",
			"九天金线",
			"无关风月",
			"朝夕"
		},
		{
			"柳叶刀",
			"苗刀",
			"夜魔弯刀",
			"金背大砍刀",
			"雁翅刀",
			"破天宝刀",
			"狼牙刀",
			"龙鳞宝刀",
			"黑炎魔刀",
			"冷月",
			"屠龙",
			"血刃",
			"偃月青龙",
			"晓风残月",
			"斩妖泣血",
			"业火三灾",
			"鸣鸿"
		},
		{
			"曲柳杖",
			"红木杖",
			"白椴杖",
			"墨铁拐",
			"玄铁牛角杖",
			"鹰眼法杖",
			"腾云杖",
			"引魂杖",
			"碧玺杖",
			"业焰",
			"玉辉",
			"鹿鸣",
			"庄周梦蝶",
			"凤翼流珠",
			"雪蟒霜寒",
			"碧海潮生",
			"弦月"
		},
		{
			"硬木弓",
			"铁胆弓",
			"紫檀弓",
			"宝雕长弓",
			"錾金宝弓",
			"玉腰弯弓",
			"连珠神弓",
			"游鱼戏珠",
			"灵犀望月",
			"非攻",
			"幽篁",
			"百鬼",
			"冥火薄天",
			"龙鸣寒水",
			"太极流光",
			"九霄风雷",
			"若木"
		},
		{
			"琉璃珠",
			"水晶珠",
			"珍宝珠",
			"翡翠珠",
			"莲华珠",
			"夜灵珠",
			"如意宝珠",
			"沧海明珠",
			"无量玉璧",
			"离火",
			"飞星",
			"月华",
			"回风舞雪",
			"紫金葫芦",
			"裂云啸日",
			"云雷万里",
			"赤明"
		},
		{
			"钝铁重剑",
			"桃印铁刃",
			"赭石巨剑",
			"壁玉长铗",
			"青铜古剑",
			"金错巨刃",
			"惊涛雪",
			"醉浮生",
			"沉戟天戊",
			"鸦九",
			"昆吾",
			"弦歌",
			"墨骨枯麟",
			"腾蛇郁刃",
			"秋水澄流",
			"百辟镇魂",
			"长息"
		},
		{
			"油纸伞",
			"红罗伞",
			"紫竹伞",
			"锦绣椎",
			"幽兰帐",
			"琳琅盖",
			"孔雀羽",
			"金刚伞",
			"落梅伞",
			"鬼骨",
			"云梦",
			"枕霞",
			"碧火琉璃",
			"雪羽穿云",
			"月影星痕",
			"浮生归梦",
			"晴雪"
		},
		[18] = {
			"素纸灯",
			"竹骨灯",
			"红灯笼",
			"鲤鱼灯",
			"芙蓉花灯",
			"如意宫灯",
			"玲珑盏",
			"玉兔盏",
			"冰心盏",
			"蟠龙",
			"云鹤",
			"风荷",
			"金风玉露",
			"凰火燎原",
			"月露清愁",
			"夭桃秾李",
			"荒尘"
		},
		[19] = {
			{
				"方巾",
				"簪子"
			},
			{
				"布帽",
				"玉钗"
			},
			{
				"面具",
				"梅花簪子"
			},
			{
				"纶巾",
				"珍珠头带"
			},
			{
				"缨络丝带",
				"凤头钗"
			},
			{
				"羊角盔",
				"媚狐头饰"
			},
			{
				"水晶帽",
				"玉女发冠"
			},
			{
				"乾坤帽",
				"魔女发冠"
			},
			{
				"黑魔冠",
				"七彩花环"
			},
			{
				"白玉龙冠",
				"凤翅金翎"
			},
			{
				"水晶夔帽",
				"寒雉霜蚕"
			},
			{
				"翡翠曜冠",
				"曜月嵌星"
			},
			{
				"金丝黑玉冠",
				"郁金流苏簪"
			},
			{
				"白玉琉璃冠",
				"玉翼附蝉翎"
			},
			{
				"兽鬼珐琅面",
				"鸾羽九凤冠"
			},
			{
				"紫金磐龙冠",
				"金珰紫焰冠"
			},
			{
				"浑天玄火盔",
				"乾元鸣凤冕"
			}
		},
		[20] = {
			"护身符",
			"五色飞石",
			"珍珠链",
			{
				"骷髅吊坠",
				"苍魂珠"
			},
			{
				"江湖夜雨",
				"九宫坠"
			},
			{
				"荧光坠子",
				"高速之星"
			},
			{
				"风月宝链",
				"八卦坠"
			},
			{
				"碧水青龙",
				"鬼牙攫魂"
			},
			{
				"万里卷云",
				"疾风之铃"
			},
			"七彩玲珑",
			"黄玉琉佩",
			"鸾飞凤舞",
			"衔珠金凤佩",
			"七璜珠玉佩",
			"鎏金点翠佩",
			"紫金碧玺佩",
			"落霞陨星坠"
		},
		[21] = {
			{
				"布裙",
				"布衣"
			},
			{
				"丝绸长裙",
				"皮衣"
			},
			{
				"五彩裙",
				"鳞甲"
			},
			{
				"龙鳞羽衣",
				"锁子甲"
			},
			{
				"天香披肩",
				"紧身衣"
			},
			{
				"金缕羽衣",
				"钢甲"
			},
			{
				"霓裳羽衣",
				"夜魔披风"
			},
			{
				"流云素裙",
				"龙骨甲"
			},
			{
				"七宝天衣",
				"死亡斗篷"
			},
			{
				"飞天羽衣",
				"神谕披风"
			},
			{
				"穰花翠裙",
				"珊瑚玉衣"
			},
			{
				"金蚕丝裙",
				"金蚕披风"
			},
			{
				"紫香金乌裙",
				"乾坤护心甲"
			},
			{
				"碧霞彩云衣",
				"蝉翼金丝甲"
			},
			{
				"金丝蝉翼衫",
				"金丝鱼鳞甲"
			},
			{
				"五彩凤翅衣",
				"紫金磐龙甲"
			},
			{
				"鎏金浣月衣",
				"混元一气甲"
			}
		},
		[22] = {
			"腰带",
			"缎带",
			"银腰带",
			{
				"水晶腰带",
				"玉树腰带"
			},
			{
				"琥珀腰链",
				"白面狼牙"
			},
			{
				"乱牙咬",
				"魔童大牙"
			},
			{
				"攫魂铃",
				"双魂引"
			},
			{
				"兽王腰带",
				"百窜云"
			},
			{
				"八卦锻带",
				"圣王坠"
			},
			"幻彩玉带",
			"珠翠玉环",
			"金蟾含珠",
			"乾坤紫玉带",
			"琉璃寒玉带",
			"蝉翼鱼佩带",
			"磐龙凤翔带",
			"紫霄云芒带"
		},
		[23] = {
			"布鞋",
			"牛皮靴",
			"马靴",
			"侠客履",
			"神行靴",
			"绿靴",
			"追星踏月",
			"九州履",
			"万里追云履",
			"踏雪无痕",
			"平步青云",
			"追云逐电",
			"乾坤天罡履",
			"七星逐月靴",
			"碧霞流云履",
			"金丝逐日履",
			"辟尘分光履"
		},
		[24] = {
			"竹编护腕",
			"皮腕",
			"针腕",
			"骨镯",
			"青铜护腕",
			"玛瑙护腕",
			"琉璃护腕",
			"镂空银镯",
			"笼玉镯",
			"嵌宝金腕",
			"玳瑁护腕",
			"七星宝腕",
			"缚龙筋",
			"凤翎护腕",
			"织锦彩带",
			"冰蚕丝带"
		},
		[25] = {
			"竹编脖环",
			"钢圈",
			"荆棘环",
			"骨环",
			"青铜颈环",
			"玛瑙石环",
			"琉璃环",
			"九曲环",
			"笼玉环",
			"嵌宝金环",
			"玳瑁环",
			"七星宝环",
			"缚龙圈",
			"鸾尾环",
			"织锦颈圈",
			"冰蚕丝圈"
		},
		[26] = {
			"竹藤甲",
			"皮甲",
			"刺甲",
			"骨排甲",
			"青铜披甲",
			"玛瑙软甲",
			"琉璃罩甲",
			"连环铠甲",
			"笼玉甲",
			"嵌宝金甲",
			"玳瑁衣",
			"七星宝甲",
			"缚龙甲",
			"凤凰彩衣",
			"织锦软褡",
			"冰蚕织甲"
		}
	}

	return n
end

取随机装备名称 = function(等级)
	local 随机装备 = 绑定等级物品()
	local 临时等级 = 等级
	local 临时参数 = 取随机数(1, #书铁范围)
	local 临时序列 = 临时参数

	if 临时序列 == 25 then
		临时序列 = 23
	elseif 临时序列 == 24 then
		临时序列 = 22
	elseif 临时序列 == 23 or 临时序列 == 22 then
		临时序列 = 21
	elseif 临时序列 == 21 then
		临时序列 = 20
	elseif 临时序列 == 20 or 临时序列 == 19 then
		临时序列 = 19
	end

	if 临时序列 <= 18 and 临时等级 >= 9 then
		临时等级 = 取随机数(9, 11)
	elseif 临时等级 >= 12 then
		临时等级 = 13
	end

	local 临时类型 = 随机装备[临时序列][临时等级 + 1]

	if type(临时类型) == "table" then
		if 临时参数 == 23 then
			临时类型 = 临时类型[2]
		elseif 临时参数 == 22 then
			临时类型 = 临时类型[1]
		elseif 临时参数 == 20 then
			临时类型 = 临时类型[2]
		elseif 临时参数 == 19 then
			临时类型 = 临时类型[1]
		else
			临时类型 = 临时类型[取随机数(1, 2)]
		end
	end

	return 临时类型
end

取官职任务物品 = function(id)
	local 物品名称 = 玩家数据[id].装备.打造物品[取随机数(1, 23)][取随机数(1, 3)]

	if type(物品名称) == "table" then
		物品名称 = 物品名称[取随机数(1, #物品名称)]
	end

	return 物品名称
end

取武器数据 = function(名称, 级别)
	if 名称 == nil or 级别 == nil then
		return
	end

	local 道具 = 物品类()

	道具:置对象(名称)

	道具.级别限制 = 级别

	return {
		名称 = 名称,
		级别限制 = 级别,
		子类 = 道具.子类
	}
end

装备种类 = {
	"头",
	"项链",
	"武器",
	"衣",
	"腰带",
	"鞋",
	"护腕",
	"项圈",
	"铠甲",
	"耳饰",
	"佩饰",
	"戒指",
	"手镯"
}
武器种类 = {
	"枪矛",
	"斧钺",
	"剑",
	"双短剑",
	"飘带",
	"爪刺",
	"扇",
	"魔棒",
	"锤",
	"鞭",
	"环圈",
	"刀",
	"法杖",
	"弓弩",
	"宝珠",
	"巨剑",
	"伞",
	"灯笼"
}

取装备详细说明 = function(名称)
	local aa = 取物品数据(名称)
	local 总类 = aa[2]

	if 总类 == 2 then
		local 分类 = aa[3]
		local 子类 = aa[4]
		local 级别 = aa[5]
		local 性别 = aa[6]
		种类 = 装备种类[分类]

		if 种类 == "武器" then
			种类 = 武器种类[子类]
		end

		if 性别 == "男" or 性别 == "女" then
			种类 = 性别 .. 种类
		end

		if 级别 ~= nil then
			级别 = 级别 .. "级"
		end

		if 通灵装备1[名称] ~= nil then
			种类 = "通灵装备"
			级别 = 个位数字转汉字(通灵装备1[名称]) .. "级"
		end

		return 名称 .. "#R(" .. (级别 or "0级") .. 种类 .. ")#W"
	end

	return 名称
end

取物品数据 = function(wd)
	local wds = {}

	if wd == "避火诀" then
		wds[1] = "仙界的五行秘宝之一，拈此诀处在烈火中也安然无恙"
		wds[2] = 150
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 74009168
		wds[13] = 3282615977.0
	elseif wd == "飞刀" then
		wds[1] = "锋利的飞刀，普通的暗器"
		wds[2] = 2000
		wds[3] = 10
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2764575173.0
		wds[13] = 2472460417.0
	elseif wd == "飞蝗石" then
		wds[1] = "普通暗器，但如果使用熟了，非常方便"
		wds[2] = 2000
		wds[3] = 20
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1275527326
		wds[13] = 3214164055.0
	elseif wd == "铁蒺藜" then
		wds[1] = "形状似蒺藜的铁制暗器"
		wds[2] = 2000
		wds[3] = 30
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 676440300
		wds[13] = 1565531474
	elseif wd == "无影神针" then
		wds[1] = "著名暗器，特点为伤害力较大，极不宜防范"
		wds[2] = 2000
		wds[3] = 40
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2517968888.0
		wds[13] = 2656925845.0
	elseif wd == "孔雀翎" then
		wds[1] = "传说中的暗器，据说伤人例不虚发"
		wds[2] = 2000
		wds[3] = 50
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2992994872.0
		wds[13] = 1162856939
	elseif wd == "含沙射影" then
		wds[1] = "传说中的暗器，扣动机关，万针齐射，非常不易防"
		wds[2] = 2000
		wds[3] = 60
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3192113518.0
		wds[13] = 3828770848.0
	elseif wd == "回龙摄魂标" then
		wds[1] = "著名暗器，发出时阴风阵阵，令人防不胜防"
		wds[2] = 2000
		wds[3] = 70
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3442626446.0
		wds[13] = 1056117989
	elseif wd == "寸阴若梦" then
		wds[1] = "来自阴府的暗器，甩出时带动惨惨阴风"
		wds[2] = 2000
		wds[3] = 80
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFB2A8F4C
		wds[13] = 1462066260
	elseif wd == "魔睛子" then
		wds[1] = "魔王妖王所用的邪恶暗器，会自己追被攻击人"
		wds[2] = 2000
		wds[3] = 90
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2191610982.0
		wds[13] = 1765821930
	elseif wd == "顺逆神针" then
		wds[1] = "此暗器，一旦被伤害，神针不易取出，极为厉害"
		wds[2] = 2000
		wds[3] = 100
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2708565857.0
		wds[13] = 2063299478
	elseif wd == "修篁斧" then
		wds[1] = "仙界的五行秘宝之一，为普陀山砍伐紫竹之物。"
		wds[2] = 150
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 636550916
		wds[13] = 888107629
	elseif wd == "炼金鼎" then
		wds[1] = "仙界的五行秘宝之一，为五庄观修炼金丹之物。 "
		wds[2] = 150
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1810657488
		wds[13] = 1167494740
	elseif wd == "定海针" then
		wds[1] = "仙界的五行秘宝之一，为龙宫的镇海之宝。"
		wds[2] = 150
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 4112841487.0
		wds[13] = 3613209822.0
	elseif wd == "凤头钗" then
		wds[1] = "雕刻着凤头的金钗，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 40
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1305963475
		wds[13] = 1323749060
	elseif wd == "雁翅刀" then
		wds[1] = "刀背布满粗大的锯齿，上挂银环，铿锵入耳如雁过九天"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 40
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1719719282
		wds[13] = 3277123413.0
	elseif wd == "面具" then
		wds[1] = "用皮制的面具，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 20
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1622680174
		wds[13] = 544766765
	elseif wd == "勾魂爪" then
		wds[1] = "状似银勾，夺命勾魂"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 40
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2945873492.0
		wds[13] = 3529952713.0
	elseif wd == "铁腕" then
		wds[1] = "铁做的护腕，可以起到伤害力"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2535965770.0
		wds[13] = 1102893761
	elseif wd == "皮衣" then
		wds[1] = "用兽皮制的皮衣，防御力较布衣要好的多"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 10
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1569129428
		wds[13] = 4004133926.0
	elseif wd == "双面斧" then
		wds[1] = "两面均制成半月状锋刃，双面制敌，力猛势强"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 20
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 595341788
		wds[13] = 917777182
	elseif wd == "七彩罗刹" then
		wds[1] = "用各式丝绸编织而成的丝带"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 60
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFB55B1E2
		wds[13] = 1196299810
	elseif wd == "五色飞石" then
		wds[1] = "仙人炼制的饰品，佩带在身上有极强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 10
		wds[11] = "物品图标.wdf"
		wds[12] = 3139664596.0
		wds[13] = 374271655
	elseif wd == "梅花簪子" then
		wds[1] = "因簪子外端有梅花形状而得名，可以起到防御作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 20
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2353187566.0
		wds[13] = 3355592593.0
	elseif wd == "霓裳羽衣" then
		wds[1] = "非常美丽的羽衣，可以起到一定的防御作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 60
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3005484634.0
		wds[13] = 2665296729.0
	elseif wd == "黄金钺" then
		wds[1] = "以华丽的黄金装饰,使其更加沉重威猛,金光起处血光飞溅"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 50
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 804669659
		wds[13] = 3468478581.0
	elseif wd == "魔兽要诀" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1241924823
		wds[13] = 2950829831.0
	elseif wd == "高级魔兽要诀" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1823291112
		wds[13] = 3631057336.0
	elseif wd == "特殊魔兽要诀" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 74009168
		wds[13] = 3282615977.0
	elseif wd == "赌一赌观照万象" then
		wds[1] = "有几率获得观照万象技能!"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1823291112
		wds[13] = 3631057336.0
	elseif wd == "召唤兽内丹" then
		wds[1] = "上古魔兽遗留下来的精气经万年而成的内丹，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1915699026
		wds[13] = 1188066226
	elseif wd == "高级召唤兽内丹" then
		wds[1] = "上古魔兽遗留下来的精气经万年而成的高级内丹，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 44529374
		wds[13] = 1313074175
	elseif wd == "顽石双斧(乾)" then
		wds[1] = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 0
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "顽石双斧(坤)" then
		wds[1] = "质地粗糙，手感不佳，造型简陋。但够大够重，威力十足。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 0
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "镔铁双斧(乾)" then
		wds[1] = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 10
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "镔铁双斧(坤)" then
		wds[1] = "两把白铁大斧的绝妙搭配，性能均衡，适合新手使用。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 10
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "黑曜双斧(乾)" then
		wds[1] = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 20
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "黑曜双斧(坤)" then
		wds[1] = "边地所产之奇石所打造的双斧，锋利无比，更胜精铁。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 20
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "枭首双斧(乾)" then
		wds[1] = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 30
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "枭首双斧(坤)" then
		wds[1] = "黄铜制造的危险双斧，造型适合斩下敌人的首级。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 30
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "破军双斧(乾)" then
		wds[1] = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 40
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "破军双斧(坤)" then
		wds[1] = "精钢打造的双斧，在工匠的坚持下加入了多道淬炼工艺和斧柄配重，使用起来得心应手，只是价格不甚美好。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 40
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "隳城双戚(乾)" then
		wds[1] = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 50
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "隳城双戚(坤)" then
		wds[1] = "一人敌者兵，万人敌者王。此斧重若千钧，能摧城破寨，震慑千军，堪称斧中之王。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 50
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "飞头蛮(乾)" then
		wds[1] = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 60
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "飞头蛮(坤)" then
		wds[1] = "此斧一大一小，大斧近身御敌，小斧投掷毙敌。飞出之斧状似飞头獠子，以恶齿取人性命，以此得名。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 60
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "竹叶青(乾)" then
		wds[1] = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 70
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "竹叶青(坤)" then
		wds[1] = "形似毒蛇之怪斧，涂有奇毒。削铁如泥，视甲胄如无物，只需触人肌肤，即可取人性命。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 70
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "鲛煞(乾)" then
		wds[1] = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 80
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "鲛煞(坤)" then
		wds[1] = "北海有大鱼，其名为鲛。取其利齿作双斧，攻时如巨鲨噬人，凶煞万分，旁人不得近身。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 80
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "啖月(乾)" then
		wds[1] = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 90
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "啖月(坤)" then
		wds[1] = "有美玉称月陨，其自天上来，落于大荒之深，时人以为天狗食月所致。锻之为斧，清辉不减，寒气逼人。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 90
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "义战(乾)" then
		wds[1] = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 100
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "义战(坤)" then
		wds[1] = "墨子曰：万事莫贵于义。义战利于天下，不义祸害四海，故造此器，集机关偃术之大成。义者持此甲盾之兵，所向无敌。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 100
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "恶来(乾)" then
		wds[1] = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 110
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "恶来(坤)" then
		wds[1] = "古之猛士恶来，力可拔山，勇不可当。即使手提重若九鼎之兵作战，也能行云流水，手到擒来。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 110
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "烬世野火(乾)" then
		wds[1] = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 120
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "烬世野火(坤)" then
		wds[1] = "毕方者，火鸟也，传其在世时火海连天，三界皆焚。后人以其羽为械，仍有焦金流石之威。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 120
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "九州海沸(乾)" then
		wds[1] = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 130
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "九州海沸(坤)" then
		wds[1] = "九婴毙于凶水，有巧匠以其骸骨龙筋制成双斧之胚，欲设斧刃，忽九婴目光洞洞，吐洪流以成斧身，流水千变，百克不殆。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 130
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "八狱末劫(乾)" then
		wds[1] = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 140
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "八狱末劫(坤)" then
		wds[1] = "地府之深，谓之地狱，有八层：曰等活，曰号叫，曰大焦热，曰无间，云云八类，遍常冥世之苦。此斧鬼面黑绳，曾为八大地狱之门，阻挡万千恶鬼。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 140
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "罗喉计都(乾)" then
		wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 150
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "罗喉计都(坤)" then
		wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 150
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "非天(乾)" then
		wds[1] = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 160
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "影精灵.dll"
		wds[12] = "非天(乾)小"
		wds[13] = "非天(乾)大"
	elseif wd == "非天(坤)" then
		wds[1] = "似神非神，似人非人。狠天神之无情，亦嗔凡人之黯弱。上战提婆，下扶苍氓，心火焚诸魔，斩业断恶果，所图非天，不顺天意。此即阿修罗之道。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 160
		wds[7] = {
			"影精灵(九黎城)"
		}
		wds[11] = "影精灵.dll"
		wds[12] = "非天(坤)小"
		wds[13] = "非天(坤)大"
	elseif wd == "罗睺计都（乾）" then
		wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 910
		wds[5] = 150
		wds[6] = "仅限九黎城门派"
		wds[11] = "路飞.wdf"
		wds[12] = 805306372
		wds[13] = 805306371
	elseif wd == "罗睺计都（坤）" or wd == "罗睺计都" then
		wds[1] = "罗喉六臂好斗，计都蛇身善搏，二者原为隐曜凶神。后放下屠刀，充作九曜星君。凡间星官拾其星辰以为祭器，有日月万钧，牵宇动宙之威。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 911
		wds[5] = 150
		wds[6] = "仅限九黎城门派"
		wds[11] = "路飞.wdf"
		wds[12] = 805306370
		wds[13] = 805306369
	elseif wd == "龙鳞羽衣" then
		wds[1] = "用龙鳞制成的羽衣，有相当的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 30
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 4057563157.0
		wds[13] = 2734928170.0
	elseif wd == "夜灵珠" then
		wds[1] = "白日之时看似平平无奇，置于灯火昏昏之处，方有幽光融融。其夜愈深，而光华愈明。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 50
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3855395369.0
		wds[13] = 814300484
	elseif wd == "风月宝链" then
		wds[1] = "名家制成的精致饰品，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 91099687
		wds[13] = 1990243519
	elseif wd == "云龙绸带" then
		wds[1] = "绸如云彩，龙隐其间"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 50
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 140457428
		wds[13] = 4041408902.0
	elseif wd == "黄色导标旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 1
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 1953229980
		wds[13] = 1011605557
		wds[14] = 13000
	elseif wd == "蓝色合成旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 2
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 2026275469
		wds[13] = 1294444558
		wds[14] = 13000
	elseif wd == "绿色合成旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 2
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 3363762323.0
		wds[13] = 1233343648
		wds[14] = 13000
	elseif wd == "黄色合成旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 2
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 1084205009
		wds[13] = 1030021222
		wds[14] = 13000
	elseif wd == "白色合成旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 2
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 812640697
		wds[13] = 2960057542.0
		wds[14] = 13000
	elseif wd == "红色合成旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 2
		wds[4] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 233337203
		wds[13] = 1334256602
		wds[14] = 13000
	elseif wd == "硬木弓" then
		wds[1] = "柳木头制成的短弓，质轻便携，很适合新手练习使用"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1102238567
		wds[13] = 322855055
	elseif wd == "缎带" then
		wds[1] = "高级丝绸制成的腰带，能起到不错的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 10
		wds[11] = "物品图标.wdf"
		wds[12] = 3002795508.0
		wds[13] = 4182781118.0
	elseif wd == "幽冥鬼爪" then
		wds[1] = "精钢打造，饰以冥文，透出森森鬼气"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 20
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 473959188
		wds[13] = 3711514054.0
	elseif wd == "五彩裙" then
		wds[1] = "五彩绵制成的裙子，可以起到一定的防御作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 20
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2890413629.0
		wds[13] = 3454325495.0
	elseif wd == "河虾" then
		wds[1] = "生长在河水中的小虾"
		wds[2] = 10
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1697773646
		wds[13] = 1542469648
	elseif wd == "墨铁拐" then
		wds[1] = "墨铁打造而成的法杖，冰冷坚硬，似乎含有奇妙的力量。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 30
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 6277753
		wds[13] = 2738948963.0
	elseif wd == "红色导标旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 1
		wds[4] = 10
		wds[11] = "物品图标.wdf"
		wds[12] = 2856215948.0
		wds[13] = 3379177744.0
		wds[14] = 7000
	elseif wd == "玄铁矛" then
		wds[1] = "枪头玄铁制成，宽大沉重，可刺可砍，威势不可挡"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 60
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4108563339.0
		wds[13] = 1450072521
	elseif wd == "双弦钺" then
		wds[1] = "铁杆黝黑，银月如弦，舞动时眩人眼目"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 30
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2083951632
		wds[13] = 709060887
	elseif wd == "紫檀弓" then
		wds[1] = "精致的紫楠木弓箭，云纹雕花流畅雅致。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 20
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1817338084
		wds[13] = 1474683356
	elseif wd == "绿色导标旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 1
		wds[4] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1060779522
		wds[13] = 662138631
		wds[14] = 120000
	elseif wd == "开山斧" then
		wds[1] = "铁铸的巨大战斧，沉重无比，力大者用以开石裂碑"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 10
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2876225806.0
		wds[13] = 511692637
	elseif wd == "神行靴" then
		wds[1] = "非常轻便的靴子，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 40
		wds[11] = "物品图标.wdf"
		wds[12] = 3963558258.0
		wds[13] = 1110999757
	elseif wd == "风火圈" then
		wds[1] = "钢制的边缘有似火焰般的刀锋"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 40
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3696047428.0
		wds[13] = 3443374908.0
	elseif wd == "幽路引魂" then
		wds[1] = "通体乌黑，引魂归冥"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 50
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3655607718.0
		wds[13] = 496189030
	elseif wd == "蓝色导标旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 1
		wds[4] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 53543608
		wds[13] = 340145338
		wds[14] = 60000
	elseif wd == "珍宝珠" then
		wds[1] = "东海海底方能寻得的巨大珍珠，光华缓缓流动，似是凝聚了海底之中游鱼的灵气。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 20
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2649110916.0
		wds[13] = 1758505762
	elseif wd == "青铜短剑" then
		wds[1] = "青铜制成，上铸有简单的图案纹饰，初学者练习常用"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1261240304
		wds[13] = 0xFA703674
	elseif wd == "玉钗" then
		wds[1] = "用玉制成的钗，可以起到防御作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 10
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 509457918
		wds[13] = 3519518702.0
	elseif wd == "毛蟹" then
		wds[1] = "常见于近海深水区域，身小壳薄，肉质细嫩而有香味"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 602109723
		wds[13] = 3555868873.0
	elseif wd == "丝绸长裙" then
		wds[1] = "用名贵丝绸制成的长裙，女子用，可以起到防御作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 10
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1759000550
		wds[13] = 451022751
	elseif wd == "绿靴" then
		wds[1] = "绿水晶制成的鞋子，防御作用非常的强"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 2631819456.0
		wds[13] = 3993409018.0
	elseif wd == "布裙" then
		wds[1] = "普通的布裙，女子用，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2415237558.0
		wds[13] = 4137686182.0
	elseif wd == "荧光坠子" then
		wds[1] = "有荧光的宝石，佩带在身上有相当强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 240077184
		wds[13] = 0xFB1404DD
	elseif wd == "龙凤双剑" then
		wds[1] = "双剑剑身一刻龙纹一刻凤饰，可同入一鞘"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 20
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2574377494.0
		wds[13] = 2688315512.0
	elseif wd == "破甲战锤" then
		wds[1] = "精钢打造的巨型战锤，上部粗大的尖齿，可破甲裂碑"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 50
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2961406351.0
		wds[13] = 2582952463.0
	elseif wd == "骷髅吊坠" then
		wds[1] = "皮绳上吊着一个骷髅，佩带在身上有一定法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 30
		wds[11] = "物品图标.wdf"
		wds[12] = 3414243240.0
		wds[13] = 3509217536.0
	elseif wd == "神火扇" then
		wds[1] = "扇面用红绸制，此扇动则似神火四起，使敌人心不能宁"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 60
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1646280508
		wds[13] = 2148260737.0
	elseif wd == "玉如意" then
		wds[1] = "细长的白玉棒，白玉使魔棒能力得到加强"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 20
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1722461164
		wds[13] = 4043165218.0
	elseif wd == "狼牙双剑" then
		wds[1] = "剑身向前方密布粗长的狼牙锯齿，令人胆寒长"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 40
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1830383421
		wds[13] = 885886005
	elseif wd == "海马" then
		wds[1] = "生活在热带及温带深海，头部弯曲，形状与马头相似"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 2901285604.0
		wds[13] = 2563380359.0
	elseif wd == "铁骨扇" then
		wds[1] = "铁制的扇骨会对敌人造成较大的威胁"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 10
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 290823954
		wds[13] = 1443372759
	elseif wd == "金枪鱼" then
		wds[1] = "温热带海洋鱼类，身型细长，游速非常快"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1109845536
		wds[13] = 3822216681.0
	elseif wd == "玄铁牛角杖" then
		wds[1] = "用寒铁锻冶的牛角状法杖，尖锐坚硬，闪着寒光，隐含奇妙的法力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 40
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3096649690.0
		wds[13] = 1043225710
	elseif wd == "纶巾" then
		wds[1] = "真丝织成的白色头巾，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 30
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1730098396
		wds[13] = 2497291232.0
	elseif wd == "玉女发冠" then
		wds[1] = "仙女常带的头环，有相当强的防御力"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 60
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3770740399.0
		wds[13] = 438307144
	elseif wd == "媚狐头饰" then
		wds[1] = "狐眼嵌着宝石的狐头帽，魔女们喜爱的头饰"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 50
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 413224440
		wds[13] = 798712466
	elseif wd == "鲤鱼" then
		wds[1] = "淡水鱼类，肉质坚实，味道鲜美"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 3865632193.0
		wds[13] = 2442761904.0
	elseif wd == "折扇" then
		wds[1] = "普通的纸扇改装而成，可以此练习最基本的使扇方法"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3563784870.0
		wds[13] = 817774560
	elseif wd == "甲鱼" then
		wds[1] = "右键使用可以增加10点积分"
		wds[2] = 10
		wds[3] = 5
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 174833964
		wds[13] = 3829834695.0
	elseif wd == "破天宝刀" then
		wds[1] = "刀光八面，劈风破天"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 50
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1201880064
		wds[13] = 3191505206.0
	elseif wd == "河豚" then
		wds[1] = "肉食鱼类，主要捕食小鱼小虾和贝类，部分内脏有毒，但肉味非常鲜美，是难得的佳肴"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 2328042941.0
		wds[13] = 2165741719.0
	elseif wd == "夜魔弯刀" then
		wds[1] = "精钢制成的细弯刀，刀背密布细齿，如夜魔之牙。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 20
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2386679785.0
		wds[13] = 2763619781.0
	elseif wd == "娃娃鱼" then
		wds[1] = "右键使用可以增加20点积分"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 6
		wds[11] = "物品图标.wdf"
		wds[12] = 2884328689.0
		wds[13] = 1455411021
	elseif wd == "水晶珠" then
		wds[1] = "晶莹水晶打磨而成的水晶球，发出微微的光晕。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 10
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 424958581
		wds[13] = 517101356
	elseif wd == "丁香水" then
		wds[1] = "从仙岛上的丁香花中精心提炼而成"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 2
		wds[10] = 75
		wds[11] = "物品图标.wdf"
		wds[12] = 870043705
		wds[13] = 598856410
		wds[14] = 1000
	elseif wd == "河蟹" then
		wds[1] = "体型较大的淡水蟹，常见于深水湖泊之中"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1298631470
		wds[13] = 3041830860.0
	elseif wd == "草鱼" then
		wds[1] = "右键使用可以增加10点积分"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3951553868.0
		wds[13] = 1888688338
	elseif wd == "沙丁鱼" then
		wds[1] = "常见海洋鱼类，身型小巧，行动敏捷，喜好群居于暖水海区"
		wds[2] = 10
		wds[3] = 1
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1219611956
		wds[13] = 3258862526.0
	elseif wd == "白色导标旗" then
		wds[1] = "集导标旗之大成，江湖遁形所用，奇人异士必备之物。"
		wds[2] = 11
		wds[3] = 1
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 2217728758.0
		wds[13] = 1751361785
		wds[14] = 1500
	elseif wd == "乌金鬼头镰" then
		wds[1] = "乌金打造的巨镰，透出森森鬼气，令人不寒而栗"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 60
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1269150805
		wds[13] = 2315090325.0
	elseif wd == "对虾" then
		wds[1] = "常栖于沿岸浅海，肉质鲜嫩，营养丰富"
		wds[2] = 10
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1712326570
		wds[13] = 2200846910.0
	elseif wd == "玉树腰带" then
		wds[1] = "玉树之丝绦制成的腰带，能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 30
		wds[11] = "物品图标.wdf"
		wds[12] = 1806472204
		wds[13] = 3616026443.0
	elseif wd == "神兽精元" then
		wds[1] = "传说中的神兽遗留下来的精元"
		wds[2] = 9
		wds[3] = 2
		wds[4] = 1
		wds[9] = 0
		wds[10] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2858010774.0
		wds[13] = 1581676023
		wds[14] = 0
	elseif wd == "镔铁双剑" then
		wds[1] = "铁制双短剑，轻巧实用"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 10
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1169767913
		wds[13] = 2278749441.0
	elseif wd == "飞行符" then
		wds[1] = "一种神奇的符咒，使用后可以穿梭于各大陆之间"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3496860737.0
		wds[13] = 2592521580.0
		wds[14] = 500
	elseif wd == "灵箓" then
		wds[1] = "一种神奇的符咒，使用后可以将灵饰特性清除"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 341278646
		wds[13] = 1801870284
		wds[14] = 500
	elseif wd == "钟灵石" then
		wds[1] = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于幻化灵饰额外效果。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 8
		wds[11] = "物品图标.wdf"
		wds[12] = 16777217
		wds[13] = 16777218
	elseif wd == "魔兽残卷" then
		wds[1] = "上古魔兽遗留下来的意志,听说唐王正在收集他们。(集齐100份可以找唐王兑换特殊兽决)"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3283060779.0
		wds[13] = 3484905693.0
		wds[14] = 500
	elseif wd == "神兜兜" then
		wds[1] = "三界之内神兽们最喜欢的玩具，积攒99个\n#P可以开出商城没有的#Y神兽"
		wds[2] = 9
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1350598977
		wds[13] = 1702193008
	elseif wd == "神兜兜(专属)" then
		wds[1] = "三界之内神兽们最喜欢的玩具，积攒99个，就可以获得一个随机神兽。"
		wds[2] = 9
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1350598977
		wds[13] = 1702193008
	elseif wd == "抽奖令牌" then
		wds[1] = "大唐官府下发的令牌,右键使用可用触发1次转盘抽奖。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3960441680.0
		wds[13] = 2299358132.0
		wds[14] = 500
	elseif wd == "召唤兽祈愿卡" then
		wds[1] = "凭此卡可通过GM定制12技能神兽（定制技能数量、资质,额外赠送一本神兽特殊技能）。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2641194545.0
		wds[13] = 3969364521.0
		wds[14] = 500
	elseif wd == "高级召唤兽祈愿卡" then
		wds[1] = "凭此卡可通过GM定制24技能神兽（仅定制技能数量、神兽资质，额外赠送四本神兽特殊技能、一本观照万象）。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 150910017
		wds[13] = 2265539359.0
		wds[14] = 500
	elseif wd == "灵饰兑换卡" then
		wds[1] = "凭此卡可通过GM定制相应等级灵饰（单件）。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "80级灵饰礼包" then
		wds[1] = "可以开出全套80级灵饰"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "60级灵饰礼包" then
		wds[1] = "可以开出全套60级灵饰"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "100级灵饰礼包" then
		wds[1] = "可以开出全套100级灵饰"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "80级无级别灵饰" then
		wds[1] = "可以开出全套80级灵饰"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "60级无级别灵饰" then
		wds[1] = "可以开出全套60级灵饰"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3432230550.0
		wds[13] = 3234431710.0
		wds[14] = 500
	elseif wd == "召唤兽装备兑换卡" then
		wds[1] = "凭此卡可通过GM定制相应位置召唤兽装备。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1142755941
		wds[13] = 0xFCAA9BF0
		wds[14] = 500
	elseif wd == "锦衣兑换卡" then
		wds[1] = "1张兑换锦衣，4张兑换限量称号，8张兑换限量坐骑。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1737373673
		wds[13] = 2901701390.0
		wds[14] = 500
	elseif wd == "翡翠琵琶" then
		wds[1] = "使用翡翠制造而成的琵琶,蕴含巨大的灵气，使用可用获得5000点炼丹灵气。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 619830034
		wds[13] = 4002849548.0
		wds[14] = 500
	elseif wd == "金砂丹" then
		wds[1] = "使用可以获得100W银子。"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1590426077
		wds[13] = 949923524
		wds[14] = 500
	elseif wd == "银砂丹" then
		wds[1] = "使用可以获得10W银子"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1977948069
		wds[13] = 3149882785.0
		wds[14] = 500
	elseif wd == "铜砂丹" then
		wds[1] = "使用可以获得1W银子"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3278677686.0
		wds[13] = 3858105791.0
		wds[14] = 500
	elseif wd == "初级神魂丹" then
		wds[1] = "一种神奇的丹药,集齐99个可以合成为中级神魂丹,使用中级神魂丹可以将初级助战提升为中级助战,能力大幅度提升！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 4
		wds[13] = 5
		wds[14] = 500
	elseif wd == "中级神魂丹" then
		wds[1] = "一种神奇的丹药,集齐99个可以合成为高级神魂丹,使用高级神魂丹可以将中级助战提升为高级助战,能力大幅度提升！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 4
		wds[13] = 5
		wds[14] = 500
	elseif wd == "高级神魂丹" then
		wds[1] = "一种神器的丹药,集齐99个可以合成为顶级神魂丹,使用顶级神魂丹可以将高级助战提升为顶级助战,能力大幅度提升！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 4
		wds[13] = 5
		wds[14] = 500
	elseif wd == "顶级神魂丹" then
		wds[1] = "一种神器的丹药,使用可以将高级助战提升为顶级助战,能力大幅度提升！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 4
		wds[13] = 5
		wds[14] = 500
	elseif wd == "坐骑内丹" then
		wds[1] = "使用可用使坐骑重新领悟技能！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 625552950
		wds[13] = 1715455834
		wds[14] = 500
	elseif wd == "坐骑转型丹" then
		wds[1] = "使用可转换坐骑的类型！"
		wds[2] = 9
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 625552950
		wds[13] = 1715455834
	elseif wd == "红木杖" then
		wds[1] = "用上好红木刻成的法杖，十分坚硬，内含一点奇妙的法力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 10
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2519088005.0
		wds[13] = 2809977168.0
	elseif wd == "蛇骨鞭" then
		wds[1] = "结似蛇骨，环环相联，抖动时骨节相撞，噼啪作响"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 40
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2780394861.0
		wds[13] = 2403200026.0
	elseif wd == "乌金三叉戟" then
		wds[1] = "玄铁长枪，头部以乌金打造，气势如虹"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 30
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2487968590.0
		wds[13] = 3770180780.0
	elseif wd == "藏宝图" then
		wds[1] = "一张记着藏宝地点的地图"
		wds[2] = 7
		wds[3] = 1
		wds[4] = 1
		wds[9] = 0
		wds[10] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 211127435
		wds[13] = 1954996989
	elseif wd == "高级藏宝图" then
		wds[1] = "一张记着藏宝地点的地图"
		wds[2] = 7
		wds[3] = 1
		wds[4] = 1
		wds[9] = 0
		wds[10] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749315747.0
		wds[13] = 2303539141.0
	elseif wd == "金缕羽衣" then
		wds[1] = "用金丝缝制的羽衣，可以起到一定的防御作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 50
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 995989694
		wds[13] = 4188048378.0
	elseif wd == "心魔宝珠" then
		wds[1] = "汲取野妖族精华而成，蕴含着无穷魔力的宝珠"
		wds[2] = 6
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1153796395
		wds[13] = 1350319491
	elseif wd == "铁爪" then
		wds[1] = "镔铁制成的铁爪"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 252413888
		wds[13] = 3216807428.0
	elseif wd == "离情环" then
		wds[1] = "乌金铁环，通体乌黑，似悠悠离情"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 20
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2588804470.0
		wds[13] = 2925351135.0
	elseif wd == "蒲扇" then
		wds[1] = "用于打扫使用的蒲扇。#Y(前往指定坐标附近，右键使用即可)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1856183780
		wds[13] = 3556047067.0
	elseif wd == "人参果" then
		wds[1] = "形状似人的仙果，五庄观的宝贝"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2153916753.0
		wds[13] = 2231564299.0
	elseif wd == "召唤兽蛋" then
		wds[1] = "一种神奇的蛋，可孵化出召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 261
		wds[13] = 262
	elseif wd == "源生之灵" then
		wds[1] = "此石乃是盘古开天辟地之时迸发出来的仙石，能吸取万灵之精华幻化成形。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 23
		wds[13] = 24
	elseif wd == "驾驭宝典" then
		wds[1] = "记载着对召唤兽的驾驭之术的宝典，可增加角色可携带的召唤兽数量。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 4420
		wds[13] = 4419
	elseif wd == "百炼晶石" then
		wds[1] = "使用后可增加百炼打造次数#Y(右键点击使用即可)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 12550
		wds[13] = 12553
	elseif wd == "百炼晶石碎片" then
		wds[1] = "集齐10个可合成1个百炼晶石#Y(右键点击合成)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 68
		wds[13] = 69
	elseif wd == "打造符" then
		wds[1] = "#W玩家使用#R打造技巧#W制作的装备制造符，可用来打造#R武器#W、#R召唤兽装备#W和#R灵饰#W。#S(放入背包中打造时自动使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 268435523
		wds[13] = 268435522
	elseif wd == "裁缝符" then
		wds[1] = "#W玩家使用#R裁缝技巧#W制作的装备制造符，可用来打造#R头盔#W和#R铠甲。#S(放入背包中打造时自动使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 268435525
		wds[13] = 268435524
	elseif wd == "炼金符" then
		wds[1] = "#W玩家使用#R炼金术#W制作的装备制造符，可用来打造#R饰品、鞋子#W和#R腰带。#S(放入背包中打造时自动使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 268435527
		wds[13] = 268435526
	elseif wd == "回收符" then
		wds[1] = "用于回收单个物品#R(右键点击使用即可)#W"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3953209807.0
		wds[13] = 3190197121.0
	elseif wd == "分解符" then
		wds[1] = "用于分解装备"
		wds[2] = 5
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3953209807.0
		wds[13] = 3190197121.0
	elseif wd == "属性转换符" then
		wds[1] = "可以随机转换装备五维属性的灵符。#R(右键点击使用即可)#W"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 341278646
		wds[13] = 1801870284
	elseif wd == "通灵重置丹" then
		wds[1] = "可以重置一级通灵装备附带的技能。#R(右键点击使用即可)#W"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 0xFEACF139
		wds[13] = 0xFEACF139
	elseif wd == "高级通灵重置丹" then
		wds[1] = "可以重置二级及以下通灵装备附带的技能。#R(右键点击使用即可)#W"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 116
		wds[13] = 117
	elseif wd == "超级通灵重置丹" then
		wds[1] = "可以重置三级及以下通灵装备附带的技能。#R(右键点击使用即可)#W"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 25
		wds[13] = 32
	elseif wd == "灵饰洗练石" then
		wds[1] = "能够将灵饰的附加属性重新洗练的神秘宝石。#R(右键点击使用即可)\n#Y【功效】洗练灵饰附加属性"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "llm.wdf"
		wds[12] = 38993
		wds[13] = 38992
	elseif wd == "特效石碎片" then
		wds[1] = "可以为装备赋予特效的神奇石头……似乎只是碎片？。#R(集齐20个后点击右键合成)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 16
		wds[13] = 17
	elseif wd == "特效石" then
		wds[1] = "可以为装备赋予特效的神奇石头。#R(右键点击使用即可)\n#Y【功效】一定概率为装备附加特效"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 16
		wds[13] = 17
	elseif wd == "特技石" then
		wds[1] = "可以为装备赋予特技的神奇石头。#R(右键点击使用即可)\n#Y【功效】100%概率为装备附加特技"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 18
		wds[13] = 19
	elseif wd == "孤儿名册" then
		wds[1] = "记载着一些孤儿名字的手册，常有好心之人伸出爱心之手，将这些孤儿收为自己的子女。#Y(凭此名册可在长寿村#R马婆婆#Y处随机领养一个孩子)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 18
		wds[13] = 19
	elseif wd == "七彩石" then
		wds[1] = "女娲补天所用的七彩石，对装备能有特殊的效果。#R(右键点击使用即可)\n#Y【功效】100%概率为装备附加特殊的效果"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 147
		wds[13] = 148
	elseif wd == "五行石" then
		wds[1] = "与装备超级五行属性密切相关的神奇石头。#R(右键点击使用即可)\n#Y【功效】一定概率为装备附加超级五行属性、100%概率为装备更改超级五行属性"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "新加图标.wdf"
		wds[12] = 20
		wds[13] = 21
	elseif wd == "还魂秘术" then
		wds[1] = "给孩子学习的特技书，学习后可获得【还魂咒】技能\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2092495326
		wds[13] = 1474646776
	elseif wd == "蚩尤武诀" then
		wds[1] = "给孩子学习的特技书，学习后可获得【蚩尤之搏】技能\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 4008670206.0
		wds[13] = 0xFFA98C67
	elseif wd == "黄帝内经" then
		wds[1] = "给孩子学习的特技书，学习后可获得【治疗】技能\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2044519309
		wds[13] = 2822684094.0
	elseif wd == "六艺修行书" then
		wds[1] = "给孩子学习六艺技能的书籍。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1408130183
		wds[13] = 3502575913.0
	elseif wd == "拜师卷轴" then
		wds[1] = "价值千金的拜师卷轴、将之交予各门派师傅可为孩子拜入师门、登堂入室。\n#Y【类型】儿童用品"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "hz.wdf"
		wds[12] = 2097987396
		wds[13] = 3691400153.0
	elseif wd == "凌波城经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2973258762.0
		wds[13] = 210714577
	elseif wd == "方寸山经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 3203441798.0
		wds[13] = 1128982279
	elseif wd == "普陀山经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1772323632
		wds[13] = 814289193
	elseif wd == "五庄观经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2473838270.0
		wds[13] = 997175829
	elseif wd == "盘丝洞经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1771031451
		wds[13] = 1213224893
	elseif wd == "龙宫经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 522352663
		wds[13] = 1363608005
	elseif wd == "魔王寨经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1542374797
		wds[13] = 1561006007
	elseif wd == "阴曹地府经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 3919253333.0
		wds[13] = 1601415406
	elseif wd == "化生寺经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2518687564.0
		wds[13] = 2401434707.0
	elseif wd == "大唐官府经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 3774142860.0
		wds[13] = 2396033177.0
	elseif wd == "神木林经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 3583228190.0
		wds[13] = 2348521922.0
	elseif wd == "无底洞经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 951130299
		wds[13] = 2756979162.0
	elseif wd == "狮驼岭经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 2613826601.0
		wds[13] = 3725336375.0
	elseif wd == "天宫经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1521779880
		wds[13] = 3675427265.0
	elseif wd == "女儿村经脉秘籍" then
		wds[1] = "价值连城的经脉秘籍、孩子研读之后可学习其上记载的无上经脉。\n#Y【类型】儿童用品"
		wds[2] = 3
		wds[3] = 9
		wds[4] = 9
		wds[11] = "hz.wdf"
		wds[12] = 1349664639
		wds[13] = 0xFBF6B87A
	elseif wd == "百炼精铁" then
		wds[1] = "精铁百炼而成\n这种材料为神兵而存在\n是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "精铁150级" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "指南书150级" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "随机百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "60-90百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "60-90制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "10级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "10级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "20级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "20级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "30级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "30级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "40级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "40级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "50级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "50级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "60级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "60级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "70级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "70级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "80级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "80级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "90级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "90级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "100级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "100级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "110级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "110级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "120级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "120级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "130级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "130级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "140级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "140级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "150级百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "150级制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "120-140百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "120-140制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "140百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "140制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "90-110百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "90-110制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "100-110百炼精铁" then
		wds[1] = "精铁百炼而成，这种材料为神兵而存在。是用来合成装备的神奇矿石"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3971456754.0
		wds[13] = 2585045399.0
	elseif wd == "100-110制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "腾云杖" then
		wds[1] = "仙人踏云而至，有着祥云之形的云母石法杖，有着奇妙法力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 60
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4198430474.0
		wds[13] = 1425813651
	elseif wd == "制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "随机制造指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "100级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "110级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "120级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "130级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "140级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "150级随机指南书" then
		wds[1] = "记载着各种装备武器制造方法的书卷。"
		wds[2] = 5
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1102456535
		wds[13] = 3855535092.0
	elseif wd == "灵饰指南书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷"
		wds[2] = 5
		wds[3] = 20
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "60级随机灵饰指南书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出60级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "100-140灵饰书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出100-140级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "60-80灵饰书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出60-80级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "140灵饰书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，开出140级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "100灵饰书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "100级随机灵饰指南书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出100级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "120级随机灵饰指南书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出120级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 4
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "140级随机灵饰指南书" then
		wds[1] = "记载各种灵饰制造方法的古老书卷，随机开出140级各部位灵饰指南书"
		wds[2] = "灵饰礼包"
		wds[3] = 5
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2931154958.0
		wds[13] = 3621950854.0
	elseif wd == "元灵晶石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料。"
		wds[2] = 5
		wds[3] = 21
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "60级元灵晶石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "140元灵石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "100-140元灵石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "60-80元灵石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "100元灵石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "100级元灵晶石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "120级元灵晶石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 4
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "140级元灵晶石" then
		wds[1] = "灵山晶石经千锤百炼而成，为灵饰淬灵所必须的材料，购买后获得对应等级的元灵晶石。"
		wds[2] = "晶石礼包"
		wds[3] = 5
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 839980719
		wds[13] = 329717685
	elseif wd == "云龙棒" then
		wds[1] = "棒身九曲，似云龙腾跃"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 40
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1889288915
		wds[13] = 741134712
	elseif wd == "摄妖香" then
		wds[1] = "人间流行的一种驱逐妖魔的异香，时效为三个时辰"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3553509277.0
		wds[13] = 4033100487.0
		wds[14] = 80
	elseif wd == "2倍经验丹" then
		wds[1] = "基础经验额外增加2倍,可以与双倍、精修、双倍经验丹同时存在,每次使用获得1小时有效时间。无法冻结、可以叠加使用。"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 710537889
		wds[13] = 2012325464
		wds[14] = 80
	elseif wd == "3倍经验丹" then
		wds[1] = "基础经验额外增加3倍,可以与双倍、精修、双倍经验丹同时存在,每次使用获得1小时有效时间。无法冻结、可以叠加使用。"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 710537889
		wds[13] = 2012325464
		wds[14] = 80
	elseif wd == "10倍经验丹" then
		wds[1] = "基础经验额外增加10倍,可以与双倍、精修、双倍经验丹同时存在,每次使用获得1小时有效时间。无法冻结、可以叠加使用。"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 710537889
		wds[13] = 2012325464
		wds[14] = 80
	elseif wd == "神兵图鉴" then
		wds[1] = "征战沙场的大唐弟子所撰写的书册，记载着天下武器和铠甲的鉴定心法。"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2770598230.0
		wds[13] = 1337340963
	elseif wd == "灵宝图鉴" then
		wds[1] = "来自地府的灵宝，记载些一些装备的鉴定心法。"
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2819276890.0
		wds[13] = 4078356857.0
	elseif wd == "乾坤袋" then
		wds[1] = "一个能装天地万物的乾坤如意袋，在特定战斗中祭起可将对手收入袋中。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3896143295.0
		wds[13] = 2584650801.0
		wds[14] = 80
	elseif wd == "特赦令牌" then
		wds[1] = "阎罗地狱里用来宽恕极恶不赦的鬼魂，非常罕见。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2415079616.0
		wds[13] = 0xFE72166A
		wds[14] = 80
	elseif wd == "空白强化符" then
		wds[1] = "传说世间中流传着一些神奇的法术，可以点化装备为其附加某种临时属性。而懂得这些法术的人也能将一张空白的强化符进行点化，使其成为有着神奇功效的灵符。"
		wds[2] = 102
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2194323173.0
		wds[13] = 3446357210.0
		wds[14] = 80
	elseif wd == "强化符" then
		wds[1] = "神奇的灵符，有着为装备附加临时属性的效果"
		wds[2] = 101
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2410170409.0
		wds[13] = 771595544
		wds[14] = 80
	elseif wd == "墨杆金钩" then
		wds[1] = "乌金铁杆，枪尖粗大且制有金色的粗大倒钩，威猛无比"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 50
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1104964498
		wds[13] = 3076442266.0
	elseif wd == "秘制醉生忘死" then
		wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 3
		wds[8] = 1
		wds[9] = 5000
		wds[11] = "物品图标.wdf"
		wds[12] = 3981927301.0
		wds[13] = 724140283
		wds[14] = 15000
	elseif wd == "黄铜圈" then
		wds[1] = "黄铜制的环圈，握手处缚上丝线，是常用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 8632408
		wds[13] = 526420633
	elseif wd == "洞冥草" then
		wds[1] = "山洞中生长的一种阴暗的小草，可以解除摄妖香效果"
		wds[2] = 4
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3286276407.0
		wds[13] = 3672031387.0
		wds[14] = 80
	elseif wd == "秘制红罗羹" then
		wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 3
		wds[8] = 1
		wds[9] = 10000
		wds[11] = "物品图标.wdf"
		wds[12] = 1928344100
		wds[13] = 2602015807.0
		wds[14] = 20000
	elseif wd == "秘制绿罗羹" then
		wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 3
		wds[8] = 1
		wds[10] = 10000
		wds[11] = "物品图标.wdf"
		wds[12] = 3453749185.0
		wds[13] = 185011224
		wds[14] = 20000
	elseif wd == "高速之星" then
		wds[1] = "神秘的项圈，来历至今无人知晓"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 4175067704.0
		wds[13] = 1572566259
	elseif wd == "钝铁重剑" then
		wds[1] = "废铁弃疗打造出来的重剑，价格低廉，适宜新手。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFB88103A
		wds[13] = 3460607829.0
	elseif wd == "秘制翡翠豆腐" then
		wds[1] = "异域传来的美味珍馐，服用后有神奇功效。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 3
		wds[8] = 1
		wds[10] = 5000
		wds[11] = "物品图标.wdf"
		wds[12] = 299271567
		wds[13] = 829957946
		wds[14] = 15000
	elseif wd == "江湖夜雨" then
		wds[1] = "流传于中土的奇异饰物，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 40
		wds[11] = "物品图标.wdf"
		wds[12] = 3985913426.0
		wds[13] = 293361877
	elseif wd == "白面狼牙" then
		wds[1] = "白色的神镜片，可束在腰间，能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 40
		wds[11] = "物品图标.wdf"
		wds[12] = 3575831350.0
		wds[13] = 3209666649.0
	elseif wd == "泥鳅" then
		wds[1] = "常见淡水鱼类，肉质细嫩，味道鲜美"
		wds[2] = 10
		wds[3] = 1
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1404739243
		wds[13] = 2931630332.0
	elseif wd == "白椴杖" then
		wds[1] = "用极佳的椴木精心雕凿而成的法杖，杖身光滑，蕴含着奇妙的法力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 20
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1994971958
		wds[13] = 1336522328
	elseif wd == "麝香" then
		wds[1] = "仙山灵麝的麝香，是名贵的中草药材，可以补充些许法力"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 2
		wds[10] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 117711803
		wds[13] = 1653741198
		wds[14] = 1250
	elseif wd == "天狼爪" then
		wds[1] = "天山雪狼之爪，锐利无比"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 10
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3766972932.0
		wds[13] = 2543379065.0
	elseif wd == "竹编脖环" then
		wds[1] = "竹子围成的项圈，可以起到防御作用"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 308637008
		wds[13] = 3243526110.0
	elseif wd == "钢圈" then
		wds[1] = "皮布围成的项圈，可以起到防御作用"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 15
		wds[11] = "物品图标.wdf"
		wds[12] = 1375604814
		wds[13] = 4041865794.0
	elseif wd == "荆棘环" then
		wds[1] = "荆棘围成的项圈，可以起到防御作用"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 25
		wds[11] = "物品图标.wdf"
		wds[12] = 352928497
		wds[13] = 2194758983.0
	elseif wd == "骨环" then
		wds[1] = "骨头围成的项圈，可以起到防御作用"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 35
		wds[11] = "物品图标.wdf"
		wds[12] = 1727331457
		wds[13] = 440555011
	elseif wd == "青铜颈环" then
		wds[1] = "铜做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 45
		wds[11] = "物品图标.wdf"
		wds[12] = 1454090395
		wds[13] = 786120977
	elseif wd == "玛瑙石环" then
		wds[1] = "玛缁做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 55
		wds[11] = "物品图标.wdf"
		wds[12] = 391314910
		wds[13] = 1466260477
	elseif wd == "琉璃环" then
		wds[1] = "琉璃的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 65
		wds[11] = "物品图标.wdf"
		wds[12] = 1897984925
		wds[13] = 2342712762.0
	elseif wd == "九曲环" then
		wds[1] = "银做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 75
		wds[11] = "物品图标.wdf"
		wds[12] = 3613005753.0
		wds[13] = 3507788902.0
	elseif wd == "笼玉环" then
		wds[1] = "玉做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 85
		wds[11] = "物品图标.wdf"
		wds[12] = 1850407544
		wds[13] = 3784211553.0
	elseif wd == "嵌宝金环" then
		wds[1] = "金做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 95
		wds[11] = "物品图标.wdf"
		wds[12] = 3283266712.0
		wds[13] = 3275437370.0
	elseif wd == "玳瑁环" then
		wds[1] = "玳瑁做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 105
		wds[11] = "物品图标.wdf"
		wds[12] = 3240013292.0
		wds[13] = 225036096
	elseif wd == "七星宝环" then
		wds[1] = "寒冰沂蒙精心给大家制作的手环，戴上他可以秒天秒地秒空气"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 115
		wds[11] = "物品图标.wdf"
		wds[12] = 678406505
		wds[13] = 552173832
	elseif wd == "缚龙圈" then
		wds[1] = "龙筋做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 125
		wds[11] = "物品图标.wdf"
		wds[12] = 2612616501.0
		wds[13] = 3489814847.0
	elseif wd == "鸾尾环" then
		wds[1] = "凤凰的羽毛做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 135
		wds[11] = "物品图标.wdf"
		wds[12] = 2344853585.0
		wds[13] = 1622496513
	elseif wd == "织锦颈圈" then
		wds[1] = "锦做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 145
		wds[11] = "物品图标.wdf"
		wds[12] = 4086876715.0
		wds[13] = 888220028
	elseif wd == "冰蚕丝圈" then
		wds[1] = "冰蚕丝做的项圈"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[5] = 155
		wds[11] = "物品图标.wdf"
		wds[12] = 3405029310.0
		wds[13] = 1657083753
	elseif wd == "竹藤甲" then
		wds[1] = "竹藤制成的衣服，可以起到防御作用。"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1141657141
		wds[13] = 3835149326.0
	elseif wd == "皮甲" then
		wds[1] = "皮布制成的衣服，可以起到防御作用"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 15
		wds[11] = "物品图标.wdf"
		wds[12] = 1718680620
		wds[13] = 360517064
	elseif wd == "刺甲" then
		wds[1] = "精铁制成的衣服，可以起到防御作用"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 25
		wds[11] = "物品图标.wdf"
		wds[12] = 3370387595.0
		wds[13] = 2368023419.0
	elseif wd == "骨排甲" then
		wds[1] = "骨头制成的衣服，可以起到防御作用"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 35
		wds[11] = "物品图标.wdf"
		wds[12] = 1237852263
		wds[13] = 1956127955
	elseif wd == "青铜披甲" then
		wds[1] = "铜做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 45
		wds[11] = "物品图标.wdf"
		wds[12] = 3118973276.0
		wds[13] = 1828827555
	elseif wd == "玛瑙软甲" then
		wds[1] = "玛缁做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 55
		wds[11] = "物品图标.wdf"
		wds[12] = 2919721376.0
		wds[13] = 3353446058.0
	elseif wd == "琉璃罩甲" then
		wds[1] = "琉璃的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 65
		wds[11] = "物品图标.wdf"
		wds[12] = 696270961
		wds[13] = 2418258211.0
	elseif wd == "连环铠甲" then
		wds[1] = "银做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 75
		wds[11] = "物品图标.wdf"
		wds[12] = 801892250
		wds[13] = 151739274
	elseif wd == "笼玉甲" then
		wds[1] = "玉做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 85
		wds[11] = "物品图标.wdf"
		wds[12] = 4176524624.0
		wds[13] = 307625549
	elseif wd == "嵌宝金甲" then
		wds[1] = "金做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 95
		wds[11] = "物品图标.wdf"
		wds[12] = 592200716
		wds[13] = 4156302542.0
	elseif wd == "玳瑁衣" then
		wds[1] = "玳瑁做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 105
		wds[11] = "物品图标.wdf"
		wds[12] = 1446992849
		wds[13] = 371678350
	elseif wd == "七星宝甲" then
		wds[1] = "寒冰沂蒙精心为大家做的铠甲，戴上后可以秒天秒地秒空气"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 115
		wds[11] = "物品图标.wdf"
		wds[12] = 1584383840
		wds[13] = 1345840279
	elseif wd == "缚龙甲" then
		wds[1] = "龙筋做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 125
		wds[11] = "物品图标.wdf"
		wds[12] = 67336897
		wds[13] = 3490861079.0
	elseif wd == "凤凰彩衣" then
		wds[1] = "凤凰的羽毛做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 135
		wds[11] = "物品图标.wdf"
		wds[12] = 3984235518.0
		wds[13] = 3296343909.0
	elseif wd == "织锦软褡" then
		wds[1] = "锦做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 145
		wds[11] = "物品图标.wdf"
		wds[12] = 3346981047.0
		wds[13] = 1314867248
	elseif wd == "冰蚕织甲" then
		wds[1] = "冰蚕丝做的铠甲"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[5] = 155
		wds[11] = "物品图标.wdf"
		wds[12] = 524242583
		wds[13] = 2617390472.0
	elseif wd == "通灵神戒" then
		wds[1] = "具有神奇力量的戒指，召唤兽佩带后可获得强大的力量。"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 2
		wds[5] = 0
		wds[11] = "火影.wdf"
		wds[12] = 264
		wds[13] = 265
	elseif wd == "通灵神臂" then
		wds[1] = "具有神奇力量的护臂，召唤兽佩带后可获得强大的力量。"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 2
		wds[5] = 0
		wds[11] = "火影.wdf"
		wds[12] = 272
		wds[13] = 273
	elseif wd == "通灵神符" then
		wds[1] = "具有神奇力量的护符，召唤兽佩带后可获得强大的力量。"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 2
		wds[5] = 0
		wds[11] = "火影.wdf"
		wds[12] = 276
		wds[13] = 277
	elseif wd == "竹编护腕" then
		wds[1] = "竹子做的护腕，可以起到伤害力"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1408822181
		wds[13] = 2157708488.0
	elseif wd == "皮腕" then
		wds[1] = "皮布做的护腕，可以起到伤害力"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 15
		wds[11] = "物品图标.wdf"
		wds[12] = 862596806
		wds[13] = 2834822848.0
	elseif wd == "针腕" then
		wds[1] = "针做的护腕，可以起到伤害力"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 25
		wds[11] = "物品图标.wdf"
		wds[12] = 3248808566.0
		wds[13] = 472447855
	elseif wd == "骨镯" then
		wds[1] = "骨头做的护腕，可以起到伤害力"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 35
		wds[11] = "物品图标.wdf"
		wds[12] = 1197998449
		wds[13] = 3679624742.0
	elseif wd == "青铜护腕" then
		wds[1] = "铜做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 45
		wds[11] = "物品图标.wdf"
		wds[12] = 355149374
		wds[13] = 2634874482.0
	elseif wd == "玛瑙护腕" then
		wds[1] = "玛缁做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 55
		wds[11] = "物品图标.wdf"
		wds[12] = 3007339583.0
		wds[13] = 3717112991.0
	elseif wd == "琉璃护腕" then
		wds[1] = "琉璃的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 65
		wds[11] = "物品图标.wdf"
		wds[12] = 1069097956
		wds[13] = 3349215227.0
	elseif wd == "镂空银镯" then
		wds[1] = "银做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 75
		wds[11] = "物品图标.wdf"
		wds[12] = 3082110275.0
		wds[13] = 3781752769.0
	elseif wd == "笼玉镯" then
		wds[1] = "玉做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 85
		wds[11] = "物品图标.wdf"
		wds[12] = 813354899
		wds[13] = 0xFEE14584
	elseif wd == "嵌宝金腕" then
		wds[1] = "金做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 95
		wds[11] = "物品图标.wdf"
		wds[12] = 3180910965.0
		wds[13] = 2826073060.0
	elseif wd == "玳瑁护腕" then
		wds[1] = "玳瑁做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 105
		wds[11] = "物品图标.wdf"
		wds[12] = 2446137013.0
		wds[13] = 188760799
	elseif wd == "七星宝腕" then
		wds[1] = "寒冰沂蒙精心给大家的护腕，戴上这个可以秒天秒地秒空气"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 115
		wds[11] = "物品图标.wdf"
		wds[12] = 770473038
		wds[13] = 361633315
	elseif wd == "缚龙筋" then
		wds[1] = "龙筋做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 125
		wds[11] = "物品图标.wdf"
		wds[12] = 1671231141
		wds[13] = 3934076700.0
	elseif wd == "凤翎护腕" then
		wds[1] = "凤凰的羽毛做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 135
		wds[11] = "物品图标.wdf"
		wds[12] = 1520923728
		wds[13] = 3501233104.0
	elseif wd == "织锦彩带" then
		wds[1] = "锦做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 145
		wds[11] = "物品图标.wdf"
		wds[12] = 426710040
		wds[13] = 4049294130.0
	elseif wd == "冰蚕丝带" then
		wds[1] = "冰蚕丝做的护腕"
		wds[2] = 2
		wds[3] = 7
		wds[4] = 1
		wds[5] = 155
		wds[11] = "物品图标.wdf"
		wds[12] = 669823245
		wds[13] = 3491081774.0
	elseif wd == "玄冰刺" then
		wds[1] = "吸玄冰阴寒之气，可以直透骨骸"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 50
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3220766446.0
		wds[13] = 1038526054
	elseif wd == "鲫鱼" then
		wds[1] = "体态雍容,有鱼中君子之称"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 6
		wds[11] = "物品图标.wdf"
		wds[12] = 392448174
		wds[13] = 3721203032.0
	elseif wd == "震天锤" then
		wds[1] = "寒钢制成的锤头巨大沉重，一击之下威势震天"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 60
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1233600514
		wds[13] = 3915438961.0
	elseif wd == "百折扇" then
		wds[1] = "采用非常多的扇骨，扇面百折，非常坚固"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 40
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 742792031
		wds[13] = 972230490
	elseif wd == "缨络丝带" then
		wds[1] = "红色的缨络结成的丝带，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 40
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1901332626
		wds[13] = 1222266422
	elseif wd == "腰带" then
		wds[1] = "一条普通的腰带，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 581742663
		wds[13] = 1978200666
	elseif wd == "钢甲" then
		wds[1] = "用精钢制成的铠甲，防御能力较强"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 50
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1672609844
		wds[13] = 1862358389
	elseif wd == "宝雕长弓" then
		wds[1] = "乌木长弓，弓身镌刻之宝雕，栩栩如生，振翅欲飞。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 30
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2253432731.0
		wds[13] = 1106872316
	elseif wd == "金丝魔棒" then
		wds[1] = "棒身缠以金丝，显得华丽"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 10
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2190248338.0
		wds[13] = 850861563
	elseif wd == "炼妖石" then
		wds[1] = "从仙界散落到人间的“灵”石，拥有强烈的吸附能量的能力。"
		wds[2] = 3
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 94724302
		wds[13] = 164529735
	elseif wd == "上古锻造图策" then
		wds[1] = "古代的典籍，详细记录了各种护具的锻造方法。"
		wds[2] = 3
		wds[3] = 10
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2674496506.0
		wds[13] = 4063731585.0
	elseif wd == "天眼珠" then
		wds[1] = "吸收了一定的生物潜能，在经过特别的处理后可将潜能转化到召唤兽装备上。"
		wds[2] = 3
		wds[3] = 11
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3533594318.0
		wds[13] = 2241593860.0
	elseif wd == "三眼天珠" then
		wds[1] = "吸收了较多的生物潜能，在经过特别的处理后可将潜能转化到召唤兽装备上。"
		wds[2] = 3
		wds[3] = 11
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 153
		wds[13] = 256
	elseif wd == "九眼天珠" then
		wds[1] = "完全吸收了生物的潜能，在经过特别的处理后可将潜能转化到召唤兽装备上。"
		wds[2] = 3
		wds[3] = 11
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 151
		wds[13] = 152
	elseif wd == "大闸蟹" then
		wds[1] = "右键使用可以增加15点积分"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2720292819.0
		wds[13] = 2971511263.0
	elseif wd == "马靴" then
		wds[1] = "皮制的马靴，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 3241248586.0
		wds[13] = 3542020689.0
	elseif wd == "藤圈" then
		wds[1] = "藤条围成的项圈，可以起到防御作用"
		wds[2] = 2
		wds[3] = 8
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 4170754053.0
		wds[13] = 2301647242.0
	elseif wd == "侠客履" then
		wds[1] = "非常强的鞋，速度和防御作用都属上品"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 30
		wds[11] = "物品图标.wdf"
		wds[12] = 32184820
		wds[13] = 558037323
	elseif wd == "八卦坠" then
		wds[1] = "以八卦制成的饰物，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1357232476
		wds[13] = 3364357037.0
	elseif wd == "细木棒" then
		wds[1] = "看似细小却有不小的威力，可以当作兵器防身"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3647840943.0
		wds[13] = 445770073
	elseif wd == "大黄鱼" then
		wds[1] = "常见于近海深水区域，身型修长"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 2350785153.0
		wds[13] = 2912558181.0
	elseif wd == "牛筋鞭" then
		wds[1] = "以上等牛筋制成，弹性极佳，抽之有破空之声"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 10
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 156247531
		wds[13] = 2779337532.0
	elseif wd == "夜魔披风" then
		wds[1] = "来自阴间的披风，隐隐透出神秘的幽冥气息"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 60
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2191193414.0
		wds[13] = 1388622524
	elseif wd == "苍魂珠" then
		wds[1] = "据说珠里附有魂魄，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 30
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFC948E76
		wds[13] = 1893159766
	elseif wd == "护身符" then
		wds[1] = "一块护身符，佩带在身上有一定法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2460748358.0
		wds[13] = 359787750
	elseif wd == "烈焰锤" then
		wds[1] = "锤面上制造了不少火焰波浪一般的锋刃，可怕的武器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 40
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1937110983
		wds[13] = 2558099166.0
	elseif wd == "锁子甲" then
		wds[1] = "胸部是铁环，如铁锁加身，防御力相当不错"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 30
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2078226169
		wds[13] = 2963205363.0
	elseif wd == "苗刀" then
		wds[1] = "苗疆常用的兵器，极细极尖锐"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 10
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 183813784
		wds[13] = 3883026774.0
	elseif wd == "青铜斧" then
		wds[1] = "以硬木和青铜制造的大斧，是常用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1194618546
		wds[13] = 1823715223
	elseif wd == "麻衣" then
		wds[1] = "麻布制成的衣服，可以起到防御作用"
		wds[2] = 2
		wds[3] = 9
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3547852010.0
		wds[13] = 276685974
	elseif wd == "精钢日月圈" then
		wds[1] = "精钢打造的圆环，外缘锋利"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 10
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2611939848.0
		wds[13] = 523588802
	elseif wd == "小黄鱼" then
		wds[1] = "也称黄花鱼，喜欢在近海底层结群活动，是常见的海产鱼类"
		wds[2] = 10
		wds[3] = 2
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 3155849929.0
		wds[13] = 1939631478
	elseif wd == "方巾" then
		wds[1] = "普通人常带的帽子"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFAA7B82D
		wds[13] = 266830706
	elseif wd == "青刚刺" then
		wds[1] = "寒刚玉所制，坚硬无比，可断金"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 60
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1950914816
		wds[13] = 414938796
	elseif wd == "蛇形月" then
		wds[1] = "划动时锋刃似盘卷的黑蛇，令人防不胜防"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 60
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3576968772.0
		wds[13] = 2783575959.0
	elseif wd == "银腰带" then
		wds[1] = "银制的腰带，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 3920753159.0
		wds[13] = 1636787949
	elseif wd == "镔铁锤" then
		wds[1] = "镔铁打造的锤是价廉而常被采用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 10
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2560759534.0
		wds[13] = 2680776140.0
	elseif wd == "如意宝珠" then
		wds[1] = "琅嬛福地生香橼，百年方熟，熟而坠地，化为如意宝珠，鲜明莹洁，祥瑞兆也。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 60
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1237441752
		wds[13] = 296013680
	elseif wd == "青龙牙" then
		wds[1] = "龙牙状的尖刺，可以透入坚固的衣甲"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 30
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3410109601.0
		wds[13] = 2844091192.0
	elseif wd == "曲柳杖" then
		wds[1] = "柳木雕凿的法杖，蕴含一点法力，适合新手使用"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 214558735
		wds[13] = 1713378827
	elseif wd == "狼牙锤" then
		wds[1] = "锤面密布狼牙细齿，杀伤力不可小视"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 30
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 575451669
		wds[13] = 3613953095.0
	elseif wd == "莲华珠" then
		wds[1] = "来自天竺佛国的灵巧宝珠，晶莹圆润，光华四溢，置于水中，可化作轻盈莲花，净水生香。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 40
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 121754786
		wds[13] = 3809551301.0
	elseif wd == "翡翠珠" then
		wds[1] = "南蛮之地进献之翡翠，经能工巧匠九琢九磨，方成玲珑宝珠，通体翠绿凝碧，触手冰凉，仿似有仙气缭绕。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 30
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3824352456.0
		wds[13] = 3517783128.0
	elseif wd == "玉腰弯弓" then
		wds[1] = "柘木宝弓嵌以碧绿美玉，质坚且韧，精准凌厉。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 50
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3397522151.0
		wds[13] = 106500071
	elseif wd == "包子" then
		wds[1] = "精面粉制作的肉包子味道非常好"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1457520669
		wds[13] = 1302655530
		wds[14] = 100
	elseif wd == "女儿红" then
		wds[1] = "名酒，酒香浓烈"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 785089880
		wds[13] = 1597465172
		wds[14] = 100
	elseif wd == "臭豆腐" then
		wds[1] = "虽然闻起来有些臭，吃起来很香的。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 2114546240
		wds[13] = 3426751509.0
		wds[14] = 100
	elseif wd == "烤鸭" then
		wds[1] = "北方特产，油滑可口"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 2416023768.0
		wds[13] = 2853699328.0
		wds[14] = 100
	elseif wd == "烤肉" then
		wds[1] = "烤出的肉，非常好吃"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 2001803179
		wds[13] = 164960309
		wds[14] = 100
	elseif wd == "佛跳墙" then
		wds[1] = "东吴名厨创制的一道菜，味道鲜美。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1990656664
		wds[13] = 32632136
		wds[14] = 100
	elseif wd == "翡翠豆腐" then
		wds[1] = "名厨名菜，炒得色香味美全。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 299271567
		wds[13] = 829957946
		wds[14] = 100
	elseif wd == "桂花丸" then
		wds[1] = "糯米和桂花制成的食品。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 3435714564.0
		wds[13] = 3751448491.0
		wds[14] = 100
	elseif wd == "资质丸" then
		wds[1] = "可以提高召唤兽资质成长的神奇丹药。"
		wds[2] = 3
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 6
		wds[13] = 7
	elseif wd == "豆斋果" then
		wds[1] = "素食品，豆面制成的各种水果。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 3931036008.0
		wds[13] = 1477643699
		wds[14] = 100
	elseif wd == "长寿面" then
		wds[1] = "一碗热气腾腾的长寿面条。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 2568288315.0
		wds[13] = 3311739653.0
		wds[14] = 100
	elseif wd == "珍露酒" then
		wds[1] = "用露水酿制的美酒。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1911833707
		wds[13] = 4026295227.0
		wds[14] = 100
	elseif wd == "梅花酒" then
		wds[1] = "梅花泡成的酒，有梅花的清香。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1904089599
		wds[13] = 4174821416.0
		wds[14] = 100
	elseif wd == "蛇胆酒" then
		wds[1] = "用蛇胆泡的美酒，具有药性。"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1711747229
		wds[13] = 1738790932
		wds[14] = 100
	elseif wd == "虎骨酒" then
		wds[1] = "虎骨泡成的酒，具有药性"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 3446660919.0
		wds[13] = 1185236114
		wds[14] = 100
	elseif wd == "百味酒" then
		wds[1] = "泡了上百味药品的药酒"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 531084138
		wds[13] = 0xFFB20F40
		wds[14] = 100
	elseif wd == "醉生梦死" then
		wds[1] = "仙酒，瑶池会的必备佳酿"
		wds[2] = 1
		wds[3] = 4
		wds[4] = 1
		wds[8] = 1
		wds[9] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 3981927301.0
		wds[13] = 724140283
		wds[14] = 100
	elseif wd == "天香披肩" then
		wds[1] = "瑶台玉女穿的披肩，有相当的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 40
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3709034410.0
		wds[13] = 3803079314.0
	elseif wd == "琉璃珠" then
		wds[1] = "三色琉璃熔成的宝珠，轻盈剔透，适合新手携带"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2607779407.0
		wds[13] = 3954061095.0
	elseif wd == "连珠神弓" then
		wds[1] = "玲珑连珠，发机如电，一发连五，绝无虚矢。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 60
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4094037333.0
		wds[13] = 2641579130.0
	elseif wd == "点金棒" then
		wds[1] = "华丽的蛇形棒，相传作法之人常用其点石成金"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 30
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3187022651.0
		wds[13] = 2074779560
	elseif wd == "錾金宝弓" then
		wds[1] = "黑檀宝弓，经巧匠之手精雕细錾，华贵不可方物。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 40
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 234218100
		wds[13] = 706673394
	elseif wd == "铁胆弓" then
		wds[1] = "硬木制成的弓箭，背嵌铁条，射程很远。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 10
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1814282557
		wds[13] = 2181027484.0
	elseif wd == "鹰眼法杖" then
		wds[1] = "孤鹰展翅，划破长空，依照孤鹰之形打造的法杖，蕴含神奇法力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 50
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3849435987.0
		wds[13] = 2058809879
	elseif wd == "金背大砍刀" then
		wds[1] = "刀身挺直，以黄金镶背，刀道沉猛"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 30
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1741978907
		wds[13] = 3104242640.0
	elseif wd == "佛光舍利子" then
		wds[1] = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
		wds[2] = 1
		wds[3] = 2
		wds[4] = 3
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 529664613
		wds[13] = 362856580
		wds[14] = 15000
	elseif wd == "黑玉云苓膏" then
		wds[1] = "用名贵药材熬制的奇妙药膏,温润如黑玉,具有补充魔法功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 4067345700.0
		wds[13] = 2689045672.0
	elseif wd == "金石返魂丹" then
		wds[1] = "传说是根据华佗遗留的药方炼制而成的丹药,具有补充气血、疗伤和起死回生的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 3790953042.0
		wds[13] = 394039043
	elseif wd == "百炼金乌丸" then
		wds[1] = "经过百次炼制的名贵丹药,具有补充气血的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 3896353632.0
		wds[13] = 3289328619.0
	elseif wd == "生骨续命膏" then
		wds[1] = "用名贵中药熬制七七四十九日而成的药膏,具有补充气血、疗伤和起死回生的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 3403404761.0
		wds[13] = 3403404760.0
	elseif wd == "回春龙沙散" then
		wds[1] = "细如金沙却有回春神效的名贵丹药,具有疗伤的功效,且可以解除封类、酒类、毒类以外的常规异常效果。,具有补充气血的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 4141186746.0
		wds[13] = 1264673554
	elseif wd == "紫心玉露丸" then
		wds[1] = "传说是太上老君丹药炉中炼制出来的名贵丹药,具有补充气血的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 0xFEC469AF
		wds[13] = 939586206
		wds[14] = 20000
	elseif wd == "无极丝" then
		wds[1] = "天地无极尽收于其间"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 30
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 85830180
		wds[13] = 4066138115.0
	elseif wd == "海星" then
		wds[1] = "生活在深海，因身型呈五角星状而得名"
		wds[2] = 10
		wds[3] = 3
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 320725587
		wds[13] = 1259406158
	elseif wd == "牛皮靴" then
		wds[1] = "牛皮缝制的靴子，速度和防御作用都比较强"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 10
		wds[11] = "物品图标.wdf"
		wds[12] = 4095390557.0
		wds[13] = 2232108129.0
	elseif wd == "鱼骨双剑" then
		wds[1] = "剑身似鱼骨，长满倒钩刺"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 50
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 741866499
		wds[13] = 1761353936
	elseif wd == "赤炎环" then
		wds[1] = "环边有锯齿，如太阳之火焰"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 50
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 692700444
		wds[13] = 609650976
	elseif wd == "珍珠链" then
		wds[1] = "一串珍珠，佩带在身上有一定法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 2451318875.0
		wds[13] = 0xFC424978
	elseif wd == "牛皮鞭" then
		wds[1] = "用牛皮制的皮鞭，很容易得到的练习用品"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1637717692
		wds[13] = 799104265
	elseif wd == "布帽" then
		wds[1] = "布制，普通人家使用的头冠"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 10
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2131362658
		wds[13] = 1813515840
	elseif wd == "彩果" then
		wds[1] = "神奇的果子，可以改变角色的造型"
		wds[2] = 8
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 567106113
		wds[13] = 0xFD6C9733
	elseif wd == "青藤柳叶鞭" then
		wds[1] = "采深山古藤制成，上缚柳叶刀片，刀光闪动，杀气逼人"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 60
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 962191784
		wds[13] = 996954971
	elseif wd == "铁面扇" then
		wds[1] = "连扇面也用铁片构成，更易格挡，晃动可出声，乱敌耳目"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 30
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3848744867.0
		wds[13] = 2633687797.0
	elseif wd == "八棱金瓜" then
		wds[1] = "锤似金瓜，八棱突起，是实用的战锤"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 20
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2288044564.0
		wds[13] = 959970229
	elseif wd == "幻彩银纱" then
		wds[1] = "上等蚕丝与银丝混织成的纱带"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 10
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3727411355.0
		wds[13] = 1872145487
	elseif wd == "精钢扇" then
		wds[1] = "精钢制的扇骨，可以格挡锋利的兵器攻击"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 20
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 742558490
		wds[13] = 208678969
	elseif wd == "鱼竿" then
		wds[1] = "用于垂钓的工具"
		wds[2] = 10
		wds[3] = 4
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2523388870.0
		wds[13] = 1932648737
	elseif wd == "黄宝石" then
		wds[1] = "闪耀着金色光彩的宝石，代表友情、友爱与希望；传说有着护主的奇效。\n增加4*宝石等级%的雷系法术吸收率\n【镶嵌对象】饰品、鞋子"
		wds[2] = 12
		wds[3] = 4
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2523388870.0
		wds[13] = 1932648737
	elseif wd == "珍珠头带" then
		wds[1] = "珍珠结成的头带，非常好看女性饰品，可以起到防御作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 30
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3660503604.0
		wds[13] = 1074719537
	elseif wd == "紧身衣" then
		wds[1] = "紧身的皮衣，非常轻便，有不错的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 40
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2338366605.0
		wds[13] = 4031115015.0
	elseif wd == "曲尖枪" then
		wds[1] = "采用上等合木，枪尖九曲，是常用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 10
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3971589602.0
		wds[13] = 632407849
	elseif wd == "劈水扇" then
		wds[1] = "挥舞之下可使狂风止，水断流"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 50
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1676697803
		wds[13] = 108510315
	elseif wd == "狼牙刀" then
		wds[1] = "精钢打造，刀背密布狼牙锯齿"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 60
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2655796221.0
		wds[13] = 295875160
	elseif wd == "追星踏月" then
		wds[1] = "非由于鞋上有云月图案而得名，有不错的防御力"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1891477910
		wds[13] = 4017464926.0
	elseif wd == "黄金剑" then
		wds[1] = "真金铸脊，精钢淬锋，其光灿烂夺人眼，魔障远避不及；沉于渭水，可镇河魔。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 50
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2052074173
		wds[13] = 1174324866
	elseif wd == "松木锤" then
		wds[1] = "松木质轻，制成的锤主要作练习用"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 753815448
		wds[13] = 3891646017.0
	elseif wd == "天蚕丝带" then
		wds[1] = "以名贵天蚕丝制成，可通生命之灵气"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 40
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 794010110
		wds[13] = 140768110
	elseif wd == "金丝彩带" then
		wds[1] = "金丝与彩缎编成的丝带"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 20
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3086295697.0
		wds[13] = 81211738
	elseif wd == "红缨枪" then
		wds[1] = "白腊木制成的枪杆，柔韧有弹性"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3032516444.0
		wds[13] = 661869979
	elseif wd == "琥珀腰链" then
		wds[1] = "用琥珀制的腰链，能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 40
		wds[11] = "物品图标.wdf"
		wds[12] = 1085821316
		wds[13] = 4041311819.0
	elseif wd == "簪子" then
		wds[1] = "女孩子们喜欢的簪子，可以起到防御作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1004476789
		wds[13] = 2338230752.0
	elseif wd == "金柳露" then
		wds[1] = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效，是用来炼妖的神奇物品。可以把怪物变成0级#Y/(有概率变异)。"
		wds[2] = 3
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2911364506.0
		wds[13] = 1443777343
	elseif wd == "羊角盔" then
		wds[1] = "以羊角为装饰的盔，有非常强的防御力"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 50
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 48596533
		wds[13] = 1115249525
	elseif wd == "火焰枪" then
		wds[1] = "以火焰状的精铁代替枪缨，焰缘锋利无比"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 40
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 382126947
		wds[13] = 2230233436.0
	elseif wd == "九宫坠" then
		wds[1] = "以九宫制成的坠子，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 40
		wds[11] = "物品图标.wdf"
		wds[12] = 1591157328
		wds[13] = 2581108802.0
	elseif wd == "柳叶刀" then
		wds[1] = "形如柳叶的细弯刀"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1159059801
		wds[13] = 388221160
	elseif wd == "竹节双剑" then
		wds[1] = "精钢制成，剑身似竹节般伸长"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 30
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1329171010
		wds[13] = 2218313214.0
	elseif wd == "龙泉剑" then
		wds[1] = "精铁铸造，又以龙泉之水淬制，上刻青龙，其利无比。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 40
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3230696706.0
		wds[13] = 3094355456.0
	elseif wd == "双短剑" then
		wds[1] = "青铜制的双短剑，制造简单，是练习常用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3212246691.0
		wds[13] = 1334943898
	elseif wd == "布鞋" then
		wds[1] = "布缝制的鞋子，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2418869371.0
		wds[13] = 2669010133.0
	elseif wd == "赤焰双剑" then
		wds[1] = "剑身赤红，齿如焰苗窜动，有一股刚烈之势"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 60
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1459131170
		wds[13] = 1669329241
	elseif wd == "青锋剑" then
		wds[1] = "剑长三尺，用起来方便灵活，是常用的兵器"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 30
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3995192813.0
		wds[13] = 1523776943
	elseif wd == "五色缎带" then
		wds[1] = "五色蚕丝织成的彩缎"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 964324271
		wds[13] = 359839285
	elseif wd == "精钢禅钺" then
		wds[1] = "精钢打造，环随舞动，铿锵入耳，震人心魄"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 40
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFE6F55DE
		wds[13] = 1201979768
	elseif wd == "玉竹金铃" then
		wds[1] = "由玉制的竹节联结而成,节间缚着金铃,铃随鞭动,声声悦耳"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 50
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 462481146
		wds[13] = 478344459
	elseif wd == "金刺轮" then
		wds[1] = "由多片精铁打造的极薄的锋刃组成，刃口白光闪闪"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 30
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1780092674
		wds[13] = 2925351135.0
	elseif wd == "游龙剑" then
		wds[1] = "剑体九曲如龙形，覆鳞片，手弹其锋刃，鸣如龙吟。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 60
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3272689235.0
		wds[13] = 2801949288.0
	elseif wd == "钢结鞭" then
		wds[1] = "以细钢环联结起一个个钢条，柔中带刚"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 30
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3232417863.0
		wds[13] = 2274385367.0
	elseif wd == "满天星" then
		wds[1] = "棒头细密的镶嵌了无数宝石，闪闪发光，似满天星辰"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 60
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3427188370.0
		wds[13] = 1777161115
	elseif wd == "吴越剑" then
		wds[1] = "吴越之地产名剑，极其锐利"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 20
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2309179882.0
		wds[13] = 118455348
	elseif wd == "锯齿矛" then
		wds[1] = "枪尖三陷三突，枪杆红绸缠绕，彩缨闪动令人眼花瞭乱"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 20
		wds[7] = {
			"神天兵",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2315151120.0
		wds[13] = 1069998337
	elseif wd == "布衣" then
		wds[1] = "普通的布衣，可以起到防御的作用"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2686301321.0
		wds[13] = 2162639125.0
	elseif wd == "水晶腰带" then
		wds[1] = "佩带在腰间的水晶腰带，能起到不错的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 30
		wds[11] = "物品图标.wdf"
		wds[12] = 588758831
		wds[13] = 684918234
	elseif wd == "乌龙鞭" then
		wds[1] = "以鲨鱼皮制成，表皮毛糙，极其坚韧"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 20
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3122588387.0
		wds[13] = 3141830232.0
	elseif wd == "鳞甲" then
		wds[1] = "用铁鳞制成的铠甲，有相当的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 20
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 391851478
		wds[13] = 2281395560.0
	elseif wd == "铁齿剑" then
		wds[1] = "铁制的短剑，边缘带齿"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 10
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3620311050.0
		wds[13] = 2592140397.0
	elseif wd == "熊胆" then
		wds[1] = "千年熊罴的胆"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 2
		wds[9] = 200
		wds[11] = "物品图标.wdf"
		wds[12] = 1374442124
		wds[13] = 278044265
		wds[14] = 1250
	elseif wd == "水晶帽" then
		wds[1] = "水晶制成的帽子，因为坚硬，有相当强的防御力"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 60
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 606790429
		wds[13] = 2525896057.0
	elseif wd == "金蛇信" then
		wds[1] = "神木制杆，弯曲似蛇形，金枪透甲，腥红双叉似金蛇出信"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 70
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3443351294.0
		wds[13] = 2134413363
	elseif wd == "丈八点钢矛" then
		wds[1] = "通体百精纯钢，如天雷击落、蛟龙出海"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 80
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 853333771
		wds[13] = 2376999944.0
	elseif wd == "暗夜" then
		wds[1] = "通体乌黑,极细的枪尖无形中直抵咽喉,如暗夜中引魂之手"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 90
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2297122969.0
		wds[13] = 4085619601.0
	elseif wd == "梨花" then
		wds[1] = "锋刃五裂似梨花绽放,粉红的枪缨银白的枪,尽显潇洒风流"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 100
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1491619643
		wds[13] = 3901170806.0
	elseif wd == "霹雳" then
		wds[1] = "以万古溶岩之火锤炼，枪杆似古树盘结，枪尖似雷霆霹雳"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 100
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1553552793
		wds[13] = 1828152464
	elseif wd == "刑天之逆" then
		wds[1] = "刑天应劫而出，劫分天兵火水土，此即为其应兵劫之武器。形长两丈，刃如月牙，锋似寒星，身雕百龙蟠纹，挥舞直欲搅碎银汉，号为枪中霸君。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 120
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3591831101.0
		wds[13] = 3656521229.0
	elseif wd == "五虎断魂" then
		wds[1] = "出如虎奔，刺如虎爪，扫如虎尾，锁如虎噬，声如虎啸；使敌魂断胆破，不战自溃，谓之“五虎断魂”，有枪中王者之气。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 130
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1491403685
		wds[13] = 1403609878
	elseif wd == "飞龙在天" then
		wds[1] = "曾为文殊菩萨降妖密宝，如今幻化为一杆金龙宝枪。此枪掷出可化为飞龙，从万丈高空俯冲而下，撕碎敌人。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 140
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4100462769.0
		wds[13] = 3889305017.0
	elseif wd == "天龙破城" then
		wds[1] = "天外陨石炼九日九夜，雷生地底、天坠神龙，乃成此戟。霸王项羽持之横行当世，睥睨天下，故名“天龙破城”。霸王既殁，佚于乌江，龙衔乃出。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 150
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1375567358
		wds[13] = 1041126896
	elseif wd == "弑皇" then
		wds[1] = "炎黄之战，杀怨之气俱归此兵。黄帝得胜，以此兵祭祀天地，誓曰:若治下三界失靖、四海不宁，则天下之人皆可持此兵取吾之首级！"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 1
		wds[5] = 160
		wds[7] = {
			"龙太子",
			"神天兵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 439395128
		wds[13] = 127581936
	elseif wd == "狂魔镰" then
		wds[1] = "沉于万魔之地，染魔性，映魔心，挥之即魔瘴四起"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 70
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2105378421
		wds[13] = 1325914922
	elseif wd == "恶龙之齿" then
		wds[1] = "寒钢为柄，龙齿为刃，风过龙鸣，摄破敌胆"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 80
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2656260066.0
		wds[13] = 2796123546.0
	elseif wd == "破魄" then
		wds[1] = "集艳日与阴月之精华，挥舞如日月同晖，中者形神俱灭"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 90
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3159282811.0
		wds[13] = 0xFD0F0F8E
	elseif wd == "肃魂" then
		wds[1] = "吸取无尽黑暗之气，肃清无规、无序、无章之魂"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 100
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 762151134
		wds[13] = 484588212
	elseif wd == "无敌" then
		wds[1] = "斧杆以千年古木之根打造，盘桓虬曲；寒铁锻造的双面巨斧发出魔气逼人的暗光"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 110
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 872395348
		wds[13] = 3255150154.0
	elseif wd == "五丁开山" then
		wds[1] = "古蜀有五力士奉命凿通群山，见一大蛇尾在洞外，乃曳之出，其身长数十里。惊讶间，山崩，五丁与蛇俱死，化为神斧，执之者有开山之力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 120
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1781160921
		wds[13] = 354227088
	elseif wd == "元神禁锢" then
		wds[1] = "阴司轮转王司过之宝。若有鬼仙犯大恶，即以此物拟其头，吸尽元神，再无转生可能。细看刃缘，可见无数痛苦鬼脸。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 130
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1793469736
		wds[13] = 3058265679.0
	elseif wd == "护法灭魔" then
		wds[1] = "佛门护法之武器，柄为鲁班所雕吴刚伐桂之枝，斧为老君所炼炉中千年玄铁，上有佛门梵文，妖怪见之退避三舍。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 140
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3099472859.0
		wds[13] = 2571183494.0
	elseif wd == "碧血干戚" then
		wds[1] = "刑天与帝争神，身首异处，碧血零落，干缺戚残；后人冶于一炉乃得神兵。长戚舞处，风云雷动，碧波流转，巨盾透体而出，其鸣呜咽，如英雄泣。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 150
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3681089967.0
		wds[13] = 1076008261
	elseif wd == "裂天" then
		wds[1] = "蚩尤随身魔武之一，取大荒四极异兽骨所制，形如巨镰，镰刃淬海皇兽魂，隐然有嘶鸣之声，裂天笞地，割风断雨。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 2
		wds[5] = 160
		wds[7] = {
			"巨魔王",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3711850827.0
		wds[13] = 1944978391
	elseif wd == "北斗七星剑" then
		wds[1] = "精炼白金之铁铸造，有北斗七星之纹饰"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 70
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1102206433
		wds[13] = 2931293335.0
	elseif wd == "碧玉剑" then
		wds[1] = "以寒冰碧玉制成,剑身如竹节,刚硬无比,难得的奇珍之物"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 80
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3706066988.0
		wds[13] = 2167893769.0
	elseif wd == "鱼肠" then
		wds[1] = "上古名剑，细短柔软，可入鱼腹"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 90
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 703624793
		wds[13] = 3087768505.0
	elseif wd == "倚天" then
		wds[1] = "上古名剑，雾中山神铁所制，剑光如电，切金如泥"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 100
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1234219918
		wds[13] = 1100401070
	elseif wd == "湛卢" then
		wds[1] = "上古名剑，剑身宽大，湛然如墨，骨锻其脊，血淬其锋，成绝世名剑"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 100
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1556155532
		wds[13] = 559555740
	elseif wd == "魏武青虹" then
		wds[1] = "通体青亮如玉，长八尺余，可于千里外取人首级，吸血如虹。曾为魏王曹操配剑，后在战乱中失传，如今又重现江湖。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 120
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1705858659
		wds[13] = 2821638391.0
	elseif wd == "灵犀神剑" then
		wds[1] = "剑长七寸，有鼻有眼，与主人心有灵犀。常藏于宝葫芦内，主人有令，则出三丈白光扣敌泥丸宫，尽斩仙魔鬼神。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 130
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2712960569.0
		wds[13] = 866429909
	elseif wd == "四法青云" then
		wds[1] = "上有符印，分别为地，火，风，水四字。挥舞时天昏地暗，火蛇狂舞，飞沙走石，龙腾海啸。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 140
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1749029011
		wds[13] = 1989171435
	elseif wd == "霜冷九州" then
		wds[1] = "冰晶雪魄，浑然天成；出则霜华满地，朔风回舞。其气凛冽，砭人肌骨；其意萧条，山川寂寥。乃天下至寒至洁之物，惟赤子心可驭之。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 150
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2892720118.0
		wds[13] = 1286710645
	elseif wd == "擒龙" then
		wds[1] = "上古魔神所铸神兵，可抗八部天龙。型如鱼骨，伸缩随心；刃化千万剑丝，柔如春蚕吐丝，韧如天地经纬。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 160
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1088458361
		wds[13] = 3004473909.0
	elseif wd == "墨玉双剑" then
		wds[1] = "体采寒冰墨玉所制，暗光流动"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 70
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3841664619.0
		wds[13] = 3428424501.0
	elseif wd == "梅花双剑" then
		wds[1] = "千年古木所制，剑似梅枝"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 80
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 956549407
		wds[13] = 353661251
	elseif wd == "阴阳" then
		wds[1] = "赤阳之铁成阳，玄冰之玉成阴，两仪相生，气韵非凡"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 90
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2351851050.0
		wds[13] = 2463244045.0
	elseif wd == "月光双环" then
		wds[1] = "清明无暇，似映月之光"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 100
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3562014914.0
		wds[13] = 2953019352.0
	elseif wd == "灵蛇" then
		wds[1] = "采千年寒冰碧玉制成，通体碧绿，剑出似灵蛇出洞"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 100
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3192742770.0
		wds[13] = 1950373522
	elseif wd == "金龙双剪" then
		wds[1] = "传说乃是一对金龙所化，头并头如剑，尾交尾如股。从半空中呼啸而下，一绞之力无人能挡。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 120
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2674540671.0
		wds[13] = 2242603958.0
	elseif wd == "连理双树" then
		wds[1] = "一对痴情男女坟前精魂所化双树，攀枝连理，象征在世虽不能合枕，来世愿永无分离。以此木为剑，因至情贯其中，也可成绕指柔，也可以断金玉。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 130
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 835871520
		wds[13] = 1841177480
	elseif wd == "祖龙对剑" then
		wds[1] = "三国时蜀帝刘备所用双剑。据说一为白龙所化，一为赤龙所化。白龙乃是秦皇，赤龙乃是汉祖。执之者当有九五之尊。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 140
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFD9838FC
		wds[13] = 3430248664.0
	elseif wd == "紫电青霜" then
		wds[1] = "鸿蒙灵气所钟，诸天精魄所禳。异器天生，一派自然。紫电稚弱，性如婴孩；青霜老沉，俨如兄长。翛忽隐现，捷如流星，啾啾呢喃，紫燕青虬。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 150
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1921395100
		wds[13] = 3349222718.0
	elseif wd == "浮犀" then
		wds[1] = "九天玄女以夔牛之角所制双剑，锋锐无双，轻如无物，曾助黄帝擒杀蚩尤。其上书天书密咒，丹血为文，翠莹如碧。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 160
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3650328746.0
		wds[13] = 2262501629.0
	elseif wd == "缚神绫" then
		wds[1] = "丝带可紧可松，传言可缚神灵"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 70
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2774766030.0
		wds[13] = 316900368
	elseif wd == "九天仙绫" then
		wds[1] = "存于九天，吸日月玄灵"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 80
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 812342002
		wds[13] = 262652275
	elseif wd == "彩虹" then
		wds[1] = "以七彩天蚕丝制成，似天边彩虹"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 90
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1130709640
		wds[13] = 3920434794.0
	elseif wd == "流云" then
		wds[1] = "流光溢彩，似天边云彩幻生幻灭"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 100
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1567038678
		wds[13] = 2712300537.0
	elseif wd == "碧波" then
		wds[1] = "聚海之灵气，碧波起，天地清"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 100
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3222386953.0
		wds[13] = 2391803383.0
	elseif wd == "秋水落霞" then
		wds[1] = "“落霞与孤鹜齐飞，秋水共长天一色。”此带乃天女掬长空之色，染落霞之艳织成。展开绚烂无比，使人俗念顿消，心无点尘。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 120
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 604608093
		wds[13] = 1182432751
	elseif wd == "晃金仙绳" then
		wds[1] = "“此物可随主人意捆住神仙魔怪，令其不能再施展变化之术。且此绳坚韧异常，火烧刀砍不断。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 130
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 730252838
		wds[13] = 2065742633
	elseif wd == "此最相思" then
		wds[1] = "“道是无情却有情，从来最苦是相思。”此物乃太虚幻境警幻仙子敕令还情债之物，一旦缠住，至死方休；虽有金石心，也顿为绕指柔，神仙难逃。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 140
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1161776179
		wds[13] = 1438567800
	elseif wd == "揽月摘星" then
		wds[1] = "翩若惊鸿，婉若游龙，仿佛兮若轻云之蔽月，飘飖兮若流风之回雪。三垣为画布，此带为软毫，可清夜起舞，拟为漫天星宿平添花鸟虫鱼。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 150
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3130490807.0
		wds[13] = 1909699944
	elseif wd == "九霄" then
		wds[1] = "九霄澄云所凝，诸天护佑，乾坤氤氲。形随意动，其高则冠盖乎九霄，其旷则笼罩乎八隅，祥瑞纷现，异香扑鼻。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 5
		wds[5] = 160
		wds[7] = {
			"舞天姬",
			"玄彩娥",
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3468947580.0
		wds[13] = 3104627686.0
	elseif wd == "华光刺" then
		wds[1] = "百炼纯钢打造，华光刺目"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 70
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1028689229
		wds[13] = 127658579
	elseif wd == "龙鳞刺" then
		wds[1] = "金色似龙鳞的针刺"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 80
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 111030939
		wds[13] = 1177500748
	elseif wd == "撕天" then
		wds[1] = "天如幕，白光起，破九重天"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 90
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3339488013.0
		wds[13] = 1471615949
	elseif wd == "毒牙" then
		wds[1] = "恐惧，只有经历无尽虚空中袭来的毒牙才知其真意"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 100
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3832046145.0
		wds[13] = 3854364995.0
	elseif wd == "胭脂" then
		wds[1] = "血红的颜色，胭脂的香气，将缤纷的灵魂凝结为黑白"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 100
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3460551634.0
		wds[13] = 3441823945.0
	elseif wd == "九阴勾魂" then
		wds[1] = "爪有九刺，阴寒冷酷，破颅勾魂，使正道名门闻之色变。为地藏王所得，将要销毁，不知何人盗出，又重现江湖。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 120
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 393789023
		wds[13] = 3180402786.0
	elseif wd == "雪蚕之刺" then
		wds[1] = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 130
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2033558106
		wds[13] = 712813114
	elseif wd == "贵霜之牙" then
		wds[1] = "昆仑山雪蚕之毒毛所化，坚硬非常，穿犀牛皮如针穿薄纱，瞬间透入；刺中后使人身中热毒，如在灼热地狱之中。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 140
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3540442244.0
		wds[13] = 989722994
	elseif wd == "忘川三途" then
		wds[1] = "忘川为生死界河，水分三途，缓急不同。此爪凝三途之水，可证罪业，望之似缓，暗流甚疾。伤者不可骤脱，如坠地狱、饿鬼、畜生道。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 150
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4114737939.0
		wds[13] = 1943604910
	elseif wd == "离钩" then
		wds[1] = "鸿蒙初辟，混沌之气混焉；后清浊渐离，有神识之气胶而不舍，亦聚亦离，愁丝千丈，钩绊难舍，岁月风化遂成离钩。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 6
		wds[5] = 160
		wds[7] = {
			"狐美人",
			"骨精灵",
			"影精灵",
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3368946268.0
		wds[13] = 3833664365.0
	elseif wd == "阴风扇" then
		wds[1] = "扇骨采玄冰制，阴风习习，让人不寒而粟"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 70
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1174967558
		wds[13] = 466225414
	elseif wd == "风云雷电" then
		wds[1] = "气势勇猛的大型折扇，扇开似风云突变，扇出似雷鸣电闪"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 80
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3812625478.0
		wds[13] = 876675307
	elseif wd == "太极" then
		wds[1] = "包容太极于其内，博采天地之灵气"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 90
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 795792061
		wds[13] = 2262423432.0
	elseif wd == "玉龙" then
		wds[1] = "白玉制的扇骨，优雅灵巧，似白龙出海"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 100
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3052815805.0
		wds[13] = 896644877
	elseif wd == "秋风" then
		wds[1] = "一纸折扇，荡平天下事，一缕秋风，吹尽凡尘心"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 100
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 516817499
		wds[13] = 1806626143
	elseif wd == "画龙点睛" then
		wds[1] = "本是一把普通的折扇，只因张僧繇画神龙于上，并点其睛，挥动时则隐有风雷之声、云雨之气，展开更有神龙奔出。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 120
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 848845144
		wds[13] = 1782681953
	elseif wd == "秋水人家" then
		wds[1] = "扇面上所画《秋水人家图》出神入化，栩栩如生；展扇更可进入其中，游山玩水，身临其境。其中定有道家仙法无疑。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 130
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2332586416.0
		wds[13] = 1923582221
	elseif wd == "逍遥江湖" then
		wds[1] = "持此扇行走江湖，可预先知晓福祸吉凶。据说是钦天监台正先生袁天罡书奇门妙法于其上，方使此扇有逍遥美名。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 140
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1361205238
		wds[13] = 1457973706
	elseif wd == "浩气长舒" then
		wds[1] = "持之若登高望远，五湖四海俱在眼前。不以物喜，不以己悲，心旷神怡，宠辱偕忘。感浩然之气至大至刚，以直养而无害，充盈天地。不亦快哉！"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 150
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3595165574.0
		wds[13] = 2725529530.0
	elseif wd == "星瀚" then
		wds[1] = "三垣中坠，不知其故。展则漫天星辰失色，收则幽渺万籁无声。万顷星瀚，无始无终，无他无我，怎不使人目眩神驰？"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 160
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2182063168.0
		wds[13] = 1649810470
	elseif wd == "水晶棒" then
		wds[1] = "通体以水晶制成，棒头镶嵌了纯净的水晶球，灵光闪闪"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 70
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3433794516.0
		wds[13] = 1032230318
	elseif wd == "日月光华" then
		wds[1] = "棒端有日月神珠，半黑半白，收太极其内，五行其间"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 80
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1445409930
		wds[13] = 345311421
	elseif wd == "沧海" then
		wds[1] = "静如海之渊深博从，动似海之激荡翻腾"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 90
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3417923595.0
		wds[13] = 32733626
	elseif wd == "红莲" then
		wds[1] = "碧杆红莲，阅众生相，度众生孽"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 100
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2931792494.0
		wds[13] = 2090478337
	elseif wd == "盘龙" then
		wds[1] = "身若九曲盘龙，口吞八卦金珠"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 100
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2599922092.0
		wds[13] = 1006965180
	elseif wd == "降魔玉杵" then
		wds[1] = "乃一块绝世好玉雕刻而成，杵头刻有仙家符咒。拿在手中，轻如鸿毛，打在人身，重如泰山。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 120
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 969185484
		wds[13] = 1480701803
	elseif wd == "青藤玉树" then
		wds[1] = "翡翠藤蔓缠绕于碧玉树干之上，红宝石所雕的鲜花正怒放枝头；它是完美的艺术品，更是仙家妙宝、除魔利器。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 130
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3608519305.0
		wds[13] = 1933825756
	elseif wd == "墨玉骷髅" then
		wds[1] = "魔棒上镶嵌着一个刻画精美的墨水晶骷髅，流露出神秘的死亡气息，似乎与地府有很深的渊源。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 140
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 758533892
		wds[13] = 1365535468
	elseif wd == "丝萝乔木" then
		wds[1] = "上古仙侣所化，丝萝出尘，花分五色；中为桐木，曾栖彩凤。千秋万载，其情不泯。仙气缠绕，百邪不侵：“醉向丝萝惊自醒，与君清耳听松湍。”"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 150
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 832692260
		wds[13] = 18189260
	elseif wd == "醍醐" then
		wds[1] = "天地未分时，混沌有异树，亿万年长成，亿万年花开，亿万年结果，果落化为醍醐。持此杖者洞悉天地，与万物同息。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 8
		wds[5] = 160
		wds[7] = {
			"玄彩娥",
			"骨精灵",
			"影精灵"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 493750456
		wds[13] = 3429406352.0
	elseif wd == "巨灵神锤" then
		wds[1] = "巨灵神所用神锤，锤似流星，非凡力可举，可挡十万天兵"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 70
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4112468633.0
		wds[13] = 977830532
	elseif wd == "天崩地裂" then
		wds[1] = "静似天柱巍巍，动则天崩地裂"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 80
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 708738253
		wds[13] = 1573610528
	elseif wd == "八卦" then
		wds[1] = "八卦其间，太极天成，天地造化，混沌无常"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 90
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFCFB1202
		wds[13] = 928644092
	elseif wd == "鬼牙" then
		wds[1] = "以万炼钢，合猛鬼牙，噬三界"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 100
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 737823355
		wds[13] = 25218036
	elseif wd == "雷神" then
		wds[1] = "一击天地轰鸣，再击电光四起，三击万物俱灰"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 100
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3048546465.0
		wds[13] = 0xFF91F65A
	elseif wd == "混元金锤" then
		wds[1] = "锤按六道之纹，柄接阴阳之气，持之者自有五行造化，诸天看护。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 120
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1164647107
		wds[13] = 2379160869.0
	elseif wd == "九瓣莲花" then
		wds[1] = "此锤乃仙池中的一朵婷婷玉莲，花开九瓣，蕊露金蓬。不知被谁采来，炼为兵器。虽已过五百年，依然盛开如新发。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 130
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2151061457.0
		wds[13] = 432377528
	elseif wd == "鬼王蚀日" then
		wds[1] = "斩魔王之头为锤，隐隐发出邪气，使日月无光。执此物则将与魔神契约，可拥魔王之力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 140
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1075077021
		wds[13] = 3952974465.0
	elseif wd == "狂澜碎岳" then
		wds[1] = "水神共工至宝，内收九曲黄河，出则天地齐喑，奔涛如雷。共工怒触不周山，天柱折地维绝，水潦尘埃俱归东南，双锤亦泯然其中，为黄帝所得。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 150
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3300988828.0
		wds[13] = 3989323201.0
	elseif wd == "碎寂" then
		wds[1] = "盘古龙齿所化，固若金汤。嘘为风雨，吹为雷电，舞之铿锵如鸣金铁，乃天下至阳至刚之物，邪魔宵小望之丧魂。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 9
		wds[5] = 160
		wds[7] = {
			"神天兵",
			"虎头怪"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3931836212.0
		wds[13] = 3916947211.0
	elseif wd == "雷鸣嗜血鞭" then
		wds[1] = "管节空洞，银钩闪闪，挥动时隐隐有风雷之音"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 70
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1854489623
		wds[13] = 3234780066.0
	elseif wd == "混元金钩" then
		wds[1] = "混元钢索之上缚有金钩，追命勾魂"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 80
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1635961330
		wds[13] = 2327240523.0
	elseif wd == "龙筋" then
		wds[1] = "以恶龙之筋制成，挥舞若龙腾"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 90
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1054575251
		wds[13] = 2303382990.0
	elseif wd == "百花" then
		wds[1] = "龙藤塑其筋，百花其上，集仙灵之气，香飘四海"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 100
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3472315232.0
		wds[13] = 1331779470
	elseif wd == "吹雪" then
		wds[1] = "鞭上石晶经千年生长，成雪花密布，映日月之光"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 100
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3293208513.0
		wds[13] = 1657462890
	elseif wd == "游龙惊鸿" then
		wds[1] = "此鞭舞之矫如游龙，翩若惊鸿，宛如活物。据传是因仙家点化，方有此功效。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 120
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 722618703
		wds[13] = 3699553560.0
	elseif wd == "仙人指路" then
		wds[1] = "此鞭之奇，在于打斗时会自寻敌之弱点，或攻或守，或点或缠，如仙人指路，变化万端；又如灵蛇狂舞，眼花缭乱。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 130
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2337416369.0
		wds[13] = 3100047545.0
	elseif wd == "血之刺藤" then
		wds[1] = "此鞭遍体生有倒刺，散发黑色邪气。据传打斗之时会如巨蟒缠住敌人，倒刺嵌入敌人体内，吸食其血肉。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 140
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3451408733.0
		wds[13] = 3574831487.0
	elseif wd == "牧云清歌" then
		wds[1] = "此鞭具大神通，持之则神虑清明，可驭使万物。苍穹为牧野，云霞为羔犊，驱鞭行九天，驭风乘云，竞雷逐电。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 150
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 422685665
		wds[13] = 4192744388.0
	elseif wd == "霜陨" then
		wds[1] = "昆仑之巅有涧曰冰溪，灿然如银，凝霜聚雪。溪流九曲，矫然若蛟，后凝为软玉长鞭，姑射仙子倚为护身仙器。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 10
		wds[5] = 160
		wds[7] = {
			"英女侠",
			"狐美人"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3829142397.0
		wds[13] = 522032539
	elseif wd == "子母双月" then
		wds[1] = "锋刃似弯月一般交错，可四面制敌"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 70
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3736409706.0
		wds[13] = 1612643041
	elseif wd == "斜月狼牙" then
		wds[1] = "青玉制成，锋似狼牙"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 80
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4116561830.0
		wds[13] = 2276604919.0
	elseif wd == "如意" then
		wds[1] = "白玉制成，光滑清丽，如意随心"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 90
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2711948052.0
		wds[13] = 952271091
	elseif wd == "乾坤" then
		wds[1] = "集天地乾坤之灵，可制万物"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 100
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2571022629.0
		wds[13] = 338904132
	elseif wd == "月光" then
		wds[1] = "清明无暇，似映月之光"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 100
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3562014914.0
		wds[13] = 2953019352.0
	elseif wd == "别情离恨" then
		wds[1] = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 120
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2437493189.0
		wds[13] = 3959090370.0
	elseif wd == "金玉双环" then
		wds[1] = "乐莫乐兮新相知，悲莫悲兮生别离；此情黯然销魂，永恨伤心。有人制同心永结环象征永不分离，但别离之后把玩，却更加伤感。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 130
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2908362125.0
		wds[13] = 1659862730
	elseif wd == "九天金线" then
		wds[1] = "此物套在手上，金光闪闪。圈飘金线，声音清越，守中有攻，刚柔并济，使敌人不知所措。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 140
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1468552095
		wds[13] = 2047583638
	elseif wd == "无关风月" then
		wds[1] = "精玉双环一名“离风”，一名“遮月”，舞之月影憧憧，别愁离绪，俱上心头。诗云：人生自是有情痴，此恨不关风与月。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 150
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3036111619.0
		wds[13] = 3104854202.0
	elseif wd == "朝夕" then
		wds[1] = "此双环伴日月而生，沐浴光华，吞吐烟云，三清将其置于天穹之上，日夜吸纳诸天亿兆流光，朝夕霞雾源出于此。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 11
		wds[5] = 150
		wds[7] = {
			"飞燕女",
			"舞天姬"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1379061378
		wds[13] = 1662428245
	elseif wd == "龙鳞宝刀" then
		wds[1] = "百练寒钢打造，以龙鳞装饰，身份的象征"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 70
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 668589754
		wds[13] = 2944368377.0
	elseif wd == "黑炎魔刀" then
		wds[1] = "刀身透出森森鬼气，有着摄人心魄的魔力"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 80
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 162972978
		wds[13] = 279098730
	elseif wd == "冷月" then
		wds[1] = "夜清冷，月露眉尖，笑引幽冥路"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 90
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 603925505
		wds[13] = 407135953
	elseif wd == "屠龙" then
		wds[1] = "上古神兵，宝刀屠龙"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 100
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1961749850
		wds[13] = 155455945
	elseif wd == "血刃" then
		wds[1] = "血红的刃，血红的光，以血洗天地"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 100
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1138002761
		wds[13] = 3952677662.0
	elseif wd == "偃月青龙" then
		wds[1] = "关公之配刀，青龙化刀柄，刀身如半月，百万军中取上将首级如探囊取物。关公死，刀柄不知去向，唯余此刀身。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 120
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 241494943
		wds[13] = 2525360226.0
	elseif wd == "晓风残月" then
		wds[1] = "迅如晓风，刃如残月。此非中土大唐之物，乃海外大食国宝刀，其上蛩伏可实现愿望之神明。但如何召唤已不可知。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 130
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 293054687
		wds[13] = 3069402462.0
	elseif wd == "斩妖泣血" then
		wds[1] = "大唐名匠半生心血所成的宝刀，因其妻子被妖魔所害，故将满腔愤恨倾注于刀中。谁能为他复仇，便以此刀相赠。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 140
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2680057538.0
		wds[13] = 1425981787
	elseif wd == "业火三灾" then
		wds[1] = "周身暗红如浴血池，刃裂三线引为三灾，中有赤瞳勾人心火。敌心神既失，十方俱灭，惟余红莲：“汝一念起，业火炽然，非人燔汝，乃汝自燔。”"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 150
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2013357951
		wds[13] = 2366906872.0
	elseif wd == "鸣鸿" then
		wds[1] = "刀长三尺，与轩辕剑同炉而成。黄帝见其刀意过盛，恐反噬刀主，欲以轩辕剑毁之；此刀乃化玄红云鹊，穿霞而逝。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 12
		wds[5] = 160
		wds[7] = {
			"剑侠客",
			"巨魔王"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3497244314.0
		wds[13] = 3024786057.0
	elseif wd == "引魂杖" then
		wds[1] = "点点萤光，引路幽魂，指引迷途幽魂的法杖，有着强大的法力"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 70
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2962804578.0
		wds[13] = 1687273756
	elseif wd == "碧玺杖" then
		wds[1] = "碧霞莹莹，玉暖生烟，浑然天成的碧玉法杖，神妙异常"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 80
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 264053858
		wds[13] = 203186473
	elseif wd == "业焰" then
		wds[1] = "取地狱燧石锻冶，燃万年业火之杖。“以业火乾枯，酬其宿债”，业焰之舞，焚尽世间罪孽。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 90
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1824574630
		wds[13] = 2003240450
	elseif wd == "玉辉" then
		wds[1] = "琉璃玉辉，星降人间，熠熠生辉的琉璃法杖，挥舞时如繁星落尽，蕴含无限灵力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 100
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3341482479.0
		wds[13] = 3389535995.0
	elseif wd == "鹿鸣" then
		wds[1] = "牡鹿凄鸣，风云雷动，天下至寒之墨玉炼成鹿角之形，夹风雷之势，让敌人闻之色变。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 100
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4184601743.0
		wds[13] = 1009912375
	elseif wd == "庄周梦蝶" then
		wds[1] = "“昔者庄周梦为蝴蝶，栩栩然蝴蝶也”梦中蝶舞花落，焉知人世几何？杖取冥府幽灯为首，引路之蝶翩飞，最善蛊惑人心。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 120
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFAF674F6
		wds[13] = 3003334713.0
	elseif wd == "凤翼流珠" then
		wds[1] = "有凤来仪，祥瑞兆也。炎帝融千金，取明珠，塑凤凰振翅衔珠之形，炼得一杖，光华灿烂，百鸟朝凤，深蕴妙法。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 130
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3777157831.0
		wds[13] = 1526765929
	elseif wd == "雪蟒霜寒" then
		wds[1] = "刘邦斩白蛇，取其精魄封于至阴至寒之地，吸寒冰精华千年，蛇魄化杖，成“雪蟒霜寒”，阴鸷寒毒，唯奇人异士方可驾驭自如。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 140
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1585143397
		wds[13] = 3652569447.0
	elseif wd == "碧海潮生" then
		wds[1] = "应龙伏旱魃，寻深海冰晶，取潮涌奔腾之势，融白浪连山之气，吐龙息为灵珠，成龙神逐珠之形，终获一杖，名曰“碧海潮生”。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 150
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 859134972
		wds[13] = 2904010505.0
	elseif wd == "弦月" then
		wds[1] = "盘古开天辟地之时，一外化陨铁落于不周山之巅，沐月华，吸星魄，尽得天地清明之气，化一杖，清辉万丈，疏影琉璃，曰之“弦月”。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 13
		wds[5] = 160
		wds[7] = {
			"巫蛮儿",
			"羽灵神"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1620809403
		wds[13] = 481332718
	elseif wd == "沧海明珠" then
		wds[1] = "东海之浪，西海之湍，南海之潮，北海之涌，凝为玲珑明珠，置于耳畔，可闻四海浪涛奔涌。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 70
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3775040856.0
		wds[13] = 1581614754
	elseif wd == "无量玉璧" then
		wds[1] = "奇珍璞玉，历神工鬼斧琢磨百年，方成无瑕白璧，明澈如镜，可见本心。心无旁骛，不惹尘埃。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 80
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 219820456
		wds[13] = 1327897055
	elseif wd == "离火" then
		wds[1] = "北地铁骨，质坚且寒，南疆离火，熔之成珠。铁骨灼灼，烈火熊熊，炽焰炎炎，刚猛之至。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 90
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3130687183.0
		wds[13] = 295884750
	elseif wd == "飞星" then
		wds[1] = "河汉渺渺，星华灿灿。流星坠地，而光华不灭，繁光云影，剔透灵动。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 100
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2857125772.0
		wds[13] = 3385292234.0
	elseif wd == "月华" then
		wds[1] = "芙蓉出水，风荷凌波。采月宫新荷之叶，凝流金月色之光，成琳琅花灯一盏，暖光融融，晴光皎皎。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 100
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3767404245.0
		wds[13] = 776402569
	elseif wd == "回风舞雪" then
		wds[1] = "洛水汤汤，钟灵毓秀。河洛之女质比霜雪，态似惊鸿；一日童心乍起，采河滨之蝶、沉水之冰，吟清歌而成宝珠，蝶舞之时回风舞雪，琴音泠泠。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 120
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3065427050.0
		wds[13] = 269710225
	elseif wd == "紫金葫芦" then
		wds[1] = "混沌初分，天开地辟，昆仑山脚下生仙藤一缕，上结葫芦七枚，名曰紫金葫芦，千年方得瓜熟蒂落，有吞吐万象之力。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 130
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1536710915
		wds[13] = 2788268887.0
	elseif wd == "裂云啸日" then
		wds[1] = "烛龙之鳞，采璇玑之华，待千年。浴羲和之光，再千年。经九煅九灼，方熔为赤金之珠，其光煌煌，可照千里，其势熊熊，耀日贯虹。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 140
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3954481057.0
		wds[13] = 3032716270.0
	elseif wd == "云雷万里" then
		wds[1] = "北溟之鲲，化而为鹏，凌风而起，翼若垂天之云，啸如雷霆之怒，水击三千，风驰如电。沉眠时化作神异之珠，聚风雷云电之力，有呼山啸海之能。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 150
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3251343750.0
		wds[13] = 3115679889.0
	elseif wd == "赤明" then
		wds[1] = "盘古开天辟地后，齿骨为金石，精髓为珠玉，灵窍一点聚天地浩气，化为宝珠“赤明”，虹霓为衣，金螭为息，吞云吐明，异光万里。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 15
		wds[5] = 160
		wds[7] = {
			"巫蛮儿",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1303853669
		wds[13] = 4145962850.0
	elseif wd == "游鱼戏珠" then
		wds[1] = "弓箭之形仿若双鱼，共戏剔透宝珠。出箭之势，亦如游鱼嬉水，婉转灵动，让对手无从躲避。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 70
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1424340640
		wds[13] = 4113025121.0
	elseif wd == "灵犀望月" then
		wds[1] = "天降奇石，锻为兵器，自生光华。美玉做灵犀之形，嵌于弓腰，祥瑞兆也。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 80
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2652946197.0
		wds[13] = 3194521736.0
	elseif wd == "非攻" then
		wds[1] = "墨家机关之术神秘莫测，相传有采玉人偶得其残片，上记“非攻”弓弩，机括精妙，威力非常。遂寻美玉，勤琢磨，终得天下难见之绝品。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 90
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3157963095.0
		wds[13] = 1966338355
	elseif wd == "幽篁" then
		wds[1] = "潮音洞外梵音悠悠，云岚缭绕，幽篁万杆，满目翠色。林中紫竹既坚且韧，扣之琅然有金石声，金童子置之于老君炉中，锻成神弓，名曰“幽篁”。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 100
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3823221168.0
		wds[13] = 3873525610.0
	elseif wd == "百鬼" then
		wds[1] = "春秋时古墓中，青铜之樽，凝百鬼之魂，锻九千日，乃成。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 100
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1920235031
		wds[13] = 878233843
	elseif wd == "冥火薄天" then
		wds[1] = "幽冥之地，麒麟衔火而生，踏火而行，所经处金石皆熔，游九州聚天地精华，得遇有缘之士，乃化作良弓一柄，凌风驭火，箭矢如焰，有燎日之能。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 120
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3592078104.0
		wds[13] = 944851297
	elseif wd == "龙鸣寒水" then
		wds[1] = "云龙居寒水，可呼云雨，开江海，鸣动天地，腾云起风。此弩熔云龙之鳞，凝万年寒水之底，聚玄冰苦寒之气，千年方成，出矢如冰，霜寒雪冷。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 130
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4125263988.0
		wds[13] = 566006425
	elseif wd == "太极流光" then
		wds[1] = "天地之道，以阴阳二气造化万物，日月、风雨，刚柔、动静莫不合此道也。此番水火相逢，相生相克，有大神通。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 140
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1065909571
		wds[13] = 453912996
	elseif wd == "九霄风雷" then
		wds[1] = "灵凰栖九天，高飞穿云，清音裂石。妙手仙匠采灵凰之魄，河汉之星，云雷之怒，以九霄长风锻造千载而成此弓，箭簇既出，风雷声动，江海怒号。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 150
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1632354244
		wds[13] = 4026131118.0
	elseif wd == "若木" then
		wds[1] = "金乌栖若木，振翅日升，归巢日落，十鸟齐飞，则十日齐出，民不聊生。后羿采若木为弓，连射九日，凝金乌之魂于弓上，羲和光华，日夜不息。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 14
		wds[5] = 160
		wds[7] = {
			"羽灵神",
			"杀破狼"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2281686232.0
		wds[13] = 1581270869
	elseif wd == "月光双剑" then
		wds[1] = "皎洁如白玉，清明如月光  "
		wds[2] = 2
		wds[3] = 3
		wds[4] = 4
		wds[5] = 100
		wds[7] = {
			"英女侠",
			"飞燕女"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 38511533
		wds[13] = 2184315991.0
	elseif wd == "桃印铁刃" then
		wds[1] = "常见铁剑，以桃木为剑柄。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 10
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3651866845.0
		wds[13] = 151833112
	elseif wd == "赭石巨剑" then
		wds[1] = "以赭石去杂质锻淬而成，色泽沉郁。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 20
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1525417198
		wds[13] = 2861515391.0
	elseif wd == "壁玉长铗" then
		wds[1] = "精铁重剑，剑身嵌美玉。碧波流光，颇有君子之风。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 30
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1360023668
		wds[13] = 2540436775.0
	elseif wd == "青铜古剑" then
		wds[1] = "青铜宝剑，古朴大气，然剑锋凌厉，不可小觑。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 40
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2157780957.0
		wds[13] = 3422630774.0
	elseif wd == "金错巨刃" then
		wds[1] = "铁匠采丹阳铜矿冶炼锻造，剑身以镶金包裹，工艺精湛，灼灼夺目。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 50
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3176923406.0
		wds[13] = 3908256016.0
	elseif wd == "惊涛雪" then
		wds[1] = "铸剑师偶得深海晶石一块，冶炼成剑，挥斩之时，流光溢彩。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 60
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 526680616
		wds[13] = 185251579
	elseif wd == "醉浮生" then
		wds[1] = "浮生若梦，一醉解忧，以布裹之，掩锋芒，平杀气，大巧不工，颇具豪侠之意。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 70
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 932320228
		wds[13] = 3918256243.0
	elseif wd == "沉戟天戊" then
		wds[1] = "原为沙场断戟，后经人收敛重铸，以缅忠魂。握之，勇武无惧。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 80
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 777578897
		wds[13] = 3882428739.0
	elseif wd == "鸦九" then
		wds[1] = "剑痴鸦九得欧冶子所遗铸剑秘法，铸长剑无名。因不舍爱剑磨损，剑成当日。即以冰匣封之。十余年后得人点拔开悟，欲拔剑出匣，然而冰匣早已与剑芯融为一体，不可分离，寻得熔岩炼化三年，方重铸此剑，剑身自此红雾缭绕。后人得之，为此剑冠以剑痴鸦九之名。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 90
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3999480433.0
		wds[13] = 987633155
	elseif wd == "昆吾" then
		wds[1] = "前朝君主雄才大略，文治武功皆成鼎盛，有邦国朝献天降陨铁。以为祥瑞，遂寻当世铸剑高手，炼化成剑，彪炳功勋。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 100
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1166957464
		wds[13] = 4191727483.0
	elseif wd == "弦歌" then
		wds[1] = "乐师师旷以剑为胆，棹伏羲木，铺天蚕丝，制成琴身重剑，以酬知己，友人闻弦歌而知雅意，奏高山流水，成一段佳话。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 110
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2070090788
		wds[13] = 693284753
	elseif wd == "墨骨枯麟" then
		wds[1] = "东海龙冢有龙骨万千，尤以黑龙龙骨为尊，取其残骨，熔以业火，成墨骨重剑。弹触剑身，争鸣作响，似有龙吟。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 120
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2215842196.0
		wds[13] = 3987640090.0
	elseif wd == "腾蛇郁刃" then
		wds[1] = "中山之州有赤目飞蛇，乘雾游云，于柴桑之山嬉戏，疲乏后盘松石小憩，留蛇蜕一副，化为巨剑，此乃王道之师。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 130
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1869392896
		wds[13] = 2604321922.0
	elseif wd == "秋水澄流" then
		wds[1] = "泑水之畔盛产婴垣之玉，得蓐收赤足踏过而成金秋之色，胜碧玉琼瑶。有人界巧匠偶得之，不知何物，投剑炉一试，不想即刻炉毁剑成，更一日入秋，遂得此名。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 140
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1600758107
		wds[13] = 1617321122
	elseif wd == "百辟镇魂" then
		wds[1] = "千年以前，世间妖魔横行，有神将除妖邪，斩厉鬼，力竭而亡，然其精魂不灭，附于生前所用神兵重剑，继续护佑四方。此剑祭出，则正气浩然冲天，可诛邪平患，可定历熄灾。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 150
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 4169954402.0
		wds[13] = 408968693
	elseif wd == "长息" then
		wds[1] = "洪水滔天，鲧窃帝之息壤以堙洪水，息壤生生不息，却于疏洪无益。帝令祝融取息壤，复命禹布土疏洪，以定九州。此时山川逼仄，水塞不出。禹借祝融火龙之力，熔炼息壤成重剑之体，以之开山疏浚，方江河倾泻，洪水东去。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 16
		wds[5] = 160
		wds[7] = {
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 339813268
		wds[13] = 1355177650
	elseif wd == "素纸灯" then
		wds[1] = "轻巧的纸灯笼，最适合新手练习使用。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 0
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3260370010.0
		wds[13] = 87699140
	elseif wd == "竹骨灯" then
		wds[1] = "以竹骨扎成的灯笼，看起来精致又风雅。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 10
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1053061536
		wds[13] = 3933056601.0
	elseif wd == "红灯笼" then
		wds[1] = "节日时方可悬挂起来的红灯笼，看到它就能感到喜庆的氛围。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 20
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3353337838.0
		wds[13] = 954591755
	elseif wd == "鲤鱼灯" then
		wds[1] = "仿照锦鲤的样子精致而成的花灯，说不定会和锦鲤一样带给人好运呢！"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 30
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2549531915.0
		wds[13] = 2547748907.0
	elseif wd == "芙蓉花灯" then
		wds[1] = "晶莹剔透的白瓷灯笼，更有名家所绘之工笔芙蓉，美轮美奂。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 40
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3445762566.0
		wds[13] = 2118059787
	elseif wd == "如意宫灯" then
		wds[1] = "宫廷巧匠耗费月余精制而成的宫灯，象征着平安吉祥，如意你心。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 50
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3036390282.0
		wds[13] = 3464919910.0
	elseif wd == "玲珑盏" then
		wds[1] = "西域工匠以 费盘斯 工艺烧制的灯笼，其色流云清彩，其质晶莹剔透，玲珑奇巧，引人注目。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 60
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2543353692.0
		wds[13] = 2746808549.0
	elseif wd == "玉兔盏" then
		wds[1] = "白璧无瑕琢成团绒玉兔，碧玉青翠雕琢剔透环珮，光润莹然，美不胜收。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 70
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3515061349.0
		wds[13] = 2621299507.0
	elseif wd == "冰心盏" then
		wds[1] = "北俱寒冰，澄澈剔透，经年不化。炽焰为刃，琢成玲珑灯盏，寒光为焰，凛风逼人。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 80
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 105020996
		wds[13] = 4065810755.0
	elseif wd == "蟠龙" then
		wds[1] = "风从龙出，云有龙息，夜放光华，金碧辉煌。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 90
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2732328406.0
		wds[13] = 1943955808
	elseif wd == "云鹤" then
		wds[1] = "饥餐瑶草，渴饮琼泉。朝飞阆苑，暮宿云烟。白鹤雪羽为灯盏，光耀如雪，不惹尘埃。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 100
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1416631053
		wds[13] = 2067233583
	elseif wd == "风荷" then
		wds[1] = "清莲出水，玉立亭亭。其灵性卓然者，化为灵仙，凡胎肉身，则凝为灯盏。含苞欲放，清芬十里。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 110
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3860693642.0
		wds[13] = 66226651
	elseif wd == "金风玉露" then
		wds[1] = "今日云軿渡鹊桥，应非脉脉与迢迢。灵鹊仙羽，织就金凤，七夕月华，酿作玉露。皎皎华光，可照良人。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 120
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3654696506.0
		wds[13] = 1458353756
	elseif wd == "凰火燎原" then
		wds[1] = "凰与凤，生相伴，死同归。一方离世，则生者必引颈而鸣，唤涅槃之火，双双浴火重生。此火五百年不灭，奔腾炽烈，可焚八方。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 130
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2435432487.0
		wds[13] = 2647753481.0
	elseif wd == "月露清愁" then
		wds[1] = "三界之西，有湖曰灵，湖水乃天女眼泪所化，夜色深浓时，有溶溶光华。水滴如泪，泪干为夜明灵珠，风流藴籍，清光冷冷。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 140
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2108777333
		wds[13] = 386007959
	elseif wd == "夭桃秾李" then
		wds[1] = "桃之夭夭，灼灼其华。烂漫春光，转瞬即逝。九重天上仙娥取之以为灯盏，光华所至处，枯木吐芽，桃李争芳。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 150
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1912528280
		wds[13] = 3941574461.0
	elseif wd == "荒尘" then
		wds[1] = "星河浩瀚，繁星若尘，亿万星尘聚沙为塔，是以沧海桑田，人世幻变，其光华永恒也。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 18
		wds[5] = 160
		wds[7] = {
			"桃夭夭"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2292083383.0
		wds[13] = 0xFEEAD4B6
	elseif wd == "油纸伞" then
		wds[1] = "普通的油纸伞，美观轻巧，最适合新手使用。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 0
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1965579013
		wds[13] = 1673759366
	elseif wd == "红罗伞" then
		wds[1] = "当下最时兴的雨伞样式，正红色的罗缎伞面看起来甚是喜庆。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 10
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2881617669.0
		wds[13] = 344304319
	elseif wd == "紫竹伞" then
		wds[1] = "伞骨及伞柄皆是紫竹制成，非常坚韧。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 20
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2125778506
		wds[13] = 686736156
	elseif wd == "锦绣椎" then
		wds[1] = "巧手绣娘，择上品丝绸，飞针走线，历时年逾，方成此伞，设色精妙，光彩夺目。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 30
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 954748488
		wds[13] = 2695242052.0
	elseif wd == "幽兰帐" then
		wds[1] = "本为一尺无暇素锦，不慎沾染墨痕，幸得雅士泼墨挥毫，绘幽兰一枝，其清俊姿态，栩栩如生，其清雅香气，扑鼻欲来。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 40
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2307616931.0
		wds[13] = 4063829163.0
	elseif wd == "琳琅盖" then
		wds[1] = "《般若经》有七宝：乃金、银、琉璃、珊瑚、琥珀、砗磲、玛瑙。能工巧匠以金银为骨，饰以琉璃、砗磲之属，方成此伞。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 50
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3506791983.0
		wds[13] = 951372395
	elseif wd == "孔雀羽" then
		wds[1] = "西域巧匠，取珍兽孔雀之尾羽，以玄妙秘法织造而成，碧彩闪烁，金翠辉煌。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 60
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFEBE2460
		wds[13] = 616371514
	elseif wd == "金刚伞" then
		wds[1] = "金刚怒目，降妖四魔。金刚伞以精钢百炼而成，铁骨刚叶，坚不可摧。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 70
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3429959359.0
		wds[13] = 1339538628
	elseif wd == "落梅伞" then
		wds[1] = "北俱苦寒之地，生千年老梅。一甲子方开花一次，色若胭脂，香欺兰蕙。梅枝落雪上，苦心雕琢，方成此伞。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 80
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3222609894.0
		wds[13] = 635634158
	elseif wd == "鬼骨" then
		wds[1] = "昆山有玉，性阴厉，蓄百年煞气，幻为枯骨，谓之鬼玉。此玉为伞骨，伞下阴魂环绕，寒气森然。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 90
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3252222745.0
		wds[13] = 1555863380
	elseif wd == "云梦" then
		wds[1] = "高唐有梦，水阔花飞，梦有神女取巫山之风云为伞，谓之云梦。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 100
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2649799579.0
		wds[13] = 853313501
	elseif wd == "枕霞" then
		wds[1] = "瑶池有仙蝶，枕霞沐云而生，其态纤巧翩然，其色艳若丹霞，取其羽翼为伞，霞光云影，如在目前。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 110
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 678894445
		wds[13] = 1337681823
	elseif wd == "碧火琉璃" then
		wds[1] = "金蛇之鳞，可萃命魂之焰。以百枚金蛇之鳞，取百鬼命魂之火，成此伞。碧火幽幽，杀气腾腾，此伞过处，百鬼夜哭，绕梁不绝。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 120
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3947421179.0
		wds[13] = 676189995
	elseif wd == "雪羽穿云" then
		wds[1] = "昆仑山中，有仙禽雪鸢，振翅可穿云，歌有裂石音，灵气所钟，位列仙班，其羽裳化伞，持此者，身轻如燕，振翅可至九天。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 130
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3515464165.0
		wds[13] = 345266312
	elseif wd == "月影星痕" then
		wds[1] = "汲天河之水，取星河之光。凝月华之露，锻千日，成此伞。其光灿然，其色清灵，伞起时，月华照人，清辉泻地。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 140
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2388486720.0
		wds[13] = 1170943818
	elseif wd == "浮生归梦" then
		wds[1] = "三生河畔，彼岸花开，殷红似火，灼灼其华。曼珠沙华一株，藏浮生忆念一世。幽梦为瓣，情丝若蕊，墨蝶翩翩，归梦何时？"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 150
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 3790341648.0
		wds[13] = 770998754
	elseif wd == "晴雪" then
		wds[1] = "燕山雪，大如席，有华胥之女幽娴娇丽，踏凌云风波，乘逐月之辇，辇有华盖，正是燕山晴雪，清光冷冷，不可逼视。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 17
		wds[5] = 160
		wds[7] = {
			"鬼潇潇"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2149640251.0
		wds[13] = 1278164518
	elseif wd == "四叶花" then
		wds[1] = "具有药性的中草药，长着四片叶子的药草，可以补充少量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[10] = 20
		wds[11] = "物品图标.wdf"
		wds[12] = 2403345371.0
		wds[13] = 2730519933.0
		wds[14] = 100
	elseif wd == "七叶莲" then
		wds[1] = "“出污泥而不染”七片叶子的莲花更是稀有品种，难能可贵的是，这种莲花具有药性。可以补充少量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1559451305
		wds[13] = 3792310897.0
		wds[14] = 150
	elseif wd == "天青地白" then
		wds[1] = "产于北方的药草，天青色的花，青白色的叶，具有药性。可以补充少量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2832513988.0
		wds[13] = 296513300
		wds[14] = 200
	elseif wd == "鬼切草" then
		wds[1] = "产自阴间的药草，由于常年在阴湿之地，故而有很强的药力,可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1290362068
		wds[13] = 1079697436
		wds[14] = 80
	elseif wd == "紫丹罗" then
		wds[1] = "产自东胜神洲的药草,紫色的叶子上散发出阵阵清香，可以补充少许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3370160386.0
		wds[13] = 1385083912
		wds[14] = 80
	elseif wd == "佛手" then
		wds[1] = "非常常见的药物，因其外貌酷似佛的手指而得名，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2548894140.0
		wds[13] = 383352299
		wds[14] = 80
	elseif wd == "旋复花" then
		wds[1] = "产于东海海滨的药草,花开三色，暗和三才之术数，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3005200763.0
		wds[13] = 1826111581
		wds[14] = 80
	elseif wd == "百色花" then
		wds[1] = "海外仙草，原产于方壶岛，兼百花之灵气，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 542670697
		wds[13] = 2739363770.0
		wds[14] = 140
	elseif wd == "草果" then
		wds[1] = "乌色的小果子\n治疗伤势10点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1219912130
		wds[13] = 288681649
		wds[14] = 140
	elseif wd == "九香虫" then
		wds[1] = "带有药性的虫\n治疗伤势15点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3272271599.0
		wds[13] = 468770382
		wds[14] = 140
	elseif wd == "水黄莲" then
		wds[1] = "产于南方水乡的黄色莲花\n治疗伤势20点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1193637428
		wds[13] = 1751009425
		wds[14] = 140
	elseif wd == "山药" then
		wds[1] = "常见的药草\n恢复气血40，治疗伤势10点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2643729465.0
		wds[13] = 3236729739.0
		wds[14] = 140
	elseif wd == "八角莲叶" then
		wds[1] = "八角形状的莲叶\n恢复气血60，治疗伤势15点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 901930079
		wds[13] = 726051549
		wds[14] = 140
	elseif wd == "人参" then
		wds[1] = "千年的老参，药性非常强\n恢复气血80，治疗伤势20点"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 367276111
		wds[13] = 4036803141.0
		wds[14] = 140
	elseif wd == "香叶" then
		wds[1] = "散发香气的药草叶子可以补充少量的法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1613933236
		wds[13] = 0xFD621F30
		wds[14] = 140
	elseif wd == "龙须草" then
		wds[1] = "《古今注》曰：“世称皇帝炼丹凿砚山，乃得仙，乘龙上天。群臣援龙须，须堕而生草，曰龙须”，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1050552246
		wds[13] = 2301092035.0
		wds[14] = 140
	elseif wd == "灵脂" then
		wds[1] = "采天地灵气而生的药物，又称三秀，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2234254574.0
		wds[13] = 4179146971.0
		wds[14] = 200
	elseif wd == "白玉骨头" then
		wds[1] = "东方白民国药兽的骨头，具有很强的药性，可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3784788337.0
		wds[13] = 3455660261.0
		wds[14] = 200
	elseif wd == "曼陀罗花" then
		wds[1] = "常用的药草之一，华佗当年配制麻沸散的主要原料。可以补充少量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1670376717
		wds[13] = 351908663
		wds[14] = 275
	elseif wd == "天不老" then
		wds[1] = "南瞻部洲常见的药草，花期非常之长，故而得名，可以补充些许气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2703828792.0
		wds[13] = 2167342295.0
		wds[14] = 1000
	elseif wd == "紫石英" then
		wds[1] = "紫色的千年英石，具有药性，可以补充些许气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 948752105
		wds[13] = 2328322925.0
		wds[14] = 1000
	elseif wd == "鹿茸" then
		wds[1] = "南极仙翁仙鹿之茸,可以补充些许气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2463951092.0
		wds[13] = 1264316847
		wds[14] = 2000
	elseif wd == "血色茶花" then
		wds[1] = "出自南方的野生茶花,可以补充些许气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1354064097
		wds[13] = 1307133621
		wds[14] = 2000
	elseif wd == "六道轮回" then
		wds[1] = "天宫的异花，六种颜色可以清楚的反映出六道的轮回，故而得名，可以补充大量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2049121098
		wds[13] = 1869015446
		wds[14] = 2000
	elseif wd == "熊胆" then
		wds[1] = "千年熊罴的胆，是十分难得可遇不可求的宝物，可以补充大量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1374442124
		wds[13] = 278044265
		wds[14] = 2000
	elseif wd == "凤凰尾" then
		wds[1] = "“彩凤双飞翼，心犀一点通。”这是一根灵鸟鸾凤尾部的羽毛，可以补充大量气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1539671207
		wds[13] = 2658275285.0
		wds[14] = 3000
	elseif wd == "硫磺草" then
		wds[1] = "在硫磺地长大的圣草，可以补充大量气血"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 864297689
		wds[13] = 2761940417.0
		wds[14] = 3000
	elseif wd == "龙之心屑" then
		wds[1] = "用龙心提炼出的灵药,只在魔界存在，可以补充极大量的气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3213130038.0
		wds[13] = 3262096188.0
		wds[14] = 4000
	elseif wd == "火凤之睛" then
		wds[1] = "无色界天的火凤凰的眼睛，可以补充极大量的气血。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3501837535.0
		wds[13] = 2002167878
		wds[14] = 4000
	elseif wd == "丁香水" then
		wds[1] = "从仙岛上的丁香花中精心提炼而成，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 870043705
		wds[13] = 598856410
		wds[14] = 4000
	elseif wd == "月星子" then
		wds[1] = "五台山的名产，用水研化后使用，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 407178454
		wds[13] = 3811606165.0
		wds[14] = 4000
	elseif wd == "仙狐涎" then
		wds[1] = "东方青丘国九尾仙狐的涎水制成的药草，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3053035433.0
		wds[13] = 508852862
		wds[14] = 5000
	elseif wd == "地狱灵芝" then
		wds[1] = "产自地狱深处的灵芝草，由于吸取了阴魂怨气，药力很强，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 796688846
		wds[13] = 1768691950
		wds[14] = 5000
	elseif wd == "麝香" then
		wds[1] = "仙山灵麝的麝香，是名贵的中草药材，可以补充些许法力"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 117711803
		wds[13] = 1653741198
		wds[14] = 5000
	elseif wd == "血珊瑚" then
		wds[1] = "东海海底的千年珊瑚，具有强大的灵力,可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 126465632
		wds[13] = 2455256649.0
		wds[14] = 5000
	elseif wd == "餐风饮露" then
		wds[1] = "南海普陀山的仙竹枝，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3943163770.0
		wds[13] = 682563718
		wds[14] = 5000
	elseif wd == "白露为霜" then
		wds[1] = "五庄观前的仙松之枝,服用后可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3376613586.0
		wds[13] = 2510824925.0
		wds[14] = 5000
	elseif wd == "天龙水" then
		wds[1] = "九天真龙的血液炼成的药物，可以补充些许法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 844527934
		wds[13] = 3663891259.0
		wds[14] = 6000
	elseif wd == "孔雀红" then
		wds[1] = "用仙家孔雀的精华制成的药品，有很强的魔性，可以补充大量法力。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 4104291822.0
		wds[13] = 2187791450.0
		wds[14] = 6000
	elseif wd == "金创药" then
		wds[1] = "用云南白药制成的疗伤药，可以止血、消毒，是常见的药品。具有补充气血的作用。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3360268674.0
		wds[13] = 3769489910.0
		wds[14] = 10000
	elseif wd == "金香玉" then
		wds[1] = "仙子仙女常用的药物，除了可以养颜之外，服用后具有恢复气血的作用。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 1
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 875333087
		wds[13] = 2395394781.0
		wds[14] = 12500
	elseif wd == "小还丹" then
		wds[1] = "载于中国古老药书《千金方》，散发着香气的紫色药丸，具有补充气血的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 1
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1261161767
		wds[13] = 4110383651.0
		wds[14] = 10000
	elseif wd == "千年保心丹" then
		wds[1] = "用大量名贵药品，经名师的精心加工制成的药丹，具有补充气血的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3968259402.0
		wds[13] = 212192249
		wds[14] = 15000
	elseif wd == "风水混元丹" then
		wds[1] = "有混元之神效，用各类名贵药品精炼的丹药，具有补充法力和恢复战斗中某些情况下损失的灵力的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 1
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1613137255
		wds[13] = 3441623302.0
		wds[14] = 10000
	elseif wd == "定神香" then
		wds[1] = "有定神凝气的功效，名贵药物，精心练成的丹药，具有补充法力的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 1
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2570329553.0
		wds[13] = 0xFC3F5A0E
		wds[14] = 11000
	elseif wd == "蛇蝎美人" then
		wds[1] = "魔王妖王常用的药物，具有补充法力的功效。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2982020731.0
		wds[13] = 2737638149.0
		wds[14] = 15000
	elseif wd == "十香返生丸" then
		wds[1] = "用十种仙山上奇香的药草制成，奇异的药丸，具有补充法力和解除酒类异常状态的作用。"
		wds[2] = 1
		wds[3] = 1
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3302437850.0
		wds[13] = 1028279805
		wds[14] = 15000
	elseif wd == "九转回魂丹" then
		wds[1] = "炼过九转的仙丹，用极为珍贵而特殊的药物制成，具有补充气血、疗伤和起死回生的功效。"
		wds[2] = 1
		wds[3] = 2
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 68961914
		wds[13] = 1116089577
		wds[14] = 40000
	elseif wd == "佛光舍利子" then
		wds[1] = "佛的舍利子具有补充气血、疗伤和起死回生的功效。"
		wds[2] = 1
		wds[3] = 2
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 68961914
		wds[13] = 1116089577
		wds[14] = 20000
	elseif wd == "五龙丹" then
		wds[1] = "来自东海龙宫的珍贵药品，是用五颗龙珠凝练的，具有补充气血和解除封类异常状态的功效（解封几率与品质相关）。若未在封类异常状态服用五龙丹，会进入睡眠状态。"
		wds[2] = 1
		wds[3] = 2
		wds[4] = 2
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 260113467
		wds[13] = 3795878131.0
		wds[14] = 17500
	elseif wd == "一级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1241680878
		wds[13] = 4046019597.0
		wds[14] = 10000
	elseif wd == "二级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3140870638.0
		wds[13] = 3140870638.0
		wds[14] = 10000
	elseif wd == "三级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3892077778.0
		wds[13] = 3892077778.0
		wds[14] = 10000
	elseif wd == "四级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2684829942.0
		wds[13] = 2684829942.0
		wds[14] = 10000
	elseif wd == "五级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 562268034
		wds[13] = 562268034
		wds[14] = 10000
	elseif wd == "六级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 4056436405.0
		wds[13] = 4056436405.0
		wds[14] = 10000
	elseif wd == "七级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 4020550188.0
		wds[13] = 4020550188.0
		wds[14] = 10000
	elseif wd == "八级变身卡" then
		wds[1] = "可以变化成对应的召唤兽，并附加特殊效果"
		wds[2] = 12
		wds[3] = 1
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 771949169
		wds[13] = 771949169
		wds[14] = 10000
	elseif wd == "乾坤帽" then
		wds[1] = "天下名冠，暗藏乾坤玄机，有相当强的防御力"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 70
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1272695123
		wds[13] = 1771271296
	elseif wd == "黑魔冠" then
		wds[1] = "魔王妖王常戴的冠帽，有相当强的防御力"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 80
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 685770468
		wds[13] = 1237041059
	elseif wd == "白玉龙冠" then
		wds[1] = "高贵雅致的冠帽，镶有上等白玉精雕之飞龙图案"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 90
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFF6021EA
		wds[13] = 1412110631
	elseif wd == "水晶夔帽" then
		wds[1] = "其状如牛,苍色无角,一足能走,出入水即风雨,目光如日月,其声如雷,名曰夔。黄帝杀之,取皮以冒鼓,声闻五百里。”相传远古奇兽夔牛皮最终为一能工巧匠所得，辅以水晶玉石经上经千锤百炼雕琢编制而成一件冠帽。据传此帽拥有奇兽的庇佑，千年不坏"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 100
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 77382880
		wds[13] = 2164041151.0
	elseif wd == "翡翠曜冠" then
		wds[1] = "相传为三清之一灵宝天尊佩戴过的帽冠。七颗翡翠分别代表“日、月、火、水、金、木、土”环绕在玉石宝珠上。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 110
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 482138369
		wds[13] = 830308889
	elseif wd == "金丝黑玉冠" then
		wds[1] = "远古盘古开天辟地，混沌初开时凝结而成的玉石雕琢而成的冠帽，充满着神奇的灵气。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 120
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1140741771
		wds[13] = 948281107
	elseif wd == "白玉琉璃冠" then
		wds[1] = "太上老君曾佩戴过的冠帽，用仙界白玉与琉璃珠辅以天丝编织而成。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 130
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 778966943
		wds[13] = 243238969
	elseif wd == "兽鬼珐琅面" then
		wds[1] = "上古神魔所戴，虽经几千年，面具独角四周仍散发着神奇的魔力。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 140
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2310107289.0
		wds[13] = 125393860
	elseif wd == "紫金磐龙冠" then
		wds[1] = "火神遗留之物。冠上用金雕琢为吉龙盘云，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 150
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 447473455
		wds[13] = 3859378496.0
	elseif wd == "浑天玄火盔" then
		wds[1] = "黄帝征伐四方之时所配战盔，刀枪不入，水火不侵，瘟邪难近，更添无尽战意。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 160
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 3566352403.0
		wds[13] = 1502470676
	elseif wd == "魔女发冠" then
		wds[1] = "魔女们常带的头环，可以起到非常强的防御作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 70
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2508308579.0
		wds[13] = 845102994
	elseif wd == "七彩花环" then
		wds[1] = "用七彩神花编成的花环，可以起到极强防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 80
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3183056480.0
		wds[13] = 2570521405.0
	elseif wd == "凤翅金翎" then
		wds[1] = "以凤翅和凤翎编织而成的金丝头环，有极强防御的作用"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 90
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2373769150.0
		wds[13] = 3600964026.0
	elseif wd == "寒雉霜蚕" then
		wds[1] = "由寒玉以及蚕丝编制而成，相传为七仙女常戴之物"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 100
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 86765519
		wds[13] = 42155348
	elseif wd == "曜月嵌星" then
		wds[1] = "瑶池圣母所戴之物。冠上镶有七星宝珠环绕在月光石周围形成七星曜月的图案。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 110
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3373770544.0
		wds[13] = 2683232345.0
	elseif wd == "郁金流苏簪" then
		wds[1] = "白晶晶佩戴的发髻。白色玉石与金丝编织而成。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 120
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3156867369.0
		wds[13] = 2529030399.0
	elseif wd == "玉翼附蝉翎" then
		wds[1] = "嫦娥仙女佩戴过的帽冠。将月宫中玉石经千年雕琢而成，羽翼薄如蝉翼"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 130
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 678644164
		wds[13] = 3321477618.0
	elseif wd == "鸾羽九凤冠" then
		wds[1] = "九只五彩凤凰的羽翼与金丝编织而成的冠帽。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 140
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1580187502
		wds[13] = 2242355262.0
	elseif wd == "金珰紫焰冠" then
		wds[1] = "水神遗留之物。上古神兽凤凰羽翼制成的帽冠，四周散发着神奇的力量。需要有一定修为之人方能佩戴。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 150
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3789475693.0
		wds[13] = 3128529272.0
	elseif wd == "乾元鸣凤冕" then
		wds[1] = "有感于女娲造人之德，三界名匠合力铸造献上的帝王冠冕。五德齐聚，凤仪天下。"
		wds[2] = 2
		wds[3] = 1
		wds[4] = 1
		wds[5] = 160
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2064393561
		wds[13] = 364230466
	elseif wd == "龙骨甲" then
		wds[1] = "以龙骨制成的宝甲，有惊人的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 70
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 541785355
		wds[13] = 1741806040
	elseif wd == "死亡斗篷" then
		wds[1] = "魔王妖王梦寐以求的防具，非常有价值"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 80
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1766901621
		wds[13] = 1885524269
	elseif wd == "神谕披风" then
		wds[1] = "受到神谕祝福的银色披风，带有灵动之气"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 90
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1771196770
		wds[13] = 1105958467
	elseif wd == "珊瑚玉衣" then
		wds[1] = "相传为龙王所用铠甲，穿上后能获得仙界的庇护。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 100
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2065701734
		wds[13] = 2474213076.0
	elseif wd == "金蚕披风" then
		wds[1] = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 110
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 2152164595.0
		wds[13] = 1839718700
	elseif wd == "乾坤护心甲" then
		wds[1] = "为道教流传的宝物，内有八卦乾坤玄机，能抵御极强的伤害。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 120
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 3449582254.0
		wds[13] = 3993401193.0
	elseif wd == "蝉翼金丝甲" then
		wds[1] = "月宫桂树上的灵蝉身上的蝉翼辅以金丝编织而成的铠甲。绝非寻常仙家之物"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 130
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 3962403816.0
		wds[13] = 60903505
	elseif wd == "金丝鱼鳞甲" then
		wds[1] = "水神遗留之物。时隔千年，依然充满着灵气。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 140
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1521396689
		wds[13] = 340629621
	elseif wd == "紫金磐龙甲" then
		wds[1] = "相传为黄帝的遗物。紫金磐龙，四周散发着神奇的力量"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 150
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 400462349
		wds[13] = 54627476
	elseif wd == "混元一气甲" then
		wds[1] = "混元一气所凝成的宝甲，至坚不摧之物，可与天地同寿"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 160
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1802888376
		wds[13] = 3052290356.0
	elseif wd == "流云素裙" then
		wds[1] = "相传是织女用流云织成的裙子，有很非常的防御力"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 70
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 3322971644.0
		wds[13] = 1771157433
	elseif wd == "七宝天衣" then
		wds[1] = "所谓天衣无缝，上有七宝华文，是可遇不可求的极品"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 80
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 4180182573.0
		wds[13] = 4034456555.0
	elseif wd == "飞天羽衣" then
		wds[1] = "相传以玉女飞天时所着衣装，受到天地精华的凝炼"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 90
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2637194038.0
		wds[13] = 1353325810
	elseif wd == "穰花翠裙" then
		wds[1] = "翠玉宝珠装饰而成的镶花裙，为王母娘娘赏赐之物。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 100
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 869673869
		wds[13] = 1836280211
	elseif wd == "金蚕丝裙" then
		wds[1] = "由千年玉桑上的金蚕吐丝为材料缝制而成的衣甲，有极强的韧性。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 110
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2107840682
		wds[13] = 1711858998
	elseif wd == "紫香金乌裙" then
		wds[1] = "汲取三界花魂而制成的裙子，穿上此裙香飘千里。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 120
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2898176567.0
		wds[13] = 273903801
	elseif wd == "碧霞彩云衣" then
		wds[1] = "收集了天界的碧霞五彩祥云编织而成的彩云衣，相传七仙女下凡时就是穿的这件。"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 130
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1972600201
		wds[13] = 2452196507.0
	elseif wd == "金丝蝉翼衫" then
		wds[1] = "月宫桂树上的灵蝉身上的蝉翼，并取自瑶池的金丝，经仙界仙女七七四十九天编织而成的软甲"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 140
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 910126967
		wds[13] = 2753459745.0
	elseif wd == "五彩凤翅衣" then
		wds[1] = "相传女娲娘娘所穿。穿上此衣能得到上古神灵的庇佑"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 150
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 2784730653.0
		wds[13] = 4139222799.0
	elseif wd == "鎏金浣月衣" then
		wds[1] = "以日月光芒所织造的霞衣，对敌之时往往令其目眩神驰"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 160
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1359780053
		wds[13] = 2596354317.0
	elseif wd == "九州履" then
		wds[1] = "天下名履，有非常不错的防御力和速度"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 70
		wds[11] = "物品图标.wdf"
		wds[12] = 1192033620
		wds[13] = 1060649976
	elseif wd == "万里追云履" then
		wds[1] = "可在任何地形疾走的神履，有不错的防御力可在任何地形疾走的神履，有不错的防御力"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 2928326681.0
		wds[13] = 1121748353
	elseif wd == "踏雪无痕" then
		wds[1] = "包蓄地之灵气，穿之幻影如风，踏雪无痕"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 90
		wds[11] = "物品图标.wdf"
		wds[12] = 1140435077
		wds[13] = 888533789
	elseif wd == "平步青云" then
		wds[1] = "寻常仙界之物，穿上此靴可平步青云，借风云飞腾。"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1930941353
		wds[13] = 771313116
	elseif wd == "七星逐月靴" then
		wds[1] = "天罡星所穿之靴。穿之及疾如风，三界之地任我遨游。"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 130
		wds[11] = "物品图标.wdf"
		wds[12] = 1623857733
		wds[13] = 2763463360.0
	elseif wd == "碧霞流云履" then
		wds[1] = "相传天界神匠以五彩天霞为材料，缝制而成的靴子。"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 3450927651.0
		wds[13] = 1312286829
	elseif wd == "九州履" then
		wds[1] = "相传是织女用流云织成的裙子，有很非常的防御力"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1192033620
		wds[13] = 1060649976
	elseif wd == "追云逐电" then
		wds[1] = "相传为雷公电母经过千万年炼化而成，穿上后可以追逐云电，日行万里。"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 110
		wds[11] = "物品图标.wdf"
		wds[12] = 1149904553
		wds[13] = 3062275612.0
	elseif wd == "乾坤天罡履" then
		wds[1] = "相传为太上老君所穿。乃天地之气编织而成"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 1238537463
		wds[13] = 2413633901.0
	elseif wd == "金丝逐日履" then
		wds[1] = "相传神匠为纪念夸父特造此靴。穿上可追逐太阳，风云皆抛于脑后"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 150
		wds[11] = "物品图标.wdf"
		wds[12] = 967718944
		wds[13] = 2734810061.0
	elseif wd == "辟尘分光履" then
		wds[1] = "上古秘宝，着此履者可于星尘间穿梭，与霞光相竞逐"
		wds[2] = 2
		wds[3] = 6
		wds[4] = 1
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 2907023969.0
		wds[13] = 3418242860.0
	elseif wd == "乱牙咬" then
		wds[1] = "神铁制的腰箍，能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 4081289026.0
		wds[13] = 1830358071
	elseif wd == "魔童大牙" then
		wds[1] = "巨大的魔牙，系在腰间能起到极强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 50
		wds[11] = "物品图标.wdf"
		wds[12] = 3917101017.0
		wds[13] = 246498213
	elseif wd == "攫魂铃" then
		wds[1] = "来自阴间的魔铃，佩在腰间，能起到极强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 3503405586.0
		wds[13] = 0xFF45D8EE
	elseif wd == "双魂引" then
		wds[1] = "来自阴间的宝物，可以佩在腰间，能起到极强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 3493684718.0
		wds[13] = 2691281237.0
	elseif wd == "兽王腰带" then
		wds[1] = "兽王曾使用过的腰饰，能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 70
		wds[11] = "物品图标.wdf"
		wds[12] = 2946790593.0
		wds[13] = 281570977
	elseif wd == "百窜云" then
		wds[1] = "神秘的缎带，系在腰间能起到较强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 70
		wds[11] = "物品图标.wdf"
		wds[12] = 1956418448
		wds[13] = 457288512
	elseif wd == "八卦锻带" then
		wds[1] = "暗藏八卦玄机的腰带，能起到极强的防御作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFCA16FA2
		wds[13] = 3676875648.0
	elseif wd == "圣王坠" then
		wds[1] = "相传为Saber的缠腰带,不如被谁偷走了,流入市场."
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 4161518362.0
		wds[13] = 2601988852.0
	elseif wd == "幻彩玉带" then
		wds[1] = "以集天界灵气之幻彩宝玉制成，有强大的护佑作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 90
		wds[11] = "物品图标.wdf"
		wds[12] = 2383008893.0
		wds[13] = 871942394
	elseif wd == "珠翠玉环" then
		wds[1] = "集合千年地气生出的翡翠宝珠雕琢而成的腰带，有强大的庇佑作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 4092702542.0
		wds[13] = 4023277032.0
	elseif wd == "金蟾含珠" then
		wds[1] = "相传“蟾”能口吐金钱为旺财之物。由金身蟾口含夜光珠再辅以金丝编织而成的腰带，世间少有，绝非人界之物"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 110
		wds[11] = "物品图标.wdf"
		wds[12] = 1436553780
		wds[13] = 415633459
	elseif wd == "乾坤紫玉带" then
		wds[1] = "千年紫玉雕琢而成的腰带，相传为道家失传的宝物，有极强的庇佑作用"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 1070699611
		wds[13] = 885196883
	elseif wd == "琉璃寒玉带" then
		wds[1] = "天界银河之水经亿万年凝结而成的玉石制成的腰带，不为寻常仙物"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 130
		wds[11] = "物品图标.wdf"
		wds[12] = 761737729
		wds[13] = 290193038
	elseif wd == "蝉翼鱼佩带" then
		wds[1] = "月宫桂树上的灵蝉身上的蝉翼以及金丝编织而成的腰带，所散发出来的灵气能抵御极强的伤害。"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 1344450765
		wds[13] = 2406174850.0
	elseif wd == "磐龙凤翔带" then
		wds[1] = "远古天神遗物，龙飞凤舞呈吉祥之态，佩戴起来能受到上古神兽的庇护。"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 150
		wds[11] = "物品图标.wdf"
		wds[12] = 2563450676.0
		wds[13] = 4015638612.0
	elseif wd == "紫霄云芒带" then
		wds[1] = "以云霞束起雷电所制成的腰带，会散发出闪电自行防御来袭的攻击。"
		wds[2] = 2
		wds[3] = 5
		wds[4] = 1
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 2824149864.0
		wds[13] = 2230161080.0
	elseif wd == "碧水青龙" then
		wds[1] = "龙形环状可戴在项部，有相当的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 70
		wds[11] = "物品图标.wdf"
		wds[12] = 2761659977.0
		wds[13] = 4002371974.0
	elseif wd == "鬼牙攫魂" then
		wds[1] = "来自阴间的饰物，佩带在身上有较强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 70
		wds[11] = "物品图标.wdf"
		wds[12] = 3973878954.0
		wds[13] = 2356109296.0
	elseif wd == "万里卷云" then
		wds[1] = "据说是大禹留下的宝物，佩带在身上有极强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 2814775714.0
		wds[13] = 3789092586.0
	elseif wd == "疾风之铃" then
		wds[1] = "来历不详的神秘饰物，佩带在身上有极强的法力作用"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 1790391367
		wds[13] = 3931720117.0
	elseif wd == "七彩玲珑" then
		wds[1] = "串有七彩玲珑的珍珠，集海之灵气，给予佩戴者祥瑞祝福"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 90
		wds[11] = "物品图标.wdf"
		wds[12] = 61182840
		wds[13] = 1790107582
	elseif wd == "黄玉琉佩" then
		wds[1] = "女娲补天遗留下的神石雕琢而成，拥有神奇的灵力。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFEBBC49F
		wds[13] = 3596201129.0
	elseif wd == "鸾飞凤舞" then
		wds[1] = "仙界仙女们常佩之物。呈祥瑞和平之气，定能给佩戴者带来好运。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 110
		wds[11] = "物品图标.wdf"
		wds[12] = 234019286
		wds[13] = 805892737
	elseif wd == "衔珠金凤佩" then
		wds[1] = "相传曾为嫦娥仙子佩戴之物。此物寓示着美好的追求与向往。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 1808237370
		wds[13] = 1175473770
	elseif wd == "七璜珠玉佩" then
		wds[1] = "以七个天珠以及天丝编制而成的坠子。集天地之灵气，能给予佩戴者吉祥如意。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 130
		wds[11] = "物品图标.wdf"
		wds[12] = 150576745
		wds[13] = 3350488882.0
	elseif wd == "鎏金点翠佩" then
		wds[1] = "玉皇大帝平常佩戴之物，集合了仙界之力，给予佩戴者神奇的魔力。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 91896384
		wds[13] = 2019827339
	elseif wd == "紫金碧玺佩" then
		wds[1] = "上古神兽遗留之物。四颗碧玉珠似乎依附着神奇的魔力。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 150
		wds[11] = "物品图标.wdf"
		wds[12] = 782330888
		wds[13] = 2103726062
	elseif wd == "落霞陨星坠" then
		wds[1] = "以陨落的星辰制成的宝玉，带有莫名的灵气与能量。"
		wds[2] = 2
		wds[3] = 2
		wds[4] = 1
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 4104259920.0
		wds[13] = 1986550511
	elseif wd == "翠叶环" then
		wds[1] = "以翠色欲滴的嫩叶为耳饰，似乎可见盎然春意。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1149024585
		wds[13] = 2216368651.0
	elseif wd == "明月珰" then
		wds[1] = "珍珠如明月，盈盈有辉光；故名为明月珰。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 3650986597.0
		wds[13] = 3981179940.0
	elseif wd == "玉蝶翩" then
		wds[1] = "彩蝶成双，翩然而舞；有双蝶偶然停驻于灵泉之畔，感其气息，化而为此玉饰。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 3698229499.0
		wds[13] = 143709305
	elseif wd == "点星芒" then
		wds[1] = "福禄寿三星以自身星芒点化而成的异石，紫芒莹然，贵不可言。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 2536845395.0
		wds[13] = 1905006111
	elseif wd == "凤羽流苏" then
		wds[1] = "灵凤舞九霄，振翼遗金羽；仙人偶得，以火元培之、以仙气养之，又缀以流苏，成一耳饰。静心而听，有凤鸣隐隐，奏大道之声。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 844320007
		wds[13] = 3361071999.0
	elseif wd == "焰云霞珠" then
		wds[1] = "后羿射日，十去其九；三足金乌之血化为丹霞，灼烈而烧，火光冲天。许久之后，其血方凝为此珠，赤光熠然。"
		wds[2] = 2
		wds[3] = 10
		wds[4] = 1
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 3977265974.0
		wds[13] = 4084046332.0
	elseif wd == "芝兰佩" then
		wds[1] = "玉树芝兰生于其中，良才美质现于其外。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 3766140893.0
		wds[13] = 191934716
	elseif wd == "逸云佩" then
		wds[1] = "飘逸如云，洒脱如风；君子之行也。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 1152854434
		wds[13] = 2332459964.0
	elseif wd == "莲音玦" then
		wds[1] = "仙池清莲所化的玉玦，隐隐可闻其中仙音缭绕，长佩于身，有助修行。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 161568319
		wds[13] = 2597783685.0
	elseif wd == "相思染" then
		wds[1] = "一寸相思一寸灰，牛郎织女分离之时滴落相思血泪，遇相思灰而化为鸳鸯之形，故名为“相思染”。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 1507181892
		wds[13] = 984926475
	elseif wd == "玄龙苍珀" then
		wds[1] = "潜龙出世，纵情一啸，声震凌霄宝殿；玉帝罪之，命天将封其龙气入苍珀之中，以为惩罚；又将玄龙苍珀送入红尘，以待有缘人。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 553282150
		wds[13] = 1579312169
	elseif wd == "碧海青天" then
		wds[1] = "鲲鹏破海而出，水浪滔天，排空怒卷；其化形之蜕则凝为一明玉，聚海中灵气而成奇宝，名曰“碧海青天”。"
		wds[2] = 2
		wds[3] = 11
		wds[4] = 2
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 2447598568.0
		wds[13] = 3142320075.0
	elseif wd == "枫华戒" then
		wds[1] = "以红枫饰于梧桐木上，炼以为戒。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 2185594639.0
		wds[13] = 3139746499.0
	elseif wd == "芙蓉戒" then
		wds[1] = "涉江采芙蓉，饰于白玉之上，是为芙蓉戒。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 800
		wds[11] = "物品图标.wdf"
		wds[12] = 2635839724.0
		wds[13] = 1184156454
	elseif wd == "金麟绕" then
		wds[1] = "金麒麟之影投于其上，使得此戒有护主之能，故名之“金麟绕”。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 1654287943
		wds[13] = 860123108
	elseif wd == "悦碧水" then
		wds[1] = "智者乐水，观音于水边有所悟，故以佛力凝碧水以为戒。迎光观之，清波荡漾。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 2174914937.0
		wds[13] = 2464404715.0
	elseif wd == "九曜光华" then
		wds[1] = "九曜星君为谢王母娘娘蟠桃会之请，特凝聚九曜光华，成此宝戒；戒中聚星辰之力，华彩耀目，仙气袅然。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 1052929823
		wds[13] = 559660606
	elseif wd == "太虚渺云" then
		wds[1] = "九霄云气飘渺无踪，自在逍遥；太上老君采撷七七四十九缕云气，以道法凝练九九八十一回，终成此戒，名为“太虚渺云”。"
		wds[2] = 2
		wds[3] = 12
		wds[4] = 3
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 2255044437.0
		wds[13] = 3289828157.0
	elseif wd == "香木镯" then
		wds[1] = "楠木所制，可辟邪护身。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1532648059
		wds[13] = 3126552891.0
	elseif wd == "翡玉镯" then
		wds[1] = "山灵水秀，方出璞石；翡玉镯以翡翠打造而成，自有光华。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 80
		wds[11] = "物品图标.wdf"
		wds[12] = 1508460761
		wds[13] = 607417840
	elseif wd == "墨影扣" then
		wds[1] = "仙人绘山水，留影玉石中；巧匠采墨影仙石制为手镯，形制奇巧，内蕴仙力。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 100
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFF46F65C
		wds[13] = 3475484945.0
	elseif wd == "花映月" then
		wds[1] = "嫦娥于广寒宫内观月照花、花映月，思念人间冷暖，故凝月华而成此手镯。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 120
		wds[11] = "物品图标.wdf"
		wds[12] = 968861447
		wds[13] = 2519773646.0
	elseif wd == "金水菩提" then
		wds[1] = "佛于西天观芸芸众生，有感于凡间诸般喜怒哀乐，故以纯净佛力凝为金水菩提，愿渡红尘之苦。佩戴此镯者，可得佛力为护，趋吉避凶。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 140
		wds[11] = "物品图标.wdf"
		wds[12] = 3618179037.0
		wds[13] = 3476964799.0
	elseif wd == "浮雪幻音" then
		wds[1] = "混沌初开，天地生成；其时也，有初生霜雪自天而降。此雪遇混沌清气后凝而不化，成一奇物，静听则有天地玄音。"
		wds[2] = 2
		wds[3] = 13
		wds[4] = 4
		wds[5] = 160
		wds[11] = "物品图标.wdf"
		wds[12] = 2989647617.0
		wds[13] = 0xFB5EEB41
	elseif wd == "冰灵蝶翼·月笼沙" then
		wds[1] = "夏日绮梦，雪浪淘纱。情深似海翻澜起，心悦君兮浪淘纱。织女素手织就浪淘纱，大浪淘纱，海枯石烂，此情不泯。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 592
		wds[13] = 593
	elseif wd == "冰雪玉兔" then
		wds[1] = "冬日雪花飘飘，穿上冰雪玉兔，化身为冰雪伶俐活泼可爱的小兔子和小伙伴们一起嬉戏玩耍吧！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 594
		wds[13] = 595
	elseif wd == "锦绣幻梦" then
		wds[1] = "春宵夜沉，一尚服局女官于梦中魂游，至不知何处仙境。仙境中男女未着锦衣华服、未戴玉镯金钗，打扮却别具一格，夺人耳目。女官魂归后遂作图纸，令人仿制之。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 596
		wds[13] = 597
	elseif wd == "浪淘纱" then
		wds[1] = "夏日绮梦，雪浪淘纱。情深似海翻澜起，心悦君兮浪淘纱。织女素手织就浪淘纱，大浪淘纱，海枯石烂，此情不泯。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 598
		wds[13] = 599
	elseif wd == "浪淘纱·月白" then
		wds[1] = "夏日绮梦，雪浪淘纱。情深似海翻澜起，心悦君兮浪淘纱。织女素手织就浪淘纱，大浪淘纱，海枯石烂，此情不泯。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "铃儿叮当" then
		wds[1] = "穿过大风雪，我们坐在雪橇上。飞奔过田野，我们欢笑又歌唱。小鹿儿铃声响，令人心欢畅，滑雪快乐多，铃儿响叮当。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 608
		wds[13] = 609
	elseif wd == "萌狮闹春" then
		wds[1] = "春暖花开，万物复苏。穿上萌狮闹春，化身为一只可爱的小狮子，一起在草地卖萌打滚，共度春日好时光。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 610
		wds[13] = 611
	elseif wd == "蜜蜂嗡嗡" then
		wds[1] = "穿花度柳飞如箭，粘絮寻香似落星。小小微躯能负重，器器薄翅会乘风。穿上可爱的蜜蜂嗡嗡，一起化身小蜜蜂嬉闹玩耍吧！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 612
		wds[13] = 613
	elseif wd == "齐天大圣" then
		wds[1] = "金甲玄绫慑九霄，降妖除魔显神通。穿上齐天大圣锦衣，心有热血，我便齐天！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 614
		wds[13] = 615
	elseif wd == "顽皮小恶魔" then
		wds[1] = "顽皮可爱好逗趣，童心未泯小恶魔。穿上这身顽皮小恶魔，在海外传来的奇特节日里和伙伴们一起玩耍吧！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 616
		wds[13] = 617
	elseif wd == "尖叫男爵" then
		wds[1] = "大唐盛世年间，海外有异域来贺。恰逢异域朝邦圣夜来临，异域人士纷纷穿着庆典礼服庆贺万圣节临。长安织造观之颇为有趣，趁此异域番邦节日之时，织就一批异域礼服。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 624
		wds[13] = 625
	elseif wd == "夏日清凉黑" then
		wds[1] = "夏日专属的清凉套装，穿着上，一起享受美好的夏日时光。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 626
		wds[13] = 627
	elseif wd == "纤云纱·墨黑" then
		wds[1] = "纤云浮光纱织就，金风玉露情缘深。织女素手织就，着其在身，便如金风玉露一相逢，胜却那人间无数。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 628
		wds[13] = 629
	elseif wd == "雁翎银钩·月笼沙" then
		wds[1] = "夏日绮梦，雪浪淘纱。情深似海翻澜起，心悦君兮浪淘纱。织女素手织就浪淘纱，大浪淘纱，海枯石烂，此情不泯。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 630
		wds[13] = 631
	elseif wd == "夜影红" then
		wds[1] = "如鬼魅般隐藏于夜色中，出其不意给予敌人致命一击。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 632
		wds[13] = 633
	elseif wd == "夜之孤煞" then
		wds[1] = "穿花蛱蝶深深见，点水蜻蜓款款飞。蝶翼做衣，比翼双飞。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 640
		wds[13] = 641
	elseif wd == "萤雪轻裘" then
		wds[1] = "萤雪微霜寒，早春轻裘暖。细雨纷飞，正是春寒料峭时节，着萤雪轻裘在身，如暖阳在抱沁人心脾。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 642
		wds[13] = 643
	elseif wd == "驭龙猎手" then
		wds[1] = "驭龙行天下，驰光耀千里。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 644
		wds[13] = 645
	elseif wd == "重溟软甲" then
		wds[1] = "碧墨深染英裘，缀以软甲银胄。传闻秘术大师于北溟的一个潮汐之夜，凝聚重溟之力制此软甲。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 646
		wds[13] = 647
	elseif wd == "竹林熊猫" then
		wds[1] = "翠翠绿竹随风摇，憨憨熊猫笑声扬。身着憨态可掬的熊猫锦衣，在三界尽情的畅快逍遥吧！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 648
		wds[13] = 649
	elseif wd == "金色羽裳" then
		wds[1] = "新添加锦衣——金色羽裳！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 648
		wds[13] = 649
	elseif wd == "白色鹿帽" then
		wds[1] = "新添加锦衣——白色鹿帽！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 648
		wds[13] = 649
	elseif wd == "成亲礼装" then
		wds[1] = "新添加锦衣——成亲礼装！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 648
		wds[13] = 649
	elseif wd == "雪色锦衣" then
		wds[1] = "新添加锦衣——雪色锦衣！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 648
		wds[13] = 649
	elseif wd == "斗战胜佛" then
		wds[1] = "新添加战斗锦衣——斗战胜佛！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新加图标.wdf"
		wds[12] = 260
		wds[13] = 259
	elseif wd == "斗战胜佛·月白" then
		wds[1] = "新添加战斗锦衣——斗战胜佛·月白！"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新加图标.wdf"
		wds[12] = 258
		wds[13] = 257
	elseif wd == "浪淘纱·白" then
		wds[1] = "【新添加战斗锦衣】夏日绮梦，雪浪淘纱。情深似海翻澜起，心悦君兮浪淘纱。织女素手织就浪淘纱，大浪淘纱，海枯石烂，此情不泯。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦1" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦2" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦3" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦4" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦5" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦6" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦7" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦8" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦9" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦10" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦11" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦12" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "战锦13" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "化圣战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "青花瓷战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "青花瓷小"
		wds[13] = "青花瓷大"
	elseif wd == "飞天舞战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "飞天舞小"
		wds[13] = "飞天舞大"
	elseif wd == "羽仙歌战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "羽仙歌小"
		wds[13] = "羽仙歌大"
	elseif wd == "浪淘纱战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "浪淘纱小"
		wds[13] = "浪淘纱大"
	elseif wd == "冰雪玉兔战锦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d6.dll"
		wds[12] = "冰雪玉兔小"
		wds[13] = "冰雪玉兔大"
	elseif wd == "花间梦" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "花间梦小"
		wds[13] = "花间梦大"
	elseif wd == "鹿角弯弯" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "鹿角弯弯小"
		wds[13] = "鹿角弯弯大"
	elseif wd == "水云归" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "水云归小"
		wds[13] = "水云归大"
	elseif wd == "飞天舞朝露" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d6.dll"
		wds[12] = "飞天舞朝露小"
		wds[13] = "飞天舞朝露大"
	elseif wd == "炽云缎墨黑" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "炽云缎墨黑小"
		wds[13] = "炽云缎墨黑大"
	elseif wd == "从军行" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "从军行小"
		wds[13] = "从军行大"
	elseif wd == "从军行月曜" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "从军行月曜小 "
		wds[13] = "从军行月曜大"
	elseif wd == "绯雪织凝霜" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d6.dll"
		wds[12] = "绯雪织凝霜小"
		wds[13] = "绯雪织凝霜大"
	elseif wd == "冰寒绡月白" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d6.dll"
		wds[12] = "冰寒绡月白小"
		wds[13] = "冰寒绡月白大"
	elseif wd == "蒹葭苍苍寒月" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "蒹葭苍苍寒月小"
		wds[13] = "蒹葭苍苍寒月大"
	elseif wd == "浪淘纱墨黑" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "浪淘纱墨黑小"
		wds[13] = "浪淘纱墨黑大"
	elseif wd == "萌萌小厨" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "萌萌小厨小"
		wds[13] = "萌萌小厨大"
	elseif wd == "霞姿月韵" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "霞姿月韵小"
		wds[13] = "霞姿月韵大"
	elseif wd == "雪眸影夜烬" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "雪眸影夜烬小"
		wds[13] = "雪眸影夜烬大"
	elseif wd == "夜影" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "夜影小"
		wds[13] = "夜影大"
	elseif wd == "官服" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d6.dll"
		wds[12] = "官服小"
		wds[13] = "官服大"
	elseif wd == "闲云野鹤" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "闲云野鹤小"
		wds[13] = "闲云野鹤大"
	elseif wd == "明光宝甲" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "nx3d5.dll"
		wds[12] = "明光宝甲小"
		wds[13] = "明光宝甲大"
	elseif wd == "化圣" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "化圣小"
		wds[13] = "化圣大"
	elseif wd == "渡劫" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "渡劫小"
		wds[13] = "渡劫大"
	elseif wd == "白金箍" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 600
		wds[13] = 601
	elseif wd == "青花瓷月白" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "青花瓷小"
		wds[13] = "青花瓷大"
	elseif wd == "青花瓷墨黑" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新bb.dll"
		wds[12] = "青花瓷墨黑小"
		wds[13] = "青花瓷墨黑大"
	elseif wd == "花重云" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新bb.dll"
		wds[12] = "花重云小"
		wds[13] = "花重云大"
	elseif wd == "水云归墨黑" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新bb.dll"
		wds[12] = "水云归墨黑小"
		wds[13] = "水云归墨黑大"
	elseif wd == "五毒" then
		wds[1] = "【新添加战斗锦衣】"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "新bb.dll"
		wds[12] = "五毒小"
		wds[13] = "五毒大"
	elseif wd == "财源滚滚" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "财源滚滚小"
		wds[13] = "财源滚滚大"
	elseif wd == "寒霜冰凌" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "寒霜冰凌小"
		wds[13] = "寒霜冰凌大"
	elseif wd == "金枝春绽" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "金枝春绽小"
		wds[13] = "金枝春绽大"
	elseif wd == "九尾庞庞" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "九尾庞庞小"
		wds[13] = "九尾庞庞大"
	elseif wd == "九霄云图" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "九霄云图小"
		wds[13] = "九霄云图大"
	elseif wd == "浪淘沙墨黑" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "浪淘沙墨黑小"
		wds[13] = "浪淘沙墨黑大"
	elseif wd == "浪淘沙月白" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "浪淘沙月白小"
		wds[13] = "浪淘沙月白大"
	elseif wd == "凌霄天宫墨黑" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "凌霄天宫墨黑小"
		wds[13] = "凌霄天宫墨黑大"
	elseif wd == "凌霄天宫" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "凌霄天宫小"
		wds[13] = "凌霄天宫大"
	elseif wd == "凌霄天宫月白" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "凌霄天宫月白小"
		wds[13] = "凌霄天宫月白大"
	elseif wd == "流云蝶影" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "流云蝶影小"
		wds[13] = "流云蝶影大"
	elseif wd == "琪草瑶花" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "琪草瑶花小"
		wds[13] = "琪草瑶花大"
	elseif wd == "琪花瑶草" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "琪花瑶草小"
		wds[13] = "琪花瑶草大"
	elseif wd == "沙骨王座" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "沙骨王座小"
		wds[13] = "沙骨王座大"
	elseif wd == "午夜魔蝠" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "午夜魔蝠小"
		wds[13] = "午夜魔蝠大"
	elseif wd == "星驰剑阵染" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "星驰剑阵染小"
		wds[13] = "星驰剑阵染大"
	elseif wd == "星驰剑阵" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "星驰剑阵小"
		wds[13] = "星驰剑阵大"
	elseif wd == "月半潮墨黑" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "月半潮墨黑小"
		wds[13] = "月半潮墨黑大"
	elseif wd == "月半潮" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "月半潮小"
		wds[13] = "月半潮大"
	elseif wd == "月半潮月白" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "月半潮月白小"
		wds[13] = "月半潮月白大"
	elseif wd == "云龙梦墨黑" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "云龙梦墨黑小"
		wds[13] = "云龙梦墨黑大"
	elseif wd == "云龙梦" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "云龙梦小"
		wds[13] = "云龙梦大"
	elseif wd == "云龙梦月白" then
		wds[1] = "新添加光环。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "r3d.dll"
		wds[12] = "云龙梦月白小"
		wds[13] = "云龙梦月白大"
	elseif wd == "甜蜜糖果" then
		wds[1] = "甜蜜的糖果，满载着我对你的爱意。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 102673511
		wds[13] = 790155222
	elseif wd == "星光" then
		wds[1] = "流星飞舞，炫彩照人，熠熠生辉。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2534298146.0
		wds[13] = 135993849
	elseif wd == "小心机" then
		wds[1] = "小心机，小幸福，小感动~。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3313665586.0
		wds[13] = 2674893002.0
	elseif wd == "青草足迹" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "糖果足迹" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "玉剑足迹" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "晶翅足迹" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "爱的泡泡" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "浮游水母" then
		wds[1] = "这位深海的小精灵，带来了海洋的味道。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2524287630.0
		wds[13] = 1328769110
	elseif wd == "闪光足迹" then
		wds[1] = "我贪恋凡世的喧嚣和明亮，享尽世俗的快乐和幸福。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1610779241
		wds[13] = 3070280310.0
	elseif wd == "跃动喷泉" then
		wds[1] = "清泉喷涌，水花四溅，给这个夏日带来冰冰凉的舒爽。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2313370449.0
		wds[13] = 1974607575
	elseif wd == "彩蝶飞" then
		wds[1] = "踏访三界时，有翩翩飞舞的彩蝶作伴岂不乐哉！。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 589770793
		wds[13] = 3143513727.0
	elseif wd == "锦鲤游" then
		wds[1] = "有锦鲤相伴守护，想必一定会有好事发生的"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 0xFE5A817B
		wds[13] = 2742548880.0
	elseif wd == "踩浪花" then
		wds[1] = "踩呀踩，踩出浪花一朵朵~。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 769138827
		wds[13] = 3522531713.0
	elseif wd == "藤蔓蔓延" then
		wds[1] = "藤蔓蔓延，一路行走，花草丛生。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1021611291
		wds[13] = 3992642779.0
	elseif wd == "随风舞" then
		wds[1] = "风乍起，一株小小蒲公英的种子随之飘舞纷飞。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2786204268.0
		wds[13] = 3907757234.0
	elseif wd == "爱的风暴" then
		wds[1] = "所到之处，刮起爱的龙卷风"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 944655185
		wds[13] = 2150129382.0
	elseif wd == "落羽" then
		wds[1] = "轻柔的羽毛飘落，洒落一地。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1806652386
		wds[13] = 898823926
	elseif wd == "星如雨" then
		wds[1] = "掩轩辕，星落如雨~可别忘记许愿哦~。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3414456168.0
		wds[13] = 2498259072.0
	elseif wd == "鱼群足迹" then
		wds[1] = "曳尾于洋中，出游从容，鱼之乐也。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3501516563.0
		wds[13] = 3652775480.0
	elseif wd == "心享气球" then
		wds[1] = "盈盈气球，浓浓心意，飘飘风中，怡然自乐。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 987958576
		wds[13] = 1348682544
	elseif wd == "璀璨烟花" then
		wds[1] = "火树银花合，星桥铁锁开。烟花璀璨，照亮身后。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 282343260
		wds[13] = 719677769
	elseif wd == "星光泡泡" then
		wds[1] = "漫天飞舞着的泡泡晶莹剔透，闪烁着淡淡星光。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3501516563.0
		wds[13] = 3501516563.0
	elseif wd == "飞雪足迹" then
		wds[1] = "雪花飘，雪花飞。飘扬起的雪花，落在身上，晶莹而美丽。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1719805215
		wds[13] = 1333501899
	elseif wd == "蝴蝶足迹" then
		wds[1] = "泡了个花瓣澡身体好香，蝴蝶都飞来围着我转。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[5] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3506969179.0
		wds[13] = 281454044
	elseif wd == "碧华锦凝雪" then
		wds[1] = "瑰梦溢彩碧华锦，寒霜凌雪晓星沉。西牛贺洲贡天庭碧水缎一匹，其色宛若碧水，金线铺就绮罗。织女采数九寒天凌雪霜，缀碧水缎之上，星落寒月，耀世夺目。"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "黑浪淘纱" then
		wds[1] = "黑浪淘纱"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "飞天舞" then
		wds[1] = "飞天舞"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "青花瓷" then
		wds[1] = "青花瓷"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "万灵夜游" then
		wds[1] = "万灵夜游"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "羽仙歌" then
		wds[1] = "羽仙歌"
		wds[2] = 2
		wds[3] = 15
		wds[4] = 1
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFED8424
		wds[13] = 0xFFED8423
	elseif wd == "太古" then
		wds[1] = "上古凶兽所化的双翼"
		wds[2] = 2
		wds[3] = 14
		wds[4] = 5
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 694146241
		wds[13] = 12158361
	elseif wd == "浩瀚星河" then
		wds[1] = "天河夜转漂回星,银浦流云学水声。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1307449113
		wds[13] = 2113402051
	elseif wd == "烈焰澜翻" then
		wds[1] = "烈焰澜翻为说时，百千诸佛尽攒眉。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 3045445429.0
		wds[13] = 0xFBBA047B
	elseif wd == "双鲤寄情" then
		wds[1] = "鸿雁在云鱼在水，惆怅此情难寄。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 2179190794.0
		wds[13] = 1218966540
	elseif wd == "凌波微步" then
		wds[1] = "体迅飞凫，飘忽若神。凌波微步，罗袜生尘。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 4074058616.0
		wds[13] = 1853383285
	elseif wd == "水墨游龙" then
		wds[1] = "翩若惊鸿，婉若游龙。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 983671320
		wds[13] = 1627730178
	elseif wd == "星光熠熠" then
		wds[1] = "天接云涛连晓雾，星河欲转千帆舞。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 3341629430.0
		wds[13] = 3984662528.0
	elseif wd == "荷塘涟漪" then
		wds[1] = "池面风来波潋潋,波间露下叶田田。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 2509765663.0
		wds[13] = 1225190718
	elseif wd == "雪花飘落" then
		wds[1] = "白雪却嫌春色晚,故穿庭树作飞花。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB11
		wds[13] = 0xFFAABB12
	elseif wd == "月影婆娑" then
		wds[1] = "今人不见古时月,今月曾经照古人。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB13
		wds[13] = 0xFFAABB14
	elseif wd == "祥云瑞气" then
		wds[1] = "日日祥云瑞气连,农家应作大神仙。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB09
		wds[13] = 0xFFAABB10
	elseif wd == "花的海洋" then
		wds[1] = "无意苦争春,一任群芳妒。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB05
		wds[13] = 0xFFAABB06
	elseif wd == "爱的光影" then
		wds[1] = "爱心闪动,光影年华。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB01
		wds[13] = 0xFFAABB02
	elseif wd == "珠落玉盘" then
		wds[1] = "嘈嘈切切错杂弹，大珠小珠落玉盘。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB15
		wds[13] = 0xFFAABB16
	elseif wd == "红叶随风" then
		wds[1] = "晚风岸抚柳,看红叶秋色然。"
		wds[2] = 2
		wds[3] = 16
		wds[4] = 2
		wds[5] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB03
		wds[13] = 0xFFAABB04
	elseif wd == "龙卷风足迹" then
		wds[1] = "龙卷风来啦！大家都快闪开，被刮跑了可不是玩的。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB20
		wds[13] = 0xFFAABB21
	elseif wd == "皮球足迹" then
		wds[1] = "真皮球是一种材质的球，适合在木地板上打。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB23
		wds[13] = 0xFFAABB22
	elseif wd == "雀屏足迹" then
		wds[1] = "孔雀开屏，骄傲的尾巴闪耀着灼灼光华。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB25
		wds[13] = 0xFFAABB24
	elseif wd == "旋律足迹" then
		wds[1] = "生动的语言节奏和丰富的生活节奏是旋律节奏的自然基础。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB27
		wds[13] = 0xFFAABB26
	elseif wd == "枫叶足迹" then
		wds[1] = "秋风扫落叶，行走时犹如带着秋风扫起一片片枫叶。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB29
		wds[13] = 0xFFAABB28
	elseif wd == "飞天足迹" then
		wds[1] = "多种颜色至于身后，犹如飞天般的感觉"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB31
		wds[13] = 0xFFAABB30
	elseif wd == "两心相悦足迹" then
		wds[1] = "从我的第一眼看到你，我就爱上你了。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFFAABB33
		wds[13] = 0xFFAABB32
	elseif wd == "心花怒放" then
		wds[1] = "故～，髓海难枯，而杰构鸿篇，大率超群出类。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 53
		wds[13] = 0xFFAABB34
	elseif wd == "雷电足迹" then
		wds[1] = "电闪雷鸣，莫装逼，装逼被雷劈。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 55
		wds[13] = 54
	elseif wd == "寒冰足迹" then
		wds[1] = "行走间，犹如冬天来到。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 57
		wds[13] = 56
	elseif wd == "星星祈愿" then
		wds[1] = "花一些时间向星星许愿吧。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 65
		wds[13] = 64
	elseif wd == "地狱焰火" then
		wds[1] = "那闪动的火光肆无忌惮燃烧着，跳跃着。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 67
		wds[13] = 66
	elseif wd == "元宝足迹" then
		wds[1] = "我是一个财迷，有钱我就会出现。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 69
		wds[13] = 68
	elseif wd == "光剑足迹" then
		wds[1] = "背后出现了神秘的光晕，有锐利的光芒投射过来。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 71
		wds[13] = 70
	elseif wd == "雪花足迹" then
		wds[1] = "雪花纷飞，犹如大雪即将来临。"
		wds[2] = 2
		wds[3] = 17
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 73
		wds[13] = 72
	elseif wd == "灵丹" then
		wds[1] = "召唤兽进阶的道具，能够唤醒召唤兽体内的潜力，突破界限，完成进阶；进阶后的召唤兽可以增加一定的资质和成长，并额外获得30潜力点"
		wds[2] = 3
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3827258198.0
		wds[13] = 1534423307
	elseif wd == "鬼谷子" then
		wds[1] = "战国智者鬼谷子所著的兵法兼玄学书籍。"
		wds[2] = 13
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFE9A9D86
		wds[13] = 1264860140
	elseif wd == "宠物饰品通用丹" then
		wds[1] = "所有宠物通用的饰品装备（特色宠物必备）"
		wds[11] = "物品图标.wdf"
		wds[12] = 3650986597.0
		wds[13] = 3981179940.0
		wds[2] = 680
		wds[3] = 1
		wds[4] = 1
	elseif wd == "超级金柳露" then
		wds[1] = "一种非常难得的仙露，据说有着令万物回归到原始状态的奇效,是用来炼妖的神奇物品。可以把召唤兽洗练成0级(有一定概率变异),且资质较好。"
		wds[2] = 3
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1572601177
		wds[13] = 2703428501.0
	elseif wd == "青龙石" then
		wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
		wds[2] = 5
		wds[3] = 4
		wds[4] = 1
		wds[5] = "装备镶嵌时附加10%气血上限和10%魔法上限"
		wds[11] = "物品图标.wdf"
		wds[12] = 2289281503.0
		wds[13] = 603616920
	elseif wd == "白虎石" then
		wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
		wds[2] = 5
		wds[3] = 4
		wds[4] = 2
		wds[5] = "装备镶嵌时附加5%伤害"
		wds[11] = "物品图标.wdf"
		wds[12] = 2867857574.0
		wds[13] = 1492919136
	elseif wd == "朱雀石" then
		wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
		wds[2] = 5
		wds[3] = 4
		wds[4] = 3
		wds[5] = "装备镶嵌时附加5%灵力"
		wds[11] = "物品图标.wdf"
		wds[12] = 650195920
		wds[13] = 3642232128.0
	elseif wd == "玄武石" then
		wds[1] = "带有灵气的石头，是强化装备所需的原料之一"
		wds[2] = 5
		wds[3] = 4
		wds[4] = 4
		wds[5] = "装备镶嵌时附加5%防御"
		wds[11] = "物品图标.wdf"
		wds[12] = 727733710
		wds[13] = 3146274026.0
	elseif wd == "打狗棒" then
		wds[1] = "在四季活动-天狗食月中在战斗中对噬月天狗使用，可以对其造成2000点伤害"
		wds[2] = 100
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2772806600.0
		wds[13] = 3495666540.0
	elseif wd == "月饼" then
		wds[1] = "中秋节活动的奖品。食用后可以增加人物1点潜能（不可以对召唤兽使用）"
		wds[2] = 1
		wds[3] = 10
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2221593093.0
		wds[13] = 1236596444
		elseif wd == "宝宝月饼" then
		wds[1] = "中秋节活动的奖品。食用后可以增加宠物1点潜能"
		wds[2] = 1
		wds[3] = 10
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2221593093.0
		wds[13] = 1236596444
	elseif wd == "潜能果" then
		wds[1] = "传说中激发人物属性的潜能，可延年益寿。食用后可以增加人物2点潜能,但每个人物最多食用对应等级阶段的数量!"
		wds[2] = 1
		wds[3] = 10
		wds[4] = 1
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2153916753.0
		wds[13] = 2231564299.0
	elseif wd == "元宵" then
		wds[1] = "元宵圆元宵圆元宵不圆不要钱！"
		wds[2] = 1
		wds[3] = 10
		wds[4] = 2
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1378629447
		wds[13] = 4031341779.0
	elseif wd == "月华露" then
		wds[1] = "昆仑山顶采集的皓月光华，是增加修为的仙露。由于月有阴晴圆缺，所以不同时间采集的光华效果也不尽相同。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 24071683
		wds[13] = 40788283
	elseif wd == "九转金丹" then
		wds[1] = "太上老君八卦炉中炼制的灵丹，服用之后可以增加人物的修炼经验。不同火候炼制的丹药，效果自然也不相同。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1510904583
		wds[13] = 1857306824
	elseif wd == "修炼果" then
		wds[1] = "具有灵气的果子，为修炼之士所常用。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 432990065
		wds[13] = 254688831
	elseif wd == "炼兽真经" then
		wds[1] = "武林秘籍，给予召唤兽学习后可提升成长。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 458137170
		wds[13] = 1503770314
	elseif wd == "蟠桃" then
		wds[1] = "具有灵气的果子，为修炼之士所常用。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 458137170
		wds[13] = 1503770314
	elseif wd == "三界悬赏令" then
		wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1170055373
		wds[13] = 1915842717
	elseif wd == "贼王的线索" then
		wds[1] = "记载着贼王的线索信息，右键点击后可获得贼王的线索任务。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3719466168.0
		wds[13] = 1676919794
	elseif wd == "5级宝石礼包" then
		wds[1] = "装着一代珠宝，散发着宝石的光华"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2535767216.0
		wds[13] = 0xFE37E4E0
	elseif wd == "7级宝石礼包" then
		wds[1] = "装着一代珠宝，散发着宝石的光华"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2535767216.0
		wds[13] = 0xFE37E4E0
	elseif wd == "10级宝石礼包" then
		wds[1] = "装着一代珠宝，散发着宝石的光华"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2535767216.0
		wds[13] = 0xFE37E4E0
	elseif wd == "情报" then
		wds[1] = "敌军的情报，速速交给李将军吧！"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3719466168.0
		wds[13] = 1676919794
	elseif wd == "天眼通符" then
		wds[1] = "可以查看部分任务的准确坐标。"
		wds[2] = 4
		wds[3] = 500
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3744973957.0
		wds[13] = 2141462591
	elseif wd == "附魔宝珠" then
		wds[1] = "蕴含天地精华的宝珠，可为一件人物装备随机附加一种特殊效果。（右键使用）"
		wds[2] = 4
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2776751
		wds[13] = 1465837133
	elseif wd == "传音纸鹤" then
		wds[1] = "神仙遗留下来的纸鹤，以无上法力将声音传至千里之外。"
		wds[2] = 9
		wds[3] = 9
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3785735584.0
		wds[13] = 173352704
	elseif wd == "碎星锤" then
		wds[1] = "蕴含神秘的法力,可以将装备上的等级最高的宝石锻造效果清除,但是宝石同样会被神秘的力量击碎。"
		wds[2] = 4
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3167031388.0
		wds[13] = 1694420888
	elseif wd == "超级碎星锤" then
		wds[1] = "拥有比碎星锤更加强大的法力,可以一次将装备上的宝石锻造效果全部清除,并获得一颗与锻造等级相同的宝石。"
		wds[2] = 4
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2480807247.0
		wds[13] = 522264062
	elseif wd == "小雪块" then
		wds[1] = "在堆雪人活动上交给雪人可以增加堆雪人进度2点"
		wds[2] = 20
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2616078033.0
		wds[13] = 3168841221.0
	elseif wd == "大雪块" then
		wds[1] = "在堆雪人活动上交给雪人可以增加堆雪人进度4点"
		wds[2] = 20
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1140430982
		wds[13] = 509384505
	elseif wd == "雪人鼻子" then
		wds[1] = "在堆雪人中雪人成长最后所需要的物品"
		wds[2] = 6
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2455700195.0
		wds[13] = 1484448566
	elseif wd == "雪人帽子" then
		wds[1] = "在堆雪人中雪人成长最后所需要的物品"
		wds[2] = 6
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2689609124.0
		wds[13] = 3565667187.0
	elseif wd == "雪人眼睛" then
		wds[1] = "在堆雪人中雪人成长最后所需要的物品"
		wds[2] = 6
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1540560660
		wds[13] = 3405625744.0
	elseif wd == "点化石" then
		wds[1] = "记载着神奇能力的石头\n可以为宝宝的装备#G/打造镶嵌#W/上套装效果"
		wds[2] = 5
		wds[3] = 5
		wds[4] = 1
		wds[11] = "路飞.wdf"
		wds[12] = 2684354564.0
		wds[13] = 2684354563.0
	elseif wd == "无级别点化石" then
		wds[1] = "该道具极为珍贵\n只能找#R逗比比#给你使用"
		wds[2] = 5
		wds[3] = 5
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3795548318.0
		wds[13] = 39205137
	elseif wd == "圣兽丹" then
		wds[1] = "与特定召唤兽炼妖合成，讲丹内上古圣兽之态与召唤兽融合，合成出该召唤兽的饰品，饰品能增加新的形态装饰效果。【说明】炼妖过程中使用的召唤兽会被消耗。"
		wds[2] = 3
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2150217994.0
		wds[13] = 2149809423.0
	elseif wd == "吸附石" then
		wds[1] = "记载着神奇能力的石头，可以吸取宝宝身上的技能。#Y(右键使用可吸附兽决)"
		wds[2] = 3
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1275527326
		wds[13] = 3214164055.0
	elseif wd == "鬼王的密信" then
		wds[1] = "从捣乱的鬼怪身上截获的一封密信"
		wds[2] = 21
		wds[3] = 1
		wds[4] = 1
		wds[8] = "右键即可领取鬼王任务"
		wds[11] = "物品图标.wdf"
		wds[12] = 3613032220.0
		wds[13] = 3926816479.0
	elseif wd == "梦魇幻境" then
		wds[1] = "似乎藏着很多人的美梦呢"
		wds[2] = 21
		wds[3] = 1
		wds[4] = 2
		wds[8] = "右键即可领取无尽梦魇任务"
		wds[11] = "物品图标.wdf"
		wds[12] = 625552950
		wds[13] = 1715455834
	elseif wd == "突厥密令" then
		wds[1] = "从突厥军中身上截获的令牌，似乎可以混入其中。"
		wds[2] = 21
		wds[3] = 1
		wds[4] = 3
		wds[8] = "右键即可领取突厥入侵任务"
		wds[11] = "物品图标.wdf"
		wds[12] = 2045372080
		wds[13] = 3897229810.0
	elseif wd == "枯萎的金莲" then
		wds[1] = "尘世间人性的金莲，已因心魔之灭而焦枯。"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 1
		wds[8] = nil
		wds[11] = "物品图标.wdf"
		wds[12] = 2296182976.0
		wds[13] = 996116316
	elseif wd == "赤叶甘草" then
		wds[1] = "王大嫂的儿子病了，听说这种稀有的赤叶甘草可以救他一命。"
		wds[2] = 1001
		wds[3] = 2
		wds[4] = 1
		wds[8] = nil
		wds[11] = "物品图标.wdf"
		wds[12] = 1989510735
		wds[13] = 965227968
	elseif wd == "红烧鱼" then
		wds[1] = "王大嫂独家制作，美味极了。"
		wds[2] = 1001
		wds[3] = 2
		wds[4] = 2
		wds[8] = nil
		wds[11] = "物品图标.wdf"
		wds[12] = 2464612516.0
		wds[13] = 1298696834
	elseif wd == "松风灵芝" then
		wds[1] = "生长在松林之中的珍贵灵芝，十分稀有"
		wds[2] = 1001
		wds[3] = 2
		wds[4] = 3
		wds[8] = nil
		wds[11] = "物品图标.wdf"
		wds[12] = 796688846
		wds[13] = 1768691950
	elseif wd == "玲珑" then
		wds[1] = "交给观音大士，是锻造照妖镜所需要的材料。"
		wds[2] = 21
		wds[3] = 2
		wds[4] = 1
		wds[8] = nil
		wds[11] = "物品图标.wdf"
		wds[12] = 3718370218.0
		wds[13] = 3554423075.0
	elseif wd == "普通木材" then
		wds[1] = "一种常见的建筑木料，在搭建房屋时必须要用到它。"
		wds[2] = 21
		wds[3] = 2
		wds[4] = 2
		wds[8] = "在“车迟斗法副本”中可以增加道观建设度4点"
		wds[11] = "物品图标.wdf"
		wds[12] = 1192555457
		wds[13] = 4056791876.0
	elseif wd == "高级木材" then
		wds[1] = "比较稀有的建筑木料，在搭建房屋时必须要用到它。"
		wds[2] = 21
		wds[3] = 2
		wds[4] = 2
		wds[8] = "在“车迟斗法副本”中可以增加道观建设度20点"
		wds[11] = "物品图标.wdf"
		wds[12] = 757799681
		wds[13] = 2818741734.0
	elseif wd == "摇钱树苗" then
		wds[1] = "摇钱树的树苗，在特定地方种下，可能有意想不到的收获。"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 756259299
		wds[13] = 2183480693.0
	elseif wd == "金刚石" then
		wds[1] = "最坚硬美丽的宝石，是传说中的五宝之一。"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1366964991
		wds[13] = 2037540820
	elseif wd == "定魂珠" then
		wds[1] = "可以用来寻找失散在人间鬼魂的奇妙宝珠，是传说中的五宝之一"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 998493704
		wds[13] = 1616709439
	elseif wd == "避水珠" then
		wds[1] = "用这件宝物，不熟水性的人也可以去到深海底，是传说中的五宝之一"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2939768623.0
		wds[13] = 2945150149.0
	elseif wd == "珍珠" then
		wds[1] = "光彩夺目的珍珠,可镶嵌在武器装备上,恢复装备一定的耐久度,每件装备镶嵌珍珠的数量没有限制,但装备等级高于珍珠等级时无法镶嵌。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 7
		wds[8] = "装备"
		wds[9] = "提高装备耐久"
		wds[11] = "物品图标.wdf"
		wds[12] = 1629038276
		wds[13] = 1489360556
	elseif wd == "夜光珠" then
		wds[1] = "能在夜里发光的明珠，是传说中的五宝之一。"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1150805256
		wds[13] = 2444966471.0
	elseif wd == "龙鳞" then
		wds[1] = "龙族下颚的鳞，愤怒和威力的象征，是传说中的五宝之一。"
		wds[2] = 21
		wds[3] = 3
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 476330030
		wds[13] = 2235282650.0
	elseif wd == "属性石" then
		wds[1] = "提高装备属性的珍惜灵石，要给装备镶嵌上才能产生效果！"
		wds[2] = 5
		wds[3] = 5
		wds[4] = 99
		wds[8] = "武器、装备、召唤兽装备"
		wds[11] = "新加图标.wdf"
		wds[12] = 8
		wds[13] = 9
		elseif wd == "中秋炮" then
		wds[1] = "降低装备属性的珍惜灵石，要给装备镶嵌上才能产生效果！"
		wds[2] = 5
		wds[3] = 5
		wds[4] = 99
		wds[8] = "武器、装备、召唤兽装备"
		wds[11] = "新加图标.wdf"
		wds[12] = 8
		wds[13] = 9
	elseif wd == "光芒石" then
		wds[1] = "聚天地之精华而成的宝石，通体散发着夺目的光彩，令人不敢直视。是用来合成装备的神奇矿石。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 1
		wds[8] = "铠甲、腰带"
		wds[9] = "提高40点气血上限"
		wds[11] = "物品图标.wdf"
		wds[12] = 182374181
		wds[13] = 1097166752
	elseif wd == "月亮石" then
		wds[1] = "由月宫中流落到人间的宝石，吸取了月光之精华，能起到鼓舞和提神的作用。是用来合成装备的神奇矿石。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 2
		wds[8] = "铠甲、头盔"
		wds[9] = "提高12点防御力"
		wds[11] = "物品图标.wdf"
		wds[12] = 3488952287.0
		wds[13] = 3067278649.0
	elseif wd == "太阳石" then
		wds[1] = "从上古时期流传至今的“太阳之石”，附有神力。是用来合成装备的神奇矿石。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 3
		wds[8] = "武器、头盔"
		wds[9] = "提高8点伤害力"
		wds[11] = "物品图标.wdf"
		wds[12] = 1387446262
		wds[13] = 2414382713.0
	elseif wd == "舍利子" then
		wds[1] = "佛的舍利子是合成装备的神秘材料。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 4
		wds[8] = "铠甲、饰品"
		wds[9] = "提高6点灵力"
		wds[11] = "物品图标.wdf"
		wds[12] = 2228232000.0
		wds[13] = 3414114421.0
	elseif wd == "红玛瑙" then
		wds[1] = "红色的玛瑙石，是合成装备的神秘材料。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 5
		wds[8] = "武器、头盔"
		wds[9] = "提高25点命中"
		wds[11] = "物品图标.wdf"
		wds[12] = 2783082158.0
		wds[13] = 3655137177.0
	elseif wd == "黑宝石" then
		wds[1] = "坚硬无比的宝石；表面看起来毫不起眼，实际上却蕴涵着巨大的力量。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 6
		wds[8] = "腰带、鞋子"
		wds[9] = "提高8点速度"
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFADEE7FC
		wds[13] = 1963658266
	elseif wd == "神秘石" then
		wds[1] = "在民间流传已久的的宝石，来历不详；似乎对外界施与的打击有着一股神秘的抗力。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 7
		wds[8] = "武器、腰带、鞋子"
		wds[9] = "提高12点气血回复效果"
		wds[11] = "物品图标.wdf"
		wds[12] = 749980813
		wds[13] = 3278224394.0
	elseif wd == "昆仑玉" then
		wds[1] = "质地细润，淡雅清爽，产自昆仑山之东，抚之心旷神怡。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 1001
		wds[8] = "武器、衣服"
		wds[9] = "提高8点治疗能力"
		wds[11] = "路飞.wdf"
		wds[12] = 4424
		wds[13] = 4423
	elseif wd == "星辉石" then
		wds[1] = "如星光一样璀璨的宝石，散发出耀眼的光芒。用于强化灵饰效果。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 8
		wds[11] = "物品图标.wdf"
		wds[12] = 3537886285.0
		wds[13] = 522946271
	elseif wd == "融合石" then
		wds[1] = "具有神秘而强大的力量，可在熔合装备失败时保护装备不会消失。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 9
		wds[11] = "物品图标.wdf"
		wds[12] = 3535131914.0
		wds[13] = 1648708883
	elseif wd == "红木短剑" then
		wds[1] = "古代儿童玩具，可以提高儿童武学悟性"
		wds[2] = 25
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3096070554.0
		wds[13] = 1582088313
	elseif wd == "搜神记" then
		wds[1] = "古代儿童玩具，可以提高儿童法术悟性"
		wds[2] = 25
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3420978211.0
		wds[13] = 3636254741.0
	elseif wd == "论语" then
		wds[1] = "古代儿童玩具，可以提高儿童心态"
		wds[2] = 25
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1796724022
		wds[13] = 2345178083.0
	elseif wd == "吊游攻略" then
		wds[1] = "#S右键使用#获取:\n#G玩法介绍#和#Y攻略说明\n#P新手玩家#想#S快速上手#:#Y请详看"
		wds[2] = 25
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1796724022
		wds[13] = 2345178083.0
	elseif wd == "瑶池蟠桃" then
		wds[1] = "古代儿童玩具，可以提高儿童体质"
		wds[2] = 25
		wds[3] = 4
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1485084420
		wds[13] = 336397352
	elseif wd == "怪物卡片" then
		wds[1] = "一张记载着某种怪物造型的神奇卡片，使用后可以变化身形"
		wds[2] = 30
		wds[3] = 1
		wds[4] = 1
	elseif wd == "碧玉葫芦" then
		wds[1] = [[
华佗悬壶济世时
所带的翡翠葫芦
此宝长期跟随华佗
行医也深谙医术
佩戴此宝会
#X增加师门法术回复的气血]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1616003057
		wds[13] = 1986650439
		wds[1000] = "增加【治疗能力】=境界*7+20"
	elseif wd == "金钱镖" then
		wds[1] = "财神爷的看家宝贝，散出千枚铜钱伤人，如果碰上不为金钱所动的人就没有办法了。每次使用消耗当前金钱2000。"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 1
		wds[6] = 1
		wds[7] = 1
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1033667749
		wds[13] = 3363231626.0
	elseif wd == "五色旗盒" then
		wds[1] = "昔日唐王拜将，天将五色旗勤兵。臣民以为祥瑞。丞相乃进五色旗盒，以盛锦旗。江湖素有能人巧士，依样画葫芦得到此宝，为行囊便利之用。"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 2
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 801390696
		wds[13] = 1563423164
	elseif wd == "飞剑" then
		wds[1] = [[
此飞剑可以从千里之外出击
取敌人首级如探囊取物
精准的袭击令人瞪目
#X佩戴飞剑可以增加人物命中]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 477508561
		wds[13] = 3157241699.0
		wds[1000] = "增加【命中】=境界*20+20"
	elseif wd == "拭剑石" then
		wds[1] = "以石拭剑，可以厉其锋\n此乃蜀山上千百仙剑拭剑之石\n#X佩戴此石可增加伤害和固伤"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4183778831.0
		wds[13] = 4084965901.0
		wds[1000] = "增加【伤害】=境界*5、增加【固伤】=境界*5"
	elseif wd == "金甲仙衣" then
		wds[1] = [[
拥有神奇效果的道家仙衣
穿上它在战斗中
承受物理攻击时候
#X可能出现天兵保护]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 2
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 136191989
		wds[13] = 199217308
		wds[1000] = "(境界*1+4)%几率减免(境界*5+10)%物理伤害"
	elseif wd == "鬼泣" then
		wds[1] = "在十八层地狱深处锻造之铃，吸收地府冤怨之气，摇之如闻听百鬼魂群号，可震慑敌方召唤兽，使其丧失斗志试图逃离战场。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 3
		wds[7] = 3
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 4127256252.0
		wds[13] = 3941908144.0
		wds[1000] = "使敌方召唤兽下次行动时(境界*3+15)%几率逃跑"
	elseif wd == "惊魂铃" then
		wds[1] = "铃声长鸣，闻者胆战心惊\n战斗中可以恐吓敌方召唤兽\n#X使其丧失斗志试图逃离战场"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 2
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 3936791854.0
		wds[13] = 1158408168
		wds[1000] = "使敌方召唤兽下次行动时(境界*3+13)%几率逃跑"
	elseif wd == "嗜血幡" then
		wds[1] = [[
暗红色的布幡
散发着血腥嗜杀的气息
拥有此旗在物理攻击时
#X有几率额外多攻击一个目标
#X且增加人物必杀几率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 1
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3643668533.0
		wds[13] = 1352236633
		wds[1000] = "增加人物【必杀几率】=(境界*0.5)%、额外攻击一个目标几率=(境界*2+5)%"
	elseif wd == "风袋" then
		wds[1] = "风婆系在腰间装风的布袋\n放出风来可吹人至数里外\n#X佩上此袋可增加人物速度"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2573751647.0
		wds[13] = 1508216402
		wds[1000] = "增加【速度】=境界*3+10"
	elseif wd == "清心咒" then
		wds[1] = "佛门经文，在心中默念三遍\n可不受外界干扰，清心自如\n#X使用后可解除因法宝异常效果"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 1
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 3430770800.0
		wds[13] = 2726600792.0
		wds[1000] = "解除受到的法宝异常效果"
	elseif wd == "九黎战鼓" then
		wds[1] = "九黎氏族用蛮兽皮所制的战鼓\n佩戴此法宝可以在\n#X战斗中增加召唤兽的攻击力"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 1
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2859062814.0
		wds[13] = 3036294781.0
		wds[1000] = "增加召唤兽【伤害力】=境界*5+5"
	elseif wd == "盘龙壁" then
		wds[1] = "以恶龙之骨制成的饰品\n佩带此宝可以在\n#X战斗中增加召唤兽的防御"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 2
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1422502108
		wds[13] = 3354820084.0
		wds[1000] = "增加召唤兽【防御】=境界*5+5"
	elseif wd == "神行飞剑" then
		wds[1] = "玄铁打造的雌雄飞剑\n佩戴此法宝可以在\n#X战斗中增加召唤兽的速度"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1602265405
		wds[13] = 2673342243.0
		wds[1000] = "增加召唤兽【速度】=境界*3+8"
	elseif wd == "汇灵盏" then
		wds[1] = "凌霄宝殿内的宫灯\n佩戴此法宝可以在\n#X战斗中增加召唤兽的灵力"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2191011435.0
		wds[13] = 1362964564
		wds[1000] = "增加召唤兽【灵力】=境界*3+3"
	elseif wd == "天师符" then
		wds[1] = [[
神奇的符纸，上面记载着
张天师的秘传制符心法
是方寸山的不传之秘
佩戴此符的方寸山弟子
#X战斗中可以提高自身封印命中率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1154097980
		wds[13] = 2771454581.0
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "织女扇" then
		wds[1] = [[
女儿村特有的羽扇
以织女而得名
佩戴后可以提升女儿村
#X战斗中自身封印命中率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1856183780
		wds[13] = 3556047067.0
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "雷兽" then
		wds[1] = [[
李天王为门下弟子
专门炼制的宝贝
为五雷之精魄
祭起时夹风雷之势
天旋地转飞沙走石
佩带此物的天宫弟子
#X战斗中提高自身封印命中率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 863407792
		wds[13] = 2718233072.0
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "迷魂灯" then
		wds[1] = [[
白晶晶的独门法宝
据说这灯是用
百只狐妖的眼神为芯
佩带在身上散发着
摄人心魂的灯光
佩带此灯的盘丝洞弟子
#X战斗中可以提高自身封印命中率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2864862793.0
		wds[13] = 1857075209
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "定风珠" then
		wds[1] = [[
镇元大仙修炼多年的宝贝
拥有摄人的威力
佩带此灯的五庄观弟子
#X战斗中可以提高自身封印命中率]]
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1238478466
		wds[13] = 1658582022
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "幽灵珠" then
		wds[1] = "佩带此珠的无底洞弟子\n#X战斗中自身封印命中率"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2433556242.0
		wds[13] = 632372372
		wds[1000] = "提高【封印命中率】=(境界*0.5+1.5)%"
	elseif wd == "发瘟匣" then
		wds[1] = "五瘟正神的密保，匣内盛满着发瘟蛊，一旦开启能使目标晕头转向，无法使用法术并且攻击失误。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 5
		wds[7] = 5
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1594699344
		wds[13] = 2013436397
		wds[1000] = "【使用成功几率】=(等级*1.5+22)%"
	elseif wd == "断线木偶" then
		wds[1] = "桃木作的人形玩偶，上面雕刻着古怪的符文，会吸引召唤兽对它进行攻击。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 2
		wds[7] = 3
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2845871769.0
		wds[13] = 2166456742.0
		wds[1000] = "使用后、敌方召唤兽下回合30%概率攻击木偶"
	elseif wd == "五彩娃娃" then
		wds[1] = "衣着五彩，色泽鲜美的布娃娃，战斗中会替主人承受一定的伤害。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 1
		wds[6] = 2
		wds[7] = 6
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1552338364
		wds[13] = 4024198352.0
		wds[1000] = "伤害减免比例=(境界*2+6)%"
	elseif wd == "七杀" then
		wds[1] = "佩戴后将提升物理伤害力，且物理攻击忽略敌人一定防御力。\n勘破人间仁与义，七杀下凡啸腥风。此宝为五斗星君的饰物，战斗祭起后战意漫天，令对手丧失斗志，毫无招架之力。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 5
		wds[7] = 4
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 387311582
		wds[13] = 987889002
		wds[1000] = "提升【伤害力】=境界*5、【忽略防御力】=目标等级*境界*0.08"
	elseif wd == "金刚杵" then
		wds[1] = "佛门利器，可断除烦恼、除恶魔，代表佛智、空性、真如与智慧。佩戴后可以提升对五行之术的掌握，使五行法术的伤害增加。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 6
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1872430352
		wds[13] = 1050054471
		wds[1000] = "提高【法术伤害】=(境界*3)%"
	elseif wd == "附灵玉" then
		wds[1] = "增加一定的人物灵力，随着境界提升增加灵力值"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 6
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1549212485
		wds[13] = 2132169612
		wds[1000] = "提高【灵力】=(境界*3+14)"
	elseif wd == "兽王令" then
		wds[1] = "玉麒麟甲制成的令牌，经青毛狮以妖力修炼，拥有号令百兽的威力。佩戴此物战斗中佩戴者的所有召唤兽能力都得到提升。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 6
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1833817382
		wds[13] = 4092683218.0
		wds[1000] = "提高召唤兽【伤害、灵力、防御、速度】=境界*2"
	elseif wd == "摄魂" then
		wds[1] = "阎王要你三更死，谁敢留人过五更。此物为黄泉中至阴之物，专门摄取生魂，通常勾魂使者才能携带。祭起后使目标失魂落魄，失去生气，三回合内造成伤害降低、承受的伤害增加。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 1
		wds[6] = 5
		wds[7] = 3
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 3184836503.0
		wds[13] = 2952287087.0
		wds[1000] = "【造成伤害降低】=(境界*1.5+12)%、【承受伤害增加】=(境界*1+8)%"
	elseif wd == "月光宝盒" then
		wds[1] = "神奇的宝盒，可以前去500年，后回500年。对着月光念出咒语，你就可以到达想去的地方。可以在任意地点定下标记，在非战斗中使用直接到达。半小时限使用一次。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 2
		wds[6] = 3
		wds[7] = 3
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2514264041.0
		wds[13] = 279837912
	elseif wd == "缩地尺" then
		wds[1] = "某个神仙制造的逃跑工具，战斗中使用后可以迅速离开战斗逃至其他地方，有可能逃跑失败哟。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 3
		wds[7] = 3
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1489248732
		wds[13] = 2357796739.0
	elseif wd == "混元伞" then
		wds[1] = "多闻天王的巨伞，撑起后可遮天蔽日。它能随机将自己承受的部分伤害反弹给对方单个成员。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 3
		wds[7] = 5
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1999219173
		wds[13] = 1091567900
		wds[1000] = "伤害反弹比例=(境界*3+10)%"
	elseif wd == "无魂傀儡" then
		wds[1] = "眼神涣散、毫无生机的傀儡，他们的魂魄已经消失，只有机械的吸引目标对其发起攻击。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 2
		wds[7] = 5
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 92892108
		wds[13] = 855191434
		wds[1000] = "使用后、敌方下回合30%概率攻击木偶"
	elseif wd == "苍白纸人" then
		wds[1] = "符纸制成的纸人，看起来单薄羸弱，在主人受到伤害时会自动现身护主。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 2
		wds[7] = 5
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 3105752839.0
		wds[13] = 1189896726
		wds[1000] = "伤害减免比例=(境界*2+15)%"
	elseif wd == "聚宝盆" then
		wds[1] = "宝盆能聚宝，财源滚滚来。佩带此盆在获得金钱时额外增加一些金钱。每提升3级修炼境界即可获得更多的额外金钱(该法宝不受五行属性影响)。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 6
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2928164306.0
		wds[13] = 3456737369.0
		wds[1000] = "获得银子加成比例=(境界/3*2)%(助战佩戴无效)"
	elseif wd == "通灵宝玉" then
		wds[1] = "拥有通灵能力的宝玉，汲取天地间的灵气，佩带此法宝可在获得经验时额外增加一些经验。每提升3级修炼境界即可获得更多的额外经验(该法宝不受五行属性影响)。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 6
		wds[8] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 4422
		wds[13] = 4421
		wds[1000] = "获得经验加成比例=(境界/3*2)%(助战佩戴无效)"
	elseif wd == "乾坤玄火塔" then
		wds[1] = "托塔天王的另一件宝贝，祭起后可增加斗志与杀气，使勇者更勇。使用后可以在一定回合内增加愤怒值。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 5
		wds[7] = 5
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 4116716738.0
		wds[13] = 405057300
		wds[1000] = "每回合增加【愤怒值】=150*((境界+1)/100"
	elseif wd == "无尘扇" then
		wds[1] = "不沾染尘世间恩怨的扇子，可以使人心情大悦。在战斗中祭起后可以在一定回合内减少对目标的愤怒。如果目标带有乾坤玄火塔效果则额外减少目标3点愤怒。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 5
		wds[7] = 5
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 2703378193.0
		wds[13] = 2677187446.0
		wds[1000] = "每回合减少【愤怒值】=境界+2"
	elseif wd == "无字经" then
		wds[1] = "无字无画的经书，据说只有开启天眼之人才可以看到竹简上的文字。战斗中祭起经书有很高几率使目标丧失心神，4回合内无法使用主动法宝。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 5
		wds[7] = 5
		wds[8] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 2114634428
		wds[13] = 2208707801.0
		wds[1000] = "【成功几率】=(境界+3+35)%"
	elseif wd == "干将莫邪" then
		wds[1] = "采五山之精铁，六合之金英，七七四十九日以身赴铜水，血凝剑气而成，削金如泥，吹毛得过，佩带在身上就已剑气横溢，令人心生怯意。战斗中祭起后杀气冲天，三回合内法宝携带者增加极高的伤害。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 1
		wds[7] = 5
		wds[8] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 1801159151
		wds[13] = 1461968064
		wds[1000] = "提高【伤害力】=境界+20"
	elseif wd == "慈悲" then
		wds[1] = "佛门之人慈悲为怀，有普度救世之心，因而得名以广佛门善心。佩带后可以提升恢复效果。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2794107488.0
		wds[13] = 2282621305.0
		wds[1000] = "提高【治疗能力】=境界*12、(境界*1)%概率治疗效果翻倍"
	elseif wd == "七宝玲珑灯" then
		wds[1] = "佛门至宝，佛祖当年以大雷音寺内玉池白莲所制。携带此灯者气定神闲，不受七情六欲之苦。此灯一旦佩戴，战斗中每回合自动对拥有法宝异常状态的成员进行解除。有一定的几率解除状态失败。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1620690131
		wds[13] = 280191139
		wds[1000] = "法宝异常状态解除几率=(境界*2+20)%"
	elseif wd == "救命毫毛" then
		wds[1] = "当年观音大士赠予孙悟空取经路上救急之用的宝贝，孙悟空修成正果后把此宝转增方寸山弟子，佩带毫毛在战斗中死亡后每回合有一定几率复活，每场战斗最多允许复活三次。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3444483028.0
		wds[13] = 3914962861.0
		wds[1000] = "【复活】概率=(境界*2)%、恢复20%的气血和气血上限"
	elseif wd == "伏魔天书" then
		wds[1] = "上面记载着降魔伏妖的秘法，可以大幅度提升天宫弟子的法术威力。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 920777911
		wds[13] = 10782320
		wds[1000] = "提高【法术伤害】=(境界*3)%"
	elseif wd == "镇海珠" then
		wds[1] = "以大禹治水时的石尺炼化而成，祭起此珠再大的风浪都要平息。佩戴此法宝的龙宫弟子可以领会本门神通的精髓，使自己的法术在战斗中发挥更大的威力。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2679460155.0
		wds[13] = 3879555428.0
		wds[1000] = "提高【法术伤害】=(境界*3)%"
	elseif wd == "奇门五行令" then
		wds[1] = "减少佩戴者所受所有伤害，随层数提升而提升效果，同是受当前气血值影响，气血越低效果越高。。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 2
		wds[7] = 5
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 878947757
		wds[13] = 2239188083.0
		wds[1000] = "【减伤比例】=(境界*2+10)%+当前气血比例(0%～40%)"
	elseif wd == "失心钹" then
		wds[1] = "以玄铁为材料，在畜生道中历练千年的霸道妖器。祭起后鬼哭狼嚎，可减少自身所受到的召唤兽伤害且攻击召唤兽时忽略其部分防御力。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 2
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2734583656.0
		wds[13] = 0xFAB633D8
		wds[1000] = "受到的召唤兽伤害【减少值】=境界*15、攻击召唤兽【忽略防御力】=目标等级*境界*0.08"
	elseif wd == "五火神焰印" then
		wds[1] = "【魔王寨门派法宝】一祭风沙起，再祭烈火燃，三祭浓烟蔽日。红孩儿以内丹在离火内修炼数百年的印章，以龙子狻猊为印饰。佩戴此宝能增加“神焰”触发几率。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 680591273
		wds[13] = 3278774169.0
		wds[1000] = "增加【触发几率】=(境界*0.5)%"
	elseif wd == "九幽" then
		wds[1] = "孟婆的茶盏，沉淀着每个鬼魂投胎转世前的怨恨与无奈，其怨之深，其恨之毒，天下无双。此物佩戴者在战斗中使用尸腐毒时有几率随机增加1个中毒目标，可通过尸腐毒造成的伤害为本方玩家成员治疗当前气血，包括持续伤害。(尸腐毒持续回合每人每回合气血回复血量最多不超过等级*3)"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2116136767
		wds[13] = 3027399584.0
		wds[1000] = "(境界*3+5)%几率尸腐毒随机增加1个中毒目标、气血回复量=尸腐毒(持续)造成伤害*((境界+1)*2+8)%"
	elseif wd == "普渡" then
		wds[1] = "观音大士流传下的至宝，佩戴此法宝后在战斗中使用普渡众生法术时有一定几率额外增加一个目标。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4108501481.0
		wds[13] = 527683743
		wds[1000] = "【触发几率】=(境界*3+5)%"
	elseif wd == "铸兵锤" then
		wds[1] = "于九黎城魔息熔浆中锻炼，由兵主蚩尤亲自铸造，魔兵之魂汇入其中，击之震撼乾坤。主动使用可获得“怒哮状态”，并且抵抗封印类法术能力提升，持续2回合。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 1
		wds[6] = 1
		wds[7] = 8
		wds[8] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 251658248
		wds[13] = 251658249
		wds[1000] = "【提升封印抵抗能力】=(境界*1+3)%"
	elseif wd == "驭魔笼" then
		wds[1] = "【九黎城门派法宝】昔日蚩尤遨游魔域，收服万邪，以此笼囚禁诸魔异兽，妖气浓郁，威压四方。佩戴后可令“黎魂”触发3个师门技能概率增加。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "路飞.wdf"
		wds[12] = 251658246
		wds[13] = 251658247
		wds[1000] = "【概率增加】=(境界*1+3)%"
	elseif wd == "万古坚冰" then
		wds[1] = "冰风谷至宝，天狼族举族之魂铸其冰魄，令其千年不化，万年不融。纵使雪虐风饕，持此物者有狼魂引路，永不迷失。佩戴此法宝，可提升人物速度，天气为雪时大幅提升。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 1
		wds[13] = 0
		wds[1000] = "增加【速度】=境界*1.5+8；【雪天】=境界*2.5+20.5"
	elseif wd == "九霄灵息" then
		wds[1] = "青龙居于九霄之上，有驱雷策电，施风布雨之大能，撷其一缕残息，仍有腾云跨风之神威。佩戴此法宝，进入战斗时，提升法术伤害，天气为风时大幅提升。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 3
		wds[13] = 2
		wds[1000] = "增加【法伤】=境界*4+18；【风天】=境界*7+34"
	elseif wd == "驱风宝诰" then
		wds[1] = "神仙赵公明所流传之宝诰，颂此圣骈者，纵使役雷驭电，驱风贯虹之法也能手到擒来。佩戴此法宝，进入战斗时，提升法术伤害，天气为风时大幅提升。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 279
		wds[13] = 278
		wds[1000] = "增加【法伤】=境界*2+6；【风天】=境界*3.5+18.5"
	elseif wd == "狂飙天爪" then
		wds[1] = "传大禹与怒蛟战于盘龙岛，使避水剑斩其利爪，龙爪落地之时，狂风骤起，飙举电至，天地为之震动。佩戴此法宝，进入战斗时，提升物理伤害，天气为风时大幅提升。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 17
		wds[13] = 16
		wds[1000] = "提高【伤害力】=境界*5+30；【风天】=境界*9+58"
	elseif wd == "止风神剑" then
		wds[1] = "持此剑者，于狂风骤雨中仍稳如泰山，举止自若。凌空一剑，便是拘风断穹之威。佩戴此法宝，进入战斗时，提升物理伤害，天气为风时大幅提升。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 23
		wds[13] = 22
		wds[1000] = "提高【伤害力】=境界*4+7；【风天】=境界*6+28"
	elseif wd == "初诞春芽" then
		wds[1] = "神木林苍古巨树的新芽，雨露滋润下，万物萌发，春暖花开，自此诸生命于三界中茂盛生长。佩戴此法宝，可提升治疗量，天气为雨时大幅提升。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 5
		wds[13] = 4
		wds[1000] = "增加【治疗量】=境界*13+26；【雨天】=境界*20+40"
	elseif wd == "澄空净铃" then
		wds[1] = "昔女娲以五色石补天，奇石化作长虹破空，淫雨止息，苍生得救。后世以虹光之遗制铃，摇动此铃，霎时天朗风清，虹销雨霁。佩戴此法宝将增加自身防御和法防，有一定几率在无天气时减免大量伤害，在有天气时减免部分伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 2
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 9
		wds[13] = 8
		wds[1000] = "增加【防御、法防】=【境界*3、境界*2】、(境界*1.1+8.2)%概率减免【无天气(境界*2.5+10)】【有天气(境界*1.5+3)】%伤害或法伤"
	elseif wd == "金箍棒" then
		wds[1] = "本是大禹治水时传下的定海神针，后被花果山孙悟空取走，成为齐天大圣的随身兵器。佩戴者可以使如意神通造成的所有伤害提高。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 281
		wds[13] = 280
		wds[1000] = "【如意神通伤害提高】=(境界*0.5+2)%"
	elseif wd == "琉璃灯" then
		wds[1] = "燃灯古佛借予孙悟空之宝灯，据说此灯恒燃不灭，可照彻过去、现在、未来三世。佩戴者可见天地洞明，对方弱点尽在眼中，从而提升自身物理暴击能力和法术暴击能力。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 19
		wds[13] = 18
		wds[1000] = "【暴击增加】=(境界*0.25+1)%"
	elseif wd == "金蟾" then
		wds[1] = "无底洞洞府极幽深处所居之蟾精，历千年而尸身不腐，玲珑剔透状如珠玉。使用此法宝，护体金蟾被击破后，可回复本方所有玩家气血。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 1
		wds[6] = 4
		wds[7] = 0
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 21
		wds[13] = 20
		wds[1000] = "【物理伤害结果增加】=(境界*0.8+3)%"
	elseif wd == "斩魔" then
		wds[1] = "四海纵横，剑斩妖魔，此剑为二郎神杨戬心爱之物。佩戴此法宝可增加物理攻击时的物理伤害结果。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "llm.wdf"
		wds[12] = 7
		wds[13] = 6
		wds[1000] = "【物理伤害结果增加】=(境界*0.8+3)%"
	elseif wd == "月影" then
		wds[1] = "【神木林门派法宝】增加“重光”触发几率"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3688798253.0
		wds[13] = 911904006
		wds[1000] = "提高【法术连击几率】=(境界*1+1)%"
	elseif wd == "降魔斗篷" then
		wds[1] = "战斗中遭受法术攻击的时候有一定几率出现神兵现身保护，随着境界提升增加被保护的几率。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 3
		wds[5] = 0
		wds[6] = 2
		wds[7] = 1
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2400084595.0
		wds[13] = 3249884672.0
		wds[1000] = "受到法术攻击(境界*1+8)%几率减少55%法伤"
	elseif wd == "鬼脸面具" then
		wds[1] = "用天蚕丝所制的面具，辅以上古符咒，是非常好的变身辅助。戴上它可以在战斗中使用变身卡进行变身。"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4127199816.0
		wds[13] = 295655277
	elseif wd == "玄冰面具" then
		wds[1] = "戴上这个面具，面容就像千年寒冰下的湖水，谁也不知道是什么样子，拥有者可以在战斗中使用变身卡变幻身份。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 705550396
		wds[13] = 3251908761.0
	elseif wd == "缚妖索" then
		wds[1] = "天师的法宝，战斗中祭起后将目标牢牢捆缚住，6回合内使其的逃跑成功率降低。"
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 2
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3517855384.0
		wds[13] = 1431582914
		wds[1000] = "降低【逃跑成功率】=(境界*4+14)%"
	elseif wd == "捆仙绳" then
		wds[1] = "天庭法宝，专为缉拿神仙所制，材料不知为何物，柔韧结实，6回合内降低目标的逃跑成功率。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 2
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 589346863
		wds[13] = 1211389100
		wds[1000] = "降低【逃跑成功率】=(境界*4+17)%"
	elseif wd == "现形符" then
		wds[1] = "无论对方如何变幻形体，用此符都有可能将其识破。只允许在战斗中对对方使用，有一定几率解除目标变身效果。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 5
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2259629009.0
		wds[13] = 1877197072
	elseif wd == "聚妖铃" then
		wds[1] = "这铃铛声是号召妖怪们战斗的号角，据说是蚩尤当年为涿鹿之战而制。战斗中摇晃此铃，附近的妖物会聚集过来协助战斗。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3408690678.0
		wds[13] = 3476256716.0
	elseif wd == "万鬼幡" then
		wds[1] = "地府钟馗的法宝，此幡一祭，天地变色，鬼影憧憧，黄泉十万阴兵应幡而出。在战斗中使用可以召唤鬼魂助战。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 150
		wds[8] = 150
		wds[11] = "物品图标.wdf"
		wds[12] = 4056997831.0
		wds[13] = 239977327
	elseif wd == "番天印" then
		wds[1] = "广成子修炼的独门宝贝，砸中后能使人神志不清，三魂出窍，失去对法宝的控制。战斗中祭后有一定几率使目标身上佩带的被动法宝3回合内失去作用。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 5
		wds[7] = 3
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3006760160.0
		wds[13] = 2337867792.0
		wds[1000] = "成功几率=(境界*5+25)%"
	elseif wd == "罗汉珠" then
		wds[1] = "使用后玩家下3个回合使用任何消耗魔法的门派法术消耗减少。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 3
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 344222491
		wds[13] = 1767249115
		wds[1000] = "法术消耗减少比例=(境界*5+20)%"
	elseif wd == "分水" then
		wds[1] = "以水为盾，可以护体。此宝为西海龙女佩带之物，佩带后遭受攻击时一定几率将伤害转化为气血，是龙宫秘宝。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3543201481.0
		wds[13] = 4056879041.0
		wds[1000] = "(境界*1+8)%概率吸收并回复(境界+1)%所受伤害"
	elseif wd == "赤焰" then
		wds[1] = "此物乃牛魔王与铁扇公主定情之时赠送给娘子的宝贝，使用此宝能在三回合内回复魔法。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 4
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1949730264
		wds[13] = 1655621603
		wds[1000] = "每回合【恢复魔法】=人物等级*(0.6+境界*0.25)+80"
	elseif wd == "宝烛" then
		wds[1] = "当佩戴者当前气血小于气血最大值的70%时，每回合恢复一定的当前气血。效果随法宝等级提升而提升。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[7] = 0
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 71971863
		wds[13] = 346485090
		wds[1000] = "恢复气血=境界*10+20"
	elseif wd == "天煞" then
		wds[1] = "每回合恢复魔法值，持续3回合，满层的情况下在法宝回合结束时恢复1点战意值。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 3
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1762355149
		wds[13] = 3835193631.0
		wds[1000] = "每回合【恢复魔法】=人物等级*(0.6+境界*0.2)+50"
	elseif wd == "神木宝鼎" then
		wds[1] = "神木林祭师祭天地所用之物。在战斗中祭起此鼎临时提升自己大量法术伤害，持续3回合。"
		wds[2] = 1000
		wds[3] = 2
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 3
		wds[8] = 10
		wds[11] = "物品图标.wdf"
		wds[12] = 2476801097.0
		wds[13] = 4033976301.0
		wds[1000] = "提升【法伤】=境界*20"
	elseif wd == "曼陀罗" then
		wds[1] = "精巧的银制匣子，内藏百花之毒，是女儿村的镇山法宝，佩戴此宝的女儿村弟子封印抗封得到相应提高。"
		wds[2] = 1000
		wds[3] = 3
		wds[4] = 1
		wds[5] = 0
		wds[6] = 5
		wds[7] = 0
		wds[8] = 0
		wds[11] = "item1.wdf"
		wds[12] = 2655866154.0
		wds[13] = 1416458865
		wds[1000] = "提高【封印命中率、封印抵抗率】=(境界*0.5+1.5)%"
	elseif wd == "蟠龙玉璧" then
		wds[1] = "金色蟠龙所化的玉璧，能自行以龙气护主。佩戴此法宝将增加自身防御和法防，受到物理攻击或法术攻击时，一定几率免疫部分伤害，不能与金甲仙玉、降魔斗篷同时佩戴。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 2
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 146495317
		wds[13] = 813227479
		wds[1000] = "增加【防御、法防】=境界*5、(境界*1+7)%概率减免(境界*1.5+13)%伤害或法伤"
	elseif wd == "落星飞鸿" then
		wds[1] = "云霄之上有飞鸿，掠影落星下九重。传说中的神物，佩带后可让人在战斗时借用九天星辰之力。佩戴此法宝，进入战斗时，大幅度提升物理伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 423996142
		wds[13] = 2694297891.0
		wds[1000] = "提高【伤害力】=境界*6+42"
	elseif wd == "流影云笛" then
		wds[1] = "天光流不定，云影共徘徊。以缥缈云竹制成的仙笛，令人在施展法术时事半功倍。佩戴此法宝，进入战斗时，大幅度提升法术伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 3
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 428499601
		wds[13] = 859886183
		wds[1000] = "增加【法伤】=境界*5+20"
	elseif wd == "千斗金樽" then
		wds[1] = "玉帝心爱的饮酒器皿，常年盛放玉酿仙液，灵气浸染之下，遍体流光。佩戴此法宝，可以随战斗回合数增加物理暴击。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2337184453.0
		wds[13] = 2859426072.0
		wds[1000] = "增加【物理暴击率】=(境界*0.5+5)%"
	elseif wd == "宿幕星河" then
		wds[1] = "银河倾泻，夜幕悬垂，星空之万千变化皆在其中。以星河之力激荡本心，源源不绝。佩戴此法宝，可以随战斗回合数增加法术暴击。(最高30%)"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 1
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3165989580.0
		wds[13] = 2241858041.0
		wds[1000] = "增加【法暴】=((境界+回合数)/2)%"
	elseif wd == "归元圣印" then
		wds[1] = "圣气非凡的一方小印，上书《楞严经》全篇，可助人明心见性，证道菩提。佩戴此法宝，可大幅提升治疗量。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 2
		wds[5] = 0
		wds[6] = 4
		wds[7] = 10
		wds[8] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3964816714.0
		wds[13] = 309986797
		wds[1000] = "增加【治疗量】=境界*15+30"
	elseif wd == "重明战鼓" then
		wds[1] = "重明鸟灵所化之战鼓，击之可激扬士气，倍增勇武。佩戴此法宝，可大大提升召唤兽物理伤害和法术伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 2
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1873410484
		wds[13] = 1873410484
		wds[1000] = "提高召唤兽【伤害力】=境界*6+42、【法伤】=境界*5+20"
	elseif wd == "梦云幻甲" then
		wds[1] = "以九天云雾炼制而成的宝甲，轻若无物，如梦似幻，令人目眩神迷。佩戴此法宝，可大大提升召唤兽的物理防御和法术防御。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2756406881.0
		wds[13] = 157916098
		wds[1000] = "提高召唤兽【防御】=境界*3+21、【法防】=境界*2.5+10"
	elseif wd == "河图洛书" then
		wds[1] = "蕴含易理天地灵宝，透出一股玄奥之感。佩戴此法宝，可大大提升封印命中率和抵抗封印命中率。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 0xFED28065
		wds[13] = 2949390447.0
		wds[1000] = "提高【封印命中率、封印抵抗率】=(境界*0.5+3)%"
	elseif wd == "炽焰丹珠" then
		wds[1] = "集人间怒火而成一朵怒焰，再将其炼为丹珠而成的法宝。佩戴此法宝，人物倒地时可保留一定的愤怒值，每场战斗起效3次。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2572126622.0
		wds[13] = 299949013
		wds[1000] = "保留愤怒比例=(境界*2+24)%"
	elseif wd == "翡翠芝兰" then
		wds[1] = "人物倒地时，回复全体队友一定量的魔法。每场战斗最多起效3次"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1027775358
		wds[13] = 3614982658.0
		wds[1000] = "全体队友回复魔法=人物等级*(境界*10+50)%"
	elseif wd == "太虚玉液" then
		wds[1] = "人物倒地时，回复全体队友一定量的气血。每场战斗最多起效3次"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 4
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3738100427.0
		wds[13] = 547394610
		wds[1000] = "全体队友回复气血=人物等级*(境界*25+300)%"
	elseif wd == "九梵清莲" then
		wds[1] = "如来座前生长千年的白莲，因长年浸润圣佛之气而成为了一件法宝。使用后2回合内，对方召唤兽对我方人物造成的物理伤害降低。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 2
		wds[7] = 15
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1638310928
		wds[13] = 4045691382.0
		wds[1000] = "受到召唤兽物理伤害降低比例=(境界*1.5+13)%"
	elseif wd == "苍灵雪羽" then
		wds[1] = "苍鸾灵气所化成的一片雪羽，有日月光华聚于其上。主动使用此法宝，在当前回合提升全体友方单位的法术伤害结果，并降低全体友方单位的法术防御效果。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 1
		wds[7] = 8
		wds[8] = 1
		wds[11] = "common/item.wdf"
		wds[12] = 3978720539.0
		wds[13] = 2251912223.0
		wds[1000] = "法术伤害结果提高比例=(境界*0.5+1)%、法术防御效果降低比例=(境界*0.5+2.4)%"
	elseif wd == "烽火狼烟" then
		wds[1] = "凝人间杀气、煞气而成的凶物，因战而生，为战而死。主动使用此法宝，在当前回合提升全体友方单位的物理伤害效果，并降低全体友方单位的物理防御效果。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 1
		wds[7] = 8
		wds[8] = 1
		wds[11] = "common/item.wdf"
		wds[12] = 2845201439.0
		wds[13] = 3074972432.0
		wds[1000] = "物理伤害结果提高比例=(境界*0.5+1)%、物理防御效果降低比例=(境界*0.5+2.4)%"
	elseif wd == "舞雪冰蝶" then
		wds[1] = "极北之地万载冰精中形成的异种冰蝶，能回风舞雪，冻结万物。主动使用此法宝，可大幅降低目标造成的伤害、大副提高目标受到的伤害，效果持续3回合。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 5
		wds[7] = 5
		wds[8] = 3
		wds[11] = "common/item.wdf"
		wds[12] = 0xFBCFDC2F
		wds[13] = 516729819
		wds[1000] = "【造成伤害降低】=(境界*2+14)%、【承受伤害增加】=(境界*1.5+18)%"
	elseif wd == "紫火如意" then
		wds[1] = "以陨星神铁炼制而成的如意，遍体生金色祥纹，有天外紫火缭绕其上，妙用无穷。主动使用此法宝可将我方全体成员的气血平均分配一次。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 3
		wds[7] = 5
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 3344593635.0
		wds[13] = 2283937288.0
		wds[1000] = "平均分配【我方全体气血比例】=(境界*2+68)%"
	elseif wd == "凌波仙符" then
		wds[1] = "聚清风为气，锁流云为形，能使人进入战斗状态，神行千里，凌波飞渡。佩戴此法宝，在强烈的战斗欲望驱使下，使得人物速度大大提升。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 1
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 341278646
		wds[13] = 1801870284
		wds[1000] = "增加【速度】=境界*4+28"
	elseif wd == "软烟罗锦" then
		wds[1] = "织女以天边晚霞织就，如烟如雾，佩戴后云雾缭绕，消弭术法。佩戴此法宝可以增加法术闪避。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1530386352
		wds[13] = 2053407277
		wds[1000] = "增加【法术闪避】=(境界*0.2+1.4)%"
	elseif wd == "谷玄星盘" then
		wds[1] = "通体暗黑，内含谷玄星辰之力。谷玄者，主吞噬。佩戴此法宝，可吸收四系属性法术"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 745696393
		wds[13] = 3424396236.0
		wds[1000] = "增加吸收四系属性法术【概率】=(境界*0.5+6)%"
	elseif wd == "北冥巨鳞" then
		wds[1] = "传说中北冥鲲之巨鳞，佩戴则可获抟扶摇之力，逍遥九天，傲视群雄。佩戴后可增加我方所有人物伤害力，队伍满人且自身伤害高于其他队友时，额外增加自身大量伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1610356209
		wds[13] = 794292712
		wds[1000] = "增加全队人物【伤害力】=境界*2+14、满足条件额外增加【伤害力】=境界*3+21"
	elseif wd == "血魄元幡" then
		wds[1] = "于地府浴千万血魄浸润而成，凶煞无比。祭出则可借鬼神之力，通天彻地。可增加我方所有人物法术伤害力，队伍满人且自身法术伤害高于其他队友时，额外增加自身大量法术伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1738980812
		wds[13] = 1394501420
		wds[1000] = "增加全队人物【法伤】=境界*1.5+13、满足条件额外增加【法伤】=境界*2.5+15"
	elseif wd == "翠碧玉箫" then
		wds[1] = "吹奏起，则万花丛中过，片叶不沾身。以灵动身法，应万千变化。佩戴后可增加我方所有人物抗封能力，队伍满人且自身速度远高于其他队友时，全队效果大幅提高。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 3
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2288495538.0
		wds[13] = 2814247464.0
		wds[1000] = "增加全队人物【封印抵抗率】=(境界*0.25+1.5)%、满足条件【封印抵抗率】=(境界*0.5+3)%"
	elseif wd == "冷龙石磐" then
		wds[1] = "增加本方所有人物防御力；队伍满人且自身防御大于其他所有队友时，全队效果大幅提高。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 2
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 1445460543
		wds[13] = 370108996
		wds[1000] = "增加全队人物【防御】=境界*1+8、满足条件【防御】=境界*1.5+13"
	elseif wd == "琉璃云罩" then
		wds[1] = "增加本方所有人物法术防御力；队伍满人且自身法术防御力大于其他所有队友的法术防御力*130%时，全队效果大幅提高。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 0
		wds[6] = 2
		wds[7] = 1
		wds[8] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2710441667.0
		wds[13] = 0xFB9618A5
		wds[1000] = "增加全队人物【法防】=境界*1+8、满足条件【法防】=境界*1.5+13"
	elseif wd == "璞玉灵钵" then
		wds[1] = "空灵空性，无欲无求。以菩提心应万物，以慈悲心护周身。有我不伤人、人不伤我之能。无需佩戴，在战斗中使用此物，本回合降低我方造成和受到所有伤害。"
		wds[2] = 1000
		wds[3] = 4
		wds[4] = 1
		wds[5] = 1
		wds[6] = 2
		wds[7] = 150
		wds[8] = 1
		wds[11] = "common/item.wdf"
		wds[12] = 1577325226
		wds[13] = 1674443512
		wds[1000] = "伤害降低比例=(境界*0.5+11)%"
	elseif wd == "天眼通符" then
		wds[1] = "天界的灵符,具有洞察世界万物象的神奇作用。\n【效果】可以查看到部分任务要求的NPC准确坐标。"
		wds[2] = 9
		wds[3] = 3
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3744973957.0
		wds[13] = 2141462591
		wds[14] = 10000
	elseif wd == "易经丹" then
		wds[1] = "《异兽录》之中记载的奇妙药丸，使用得当可助召唤兽打通筋骨达到形易经之境。"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3652963079.0
		wds[13] = 2352282937.0
	elseif wd == "初级清灵仙露" then
		wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1867142286
		wds[13] = 310894893
	elseif wd == "中级清灵仙露" then
		wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFD5F44C0
		wds[13] = 3371803859.0
	elseif wd == "高级清灵仙露" then
		wds[1] = "由清灵净瓶所汇聚的神奇仙露，可以用于提升召唤兽的灵性。（只对50≤灵性≤100的召唤兽使用）"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3772341384.0
		wds[13] = 624654979
	elseif wd == "玉葫灵髓" then
		wds[1] = "《博物录》之中记载的玄妙丹药，可以将召唤兽已使用的清灵仙露的状态回归原始。"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1071679619
		wds[13] = 84951361
	elseif wd == "清灵净瓶" then
		wds[1] = "自上古流传至今的神奇净瓶，注以灵力之后可以汇聚净瓶仙露。"
		wds[2] = "召唤兽道具"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3143825293.0
		wds[13] = 1163646927
	elseif wd == "神兽内丹" then
		wds[1] = "召唤兽进阶的道具，能够唤醒召唤兽体内的潜力，突破界限，完成进阶；进阶后的召唤兽可以增加一定的资质和成长。"
		wds[2] = 9
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1804667887
		wds[13] = 47447545
	elseif wd == "洗点丹" then
		wds[1] = "可以改变身体的资质"
		wds[2] = 9
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1220225280
		wds[13] = 424386854
	elseif wd == "坐骑星辰碎片" then
		wds[1] = "古人根据星辰飞落的方式研究出的捕捉怪物,里面记载着捕捉怪物的方法，使用〖100〗个【坐骑星辰碎片】后可以获取随机坐骑!"
		wds[2] = 9
		wds[3] = 4
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3376148133.0
		wds[13] = 970939530
		wds[14] = 500
	elseif wd == "星辰碎片" then
		wds[1] = "星辰碎片，使用后可以穿梭于各大陆之间"
		wds[2] = 9
		wds[3] = 5
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3376148133.0
		wds[13] = 970939530
		wds[14] = 500
	elseif wd == "琉璃盏的碎片" then
		wds[1] = "剧情道具,#R不可扔掉\n#G日后定有用处"
		wds[2] = 9
		wds[3] = 6
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3679739117.0
		wds[13] = 1317304233
		wds[14] = 500
	elseif wd == "破碎的绿烟如梦" then
		wds[1] = "八戒悟空剧情"
		wds[2] = 9
		wds[3] = 10
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3091276860.0
		wds[13] = 1466381711
		wds[14] = 500
	elseif wd == "召唤兽饰品碎片" then
		wds[1] = "里面记载着远古时期,古人对召唤兽研究的模样,不过后来被人不小心打碎了散落四方,筹齐之后,方可使用,可使参战的召唤兽得到一个【饰品①】效果!"
		wds[2] = 9
		wds[3] = 11
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3091276860.0
		wds[13] = 1466381711
		wds[14] = 500
	elseif wd == "宠物口粮" or wd == "口粮" then
		wds[1] = "宠物非常喜欢的食物,可以恢复一定的宠物耐力."
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1929906828
		wds[13] = 867950594
		wds[14] = 80
	elseif wd == "高级宠物口粮" then
		wds[1] = "宠物非常喜欢的食物,可以大量恢复宠物耐力."
		wds[2] = 4
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1929906828
		wds[13] = 3686096068.0
		wds[14] = 80
	elseif wd == "帮派银票" then
		wds[1] = "这是属于某个帮派的银票，上面的钱可不能随便挪用哦。"
		wds[2] = "帮派银票"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2546434008.0
		wds[13] = 2465658058.0
	elseif wd == "商品盐" then
		wds[1] = "东海的特产之一，精细的海盐。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 488343075
		wds[13] = 1570926066
	elseif wd == "商品武器" then
		wds[1] = "使用上好材料精心制作，是学武之日必备的武器。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 997342473
		wds[13] = 1539066837
	elseif wd == "商品帽子" then
		wds[1] = "普通人家使用的布制头冠，在冬天可以起到一定御寒的作用。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1163151310
		wds[13] = 3017925873.0
	elseif wd == "商品符" then
		wds[1] = "道士所需的灵符，驱邪镇魔之用。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 4
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1334482463
		wds[13] = 1480265575
	elseif wd == "商品鹿茸" then
		wds[1] = "鹿角上长的茸，可强身健体，是上好的药材。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 5
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 411164756
		wds[13] = 1368198926
	elseif wd == "商品纸钱" then
		wds[1] = "民间用来烧给阴间亲人使用的冥钞。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 6
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 303325212
		wds[13] = 3319281284.0
	elseif wd == "商品佛珠" then
		wds[1] = "檀香木制的佛珠，佩带在身上可以驱邪镇魔。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 161715935
		wds[13] = 203664130
	elseif wd == "商品酒" then
		wds[1] = "精心酿制，窖藏多年，是不可多得的好酒。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4163546127.0
		wds[13] = 724140283
	elseif wd == "商品棉布" then
		wds[1] = "使用上品棉花编织而成的布匹。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 741148010
		wds[13] = 1044767856
	elseif wd == "商品面粉" then
		wds[1] = "用小麦等材料精磨而成，可以制作各种可口的食物。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 10
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2120058987
		wds[13] = 1021907380
	elseif wd == "商品珍珠" then
		wds[1] = "东海珍珠，色泽明润洁白，无论是装饰和入药多可以。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1197212199
		wds[13] = 1320512785
	elseif wd == "商品人参" then
		wds[1] = "北方特产，是极好的补品，也可入药。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 12
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3506367779.0
		wds[13] = 1978333732
	elseif wd == "商品木材" then
		wds[1] = "百年原木，用于修建房屋的，名贵木材。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 13
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 757799681
		wds[13] = 2818741734.0
	elseif wd == "商品蜡烛" then
		wds[1] = "每家每户必备的照明工具，销路很好。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 14
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3433423674.0
		wds[13] = 286391201
	elseif wd == "商品扇子" then
		wds[1] = "只是普通的折扇，为文人雅士所喜好。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 15
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 269048562
		wds[13] = 2917655826.0
	elseif wd == "商品铃铛" then
		wds[1] = "声音悦耳，为女子所喜，常买回去佩带在身上。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 16
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 625947371
		wds[13] = 3748316188.0
	elseif wd == "商品夜明珠" then
		wds[1] = "能再夜中放光的明珠，是价值连城的宝物。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 17
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 399352232
		wds[13] = 3605357953.0
	elseif wd == "商品麻线" then
		wds[1] = "坚韧的麻线，商品的一种"
		wds[2] = "跑商商品"
		wds[3] = 18
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 317081479
		wds[13] = 3994353422.0
	elseif wd == "商品剪刀" then
		wds[1] = "裁剪衣服所用的剪刀，女儿家常用物品。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 19
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 360911661
		wds[13] = 3579779259.0
	elseif wd == "商品香油" then
		wds[1] = "供奉神明的长明灯中所用的香油。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 20
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1262876500
		wds[13] = 1145481932
	elseif wd == "商品首饰" then
		wds[1] = "佩带在身上增添美观的一些精巧小玩意，价值视做工与材料而定。商品的一种。"
		wds[2] = "跑商商品"
		wds[3] = 21
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1878942191
		wds[13] = 3687613790.0
	elseif wd == "小额银票" then
		wds[1] = "大唐年间，李记钱庄发行的一种银票，可获得100万两银子。"
		wds[2] = "银票"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2444792548.0
		wds[13] = 0xFA853D52
	elseif wd == "大额银票" then
		wds[1] = "大唐年间，李记钱庄发行的一种银票，可获得二亿两银子。"
		wds[2] = "银票"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4199144189.0
		wds[13] = 2132684182
	elseif wd == "储灵袋" then
		wds[1] = "古董商人收藏的神仙宝贝，用以储存灵气，使用后可为佩戴的法宝补充100点灵气。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "common/item.wdf"
		wds[12] = 2193348990.0
		wds[13] = 1989581720
	elseif wd == "160级头盔定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级头盔。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级项链定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级项链。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级武器定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级武器。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级衣服定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级衣服。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级腰带定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级腰带。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级鞋子定制礼包" then
		wds[1] = "装备定制礼包，可获得定制160级鞋子。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级耳饰定制礼包" then
		wds[1] = "灵饰定制礼包，可获得定制160级耳饰。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级佩饰定制礼包" then
		wds[1] = "灵饰定制礼包，可获得定制160级佩饰。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级戒指定制礼包" then
		wds[1] = "灵饰定制礼包，可获得定制160级戒指。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级手镯定制礼包" then
		wds[1] = "灵饰定制礼包，可获得定制160级手镯。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "神兽自选礼包" then
		wds[1] = "召唤兽礼包，可获得指定神兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "13技能定制法宠礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "13技能定制攻宠礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "15技能定制法宠礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "15技能定制攻宠礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "10技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "12技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "14技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "16技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "18技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "20技能胚子召唤兽礼包" then
		wds[1] = "召唤兽礼包，可获得指定召唤兽。#Y(右键点击使用)"
		wds[2] = 5
		wds[3] = 9
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "1号助战装备礼包" then
		wds[1] = "欢迎光临,这是属于您的礼物\n如果你没有#S对应位置#的助战,该物品将#R无法使用"
		wds[2] = "装备礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "2号助战装备礼包" then
		wds[1] = "欢迎光临,这是属于您的礼物\n如果你没有#S对应位置#的助战,该物品将#R无法使用"
		wds[2] = "装备礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "3号助战装备礼包" then
		wds[1] = "欢迎光临,这是属于您的礼物\n如果你没有#S对应位置#的助战,该物品将#R无法使用"
		wds[2] = "装备礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "4号助战装备礼包" then
		wds[1] = "欢迎光临,这是属于您的礼物\n如果你没有#S对应位置#的助战,该物品将#R无法使用"
		wds[2] = "装备礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "50级装备礼包" then
		wds[1] = "内含一套6件50级装备，根据玩家角色开出自身对应的装备"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "10级装备礼包" then
		wds[1] = "内含一套6件10级装备，根据玩家角色开出自身对应的装备"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "20级装备礼包" then
		wds[1] = "内含一套6件20级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "30级装备礼包" then
		wds[1] = "内含一套6件30级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "40级装备礼包" then
		wds[1] = "内含一套6件40级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "60级装备礼包" then
		wds[1] = "内含一套6件60级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "70级装备礼包" then
		wds[1] = "内含一套6件70级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "80级装备礼包" then
		wds[1] = "内含一套6件80级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "90级装备礼包" then
		wds[1] = "内含一套6件90级装备，根据玩家角色开出自身对应的装备\n#G礼包可以交易#，但是开出来的装备#R无法交易！"
		wds[2] = "装备礼包"
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2749064731.0
		wds[13] = 1521456320
	elseif wd == "100级装备礼包" then
		wds[1] = "内含一套6件100级装备，根据玩家角色开出自身对应的装备\n#G礼包可以交易#，但是开出来的装备#R无法交易！"
		wds[2] = "装备礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1249264183
		wds[13] = 1674166994
	elseif wd == "120级装备礼包" then
		wds[1] = "内含一套6件120级装备，根据玩家角色开出自身对应的装备\n#G礼包可以交易#，但是开出来的装备#R无法交易！"
		wds[2] = "装备礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1249264183
		wds[13] = 1674166994
	elseif wd == "130级补偿装备礼包" then
		wds[1] = "内含一套6件130级装备，根据玩家角色开出自身对应的装备\n#G礼包不可交易"
		wds[2] = "装备礼包"
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1249264183
		wds[13] = 1674166994
	elseif wd == "140级装备礼包" then
		wds[1] = "内含一套6件140级装备，根据玩家角色开出自身对应的装备\n#G礼包可以交易#，但是开出来的装备#R无法交易！"
		wds[2] = "装备礼包"
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1705905663
		wds[13] = 752892905
	elseif wd == "130级装备礼包" then
		wds[1] = "内含一套6件130级装备，根据玩家角色开出自身对应的装备\n#G礼包可以交易#，但是开出来的装备#R无法交易！"
		wds[2] = "装备礼包"
		wds[3] = 4
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1705905663
		wds[13] = 752892905
	elseif wd == "140级装备礼包" then
		wds[1] = [[
此礼包无法交易
一个角色一个
开出来的装备也无法交易
但是可以用#R比武积分
对#G绑定装备
进行解绑！]]
		wds[2] = "装备礼包"
		wds[3] = 5
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1705905663
		wds[13] = 752892905
	elseif wd == "150级装备礼包" then
		wds[1] = "内含一套6件150级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 6
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级装备礼包" then
		wds[1] = "内含一套6件160级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "镇妖拘魂铃" then
		wds[1] = "妖魔的元气暂时收集在这一串带有符咒法力的铜铃中。将他右键炼化妖魔元气，成为各种奇珍异宝。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 625947371
		wds[13] = 3748316188.0
	elseif wd == "种族坐骑礼包" then
		wds[1] = [[
内含坐骑宠物一只,开启后获得
对应种族的坐骑:
#R人族:
神奇小龟,汗血宝马,欢喜羊羊
#G魔族:
神奇小龟,魔力斗兽,披甲战狼
#Y仙族:
神奇小龟,闲云野鹤,云魅仙鹿
#S新三角色:
#P(桃夭夭,偃无师,鬼潇潇)
只能获得:宝贝葫芦
#G龙太子和骨精灵因为当年官服版本原因没迭代人物坐骑造型
故此也可以获得:宝贝葫芦
#R坐骑任务#Y最后获得的
#Y坐骑奖励和此物一致]]
		wds[2] = "坐骑礼包"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "160级高级装备礼包" then
		wds[1] = "内含一套6件160级装备，根据玩家角色开出自身对应的装备，随机属性，衣服和武器必出双加。"
		wds[2] = "装备礼包"
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "跨服专属礼包" then
		wds[1] = "内含一件宝宝装备。"
		wds[2] = "装备礼包"
		wds[3] = 8
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "金砖" then
		wds[1] = "闪闪发光，可获得大量的银子。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1414767729
		wds[13] = 3721098162.0
	elseif wd == "金砖1" then
		wds[1] = "闪闪发光，可获得大量的银子。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1414767729
		wds[13] = 3721098162.0
	elseif wd == "金砖2" then
		wds[1] = "闪闪发光，可获得大量的银子。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1414767729
		wds[13] = 3721098162.0
	elseif wd == "金砖3" then
		wds[1] = "闪闪发光，可获得大量的银子。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1414767729
		wds[13] = 3721098162.0
	elseif wd == "储备" then
		wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1414767729
		wds[13] = 3721098162.0
	elseif wd == "仙丹" then
		wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4119346967.0
		wds[13] = 1626787288
	elseif wd == "育兽仙丹" then
		wds[1] = "记载着被三界通缉的犯人信息，右键点击后可获得三界悬赏任务。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 4119346967.0
		wds[13] = 1626787288
	elseif wd == "破裂的蛋" then
		wds[1] = "一种神奇的蛋，蛋壳已经破裂，据说集齐99个破裂的蛋后就可以召唤出异兽纳为坐骑。右键点击使用。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3611787545.0
		wds[13] = 3765069160.0
	elseif wd == "随机5级宝石" then
		wds[1] = "随机5级宝石"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 182374181
		wds[13] = 1097166752
	elseif wd == "祥瑞坐骑礼包" then
		wds[1] = "内含坐骑宠物一只,开启后获得\n#S随机#G祥瑞的坐骑"
		wds[2] = "祥瑞坐骑"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "神行百变·坐骑礼包" then
		wds[1] = "内含坐骑宠物一只,开启后可获得【#S神行百变#W】祥瑞坐骑"
		wds[2] = "祥瑞坐骑"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "百变坐骑·坐骑礼包" then
		wds[1] = "内含坐骑宠物一只,开启后可获得【#S百变坐骑#W】祥瑞坐骑"
		wds[2] = "祥瑞坐骑"
		wds[3] = 7
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3593878998.0
		wds[13] = 1606072540
	elseif wd == "钨金" then
		wds[1] = "一种十分稀有的矿产，其坚硬的性能受广大铸造师的喜爱，是熔炼装备的主要配料。"
		wds[2] = 5
		wds[3] = 6
		wds[4] = 9
		wds[11] = "物品图标.wdf"
		wds[12] = 418047653
		wds[13] = 613303140
	elseif wd == "100点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "20点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "30点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "50点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "80点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "100点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "120点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "200点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "300点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "400点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "500点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "600点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "1000点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "2000点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "2500点卡" then
		wds[1] = "经典点卡，可兑换一定的点数。"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "月卡" then
		wds[1] = "经典月卡,每日可领取一定奖励,持续30日!"
		wds[2] = 1
		wds[3] = 11
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3105159653.0
		wds[13] = 0xFEF0147A
	elseif wd == "100级无级别武器" then
		wds[1] = "三垣中坠，不知其故。展则漫天星辰失色，收则幽渺万籁无声。万顷星瀚，无始无终，无他无我，怎不使人目眩神驰？"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 7
		wds[5] = 160
		wds[7] = {
			"逍遥生",
			"龙太子"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 2182063168.0
		wds[13] = 1649810470
	elseif wd == "100级无级别装备" then
		wds[1] = "以日月光芒所织造的霞衣，对敌之时往往令其目眩神驰"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 160
		wds[6] = "女"
		wds[11] = "物品图标.wdf"
		wds[12] = 1359780053
		wds[13] = 2596354317.0
	elseif wd == "110级无级别武器" then
		wds[1] = "上古魔神所铸神兵，可抗八部天龙。型如鱼骨，伸缩随心；刃化千万剑丝，柔如春蚕吐丝，韧如天地经纬。"
		wds[2] = 2
		wds[3] = 3
		wds[4] = 3
		wds[5] = 160
		wds[7] = {
			"逍遥生",
			"剑侠客",
			"偃无师"
		}
		wds[11] = "物品图标.wdf"
		wds[12] = 1088458361
		wds[13] = 3004473909.0
	elseif wd == "110级无级别装备" then
		wds[1] = "混元一气所凝成的宝甲，至坚不摧之物，可与天地同寿"
		wds[2] = 2
		wds[3] = 4
		wds[4] = 1
		wds[5] = 160
		wds[6] = "男"
		wds[11] = "物品图标.wdf"
		wds[12] = 1802888376
		wds[13] = 3052290356.0
	elseif wd == "高级兽决" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1823291112
		wds[13] = 3631057336.0
	elseif wd == "特殊兽诀" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 74009168
		wds[13] = 3282615977.0
	elseif wd == "神兽兽决" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 74009168
		wds[13] = 3282615977.0
	elseif wd == "观照万象" then
		wds[1] = "记载着上古魔兽特技，可供你的召唤兽学习。"
		wds[2] = 3
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 74009168
		wds[13] = 3282615977.0
	elseif wd == "随机法宝" or wd == "随机一级法宝" or wd == "随机二级法宝" or wd == "随机三级法宝" or wd == "随机四级法宝" then
		wds[1] = wd
		wds[2] = 1000
		wds[3] = 1
		wds[4] = 1
		wds[5] = 1
		wds[6] = 60
		wds[11] = "物品图标.wdf"
		wds[12] = 1616003057
		wds[13] = 1986650439
	elseif wd == "展翅高飞" then
		wds[1] = "展翅高飞仰望天空，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "宝贝葫芦"
		wds[11] = "物品图标.wdf"
		wds[12] = 3622402039.0
		wds[13] = 1862906671
	elseif wd == "旗开得胜" then
		wds[1] = "凯旋之音，百战百胜，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "宝贝葫芦"
		wds[11] = "物品图标.wdf"
		wds[12] = 3579176300.0
		wds[13] = 2485827520.0
	elseif wd == "霸王雄风" then
		wds[1] = "霸气雄风，拥有王者之气魄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "宝贝葫芦"
		wds[11] = "物品图标.wdf"
		wds[12] = 3685825410.0
		wds[13] = 28872718
	elseif wd == "独眼观天" then
		wds[1] = "非常有特色的装饰，装配后个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "神气小龟"
		wds[11] = "物品图标.wdf"
		wds[12] = 2904178090.0
		wds[13] = 2831243733.0
	elseif wd == "威武不屈" then
		wds[1] = "充满着坚贞顽强的气魄，照射出大丈夫的豪气，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "神气小龟"
		wds[11] = "物品图标.wdf"
		wds[12] = 3024391701.0
		wds[13] = 3776779914.0
	elseif wd == "深藏不露" then
		wds[1] = "具备神秘的力量，折射着独特的探险家的气味，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "神气小龟"
		wds[11] = "物品图标.wdf"
		wds[12] = 3255879846.0
		wds[13] = 951814593
	elseif wd == "异域浓情" then
		wds[1] = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "汗血宝马"
		wds[11] = "物品图标.wdf"
		wds[12] = 568779949
		wds[13] = 725341615
	elseif wd == "流星天马" then
		wds[1] = "如流星划过夜空，如天马飞跃彩虹，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "汗血宝马"
		wds[11] = "物品图标.wdf"
		wds[12] = 1315054993
		wds[13] = 3919352361.0
	elseif wd == "威猛将军" then
		wds[1] = "战场上的最强者，威猛而无畏，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "汗血宝马"
		wds[11] = "物品图标.wdf"
		wds[12] = 1731519606
		wds[13] = 3389523093.0
	elseif wd == "知情达理" then
		wds[1] = "相互感知，生死与共，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "欢喜羊羊"
		wds[11] = "物品图标.wdf"
		wds[12] = 1120460818
		wds[13] = 3628789721.0
	elseif wd == "气宇轩昂" then
		wds[1] = "潇潇洒洒，气宇轩昂，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "欢喜羊羊"
		wds[11] = "物品图标.wdf"
		wds[12] = 3264247745.0
		wds[13] = 356194539
	elseif wd == "如花似玉" then
		wds[1] = "如花似如梦，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "欢喜羊羊"
		wds[11] = "物品图标.wdf"
		wds[12] = 1453591152
		wds[13] = 2515720938.0
	elseif wd == "傲视天下" then
		wds[1] = "群雄傲世英雄盖世，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "魔力斗兽"
		wds[11] = "物品图标.wdf"
		wds[12] = 966475601
		wds[13] = 3240415732.0
	elseif wd == "铁血豪情" then
		wds[1] = "铁汉柔情，刚柔并济乃侠之大者，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "魔力斗兽"
		wds[11] = "物品图标.wdf"
		wds[12] = 4042059147.0
		wds[13] = 916223715
	elseif wd == "唯我独尊" then
		wds[1] = "天大地大唯我独大，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "魔力斗兽"
		wds[11] = "物品图标.wdf"
		wds[12] = 3626264928.0
		wds[13] = 522349703
	elseif wd == "叱咤风云" then
		wds[1] = "一声怒喝而使风云翻滚，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "披甲战狼"
		wds[11] = "物品图标.wdf"
		wds[12] = 2195434230.0
		wds[13] = 1490836564
	elseif wd == "异域风情" then
		wds[1] = "异国色彩浓浓，装扮个性独特，与众不同，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "披甲战狼"
		wds[11] = "物品图标.wdf"
		wds[12] = 572805958
		wds[13] = 2136666861
	elseif wd == "假面勇者" then
		wds[1] = "藏在面具后面的脸，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "披甲战狼"
		wds[11] = "物品图标.wdf"
		wds[12] = 2218300480.0
		wds[13] = 1838337721
	elseif wd == "霓裳魅影" then
		wds[1] = "似是天上仙女霓裳飘飘，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "闲云野鹤"
		wds[11] = "物品图标.wdf"
		wds[12] = 880600568
		wds[13] = 3272768191.0
	elseif wd == "披星戴月" then
		wds[1] = "犹如夜空中最亮的星，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "闲云野鹤"
		wds[11] = "物品图标.wdf"
		wds[12] = 2054350186
		wds[13] = 0xFFB05D4D
	elseif wd == "烈焰燃情" then
		wds[1] = "热情澎湃，此物必配蒙情英雄，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "闲云野鹤"
		wds[11] = "物品图标.wdf"
		wds[12] = 536705516
		wds[13] = 2333471637.0
	elseif wd == "天雨流芳" then
		wds[1] = "似是天上流星天雨，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "云魅仙鹿"
		wds[11] = "物品图标.wdf"
		wds[12] = 1535100067
		wds[13] = 1695126102
	elseif wd == "灵光再现" then
		wds[1] = "灵光闪动跳跃着智慧和力量，必是侠者不可缺少之物，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "云魅仙鹿"
		wds[11] = "物品图标.wdf"
		wds[12] = 1583552321
		wds[13] = 92788213
	elseif wd == "倾国倾城" then
		wds[1] = "美艳动人，美丽与智慧并存，装配此物，在人群中闪耀着不同，坐骑装配后能增加所统驭召唤兽的某项临时战斗属性。"
		wds[2] = "坐骑饰品"
		wds[3] = 1
		wds[4] = "云魅仙鹿"
		wds[11] = "物品图标.wdf"
		wds[12] = 546128621
		wds[13] = 2167975905.0
	elseif wd == "天蚕丝" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 350708213
		wds[13] = 1147188956
	elseif wd == "玄龟板" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1445178403
		wds[13] = 928850255
	elseif wd == "阴沉木" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3531700838.0
		wds[13] = 2469491275.0
	elseif wd == "麒麟血" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 3594116837.0
		wds[13] = 4103189534.0
	elseif wd == "内丹" then
		wds[1] = "修炼者经过百年甚至千年的修炼在体内以灵气结成的丹丸，是锻造法宝必备的材料。"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 850048785
		wds[13] = 1654536041
	elseif wd == "金凤羽" then
		wds[1] = "蜂巢百凤之王金凤凰的羽毛，羽毛上带着不熄的火焰，一片凤羽即可燎原，是锻造法宝的上好材料。"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 6
		wds[11] = "物品图标.wdf"
		wds[12] = 3713647641.0
		wds[13] = 1616958067
	elseif wd == "补天石" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 7
		wds[11] = "物品图标.wdf"
		wds[12] = 1048011956
		wds[13] = 3229131074.0
	elseif wd == "龙之筋" then
		wds[1] = "为合成法宝的材料之一"
		wds[2] = 1001
		wds[3] = 1
		wds[4] = 8
		wds[11] = "物品图标.wdf"
		wds[12] = 50965891
		wds[13] = 861051391
	elseif wd == "金银锦盒" then
		wds[1] = "满载富贵与祝福的锦盒，上交帮派白虎堂总管，使帮派增加资金并获得10点帮贡。"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2830836861.0
		wds[13] = 4054553900.0
	elseif wd == "神秘钥匙" then
		wds[1] = "神秘的钥匙，使用后有意想不到的效果。"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 2766304509.0
		wds[13] = 1701091376
	elseif wd == "金钥匙" then
		wds[1] = "神秘的金钥匙，可以用来开启幻境迷宫中散落的宝箱。"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 2766304509.0
		wds[13] = 1701091376
	elseif wd == "突厥密函" then
		wds[1] = "突厥贼子身上的密函，似乎写有一些情报，交给长安李捕头可以换取军功！"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 3613032220.0
		wds[13] = 3926816479.0
	elseif wd == "仙玉锦囊" then
		wds[1] = "传闻是仙神身上携带的锦囊，开启1000仙玉。"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 358867997
		wds[13] = 3080909934.0
	elseif wd == "新仙玉锦囊" then
		wds[1] = "传闻是仙神身上携带的锦囊，开启100仙玉。"
		wds[2] = 1002
		wds[3] = 1
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 358867997
		wds[13] = 3080909934.0
	elseif wd == "贪狼令牌" then
		wds[1] = "积攒999个，可找老G换贪狼神兽一只。"
		wds[2] = 1003
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1037119219
		wds[13] = 2408432815.0
	elseif wd == "观照万象碎片" then
		wds[1] = "积攒999个，可找老G换特殊技能观照万象。"
		wds[2] = 1003
		wds[3] = 11
		wds[4] = 0
		wds[8] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 614270885
		wds[13] = 634783976
	elseif wd == "冰符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2471401267.0
		wds[13] = 1788227286
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			体质 = 1
		}
	elseif wd == "土符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1050037289
		wds[13] = 2121836036
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			耐力 = 1
		}
	elseif wd == "雷符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1739716500
		wds[13] = 2503628148.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			敏捷 = 1
		}
	elseif wd == "电符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFCCD6BDA
		wds[13] = 1172337717
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			法防 = 1
		}
	elseif wd == "风符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2636656361.0
		wds[13] = 1098972045
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黄色"
		wds[21] = {
			魔力 = 1
		}
	elseif wd == "炎符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 565262101
		wds[13] = 4004461966.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黄色"
		wds[21] = {
			力量 = 1
		}
	elseif wd == "火符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 3699495697.0
		wds[13] = 1910852827
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黄色"
		wds[21] = {
			法伤 = 1
		}
	elseif wd == "红云符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1992220900
		wds[13] = 1948652630
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			气血 = 10
		}
	elseif wd == "碧玉符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1130851551
		wds[13] = 1948652630
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			防御 = 3
		}
	elseif wd == "金光符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1463243372
		wds[13] = 1920958763
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			命中 = 4
		}
	elseif wd == "天神符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 2178467971.0
		wds[13] = 609525622
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			伤害 = 1.5
		}
	elseif wd == "飘渺符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 1805352982
		wds[13] = 1178162885
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "绿色"
		wds[21] = {
			灵力 = 1.5
		}
	elseif wd == "天仙符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 3763992223.0
		wds[13] = 3432253321.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "绿色"
		wds[21] = {
			魔法 = 6
		}
	elseif wd == "霞光符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 3274690495.0
		wds[13] = 3376886442.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "绿色"
		wds[21] = {
			速度 = 1.5
		}
	elseif wd == "逍遥符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 158009730
		wds[13] = 2362222373.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "绿色"
		wds[21] = {
			躲避 = 3
		}
	elseif wd == "虹珀符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1559445794
		wds[13] = 234370443
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			魔法 = 6,
			体质 = 1
		}
	elseif wd == "陌影符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1825541961
		wds[13] = 570937575
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			命中 = 4,
			体质 = 1
		}
	elseif wd == "北冥符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2428054060.0
		wds[13] = 2174203433.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			伤害 = 1.5,
			体质 = 1
		}
	elseif wd == "灵月符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFEA25D6F
		wds[13] = 3627783605.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			防御 = 3,
			体质 = 1
		}
	elseif wd == "锦瑟符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 583791394
		wds[13] = 2849591075.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			速度 = 1.5,
			体质 = 1
		}
	elseif wd == "银光符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFC3CDE97
		wds[13] = 603431470
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			躲避 = 3,
			体质 = 1
		}
	elseif wd == "清心符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1443933776
		wds[13] = 778793738
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			灵力 = 1.5,
			体质 = 1
		}
	elseif wd == "星辰符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 780746468
		wds[13] = 1103161354
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			法伤 = 2,
			体质 = 1
		}
	elseif wd == "雪月符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 4016362248.0
		wds[13] = 277375309
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			法防 = 2,
			体质 = 1
		}
	elseif wd == "玄魂符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 891495191
		wds[13] = 3164773242.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			固定伤害 = 2,
			体质 = 1
		}
	elseif wd == "乾坤符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 133493417
		wds[13] = 1149639898
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			气血 = 10,
			耐力 = 1
		}
	elseif wd == "珍珀符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1559445794
		wds[13] = 234370443
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			魔法 = 6,
			耐力 = 1
		}
	elseif wd == "银竹符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 63026987
		wds[13] = 3437329296.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			命中 = 4,
			耐力 = 1
		}
	elseif wd == "神川符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 4183504541.0
		wds[13] = 604767662
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			伤害 = 1.5,
			耐力 = 1
		}
	elseif wd == "玲珑符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 111857621
		wds[13] = 586373815
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			速度 = 1.5,
			耐力 = 1
		}
	elseif wd == "暮影符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 107633839
		wds[13] = 2716847053.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			躲避 = 3,
			耐力 = 1
		}
	elseif wd == "天珍符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3713339032.0
		wds[13] = 1511020724
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			灵力 = 1.5,
			耐力 = 1
		}
	elseif wd == "九影符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3243120012.0
		wds[13] = 1951861465
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			法伤 = 2,
			耐力 = 1
		}
	elseif wd == "百冥符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3888324523.0
		wds[13] = 541751152
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			法防 = 2,
			耐力 = 1
		}
	elseif wd == "莫念符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 891495191
		wds[13] = 2122992980
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			固定伤害 = 2,
			耐力 = 1
		}
	elseif wd == "醉魂符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3744068677.0
		wds[13] = 1749703475
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			气血 = 10,
			魔力 = 1
		}
	elseif wd == "玄羽符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 737873518
		wds[13] = 0xFD8EB3CF
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			命中 = 4,
			魔力 = 1
		}
	elseif wd == "霸风符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1469882154
		wds[13] = 1520487064
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			伤害 = 1.5,
			魔力 = 1
		}
	elseif wd == "无相符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1255834882
		wds[13] = 1606270597
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			防御 = 3,
			魔力 = 1
		}
	elseif wd == "无极符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 517250470
		wds[13] = 2322421997.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			速度 = 1.5,
			魔力 = 1
		}
	elseif wd == "紫晶符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1398893962
		wds[13] = 2809670038.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			躲避 = 3,
			魔力 = 1
		}
	elseif wd == "圣火符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3390074415.0
		wds[13] = 1960013823
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			固定伤害 = 2,
			魔力 = 1
		}
	elseif wd == "昔光符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1875076536
		wds[13] = 3419419685.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			魔法 = 6,
			魔力 = 1
		}
	elseif wd == "子蚀符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 4136157150.0
		wds[13] = 2478851957.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			法防 = 2,
			魔力 = 1
		}
	elseif wd == "流风符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2634887407.0
		wds[13] = 2604967176.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			法伤 = 1.5,
			魔力 = 1
		}
	elseif wd == "地炎符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2507609103.0
		wds[13] = 723671039
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			气血 = 10
		}
	elseif wd == "素影符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3977594714.0
		wds[13] = 400435809
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			魔法 = 6
		}
	elseif wd == "燕灵符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3997289827.0
		wds[13] = 3589360348.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			防御 = 3
		}
	elseif wd == "降龙符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3928882607.0
		wds[13] = 2132322043
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			速度 = 1.5
		}
	elseif wd == "苍玉符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2256111083.0
		wds[13] = 1396086844
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			躲避 = 3
		}
	elseif wd == "流魂符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 4035481111.0
		wds[13] = 4062060336.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			灵力 = 1.5
		}
	elseif wd == "九凤符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2093817338
		wds[13] = 3965028696.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			法防 = 2
		}
	elseif wd == "墨陀符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 66556337
		wds[13] = 1156419874
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			法伤 = 2
		}
	elseif wd == "南夕符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1572608590
		wds[13] = 3132509236.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			力量 = 1,
			固定伤害 = 2
		}
	elseif wd == "引幽符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2735933728.0
		wds[13] = 2891351008.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			气血 = 10,
			敏捷 = 1
		}
	elseif wd == "波涛符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1571227786
		wds[13] = 3755050012.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			魔法 = 6,
			敏捷 = 1
		}
	elseif wd == "铃星符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2892798808.0
		wds[13] = 2101653500
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			命中 = 4,
			敏捷 = 1
		}
	elseif wd == "狂念符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1692207624
		wds[13] = 1569389261
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			伤害 = 1.5,
			敏捷 = 1
		}
	elseif wd == "乱花符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2535644505.0
		wds[13] = 0xFAE16C2E
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			灵力 = 1.5,
			敏捷 = 1
		}
	elseif wd == "幽月符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 149795640
		wds[13] = 1545002453
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			法伤 = 2,
			敏捷 = 1
		}
	elseif wd == "两仪符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1632235560
		wds[13] = 2963628429.0
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			法防 = 2,
			敏捷 = 1
		}
	elseif wd == "七情符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1337602421
		wds[13] = 903646592
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			固定伤害 = 2,
			敏捷 = 1
		}
	elseif wd == "召影符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 2063196919
		wds[13] = 254322973
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			防御 = 3,
			敏捷 = 1
		}
	elseif wd == "太阳符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "红色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "少阳符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黄色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "少阴符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "蓝色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "太阴符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "绿色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "阳仪符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "白色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "阴仪符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "黑色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "太极符石" then
		wds[1] = "铭刻着神秘符文的上古神石,散落三界,具备神秘力量"
		wds[2] = 889
		wds[3] = 88
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
		wds[15] = "可以镶嵌在有开运孔数的装备上"
		wds[20] = "紫色"
		wds[21] = {
			速度 = 1.5,
			气血 = 15
		}
	elseif wd == "未激活的符石1级" then
		wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
		wds[2] = 889
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1477316065
		wds[13] = 3294501316.0
		wds[15] = "鼠标右键点击使用激活"
	elseif wd == "未激活的符石2级" then
		wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
		wds[2] = 889
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1477316065
		wds[13] = 3294501316.0
		wds[15] = "鼠标右键点击使用激活"
	elseif wd == "未激活的符石3级" then
		wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
		wds[2] = 889
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1477316065
		wds[13] = 3294501316.0
		wds[15] = "鼠标右键点击使用激活"
	elseif wd == "未激活的符石" then
		wds[1] = "依照天神所授意的神奇符石，利用人物经验#R/激活#W/后,可以镶嵌到开过运的装备上，按照一定顺序，将正确的符石放入装备的位置中，可被天神附身获得神奇效果。#R/激活后为专用无法转移给他人。"
		wds[2] = 889
		wds[3] = 2
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 1477316065
		wds[13] = 3294501316.0
		wds[15] = "鼠标右键点击使用激活"
	elseif wd == "未激活的星石" then
		wds[1] = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
		wds[2] = 889
		wds[3] = 1
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 1867068088
		wds[13] = 3808811763.0
		wds[15] = "鼠标右键点击使用激活"
	elseif wd == "符石卷轴" then
		wds[1] = "一张记载高级符石合成方式的卷轴。"
		wds[2] = 889
		wds[3] = 2
		wds[4] = 6
		wds[11] = "物品图标.wdf"
		wds[12] = 4192043974.0
		wds[13] = 3745385950.0
	elseif wd == "云荒" then
		wds[1] = "以符文六棱石紧紧包裹住星石，防止其灵气逸散。里面的星石一直在蠢蠢欲动！"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 1
		wds[11] = "物品图标.wdf"
		wds[12] = 2732865720.0
		wds[13] = 1165797035
	elseif wd == "暮霭" then
		wds[1] = "正反两面为不同颜色的陨星。双面绯二色,暮沉沉,楚天辽阔。"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 2
		wds[11] = "物品图标.wdf"
		wds[12] = 4113732788.0
		wds[13] = 4179335718.0
	elseif wd == "落日" then
		wds[1] = "正反两面为不同颜色的陨星。双面金赤二色，落日熔金，山河沐血。"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 3
		wds[11] = "物品图标.wdf"
		wds[12] = 211029992
		wds[13] = 2594025720.0
	elseif wd == "晓天" then
		wds[1] = "正反两面为不同色的陨星。双面苍二色,晓天迷雾,江川双寥。"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 4
		wds[11] = "物品图标.wdf"
		wds[12] = 1841858964
		wds[13] = 358464330
	elseif wd == "林海" then
		wds[1] = "正反两面为不同颜色的陨星。双面翠青二色，林海叠翠，远峰数青。"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 5
		wds[11] = "物品图标.wdf"
		wds[12] = 2786742311.0
		wds[13] = 993326702
	elseif wd == "流霞" then
		wds[1] = "正反两面为不同颜色的陨星。双面绯二色,流霞浴火,枫舞霜天。"
		wds[2] = 889
		wds[3] = 91
		wds[4] = 6
		wds[11] = "物品图标.wdf"
		wds[12] = 3727438775.0
		wds[13] = 1088083837
	elseif wd == "巨剑·元身" then
		wds[1] = "等待被唤醒的洪荒巨剑，与战魄一起锻造为[长息]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3588599251.0
		wds[13] = 1137446459
	elseif wd == "伞·元身" then
		wds[1] = "等待被唤醒的风云之伞，与战魄一起锻造成为[晴雪]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3411832573.0
		wds[13] = 1206537281
	elseif wd == "灯笼·元身" then
		wds[1] = "等待被唤醒的河汉之灯，与战魄一起锻造为[荒尘]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2061657119
		wds[13] = 1305163811
	elseif wd == "长杖·元身" then
		wds[1] = "等待被唤醒的天地之杖，与战魄一起锻造为[弦月]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 841087864
		wds[13] = 1881400609
	elseif wd == "宝珠·元身" then
		wds[1] = "等待被唤醒的盘古之珠，与战魄一起锻造为[赤明]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2933090187.0
		wds[13] = 2474730574.0
	elseif wd == "弓·元身" then
		wds[1] = "等待被唤醒的射日之弓，与战魄一起锻造为[若木]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3457617402.0
		wds[13] = 360584229
	elseif wd == "扇·元身" then
		wds[1] = "等待被唤醒的玄冥之扇，与战魄一起锻造为[星瀚]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1844641073
		wds[13] = 1131474648
	elseif wd == "刀·元身" then
		wds[1] = "等待被唤醒的复仇之刀，与战魄一起锻造为[鸣鸿]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1110521408
		wds[13] = 3907488658.0
	elseif wd == "剑·元身" then
		wds[1] = "等待被唤醒的宿敌之剑，与战魄一起锻造为[擒龙]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2910535259.0
		wds[13] = 3770392192.0
	elseif wd == "斧·元身" then
		wds[1] = "等待被唤醒的魔君之斧，与战魄一起锻造为[裂天]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 0xFBEC3D5B
		wds[13] = 3849362383.0
	elseif wd == "锤·元身" then
		wds[1] = "等待被唤醒的盘古龙齿，与战魄一起锻造为[碎寂]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 964495916
		wds[13] = 1242439028
	elseif wd == "枪·元身" then
		wds[1] = "等待被唤醒的王者之枪，与战魄一起锻造为[弑皇]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2858744109.0
		wds[13] = 791245803
	elseif wd == "飘带·元身" then
		wds[1] = "等待被唤醒的九霄澄云，与战魄一起锻造为[九霄]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1330303181
		wds[13] = 3744558839.0
	elseif wd == "魔棒·元身" then
		wds[1] = "等待被唤醒的混沌异果，与战魄一起锻造为[醍醐]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2367620729.0
		wds[13] = 2874302289.0
	elseif wd == "双环·元身" then
		wds[1] = "等待被唤醒的朝夕霞雾，与战魄一起锻造为[朝夕]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 287151083
		wds[13] = 2107460889
	elseif wd == "双剑·元身" then
		wds[1] = "等待被唤醒的双飞利刃，与战魄一起锻造为[浮犀]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3953056905.0
		wds[13] = 1591395038
	elseif wd == "长鞭·元身" then
		wds[1] = "等待被唤醒的九曲月华，与战魄一起锻造为[霜陨]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2494693490.0
		wds[13] = 472916269
	elseif wd == "爪刺·元身" then
		wds[1] = "等待被唤醒的天地离愁，与战魄一起锻造为[离钩]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 259484746
		wds[13] = 2632033132.0
	elseif wd == "头盔·元身" then
		wds[1] = "等待被唤醒的浑天玄火，与战魄一起锻造为[浑天玄火盔]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 1984577537
		wds[13] = 2154057114.0
	elseif wd == "冠冕·元身" then
		wds[1] = "等待被唤醒的乾元鸣凤，与战魄一起锻造为[乾元鸣凤冕]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3449022199.0
		wds[13] = 3648704534.0
	elseif wd == "坚甲·元身" then
		wds[1] = "等待被唤醒的混元一气，与战魄一起锻造为[混元一气甲]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3498793095.0
		wds[13] = 1606804551
	elseif wd == "纱衣·元身" then
		wds[1] = "等待被唤醒的鎏金浣月，与战魄一起锻造为[鎏金浣月衣]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2582488470.0
		wds[13] = 1251272172
	elseif wd == "挂坠·元身" then
		wds[1] = "等得被唤醒的落霞陨星，与战魄一起锻造为[落霞陨星坠]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 593883840
		wds[13] = 3273328935.0
	elseif wd == "束带·元身" then
		wds[1] = "等待被唤醒的紫霄云芒，与战魄一起锻造为[紫霄云芒带]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 2212029734.0
		wds[13] = 3665373306.0
	elseif wd == "鞋履·元身" then
		wds[1] = "等待被唤醒的紫霄云芒，与战魄一起锻造为[紫霄云芒带]。"
		wds[2] = 66
		wds[3] = 1
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 760051428
		wds[13] = 780070383
	elseif wd == "战魄" then
		wds[1] = "十二神兵精魄所凝的玄彩战魄，不屈的杀意仍在其间咆哮呐喊，他们誓要铸躯重生，再续与魔气这万年未竟之战，与元身一同锻造则可制作160级装备。"
		wds[2] = 67
		wds[3] = 2
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 4168892487.0
		wds[13] = 1412967964
	elseif wd == "陨铁" then
		wds[1] = "由婉君雷霆劈裂出来的陨铁，由于千万年来被神兵与魔气交战所淬炼，其上的痕迹无一不铭刻着各式神兵的印记，亦含有强大神秘力量。可对150级装备进行幻化。"
		wds[2] = 65
		wds[3] = 3
		wds[4] = 0
		wds[11] = "物品图标.wdf"
		wds[12] = 3789813829.0
		wds[13] = 40747013
	elseif wd == "如意符" then
		wds[1] = "用于删除家具，右击使用，点击要删除的家具就可以了"
		wds[2] = 201
		wds[3] = 3
		wds[4] = 0
		wds[11] = "房屋图标.wdf"
		wds[12] = 1457008199
		wds[13] = 2719255743.0
	elseif wd == "蝴蝶兰" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 4054457564.0
		wds[13] = 64792198
		wds[15] = "鼠标右键点击使用"
	elseif wd == "桦木圆桌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 245626769
		wds[13] = 76525272
		wds[15] = "鼠标右键点击使用"
	elseif wd == "五谷轮回桶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 4
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3779948595.0
		wds[13] = 140394635
		wds[15] = "鼠标右键点击使用"
	elseif wd == "凤凰傲意图" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 162415283
		wds[13] = 1149773660
		wds[15] = "鼠标右键点击使用"
	elseif wd == "狮子图屏风" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 202759390
		wds[13] = 3078358520.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "神仙帐" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1932969387
		wds[13] = 242505029
		wds[15] = "鼠标右键点击使用"
	elseif wd == "麻布地毯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 0xFFC56CAC
		wds[13] = 0xFFC56CAC
		wds[15] = "鼠标右键点击使用"
	elseif wd == "虎威太师椅" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3714722222.0
		wds[13] = 2523038028.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "红木地板" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3709028060.0
		wds[13] = 899250745
		wds[15] = "鼠标右键点击使用"
	elseif wd == "桦木立柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1088156777
		wds[13] = 2500704542.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "紫檀马桶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 536870917
		wds[13] = 536870916
		wds[15] = "鼠标右键点击使用"
	elseif wd == "大理石影壁" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 536870919
		wds[13] = 536870918
		wds[15] = "鼠标右键点击使用"
	elseif wd == "猛虎坐山图" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 536870921
		wds[13] = 536870920
		wds[15] = "鼠标右键点击使用"
	elseif wd == "榛木床" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 536870929
		wds[13] = 536870928
		wds[15] = "鼠标右键点击使用"
	elseif wd == "窗帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 536870931
		wds[13] = 536870930
		wds[15] = "鼠标右键点击使用"
	elseif wd == "福" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 3623516388.0
		wds[13] = 164793388
		wds[15] = "鼠标右键点击使用"
	elseif wd == "对联" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 1165090352
		wds[13] = 3515568701.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "横批" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "新加图标.wdf"
		wds[12] = 2088610855
		wds[13] = 4159077088.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "月牙凳" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 922665198
		wds[13] = 2508902162.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "银烛台" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 402845804
		wds[13] = 2523911629.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "蓝绸绣花帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1137982403
		wds[13] = 1494638855
		wds[15] = "鼠标右键点击使用"
	elseif wd == "波丝地毯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1609671252
		wds[13] = 1609671252
		wds[15] = "鼠标右键点击使用"
	elseif wd == "千佛图" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 0xFD182818
		wds[13] = 2847350594.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "双鱼吉庆柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2096188044
		wds[13] = 0xFC060E32
		wds[15] = "鼠标右键点击使用"
	elseif wd == "仙人掌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 963676059
		wds[13] = 0xFB18050C
		wds[15] = "鼠标右键点击使用"
	elseif wd == "雕花马桶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 642408137
		wds[13] = 4033448801.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "水仙" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 279768917
		wds[13] = 731935980
		wds[15] = "鼠标右键点击使用"
	elseif wd == "漆花地板" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3160699751.0
		wds[13] = 288601235
		wds[15] = "鼠标右键点击使用"
	elseif wd == "花鸟图屏风" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 380821555
		wds[13] = 2758205137.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "龟鹤延年灯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 391253560
		wds[13] = 864584440
		wds[15] = "鼠标右键点击使用"
	elseif wd == "壮丽山河" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 479455116
		wds[13] = 3938246537.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "踏春图" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 486590349
		wds[13] = 3780027226.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "红木八仙桌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 507201508
		wds[13] = 3459394432.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "黑麻垂蔓帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3144910053.0
		wds[13] = 527748860
		wds[15] = "鼠标右键点击使用"
	elseif wd == "雕花马桶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 642408137
		wds[13] = 4033448801.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "漆花竹凳" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 713394879
		wds[13] = 3709427222.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白虎皮地毯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3899911130.0
		wds[13] = 726113885
		wds[15] = "鼠标右键点击使用"
	elseif wd == "天山云雪" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 798523924
		wds[13] = 3314557937.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "桦木靠背椅" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 838629810
		wds[13] = 1875485944
		wds[15] = "鼠标右键点击使用"
	elseif wd == "百兽镇邪桌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 857217854
		wds[13] = 951430598
		wds[15] = "鼠标右键点击使用"
	elseif wd == "八宝呈祥桌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 888399610
		wds[13] = 3644963889.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "黄锻锦边帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 926768151
		wds[13] = 3877257957.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "彩绘立柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2771212194.0
		wds[13] = 1088164477
		wds[15] = "鼠标右键点击使用"
	elseif wd == "夕阳山水图" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1691929310
		wds[13] = 3428702620.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "兽皮地毯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1774988676
		wds[13] = 3824138317.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "麻木地毯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1774988676
		wds[13] = 1781444045
		wds[15] = "鼠标右键点击使用"
	elseif wd == "红杏闹春帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 4
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1819362287
		wds[13] = 2161189635.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "紫檀雕花椅" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2734236938.0
		wds[13] = 1847564617
		wds[15] = "鼠标右键点击使用"
	elseif wd == "印花屏风" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2367462166.0
		wds[13] = 1853211998
		wds[15] = "鼠标右键点击使用"
	elseif wd == "玉瓷画瓶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1924160610
		wds[13] = 3179521060.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "嵌玉虎纹桌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1956285927
		wds[13] = 2184109650.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "招财聚宝柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 4
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2130182259
		wds[13] = 3008929205.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "八卦镇邪塌" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 4
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2625514981.0
		wds[13] = 2222572084.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "龙凤呈祥" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3396375782.0
		wds[13] = 4026634367.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "文竹" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2749653472.0
		wds[13] = 3861270528.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "金座雕龙屏风" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3201477312.0
		wds[13] = 3829326163.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "木地板" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 42
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3802256143.0
		wds[13] = 3802256143.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "长信女宫灯" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2678881313.0
		wds[13] = 3737610998.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "紫檀雕花柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 3
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3745427611.0
		wds[13] = 3615622396.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "宁安夜梦" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 4
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3684518415.0
		wds[13] = 2687259099.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "彩绘花瓶" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3645081089.0
		wds[13] = 2737260129.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白鹤展翅帘" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3495043848.0
		wds[13] = 3130450639.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "桦木地板" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3709028060.0
		wds[13] = 2388510788.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "君子兰" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2921325868.0
		wds[13] = 2316444552.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白栅绿竹门" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 766183462
		wds[13] = 0xFAD67DD7
		wds[15] = "鼠标右键点击使用"
	elseif wd == "篱笆花圃" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1819467161
		wds[13] = 2288296141.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "篱笆院墙" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2355313180.0
		wds[13] = 2770542566.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "石凳" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1846709744
		wds[13] = 739937038
		wds[15] = "鼠标右键点击使用"
	elseif wd == "石制宫灯" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2805159460.0
		wds[13] = 1930266364
		wds[15] = "鼠标右键点击使用"
	elseif wd == "石制影壁" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2237459542.0
		wds[13] = 320461298
		wds[15] = "鼠标右键点击使用"
	elseif wd == "石桌" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2756865415.0
		wds[13] = 632597511
		wds[15] = "鼠标右键点击使用"
	elseif wd == "大理石凳" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3032152230.0
		wds[13] = 2516910070.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "大理石花圃" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1995805781
		wds[13] = 1070623151
		wds[15] = "鼠标右键点击使用"
	elseif wd == "大理石桌" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1549575193
		wds[13] = 1300642034
		wds[15] = "鼠标右键点击使用"
	elseif wd == "红漆雕花门" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 81611213
		wds[13] = 1380106107
		wds[15] = "鼠标右键点击使用"
	elseif wd == "青瓷花盆" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2437173080.0
		wds[13] = 2570971897.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "青石路砖" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 2
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3508096336.0
		wds[13] = 148462116
		wds[15] = "鼠标右键点击使用"
	elseif wd == "青铜鼎" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2663779279.0
		wds[13] = 193255470
		wds[15] = "鼠标右键点击使用"
	elseif wd == "石制院墙" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2439436856.0
		wds[13] = 470361498
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白玉花圃" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 0xFBCA03F8
		wds[13] = 2843864409.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白玉狮子" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 766183462
		wds[13] = 1413895521
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白玉石凳" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 681269415
		wds[13] = 3611995190.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白玉石桌" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3111459450.0
		wds[13] = 2731555160.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "白玉影壁" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2203966838.0
		wds[13] = 2247553409.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "花岗石路砖" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 919964124
		wds[13] = 795019860
		wds[15] = "鼠标右键点击使用"
	elseif wd == "混土砖石院墙" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 2343339595.0
		wds[13] = 1182842286
		wds[15] = "鼠标右键点击使用"
	elseif wd == "金丝楠木门" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3611897254.0
		wds[13] = 689004255
		wds[15] = "鼠标右键点击使用"
	elseif wd == "山水盆景" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 3056891040.0
		wds[13] = 2043163465
		wds[15] = "鼠标右键点击使用"
	elseif wd == "四圣兽之白虎" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1795748654
		wds[13] = 3654662840.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "四圣兽之青龙" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 0xFEEF9473
		wds[13] = 3537831900.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "四圣兽之玄武" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1045431423
		wds[13] = 3617514975.0
		wds[15] = "鼠标右键点击使用"
	elseif wd == "四圣兽之朱雀" then
		wds[1] = ""
		wds[2] = 202
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 1017717744
		wds[13] = 707125751
		wds[15] = "鼠标右键点击使用"
	elseif wd == "物品柜" then
		wds[1] = ""
		wds[2] = 200
		wds[3] = 1
		wds[4] = 1
		wds[11] = "房屋图标.wdf"
		wds[12] = 324862490
		wds[13] = 1155057222
		wds[15] = "鼠标右键点击使用"
	end

	return wds
end

复制物品 = function(物品)
	local 道具数据 = 物品类()

	道具数据:置对象(物品.名称)

	道具数据.总类 = 物品.总类
	道具数据.分类 = 物品.分类
	道具数据.子类 = 物品.子类

	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end

	if 物品.气血 ~= nil then
		道具数据.气血 = 物品.气血
	end

	if 物品.魔法 ~= nil then
		道具数据.魔法 = 物品.魔法
	end

	if 物品.愤怒 ~= nil then
		道具数据.愤怒 = 物品.愤怒
	end

	if 物品.体力 ~= nil then
		道具数据.体力 = 物品.体力
	end

	if 物品.活力 ~= nil then
		道具数据.活力 = 物品.活力
	end

	if 物品.命中 ~= nil then
		道具数据.命中 = 物品.命中
	end

	if 物品.伤害 ~= nil then
		道具数据.伤害 = 物品.伤害
	end

	if 物品.防御 ~= nil then
		道具数据.防御 = 物品.防御
	end

	if 物品.速度 ~= nil then
		道具数据.速度 = 物品.速度
	end

	if 物品.躲避 ~= nil then
		道具数据.躲避 = 物品.躲避
	end

	if 物品.灵力 ~= nil then
		道具数据.灵力 = 物品.灵力
	end

	if 物品.体质 ~= nil then
		道具数据.体质 = 物品.体质
	end

	if 物品.魔力 ~= nil then
		道具数据.魔力 = 物品.魔力
	end

	if 物品.力量 ~= nil then
		道具数据.力量 = 物品.力量
	end

	if 物品.耐力 ~= nil then
		道具数据.耐力 = 物品.耐力
	end

	if 物品.敏捷 ~= nil then
		道具数据.敏捷 = 物品.敏捷
	end

	if 物品.品质 ~= nil then
		道具数据.品质 = 物品.品质
	end

	if 物品.附带技能 ~= nil then
		道具数据.附带技能 = 物品.附带技能
	end

	if 物品.镶嵌四相 ~= nil then
		道具数据.镶嵌四相 = 物品.镶嵌四相
	end

	if 物品.锻炼等级 ~= nil then
		道具数据.锻炼等级 = 物品.锻炼等级
	end

	if 物品.镶嵌宝石 ~= nil then
		道具数据.镶嵌宝石 = 物品.镶嵌宝石
	end

	if 物品.级别限制 ~= nil then
		道具数据.级别限制 = 物品.级别限制
	end

	if 物品.特效 ~= nil then
		道具数据.特效 = 物品.特效
	end

	if 物品.特技 ~= nil then
		道具数据.特技 = 物品.特技
	end

	if 物品.价格 ~= nil then
		道具数据.价格 = 物品.价格
	end

	if 物品.五行 ~= nil then
		道具数据.五行 = 物品.五行
	end

	if 物品.数量 ~= nil and 物品.可叠加 then
		道具数据.数量 = 物品.数量
	end

	if 物品.制造者 ~= nil then
		道具数据.制造者 = 物品.制造者
	end

	return 道具数据
end
