装备特技 = {
	弱点击破 = {}
}
装备特技.弱点击破.说明 = "以临时提高伤害力攻击对手,适于对付防御高者"
装备特技.弱点击破.消耗 = 50
装备特技.弱点击破.编号 = 37
装备特技.弱点击破.对象 = 3
装备特技.破血狂攻 = {
	说明 = "狂性大发，可以连续攻击两次",
	消耗 = 80,
	编号 = 36,
	对象 = 3
}
制造装备 = {
	戒指 = {
		[60.0] = "枫华戒",
		[100.0] = "金麟绕",
		[80.0] = "芙蓉戒",
		[160.0] = "太虚渺云",
		[120.0] = "悦碧水",
		[140.0] = "九曜光华"
	},
	手镯 = {
		[60.0] = "香木镯",
		[100.0] = "墨影扣",
		[80.0] = "翡玉镯",
		[160.0] = "浮雪幻音",
		[120.0] = "花映月",
		[140.0] = "金水菩提"
	},
	耳饰 = {
		[60.0] = "翠叶环",
		[100.0] = "玉蝶翩",
		[80.0] = "明月珰",
		[160.0] = "焰云霞珠",
		[120.0] = "点星芒",
		[140.0] = "凤羽流苏"
	},
	佩饰 = {
		[60.0] = "芝兰佩",
		[100.0] = "莲音玦",
		[80.0] = "逸云佩",
		[160.0] = "碧海青天",
		[120.0] = "相思染",
		[140.0] = "玄龙苍珀"
	}
}
装备特技.心疗术 = {
	说明 = "狂性大发，可以连续攻击两次",
	消耗 = 60
}
装备特技.凝气诀 = {
	说明 = "狂性大发，可以连续攻击两次",
	消耗 = 60
}
装备特技.凝神诀 = {
	说明 = "狂性大发，可以连续攻击两次",
	消耗 = 90
}
装备特技.破碎无双 = {
	说明 = "物理攻击敌人，并减少对方和hp损失相同的mp",
	消耗 = 80,
	编号 = 36,
	对象 = 3
}
装备特技.冥王爆杀 = {
	说明 = "减少对方HP，最小伤害为50",
	消耗 = 60,
	编号 = 40,
	对象 = 3
}
装备特技.诅咒之伤 = {
	说明 = "减少敌方单人当前20%的HP",
	消耗 = 40,
	编号 = 16,
	对象 = 3
}
装备特技.太极护法 = {
	说明 = "受到的法伤减半，效果为3回合",
	消耗 = 90,
	编号 = 26,
	对象 = 2
}
装备特技.罗汉金钟 = {
	说明 = "全体队友受到的法伤减半，效果为3回合",
	消耗 = 150,
	编号 = 27,
	对象 = 1
}
装备特技.慈航普渡 = {
	说明 = "复活我方全体队友",
	消耗 = 150,
	编号 = 28,
	对象 = 1
}
装备特技.放下屠刀 = {
	说明 = "降低敌人的物理伤害力，效果持续到战斗结束",
	消耗 = 30,
	编号 = 30,
	对象 = 3
}
装备特技.河东狮吼 = {
	说明 = "降低敌人的物理伤害力，效果持续到战斗结束",
	消耗 = 100,
	编号 = 30,
	对象 = 3
}
装备特技.笑里藏刀 = {
	说明 = "减少敌方单体目标70点愤怒",
	消耗 = 40,
	编号 = 30,
	对象 = 3
}
装备特技.绝幻魔音 = {
	说明 = "减少敌方全体目标20点愤怒",
	消耗 = 70,
	编号 = 30,
	对象 = 3
}
装备特技.破甲术 = {
	说明 = "降低敌方全体的物理防御力，效果持续到战斗结束",
	消耗 = 35,
	编号 = 30,
	对象 = 3
}
装备特技.碎甲术 = {
	说明 = "降低敌方全体的物理防御力，效果持续到战斗结束",
	消耗 = 80,
	编号 = 30,
	对象 = 3
}
装备特技.命归术 = {
	说明 = "恢复自身1/2的气血(最高不超过人物等级*20)",
	消耗 = 130,
	编号 = 7,
	对象 = 1
}
装备特技.气归术 = {
	说明 = "恢复自身1/4的气血(最高不超过人物等级*12)",
	消耗 = 60,
	编号 = 6,
	对象 = 1
}
装备特技.凝气决 = {
	说明 = "恢复自身魔法(魔法上限*10%+150)",
	消耗 = 60,
	编号 = 4,
	对象 = 1
}
装备特技.凝神诀 = {
	说明 = "恢复自身魔法(魔法上限*15%+250)",
	消耗 = 90,
	编号 = 5,
	对象 = 1
}
装备特技.命疗术 = {
	说明 = "恢复(上限9%+600)的气血，对单人使用",
	消耗 = 90,
	编号 = 3,
	对象 = 2
}
装备特技.流云诀 = {
	说明 = "提升队友的速度，效果持续到战斗结束",
	消耗 = 40,
	编号 = 43,
	对象 = 2
}
装备特技.啸风诀 = {
	说明 = "全体队友速度上升，效果持续到战斗结束",
	消耗 = 80,
	编号 = 44,
	对象 = 1
}
装备特技.修罗咒 = {
	说明 = "单体反弹50%的伤害3回合",
	消耗 = 80,
	编号 = 44,
	对象 = 1
}
装备特技.天衣无缝 = {
	说明 = "全体反弹30%的伤害3回合",
	消耗 = 80,
	编号 = 44,
	对象 = 1
}
装备特技.凝滞术 = {
	说明 = "单体速-10%持续到战斗结束",
	消耗 = 40,
	编号 = 44,
	对象 = 1
}
装备特技.停陷术 = {
	说明 = "全体速-5%,持续到战斗结束",
	消耗 = 70,
	编号 = 44,
	对象 = 1
}
装备特技.起死回生 = {
	说明 = "复活队友并回复其一半气血",
	消耗 = 120,
	编号 = 45,
	对象 = 2
}
装备特技.回魂咒 = {
	说明 = "复活队友并回复其一半气血",
	消耗 = 100,
	编号 = 45,
	对象 = 2
}
装备特技.气疗术 = {
	说明 = "恢复(上限3%+200)的气血，对单人使用",
	消耗 = 30,
	编号 = 1,
	对象 = 2
}
装备特技.野兽之力 = {
	说明 = "提升队友的伤害力，效果持续到战斗结束",
	消耗 = 40,
	编号 = 20,
	对象 = 2
}
装备特技.魔兽之印 = {
	说明 = "提升我方全体的伤害力，效果持续到战斗结束",
	消耗 = 70,
	编号 = 21,
	对象 = 1
}
装备特技.光辉之甲 = {
	说明 = "提升队友的防御，效果持续到战斗结束",
	消耗 = 40,
	编号 = 22,
	对象 = 2
}
装备特技.圣灵之甲 = {
	说明 = "提升我方全体的防御，效果持续到战斗结束",
	消耗 = 80,
	编号 = 23,
	对象 = 1
}
装备特技.四海升平 = {
	说明 = "恢复全体队友1/4的气血(最高不超过被恢复目标的等级*12)",
	消耗 = 135,
	编号 = 8,
	对象 = 1
}
装备特技.水清诀 = {
	说明 = "解除目标异常状态",
	消耗 = 50,
	编号 = 12,
	对象 = 2
}
装备特技.玉清诀 = {
	说明 = "解除全体队员异常状态",
	消耗 = 125,
	编号 = 14,
	对象 = 2
}
装备特技.冰清诀 = {
	说明 = "解除目标当前异常状态并恢复目标1/4的气血",
	消耗 = 100,
	编号 = 13,
	对象 = 2
}
装备特技.晶清诀 = {
	说明 = "解除全体队员异常状态并恢复全体队员15%的气血",
	消耗 = 150,
	编号 = 15,
	对象 = 2
}
装备特技.金刚怒目 = {
	说明 = "对一个目标使用，使目标获得80点愤怒。不可对自己用",
	消耗 = 80,
	编号 = 100,
	对象 = 2
}
装备特技.乾坤挪移 = {
	说明 = "驱散目标所有增益、清除目标所有异常、移除目标的太极护法、罗汉金钟、死亡禁锢效果",
	消耗 = 135,
	编号 = 101
}
装备特技.菩提心佑 = {
	说明 = "给己方所有目标增加等级×15的护盾值。",
	消耗 = 150,
	编号 = 102,
	对象 = 2
}
装备特技.琴音三叠 = {
	说明 = "使用3次法术攻击敌人,按次数增加伤害",
	消耗 = 80,
	编号 = 41,
	对象 = 3
}
装备特技.琴音三叠2 = {
	消耗 = 0
}
装备特技.琴音三叠3 = {
	消耗 = 0
}
