官职答题题库 = {
	{
		"白求恩是哪国人?",
		"加拿大",
		"俄罗斯",
		"法国",
		"德国"
	},
	{
		"世界上最大的宫殿是:",
		"故宫",
		"白宫",
		"爱丽舍宫",
		"克里姆林宫"
	},
	{
		"奥运会旗是:'五色环'旗,其中黄色环代表:",
		"亚洲",
		"欧洲",
		"非洲",
		"大洋洲"
	},
	{
		"“轻于鸿毛”中的鸿毛是哪种动物的毛?",
		"大雁",
		"羊",
		"鸡",
		"鸭"
	},
	{
		"校园歌曲《童年》的词曲作者是：正确答案：",
		"罗大佑",
		"李宗盛",
		"周杰伦",
		"光良"
	},
	{
		"奥运会上的马拉松比赛的起源与什么有关?",
		"战争",
		"游戏",
		"打赌",
		"竞赛"
	},
	{
		"藏历新年，人们见面时都要说“扎西德勒”是什么意思?",
		"吉祥如意",
		"新年好",
		"你好",
		"恭喜发财"
	},
	{
		"“写鬼写妖高人一筹，刺贪刺虐入木三分”这一对联写的作家是",
		"蒲松龄",
		"吴敬梓",
		"曹雪芹",
		"罗贯中"
	},
	{
		"世界上最深的海沟是?",
		"马里亚纳海沟",
		"马绍尔海沟",
		"日本海沟",
		"汤加海沟"
	},
	{
		"俗称“长生果”是指",
		"花生",
		"腰果",
		"核桃",
		"桃子"
	},
	{
		"红娘由来是出自下列哪部古典名剧:",
		"《西厢记》",
		"《琵琶记》",
		"《长生殿》",
		"《桃花扇》"
	},
	{
		"“民为贵,社稷次之,君为轻”这句话出自",
		"《孟子》",
		"《孔子》",
		"《庄子》",
		"《韩非子》"
	},
	{
		"六弦琴是什么乐器的别称",
		"吉他",
		"二胡",
		"小提琴",
		"古筝"
	},
	{
		"在电脑领域，“闪客”是指",
		"Flash高手",
		"iso高手",
		"编程高手",
		"PS高手"
	},
	{
		"一般钢琴是以一连串八度音程的区间所构成，请问同一音程中有几个黑阶?",
		"五个",
		"七个",
		"六个",
		"四个"
	},
	{
		"“who”代表什么世界组织",
		"世界卫生组织",
		"世界石油输出国组织",
		"世界绿色和平组织",
		"世界贸易组织"
	},
	{
		"人体最坚硬的部分是：",
		"牙齿",
		"膝盖",
		"头盖骨",
		"指甲"
	},
	{
		"著名油画《开国大典》是誰的作品?",
		"董西文",
		"关山月",
		"徐悲鸿",
		"范曾"
	},
	{
		"山东山西的'山'是指:",
		"太行山",
		"泰山",
		"沂蒙山",
		"恒山"
	},
	{
		"通常人们在信尾写上“此致敬礼”，这个“此”是指",
		"信的内容",
		"写信人的谦称",
		"代指后面的敬礼",
		"礼貌用语"
	},
	{
		"“三十年河东，四十年河西”中的“河”最初指的是",
		"黄河",
		"淮河",
		"长江",
		"汾河"
	},
	{
		"具有止血功能的维生素是：",
		"维生素K",
		"维生素C",
		"维生素E",
		"维生素B"
	},
	{
		"“豆寇年华”是指几岁?",
		"13岁",
		"14岁",
		"15岁",
		"16岁"
	},
	{
		"“三月不知肉味”这句话一般用来形容",
		"音乐",
		"诗歌",
		"小说",
		"散文"
	},
	{
		"我国的哪一个城市素有“日光之城”的美称?",
		"拉萨",
		"厦门",
		"青岛",
		"三亚"
	},
	{
		"被誉为“浑身都是音乐”的著名指挥家是：",
		"小泽征尔",
		"伯恩施坦",
		"卡拉扬",
		"梅达"
	},
	{
		"弱冠指的是多少岁?",
		"二十岁",
		"十岁",
		"十五岁",
		"二十五岁"
	},
	{
		"青年毛泽东在湖南第一师范创立读书会时，他们的口号是",
		"经世致用",
		"改造中国，改造世界",
		"博学笃行立志修身",
		"革新学术"
	},
	{
		"下列哪个不属于我国民间四大传说之一:",
		"嫦娥奔月",
		"牛郎织女",
		"孟姜女寻夫",
		"梁山伯与祝英台",
		"白蛇与许仙"
	},
	{
		"“沉鱼落雁，闭月羞花”中“闭月”是指：",
		"貂禅",
		"王昭君",
		"杨贵妃",
		"西施"
	},
	{
		"“沉鱼落雁，闭月羞花”中“沉鱼”是指：",
		"西施",
		"貂禅",
		"王昭君",
		"杨贵妃"
	},
	{
		"“沉鱼落雁，闭月羞花”中“落雁”是指：",
		"王昭君",
		"西施",
		"貂禅",
		"杨贵妃"
	},
	{
		"“沉鱼落雁，闭月羞花”中“羞花”是指：",
		"杨贵妃",
		"王昭君",
		"西施",
		"貂禅"
	},
	{
		"中国人过年吃的年糕是为了纪念哪位历史名人",
		"伍子胥",
		"孙武",
		"夫差",
		"诸葛亮"
	},
	{
		"“惟见长江天际流”的前一句是什么?",
		"孤帆远影碧空尽",
		"除却巫山不是云",
		"莫愁前路无知己",
		"身无彩凤双飞翼"
	},
	{
		"“曾经沧海难为水”的下一句是什么?",
		"除却巫山不是云",
		"孤帆远影碧空尽",
		"春蚕到死丝方尽",
		"宝剑锋从磨砺出"
	},
	{
		"“天下谁人不识君”的前一句是什么?",
		"莫愁前路无知己",
		"除却巫山不是云",
		"孤帆远影碧空尽",
		"身无彩凤双飞翼"
	},
	{
		"“蜡炬成灰泪始干”的前一句是什么?",
		"春蚕到死丝方尽",
		"莫愁前路无知己",
		"碧玉妆成一树高",
		"除却巫山不是云"
	},
	{
		"“梅花香自苦寒来”的前一句是什么?",
		"宝剑锋从磨砺出",
		"孤帆远影碧空尽",
		"身无彩凤双飞翼",
		"莫愁前路无知己"
	},
	{
		"“心有灵犀一点通”的前一句是什么?",
		"身无彩凤双飞翼",
		"碧玉妆成一树高",
		"除却巫山不是云",
		"莫愁前路无知己"
	},
	{
		"“万条垂下绿丝绦”的前一句是什么?",
		"碧玉妆成一树高",
		"莫愁前路无知己",
		"身无彩凤双飞翼",
		"春蚕到死丝方尽"
	},
	{
		"“智慧之果”是指什么？",
		"香蕉",
		"苹果",
		"桃子",
		"菠萝"
	},
	{
		"植物什么时候需水最多？",
		"初夏",
		"开春",
		"入秋",
		"寒冬"
	},
	{
		"在我国，一般草莓是什么形状的？",
		"叶椭圆形",
		"圆形",
		"半圆形",
		"椭圆形"
	},
	{
		"中国的国花是哪种？",
		"牡丹",
		"杜鹃",
		"樱花",
		"波斯菊"
	},
	{
		"早晨开的花是：",
		"牵牛花",
		"玫瑰花",
		"牡丹花",
		"樱花"
	},
	{
		"九转大肠是属于什么菜系的名菜？",
		"鲁菜",
		"川菜",
		"粤菜",
		"闽菜"
	},
	{
		"我国第一部有声影片是：",
		"《歌女红牡丹》",
		"《定军山》",
		"《林则徐》",
		"《玉人何处》"
	},
	{
		"下列哪座山不属于我国四大佛山之一：",
		"雁荡山",
		"五台山",
		"九华山",
		"峨眉山",
		"普陀山"
	},
	{
		"下面哪个是对“惊蛰”这个节气的正确描述？",
		"温度逐渐升高，开始打雷，冬眠动物苏醒",
		"降雨量增多，对谷类生长有利。",
		"春季开始",
		"气候温暖，草木茂盛，天气晴朗。"
	},
	{
		"没有在入海口形成三角洲的河流是",
		"钱塘江",
		"长江",
		"黄河",
		"珠江"
	},
	{
		"奔驰汽车原产于哪一个国家?",
		"德国",
		"美国",
		"日本",
		"英国"
	},
	{
		"北京大学的第一位校长是？",
		"严复",
		"蔡元培",
		"胡适",
		"鲁迅"
	},
	{
		"大汶口文化遗址在我国的什么地方？",
		"山东",
		"湖南",
		"广西",
		".甘肃"
	},
	{
		"世界第一大教堂是？",
		"圣彼得大教堂",
		"圣罗伦索大教堂",
		"圣玛利亚教堂",
		"米兰大教堂"
	},
	{
		"下列哪个不是美国宝洁公司的产品",
		"纳爱斯牙膏",
		"海飞丝洗发水",
		"佳洁士牙膏",
		"汰渍洗衣粉",
		"飘柔洗发水"
	},
	{
		"洲际导弹一般射程在多少公里以上? ",
		"一万",
		"一百",
		"一千",
		"十万"
	},
	{
		"莎士比亚四大悲剧中哪部又称“王子复仇记”",
		"《哈姆雷特》",
		"《奥赛罗》",
		"《麦克白斯》",
		"《李尔王》"
	},
	{
		"味精的主要成分是",
		"谷氨酸钠",
		"氯化钠",
		"醋酸",
		"硝酸钠"
	},
	{
		"‘破釜沉舟’这个成语出于哪次战争?",
		"巨鹿之战",
		"赤壁之战",
		"长平之战",
		"官渡之战"
	},
	{
		"地核内部的温度在多少 ℃以上",
		"5000",
		"3000",
		"4000",
		"6000"
	},
	{
		"一般而言，肥胖是指超过理想体重的百分之多少",
		"20%",
		"10%",
		"30%",
		"40%"
	},
	{
		"平素体弱又不经常锻炼身体的人，当她（他）们从蹲位突然站起时，往往出现头晕、眼前发黑，甚至晕倒等现象，其原因是",
		"直立性高血压",
		"贫血",
		"饥饿",
		"高血压"
	},
	{
		"《献血法》规定，献血者两次献血间隔时间不得少于",
		"六个月",
		"两个月",
		"八个月",
		"一年"
	},
	{
		"西洋占星术中将一年分成十二个星座，以下哪个不是土像星座？",
		"牡羊座",
		"处女座",
		"金牛座",
		"魔羯座"
	},
	{
		"下列著名作家哪位不是19世纪英国诗坛三大巨星之一:",
		"笛福",
		"济慈",
		"雪莱",
		"拜伦"
	},
	{
		"世界上有很多种语言，大约有多少种？",
		"近3000种",
		"近1000种",
		"近4000种",
		"近2000种"
	},
	{
		"在湖南第一师范，杨昌济老师有三位得意弟子，他们品学兼优，志趣相投，人称“湘江三友”，请问他们分别是",
		"毛泽东、萧子升、何叔衡",
		"毛泽东、蔡和森、张昆弟",
		"毛泽东、蔡和森、萧子升",
		"蔡和森、张昆弟、何叔衡"
	},
	{
		"世界哪一个国家的茶叶产量最多？",
		"印度",
		"中国",
		"朝鲜",
		"日本"
	},
	{
		"发烧时不宜喝什么饮料？",
		"浓茶",
		"白开水",
		"果汁",
		"汽水"
	},
	{
		"世界读书日是什么时候？",
		"4.23",
		"9.18",
		"2.13",
		"6.21"
	},
	{
		"下列哪个概念不符合温带沙漠环境特征：",
		"年温差小",
		"日温差大",
		"年降雨量少",
		"植物根长叶小"
	},
	{
		"我们通常所说的“北斗七星”，天文学上称之为：",
		"小熊星座",
		"半人马座",
		"大熊星座",
		"狮子星座"
	},
	{
		"下列科学家中哪位是犹太人？",
		"爱因斯坦",
		"培根",
		"牛顿",
		"拉瓦锡"
	},
	{
		"第一个在春晚上打广告的企业是",
		"活力28集团",
		"联想集团",
		"稻花香酒业",
		"海尔集团"
	},
	{
		"《西游记》中的火焰山在哪里？",
		"中国吐鲁番",
		"中国四川",
		"巴基斯坦",
		"哈萨克斯坦"
	},
	{
		"按照宇宙大爆炸理论，宇宙的年龄估计有",
		"120亿年",
		"200亿年",
		"50亿年",
		"150亿年"
	},
	{
		"以下历史事件中，与关羽无关的是",
		"七擒七纵",
		"单刀赴会",
		"水淹七军",
		"大意失荆州"
	},
	{
		"“东风不与周郎便，铜雀春深锁二乔”。这首诗的作者生活的年代与诗中所描述的历史事件发生的年代大约相隔了",
		"600年",
		"400年",
		"500年",
		"700年"
	},
	{
		"巴黎凯旋门是为纪念谁而建？",
		"拿破仑",
		"丘吉尔",
		"哥伦布",
		"路易十四"
	},
	{
		"在我国古代神话中'开天辟地'的是",
		"盘古氏",
		"燧人氏",
		"女娲",
		"神农氏"
	},
	{
		"在我国古代神话中'钻木取火'的是",
		"燧人氏",
		"盘古氏",
		"女娲",
		"神农氏"
	},
	{
		"在我国古代神话中'尝百草'的是",
		"神农氏",
		"盘古氏",
		"燧人氏",
		"女娲"
	},
	{
		"在我国古代神话中'补天'的是",
		"女娲",
		"神农氏",
		"盘古氏",
		"燧人氏"
	},
	{
		"下列哪个是真正的鱼",
		"海马",
		"鲸鱼",
		"章鱼",
		"儒艮"
	},
	{
		"足球共有多少块补丁组成？",
		"32",
		"36",
		"28",
		"30"
	},
	{
		"中国古代的青铜器，造型新颖，种类繁多，以商、周、春秋时期的为多。其主要成分是",
		"铜与锡",
		"铜",
		"铜与铁",
		"铜与钢"
	},
	{
		"造纸和印刷术是我国的伟大发明，而下列哪部著作是世界上第一部用纸印刷的书籍？",
		"《金刚经》",
		"《三国志》",
		"《营造方式》",
		"《禽经》"
	},
	{
		"马岛战争是哪两国之间的战争",
		"英国-阿根廷",
		"美国—日本",
		"美国—古巴",
		"英国—德国"
	},
	{
		"下列世界奇迹哪个位于伊拉克？",
		"空中花园",
		"金字塔",
		"宙斯神像",
		"太阳神像"
	},
	{
		"历史上曾有的“风声雨声读书声声声入耳，家事国事天下事事事关心”对联是在：",
		"东林书院",
		"岳麓书院",
		"石鼓书院",
		"白鹿书院",
		"应天书院"
	},
	{
		"所谓“先有哈佛，后有美利坚”第一批清教徒抵达北美160年后有了美利坚，那么他们抵达北美多久有了哈佛大学",
		"16年",
		"10年",
		"28年",
		"50年"
	},
	{
		"电力是一种便于集中、传输、分散、控制和转换成其他形式的能源，是（）次能源？",
		"二",
		"一",
		"三",
		"四"
	},
	{
		"下列袋类动物中哪一种的育儿袋是朝后开的",
		"袋熊",
		"袋狸",
		"袋鼠",
		"袋狼"
	},
	{
		"根据有关规定，职工的试用期最长不得超过：",
		"6个月",
		"3个月",
		"1个月",
		"12个月"
	},
	{
		"中国民主党派共有多少个？",
		"8",
		"9",
		"10",
		"11"
	},
	{
		"阴历闰年的二月比其他年份的二月多一天，为什么要这样安排？",
		"因为月亮绕地球一周的运行时间很接近29天",
		"为了使历法与地球的自转周期更接近",
		"为了使历法与地球的公转周期相吻合",
		"平年二月只有28天，与其他月份的天数相差太大，为了补偿这种差异，每四年给二月增加一天。"
	},
	{
		"长江大学校徽上“长江大学”几个字是谁写的",
		"廖永远",
		"胡锦涛",
		"江泽民",
		"毛泽东"
	},
	{
		"一度电可供一只50瓦的灯泡照明几小时?",
		"20",
		"5",
		"10",
		"36"
	},
	{
		"不锈钢中的什么元素使这种合金钢不生锈？",
		"铬",
		"锰",
		"钨",
		"钼"
	},
	{
		"下列哪个情景正确使用了“摆烂”一词？",
		"考研偶尔摆烂，经常偶尔。",
		"我把宿舍的抹布摆烂了。"
	},
	{
		"“栓Q'是什么意思？",
		"表示很无语的“谢谢”",
		"表示很酸",
		"表示拴住什么东西"
	},
	{
		"“你没事吧”和哪位明星相关？",
		"杨幂",
		"赵今麦",
		"迪丽热巴",
		"刘诗诗"
	},
	{
		"“退退退“出自哪里？",
		"本土大妈吵架的视频",
		"击剑运动的动作",
		"本土大叔钓鱼的视频"
	},
	{
		"银河系知名弹幕网站'bilibili'的正确写法是？",
		"哔哩哔哩",
		"吡哩吡哩",
		"哗哩哗哩",
		"比利比利"
	},
	{
		"下列哪一句名言的作者是诸葛亮？",
		"鞠躬尽瘁，死而后已",
		"我太祖武皇帝，扫清六合，席卷八荒",
		"天数有变，神器更易，而归有德之人",
		"谅尔等腐草之萤光，如何比得上天空之皓月"
	},
	{
		"下列注音，有误的一项是？",
		"堀(jué)北铃音",
		"昴宿(xiù)七星",
		"梓川咲(xiào)太",
		"中野三玖(jiǔ)"
	},
	{
		"下列哪一段话的作者是鲁迅？",
		"我们中国的最伟大最永久，而且最普遍的艺术也就是男人扮女人",
		"好一个黄土高原！好一个安塞腰鼓！",
		"如果拿不准一句名言是谁说的，就说是马克·吐温说的",
		"我即使是死了，被钉在棺材里了，也要在墓里，用腐朽的声音喊出......"
	},
	{
		"下列古诗文，衔接正确的一项是？",
		"徘徊庭树下，自挂东南枝",
		"受任于败军之际，骈死于槽枥之间",
		"朕与先生解战袍，芙蓉帐暖度春宵",
		"轻拢慢捻抹复挑，从此君王不早朝"
	},
	{
		"以下哪种情况可以用梗“苹果手机看不见”",
		"美国发生重大枪击案",
		"日本经济衰退",
		"缅甸一小孩三餐吃土豆",
		"英国人砸5G基站"
	},
	{
		"考试一般用什么铅笔？",
		"2B",
		"SB",
		"HB",
		"NB"
	},
	{
		"以下与“闹太套”无关的是？",
		"避孕套",
		"黄晓明",
		"not at all"
	},
	{
		"“一个艰难的决定”是以下哪个公司做出的？",
		"腾讯",
		"360",
		"百度",
		"网易"
	},
	{
		"“坑爹”是什么意思？",
		"小坑他爹",
		"他爹姓坑",
		"骗人、不太给力"
	},
	{
		"中国最神秘的部门是神马部门？",
		"有关部门",
		"无关部门",
		"艳照门"
	},
	{
		"什么是“3Q大战”？",
		"腾讯公司强迫4亿网民卸载360事件",
		"三个阿Q玩3P",
		"赌王和赌圣决战时双方的底牌分别是红桃3和黑桃Q；"
	},
	{
		"国家规定卖淫的尊称必须是神马？",
		"失足妇女",
		"果儿",
		"小姐",
		"公主"
	},
	{
		"如果湖南卫视叫“芒果台”，江苏卫视叫？",
		"大蒜台",
		"鸭梨台",
		"番茄台"
	},
	{
		"淘宝卖家喜欢怎么称呼买家？",
		"亲",
		"顾客",
		"你"
	},
	{
		"上课的时候，小猫、小狗、小鸡、小鸭谁最先被叫起来背书？",
		"小狗",
		"小猫",
		"小鸡",
		"小鸭"
	},
	{
		"茉莉花、太阳花、玫瑰花哪一朵花最没力？",
		"茉莉花",
		"太阳花",
		"玫瑰花"
	},
	{
		"猩猩最讨厌什么线？?",
		"平行线",
		"相交线",
		"直线",
		"斜线"
	},
	{
		"橡皮、老虎皮、狮子皮哪一个最不好？",
		"橡皮",
		"老虎皮",
		"狮子皮"
	},
	{
		"数字中哪个最勤劳？",
		"2",
		"1",
		"3",
		"4"
	},
	{
		"数字中哪个最懒惰？",
		"1",
		"2",
		"3",
		"4"
	},
	{
		"出现食物中毒症状或者误食化学品时，最先采取的急救措施是",
		"催吐",
		"吃止泻药物",
		"进行人工呼吸",
		"向卫生防疫部门报告"
	},
	{
		"绿色蔬菜营养营养丰富，下列不属于绿色蔬菜所含营养物质的为",
		"钙质",
		"叶酸",
		"维生素A",
		"维生素C"
	},
	{
		"俗称“四不像”的动物是",
		"麋鹿",
		"白唇鹿",
		"斑马",
		"河马"
	},
	{
		"烧菜时最好在何时加碘盐以减少碘的损失？",
		"菜将出锅时",
		"烧菜加水后",
		"烧菜加水前",
		"烧菜前用碘盐爆锅"
	},
	{
		"食品的保质期是指它的：",
		"最佳食用期",
		"生产日期",
		"最终食用期",
		"出厂日期"
	},
	{
		"感冒忌用下列哪一种食物",
		"海鱼",
		"豆浆",
		"青菜",
		"生姜"
	},
	{
		"某试验检测将实际有病的人正确地判断为病人的能力，被称为：",
		"敏感度",
		"特异度",
		"阳性预测值",
		"一致性",
		"约登指数"
	},
	{
		"管理流行病学和卫生事业管理的研究对象是：",
		"社区人群",
		"疾病和健康状况",
		"病人",
		"健康人群",
		"普通人群"
	},
	{
		"下列注音，有误的一项是？",
		"远坂凛(líng)",
		"反差(chā)萌",
		"世界美咲(xiào)剧场",
		"珈(jiā)百璃"
	},
	{
		"与二次元相对应的概念是",
		"三次元",
		"异次元",
		"半次元",
		"四次元"
	},
	{
		"动漫的含义是",
		"动画和漫画",
		"好看的动画",
		"有声漫画",
		"冷冻的鳗鱼"
	},
	{
		"卫宫家今天的饭是什么？",
		"是动画",
		"是炒饭",
		"是辣条",
		"是寿司"
	},
	{
		"为什么当年动画版圣斗士比动画版七龙珠引进得早？",
		"因为紫龙的名字很中国范儿，而七龙珠则魔改西游记",
		"因为瞬是男的能够避免早恋现象，而布尔玛太天然",
		"因为领导喜欢雅典娜，却不喜欢孙悟空",
		"因为圣斗士出周边赚得比七龙珠多"
	},
	{
		"中国第一部动画《大闹画室》诞生于（），日本的第一部动画片诞生于（）",
		"1926、1917",
		"1925、1916",
		"1927、1918",
		"1918、1919"
	},
	{
		"连环画版《悲惨世界》的作者是",
		"张定华",
		"张一山",
		"张全蛋",
		"张召忠"
	},
	{
		"下列哪一位是著名数学家？",
		"欧拉",
		"木大",
		"呦西",
		"西内"
	},
	{
		"下列数字中，哪一个是素数（质数）？",
		"233",
		"9",
		"666",
		"114514"
	},
	{
		"tan90°是什么意思？",
		"不存在的",
		"鸡你太美",
		"素质三连",
		"一个顶俩"
	},
	{
		"数学家高斯在大学时解决的千年难题是？",
		"正十七边形如何尺规作图",
		"一个人是傲娇好还是天然好",
		"豆腐脑是甜的好还是咸的好",
		"维纳斯的身高是多少"
	},
	{
		"圆锥曲线中，遇到中点弦相关的问题，通常应该使用哪种方法？",
		"点差法",
		"口胡法",
		"目测法",
		"随机数表法"
	},
	{
		"“如果一个人是肥宅，那么他每三个月就换一次老婆”的逆命题是？",
		"每三个月换一次老婆的人是肥宅",
		"肥宅每三个月换一次老婆",
		"老婆每三个月换一次肥宅",
		"肥宅没有老婆"
	},
	{
		"一个人喜欢另一个人是两个人互相喜欢的？",
		"必要不充分条件",
		"充分不必要条件",
		"充要条件",
		"既不充分也不必要条件"
	},
	{
		"经常在江苏省为高考数学命题的是？",
		"葛军",
		"葛平",
		"葛优",
		"葛炮"
	},
	{
		"下列哪一选项所对应的数字最大？",
		"2233手办的最高拍卖价",
		"蔡徐坤兴趣的数量",
		"被抢注商标的UP主人数",
		"厂长一盘盲僧的输出"
	}
}
文官称谓 = {
	{
		"从九品·将仕郎",
		50,
		0
	},
	{
		"从九品·文林郎",
		150,
		0
	},
	{
		"正九品·登仕郎",
		309,
		0
	},
	{
		"正九品·儒林郎",
		476,
		0
	},
	{
		"从八品·右拾遗",
		767,
		0
	},
	{
		"从八品·左拾遗",
		1078,
		0
	},
	{
		"正八品·右补阙",
		1390,
		0
	},
	{
		"正八品·左补阙",
		1701,
		0
	},
	{
		"从七品·右录事",
		2012,
		0
	},
	{
		"从七品·左录事",
		2412,
		0
	},
	{
		"正七品·右功曹",
		2812,
		0
	},
	{
		"正七品·左功曹",
		3212,
		0
	},
	{
		"从六品·侍御史",
		3612,
		0
	},
	{
		"从六品·太学博士",
		4012,
		0
	},
	{
		"正六品·广文博士",
		4412,
		767
	},
	{
		"正六品·通文博士",
		4985,
		1078
	},
	{
		"从五品·朝散大夫",
		5557,
		1390
	},
	{
		"从五品·朝请大夫",
		6130,
		1701
	},
	{
		"正五品·奉御少监",
		6703,
		2012
	},
	{
		"正五品·御史中丞",
		7275,
		2412
	},
	{
		"从四品·御史大夫",
		8494,
		2812
	},
	{
		"从四品·太中大夫",
		10080,
		3212
	},
	{
		"正四品·尚书右丞",
		12320,
		3612
	},
	{
		"正四品·尚书左丞",
		14560,
		4012
	},
	{
		"从三品·光禄大夫",
		16800,
		4412
	},
	{
		"正三品·尚书",
		19600,
		4985
	},
	{
		"从二品·尚书仆射",
		22400,
		5557
	},
	{
		"正二品·御赐特进",
		25200,
		6130
	},
	{
		"从一品·尚书令",
		29120,
		6703
	},
	{
		"正一品·开府仪同三司",
		34720,
		7275
	}
}
武官称谓 = {
	{
		"从九品·陪戎副尉",
		0,
		50
	},
	{
		"从九品·陪戎校尉",
		0,
		150
	},
	{
		"正九品·仁勇副尉",
		0,
		309
	},
	{
		"正九品·仁勇校尉",
		0,
		476
	},
	{
		"从八品·御侮副尉",
		0,
		767
	},
	{
		"从八品·御侮校尉",
		0,
		1078
	},
	{
		"正八品·宣节副尉",
		0,
		1390
	},
	{
		"正八品·宣节校尉",
		0,
		1701
	},
	{
		"从七品·翊麾副尉",
		0,
		2012
	},
	{
		"从七品·翊麾校尉",
		0,
		2412
	},
	{
		"正七品·致果副尉",
		0,
		2812
	},
	{
		"正七品·致果校尉",
		0,
		3212
	},
	{
		"从六品·振威副尉",
		0,
		3612
	},
	{
		"从六品·振威校尉",
		0,
		4012
	},
	{
		"正六品·昭武副尉",
		767,
		4412
	},
	{
		"正六品·昭武校尉",
		1078,
		4985
	},
	{
		"从五品·游击将军",
		1390,
		5557
	},
	{
		"从五品·游骑将军",
		1701,
		6130
	},
	{
		"正五品·宁远将军",
		2012,
		6703
	},
	{
		"正五品·定远将军",
		2412,
		7275
	},
	{
		"从四品·明威将军",
		2812,
		8494
	},
	{
		"从四品·宣威将军",
		3212,
		10080
	},
	{
		"正四品·壮武将军",
		3612,
		12320
	},
	{
		"正四品·忠武将军",
		4012,
		14560
	},
	{
		"从三品·云麾将军",
		4412,
		16800
	},
	{
		"正三品·冠军将军",
		4985,
		19600
	},
	{
		"从二品·镇军将军",
		5557,
		22400
	},
	{
		"正二品·辅国将军",
		6130,
		25200
	},
	{
		"从一品·镇国将军",
		6703,
		29120
	},
	{
		"正一品·天策上将",
		7275,
		34720
	}
}
特殊官职称谓列表 = {
	"功标青史·太傅",
	"功标青史·太师",
	"铁券丹书·太保",
	"铁券丹书·太尉",
	"国士无双·国公",
	"金章紫绶·郡王",
	"御赐金封·辅佐王"
}
特殊官职称谓要求 = {
	["功标青史·太傅"] = {
		文功 = 34720,
		总贡献 = 50000,
		级别 = 10,
		武勋 = 7275,
		俸禄 = {}
	},
	["功标青史·太师"] = {
		文功 = 34720,
		总贡献 = 50000,
		级别 = 20,
		武勋 = 7275,
		俸禄 = {}
	},
	["铁券丹书·太保"] = {
		文功 = 7275,
		总贡献 = 50000,
		级别 = 10,
		武勋 = 34720,
		俸禄 = {}
	},
	["铁券丹书·太尉"] = {
		文功 = 7275,
		总贡献 = 50000,
		级别 = 20,
		武勋 = 34720,
		俸禄 = {}
	},
	["国士无双·国公"] = {
		文功 = 7275,
		总贡献 = 60000,
		满足其一 = 34720,
		级别 = 10,
		武勋 = 7275,
		俸禄 = {}
	},
	["金章紫绶·郡王"] = {
		文功 = 7275,
		总贡献 = 60000,
		满足其一 = 34720,
		级别 = 20,
		武勋 = 7275,
		俸禄 = {}
	},
	["御赐金封·辅佐王"] = {
		文功 = 7275,
		总贡献 = 60000,
		满足其一 = 34720,
		级别 = 40,
		武勋 = 7275,
		俸禄 = {}
	}
}

刷新官职级别 = function(角色数据)
	角色数据.文官级别 = 0
	角色数据.武官级别 = 0
	角色数据.特殊官职级别 = 0
	local 称谓列表 = 角色数据.称谓 or {}

	for i = 1, #称谓列表 do
		if 文官级别列表[称谓列表[i]] ~= nil then
			角色数据.文官级别 = 角色数据.文官级别 + 文官级别列表[称谓列表[i]]
		elseif 武官级别列表[称谓列表[i]] ~= nil then
			角色数据.武官级别 = 角色数据.武官级别 + 武官级别列表[称谓列表[i]]
		elseif 特殊官职级别列表[称谓列表[i]] ~= nil then
			角色数据.特殊官职级别 = 角色数据.特殊官职级别 + 特殊官职级别列表[称谓列表[i]]
		end
	end
end

特殊官职级别列表 = {
	["铁券丹书·太保"] = 10,
	["金章紫绶·郡王"] = 20,
	["御赐金封·辅佐王"] = 40,
	["国士无双·国公"] = 10,
	["功标青史·太傅"] = 10,
	["功标青史·太师"] = 20,
	["铁券丹书·太尉"] = 20
}
官职俸禄 = {
	{
		银两 = 500000
	},
	{
		银两 = 600000
	},
	{
		银两 = 800000
	},
	{
		银两 = 1000000
	},
	{
		魔兽要诀 = 2,
		银两 = 1000000
	},
	{
		魔兽要诀 = 3,
		银两 = 1000000
	},
	{
		魔兽要诀 = 4,
		银两 = 1500000
	},
	{
		魔兽要诀 = 5,
		银两 = 1500000
	},
	{
		魔兽要诀 = 5,
		银两 = 1500000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 5,
		银两 = 1600000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 5,
		银两 = 1800000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 5,
		银两 = 2000000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 6,
		银两 = 2200000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 7,
		银两 = 2200000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 8,
		银两 = 2400000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 10,
		银两 = 2400000,
		神兜兜 = 1
	},
	{
		魔兽要诀 = 12,
		银两 = 2600000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 14,
		银两 = 2600000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 16,
		银两 = 2800000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 18,
		银两 = 2800000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 18,
		银两 = 3000000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 20,
		银两 = 3000000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 20,
		银两 = 3000000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 20,
		银两 = 3000000,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 20,
		银两 = 3500000,
		特赦令牌 = 1,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 25,
		银两 = 3500000,
		特赦令牌 = 1,
		神兜兜 = 2
	},
	{
		魔兽要诀 = 25,
		银两 = 4000000,
		特赦令牌 = 1,
		神兜兜 = 3
	},
	{
		魔兽要诀 = 30,
		银两 = 4000000,
		特赦令牌 = 1,
		神兜兜 = 3
	},
	{
		魔兽要诀 = 35,
		银两 = 4500000,
		特赦令牌 = 1,
		神兜兜 = 3
	},
	{
		魔兽要诀 = 40,
		银两 = 5000000,
		特赦令牌 = 2,
		神兜兜 = 3
	}
}
俸禄领取列表 = {}

给予官职俸禄 = function(id)
	if 俸禄领取列表[id] == nil then
		添加最后对话(id, "领取失败、少侠没有俸禄可领。")
	end

	for k, v in pairs(俸禄领取列表[id]) do
		if k == "银两" then
			玩家数据[id].角色:添加银子(v, "官职俸禄兑换", 1)
		elseif string.find(k, "魔兽要诀") then
			for i = 1, v do
				快捷给道具(id, k, 1)
			end
		else
			快捷给道具(id, k, v)
		end
	end
end

取官职俸禄文本 = function(id, 角色数据)
	local 文 = 角色数据.文官级别 or 0
	local 武 = 角色数据.武官级别 or 0
	local 称谓列表 = 列表模式转换(角色数据.称谓 or {})
	local wb = ""
	俸禄领取列表[id] = {}

	if 文 > 0 and 文官称谓[文] ~= nil and 称谓列表[文官称谓[文][1]] ~= nil then
		wb = wb .. "\n#P【" .. 文官称谓[文][1] .. "】#Y每日俸禄如下:"
		local aa = ""

		for k, v in pairs(官职俸禄[文]) do
			俸禄领取列表[id][k] = (俸禄领取列表[id][k] or 0) + v
			aa = aa .. k .. "*" .. 数字转简(v) .. "、"
		end

		wb = wb .. "\n#Z" .. string.sub(aa, 1, #aa - 2)
	end

	if 武 > 0 and 武官称谓[武] ~= nil and 称谓列表[武官称谓[武][1]] ~= nil then
		wb = wb .. "\n#P【" .. 武官称谓[武][1] .. "】#Y每日俸禄如下:"
		local aa = ""

		for k, v in pairs(官职俸禄[武]) do
			俸禄领取列表[id][k] = (俸禄领取列表[id][k] or 0) + v
			aa = aa .. k .. "*" .. 数字转简(v) .. "、"
		end

		wb = wb .. "\n#Z" .. string.sub(aa, 1, #aa - 2)
	end

	return wb
end

文官级别列表 = {
	["正四品·尚书左丞"] = 24,
	["正九品·登仕郎"] = 3,
	["从七品·左录事"] = 10,
	["从八品·右拾遗"] = 5,
	["正六品·通文博士"] = 16,
	["从六品·侍御史"] = 13,
	["从九品·将仕郎"] = 1,
	["正九品·儒林郎"] = 4,
	["从八品·左拾遗"] = 6,
	["正八品·右补阙"] = 7,
	["正七品·右功曹"] = 11,
	["从三品·光禄大夫"] = 25,
	["从五品·朝请大夫"] = 18,
	["从四品·太中大夫"] = 22,
	["正四品·尚书右丞"] = 23,
	["从七品·右录事"] = 9,
	["正七品·左功曹"] = 12,
	["正六品·广文博士"] = 15,
	["从六品·太学博士"] = 14,
	["从四品·御史大夫"] = 21,
	["正二品·御赐特进"] = 28,
	["从五品·朝散大夫"] = 17,
	["正五品·奉御少监"] = 19,
	["从二品·尚书仆射"] = 27,
	["正三品·尚书"] = 26,
	["从九品·文林郎"] = 2,
	["从一品·尚书令"] = 29,
	["正一品·开府仪同三司"] = 30,
	["正五品·御史中丞"] = 20,
	["正八品·左补阙"] = 8
}
武官级别列表 = {
	["从六品·振威副尉"] = 13,
	["从八品·御侮副尉"] = 5,
	["从六品·振威校尉"] = 14,
	["正六品·昭武校尉"] = 16,
	["正七品·致果校尉"] = 12,
	["从五品·游击将军"] = 17,
	["从三品·云麾将军"] = 25,
	["从八品·御侮校尉"] = 6,
	["从五品·游骑将军"] = 18,
	["从九品·陪戎校尉"] = 2,
	["正五品·宁远将军"] = 19,
	["从四品·明威将军"] = 21,
	["正九品·仁勇校尉"] = 4,
	["从四品·宣威将军"] = 22,
	["从七品·翊麾校尉"] = 10,
	["正三品·冠军将军"] = 26,
	["正八品·宣节校尉"] = 8,
	["从二品·镇军将军"] = 27,
	["正二品·辅国将军"] = 28,
	["正四品·忠武将军"] = 24,
	["正九品·仁勇副尉"] = 3,
	["从一品·镇国将军"] = 29,
	["正七品·致果副尉"] = 11,
	["正八品·宣节副尉"] = 7,
	["正一品·天策上将"] = 30,
	["从七品·翊麾副尉"] = 9,
	["正六品·昭武副尉"] = 15,
	["正五品·定远将军"] = 20,
	["正四品·壮武将军"] = 23,
	["从九品·陪戎副尉"] = 1
}
