-- @作者: baidwwy
-- @邮箱:  小巷子资源网:vvxxz.com
-- @创建时间:   2022-10-18 23:13:44
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-12-30 07:09:50
-- @作者: baidwwy
-- @邮箱:  小巷子资源网:vvxxz.com
-- @创建时间:   2022-10-18 21:27:02
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-10-18 23:13:23
local battle_100306 = class()


function battle_100306:初始化(战斗id)
	self.战斗id=战斗id
end

function battle_100306:战斗准备后()
	self.悲歌=2
	self.欢喜=2
end

function battle_100306:单位死亡(编号)
	if self.参战单位[编号].名称=="悲歌" and self.参战单位[编号].队伍==0 then
		self.悲歌=self.悲歌-1
	end
	if self.参战单位[编号].名称=="欢喜" and self.参战单位[编号].队伍==0 then
		self.欢喜=self.欢喜-1
	end
end

function battle_100306:命令回合前(回合数)

end

function battle_100306:NPC智能施法(编号,战斗单位,回合数)
  local 返回数据 = {类型="",目标=0,参数="",下达=false}
  --如果写召唤的话，把技能改成无敌牛虱这类的,在这里施法
  if 战斗单位.名称=="沈唐真身" then
	if self.悲歌 > self.欢喜 then
		self:添加即时发言(编号,"此生悲歌多而欢喜寡")
		返回数据.类型="法术"
		返回数据.目标=self:取单个敌方目标(编号)
		返回数据.参数="翻江搅海"
	    返回数据.下达=true
	elseif self.悲歌 < self.欢喜 then
		self:添加即时发言(编号,"此生欢喜多而悲歌寡")
		返回数据.类型="法术"
		返回数据.目标=self:取单个敌方目标(编号)
		返回数据.参数="断岳势"
	    返回数据.下达=true
	elseif self.悲歌 == self.欢喜 then
		if self.悲歌==0 then
			self:添加即时发言(编号,"此生无悲无欢")
			返回数据.类型="法术"
			返回数据.目标=self:取单个敌方目标(编号)
			返回数据.参数="失心符"
		    返回数据.下达=true
		elseif self.悲歌 > 0 then
			self:添加即时发言(编号,"此生悲歌与欢喜，我也不知哪个更多一些")
			返回数据.类型="法术"
			返回数据.目标=self:取单个敌方目标(编号)
			返回数据.参数="天崩地裂"
		    返回数据.下达=true
		end
	end
  end
  return 返回数据
end

function battle_100306:战斗胜利(胜利id,失败id)
	local 队伍id=玩家数据[self.进入战斗玩家id].队伍
	for i=1,#队伍数据[队伍id].成员数据 do
		if 队伍处理类:取是否助战(玩家数据[self.进入战斗玩家id].队伍,i) == 0 then
			local 临时id=队伍数据[队伍id].成员数据[i]
			local 等级=玩家数据[临时id].角色.数据.等级
            local 经验=等级*800*1.5+等级*等级*15
            local 银子=等级*250*1.5+等级*等级*6
            玩家数据[临时id].角色:添加经验(经验,"副本沈唐二")
            玩家数据[临时id].角色:添加银子(银子,"副本沈唐二",1)
			local 奖励参数=取随机数()
			if 奖励参数<=20 then
			local 名称="高级召唤兽内丹"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功击败沈唐真身，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=50 then
			local 名称="召唤兽内丹"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功击败沈唐真身，因此获得了其奖励的#G/%s*2#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=80 then
			local 名称="灵饰指南书"
			玩家数据[临时id].道具:给予道具(临时id,"灵饰指南书",{10,12})
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功击败沈唐真身，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=90 then
			local 名称="元灵晶石"
			玩家数据[临时id].道具:给予道具(临时id,"元灵晶石",{10,12})
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功击败沈唐真身，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			else
			local 名称="高级魔兽要诀"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功击败沈唐真身，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			end
            玩家数据[临时id].战斗=0
		end
	end
	副本id=玩家数据[self.进入战斗玩家id].角色:取任务(7001)
	副本处理类:播放剧情动画(self.进入战斗玩家id,7003)
	副本处理类.副本盒子[副本id]:设置副本进程(13)
end

function battle_100306:战斗失败(失败id,是否逃跑,胜利id)
	-- body
end

return battle_100306