-- @作者: baidwwy
-- @邮箱:  小巷子资源网:vvxxz.com
-- @创建时间:   2022-10-18 21:27:02
-- @最后修改来自: baidwwy
-- @Last Modified time: 2022-10-22 19:27:28
local battle_100301 = class()


function battle_100301:初始化(战斗id)
	self.战斗id=战斗id
end

function battle_100301:战斗准备后()

end

function battle_100301:单位死亡(编号)
	if self.参战单位[编号].名称=="清醒意识" and self.参战单位[编号].队伍==0 then
		if self.清醒死亡数量==nil then
			self.清醒死亡数量=0
		end
		self.清醒死亡数量=self.清醒死亡数量+1
	end
end

function battle_100301:命令回合前(回合数)
    for n=1,#self.参战单位 do
		--集火事件是临时存的变量，但是是挂在战斗处理类下的，注意这种临时变量不要与战斗处理类里的同名
		if self.参战单位[n].名称=="鸾儿姑娘" then
			if self.清醒死亡数量 and self.清醒死亡数量>0 then
				self.参战单位[n].伤害=self.参战单位[n].伤害+self.清醒死亡数量*100
				self.清醒死亡数量=0
				self:添加即时发言(n,"啊……感觉完全无法控制自己了！")
			end
		elseif self.参战单位[n].名称=="清醒意识" and 回合数==1 then
			self:添加即时发言(n,"别打我们，否则主人会很可怕！")
		end
    end
end

function battle_100301:NPC智能施法(编号,战斗单位,回合数)
  local 返回数据 = {类型="",目标=0,参数="",下达=false}
  --如果写召唤的话，把技能改成无敌牛虱这类的,在这里施法
  if 战斗单位.名称=="缠绵幽怨" then
	if 回合数==10 then
		返回数据.类型="特技"
		返回数据.目标=self:取单个友方目标(编号)
		返回数据.参数="晶清诀"
	    返回数据.下达=true
	end
  end
  return 返回数据
end

function battle_100301:战斗胜利(胜利id,失败id)
	local 队伍id=玩家数据[self.进入战斗玩家id].队伍
	for i=1,#队伍数据[队伍id].成员数据 do
		if 队伍处理类:取是否助战(玩家数据[self.进入战斗玩家id].队伍,i) == 0 then
			local 临时id=队伍数据[队伍id].成员数据[i]
			local 等级=玩家数据[临时id].角色.数据.等级
            local 经验=等级*800+等级*等级*15
            local 银子=等级*250+等级*等级*6
            玩家数据[临时id].角色:添加经验(经验,"副本鸾儿小姐")
            玩家数据[临时id].角色:添加银子(银子,"副本鸾儿小姐",1)
            local 奖励参数=取随机数()
			if 奖励参数<=20 then
			local 名称="高级召唤兽内丹"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(看戏-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功阻止了鸾儿小姐，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=50 then
			local 名称="召唤兽内丹"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(副本-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功阻止了鸾儿小姐，因此获得了其奖励的#G/%s*2#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=80 then
			local 名称="炼兽真经"
			玩家数据[临时id].道具:给予道具(临时id,名称,1)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(副本-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功阻止了鸾儿小姐，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			elseif 奖励参数<=90 then
			local 名称="高级魔兽要诀"
			玩家数据[临时id].道具:给予道具(临时id,名称)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(副本-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功阻止了鸾儿小姐，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
		    else
		    local 名称="坐骑内丹"
			玩家数据[临时id].道具:给予道具(临时id,名称,1)
			常规提示(临时id,"#Y/你获得了"..名称)
			广播消息({内容=format("#S(副本-一斛珠)#R/%s#Y在#R一斛珠#Y副本中成功阻止了鸾儿小姐，因此获得了其奖励的#G/%s#Y".."#"..取随机数(1,110),玩家数据[临时id].角色.数据.名称,名称),频道="hd"})
			end
		end
	end
	副本id=玩家数据[self.进入战斗玩家id].角色:取任务(7001)
	副本处理类.副本盒子[副本id]:设置副本进程(3)
	添加最后对话(胜利id,format("啊……我的脸……我的脸！"))
end

function battle_100301:战斗失败(失败id,是否逃跑,胜利id)
	-- body
end

return battle_100301