local 雁塔地宫 = class()

function 雁塔地宫:初始化()
	self.活动开关 = false
	self.间隔 = 30
	self.数据 = {}

	if f函数.文件是否存在("tysj/雁塔地宫.txt") == false then
		写出文件("tysj/雁塔地宫.txt", table.tostring({}))
	else
		self.数据 = table.loadstring(读入文件("tysj/雁塔地宫.txt"))
	end

	self:加载数据()
	self:更新怪物()
end

function 雁塔地宫:每日下调()
	for k, v in pairs(self.数据) do
		v.层数 = v.层数 - 10
		v.次数 = 0

		if v.层数 < 1 then
			v.层数 = 1
		elseif v.层数 > 40 then
			v.层数 = 40
		end
	end

	广播消息({
		频道 = "hd",
		内容 = format("#R(雁塔地宫)#Y新的一天开始了，各位少侠的地宫层数减少了#G10#Y层！")
	})
	写出文件("tysj/雁塔地宫.txt", table.tostring(self.数据))
end

function 雁塔地宫:每周归零()
	self.数据 = {}

	广播消息({
		频道 = "hd",
		内容 = format("#R(雁塔地宫)#Y新的一周开始了，雁塔地宫层数已经全部重置！")
	})
	写出文件("tysj/雁塔地宫.txt", table.tostring({}))
end

function 雁塔地宫:取地宫最低层数(id)
	local tab = {}
	local 队伍id = 玩家数据[id].队伍

	for n = 1, #队伍数据[队伍id].成员数据 do
		if 队伍处理类:取是否助战(队伍id, n) == 0 then
			if not self.数据[队伍数据[队伍id].成员数据[n]] then
				self.数据[队伍数据[队伍id].成员数据[n]] = {
					次数 = 0,
					层数 = 1
				}
			end

			tab[n] = {
				cs = self.数据[队伍数据[队伍id].成员数据[n]].层数 or 1,
				id = 队伍数据[队伍id].成员数据[n]
			}
		end
	end

	table.sort(tab, function (a, b)
		return a.cs < b.cs
	end)

	return tab[1].cs, tab[1].id
end

function 雁塔地宫:对话内容(map, 编号, 数字id)
	local wb = {}
	local xx = {}
	local mx = self.取怪物[map - 3000 + 1][1].模型

	if 编号 == 1 then
		wb[1] = "我乃第" .. map - 3000 + 1 .. "层的守护兽，少侠可有勇气挑战我？"
		local xx = {
			"我来会会你",
			"我准备一下"
		}

		return {
			mx,
			mx,
			wb[取随机数(1, #wb)],
			xx
		}
	elseif 编号 == 2 then
		wb[1] = "我是专门治疗和调训召唤兽的医生，10级以下免费治疗驯养，选择驯养或治疗之前请注意：我每次都是把你身上携带的所有召唤兽进行统一治疗和驯养"
		xx = {
			"我的召唤兽受伤了，请帮我救治一下吧",
			"我的召唤兽忠诚度降低了，请帮我驯养一下吧",
			"我要同时补满召唤兽的气血、魔法和忠诚",
			"我只是看看"
		}

		return {
			"男人_巫医",
			"超级巫医",
			wb[取随机数(1, #wb)],
			xx
		}
	end
end

function 雁塔地宫:对话处理(id, 名称, 事件, 地图编号)
	if 事件 == "送我进去（队伍最低层数）" then
		if not 调试模式 and (玩家数据[id].队伍 == 0 or 取队伍人数(id) < 3 or 取队伍最低等级(玩家数据[id].队伍, 50)) then
			添加最后对话(id, "地宫对于少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级≥50，人数≥3人）")

			return
		end

		for n = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
			local cyid = 队伍数据[玩家数据[id].队伍].成员数据[n]

			if 玩家数据[cyid].角色.数据.飞行中 then
				添加最后对话(id, "#Y/地宫中凶险万分，少侠还是走路比较安全。（禁止飞行）")

				return
			end
		end

		local 层数, aidi = self:取地宫最低层数(id)

		添加最后对话(id, "目前你们队伍中层数最低的玩家是#Y" .. 玩家数据[aidi].角色.数据.名称 .. "，层数：" .. 层数 .. "层#W。我的能力只能送你们去这个层数，是否考虑好了？", {
			"请送我们过去吧",
			"我再想想"
		})
	elseif 事件 == "请送我们过去吧" then
		if not 调试模式 and (玩家数据[id].队伍 == 0 or 取队伍人数(id) < 3 or 取队伍最低等级(玩家数据[id].队伍, 50)) then
			添加最后对话(id, "地宫对于少侠来说还是过于危险了，还是好好磨练一番再来吧。（进入地宫需要等级≥50，人数≥3人）")

			return
		end

		local 层数, aidi = self:取地宫最低层数(id)

		地图处理类:跳转地图(id, self.ditu.层数[层数], self.ditu.传送坐标[层数].x, self.ditu.传送坐标[层数].y)
	elseif 事件 == "了解地宫规则" then
		添加最后对话(id, "雁塔地宫为不限时挑战模式，每日可进行30次挑战，每天晚12点会自动下降10层挑战层数，每周日晚12点将自动归零。每次挑战按队伍中最低层数来进行。")
	elseif 事件 == "我来会会你" then
		if 玩家数据[id].队伍 == 0 or 取队伍人数(id) < 3 or 取队伍最低等级(玩家数据[id].队伍, 50) then
			添加最后对话(id, "地宫对于少侠来说还是过于危险了，还是好好磨练一番再来吧。（需要等级≥50，人数≥3人）")

			return
		end

		local 怪物层数 = 地图编号 - 3000 + 1
		local 层数, aidi = self:取地宫最低层数(id)

		if 层数 >= 70 then
			return 添加最后对话(id, "目前地宫只更新至70层。")
		end

		for n = 1, #队伍数据[玩家数据[id].队伍].成员数据 do
			if 队伍处理类:取是否助战(玩家数据[id].队伍, n) == 0 then
				local cyid = 队伍数据[玩家数据[id].队伍].成员数据[n]

				if 怪物层数 ~= 层数 then
					添加最后对话(id, "你们目前应该挑战的层数为：" .. 层数 .. "层")

					return
				end

				if self.数据[cyid].次数 >= 30 then
					添加最后对话(id, "队伍中#Y" .. 玩家数据[cyid].角色.数据.名称 .. "#W今日挑战次数已达#P30#W次，无法再继续挑战！")

					return
				end
			end
		end

		战斗准备类:创建战斗(id, 140000, 1)
	end
end

function 雁塔地宫:取奖励等级(层数)
	if 层数 <= 10 then
		return "地宫1至10"
	elseif 层数 <= 20 then
		return "地宫11至20"
	elseif 层数 <= 30 then
		return "地宫21至30"
	elseif 层数 <= 40 then
		return "地宫31至40"
	elseif 层数 <= 50 then
		return "地宫41至50"
	elseif 层数 <= 60 then
		return "地宫51至60"
	elseif 层数 <= 70 then
		return "地宫61至70"
	elseif 层数 <= 80 then
		return "地宫71至80"
	elseif 层数 <= 90 then
		return "地宫81至90"
	else
		return "地宫91至100"
	end
end

function 雁塔地宫:战斗胜利处理(id组, 战斗类型)
	local 层数 = self:取地宫最低层数(id组[1]) + 0
	self.数据[id组[1]].层数 = 层数 + 1
	local cs = self.数据[id组[1]].层数

	for n = 1, #id组 do
		local id = id组[n]

		if 队伍处理类:取是否助战(玩家数据[id].队伍, n) == 0 then
			玩家数据[id].战斗 = 0

			if self.数据[id] then
				self.数据[id].层数 = cs
			else
				self.数据[id] = {
					重置 = false,
					次数 = 0,
					层数 = cs
				}
			end

			self.数据[id].次数 = self.数据[id].次数 + 1

			if 层数 <= 10 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫1", nil, 层数)
			elseif 层数 <= 20 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫2", nil, 层数)
			elseif 层数 <= 30 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫3", nil, 层数)
			elseif 层数 <= 40 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫4", nil, 层数)
			elseif 层数 <= 50 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫5", nil, 层数)
			elseif 层数 <= 60 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫6", nil, 层数)
			elseif 层数 <= 70 then
				通用给奖励(id, {
					经验 = {
						1500 + 层数 * 100,
						2000 + 层数 * 100
					},
					银子 = {
						1000 + 层数 * 100,
						1300 + 层数 * 100
					}
				}, "雁塔地宫7", nil, 层数)
			end
		end
	end

	if self.ditu.层数[cs] then
		地图处理类:跳转地图(id组[1], self.ditu.层数[cs], self.ditu.传送坐标[cs].x, self.ditu.传送坐标[cs].y)
	end
end

local 前缀属性 = {
	强壮的 = {
		气血 = 50,
		增伤百分比 = 20
	},
	汗血的 = {
		法伤 = 50,
		伤害 = 50,
		速度 = 50,
		气血 = 50
	},
	全能的 = {
		法伤 = 20,
		伤害 = 20,
		速度 = 20,
		气血 = 20
	},
	坚定的 = {
		抵抗封印等级 = 50
	},
	激进的 = {
		速度 = 50
	},
	肥胖的 = {
		速度 = -40,
		气血 = 100
	},
	笨重的 = {
		速度 = -40,
		气血 = 40
	},
	敏捷的 = {
		速度 = 100,
		气血 = 40
	},
	无畏的 = {
		抵抗封印等级 = 20
	},
	裸衣的 = {
		增伤百分比 = 50,
		受伤百分比 = 50
	},
	坚韧的 = {
		受伤百分比 = 50
	},
	好战的 = {
		递增伤害 = 5
	},
	聪慧的 = {
		受伤百分比 = 150
	},
	隐忍的 = {
		伤害 = 100
	},
	偏执的 = {
		伤害 = 100
	},
	疯癫的 = {
		伤害 = 400
	},
	入魔的 = {
		增伤百分比 = 50,
		受伤百分比 = 20
	},
	抗物的 = {
		物伤免疫 = 0.1
	},
	抗法的 = {
		法伤免疫 = 0.1
	}
}
local 后缀属性 = {
	莽夫 = {
		法伤 = 5,
		伤害 = 5
	},
	精英 = {
		法伤 = 20,
		伤害 = 20,
		速度 = 20,
		气血 = 20
	},
	刺客 = {
		气血 = -50,
		伤害 = 400
	},
	富豪 = {
		法伤 = 100,
		伤害 = 100,
		速度 = 100,
		气血 = 100
	}
}
local fenlei = {
	物理 = {
		"大唐官府",
		"狮驼岭",
		"凌波城",
		"阴曹地府",
		"天宫",
		"五庄观"
	},
	法系 = {
		"化生寺",
		"方寸山",
		"神木林",
		"魔王寨",
		"天宫",
		"龙宫"
	},
	固伤 = {
		"女儿村",
		"阴曹地府",
		"无底洞",
		"普陀山"
	},
	封系 = {
		"方寸山",
		"女儿村",
		"盘丝洞",
		"无底洞",
		"五庄观"
	},
	辅助 = {
		"化生寺",
		"无底洞",
		"普陀山"
	}
}

function 雁塔地宫:更新怪物()
	for a = 1, #self.取怪物 do
		for b = 1, #self.取怪物[a] do
			local 前缀 = self.取怪物[a][b].前缀
			local 后缀 = self.取怪物[a][b].后缀
			local 模型 = self.取怪物[a][b].模型
			local 名称 = 模型
			self.取怪物[a][b].额外面板百分比 = {
				伤害 = 1,
				法伤 = 1,
				固定伤害 = 1,
				气血 = 1,
				受伤百分比 = 1,
				抵抗封印等级 = 1,
				增伤百分比 = 1,
				封印命中等级 = 1,
				治疗能力 = 1,
				速度 = 1,
				递增伤害 = 1
			}

			if 前缀 then
				if 前缀 == "隐忍的" or 前缀 == "偏执的" then
					self.取怪物[a][b].不可封印 = true
				end

				名称 = 前缀 .. 名称

				if 前缀属性[前缀] then
					for k, v in pairs(前缀属性[前缀]) do
						self.取怪物[a][b].额外面板百分比[k] = (self.取怪物[a][b].额外面板百分比[k] or 0) + v / 100
					end
				end
			end

			if 后缀 then
				名称 = 名称 .. 后缀

				if 后缀属性[后缀] then
					for k, v in pairs(后缀属性[后缀]) do
						self.取怪物[a][b].额外面板百分比[k] = (self.取怪物[a][b].额外面板百分比[k] or 0) + v / 100
					end
				end
			end

			self.取怪物[a][b].名称 = 名称
			self.取怪物[a][b].QT = {}

			if self.染色[模型] and self.染色[模型][前缀] then
				self.取怪物[a][b].QT = table.copy(self.染色[模型][前缀])

				if self.取怪物[a][b].QT.AI then
					if 前缀 ~= "疯癫的" and 后缀 ~= "刺客" then
						if self.取怪物[a][b].QT.AI == "物理" and 取随机数() <= 20 then
						elseif self.取怪物[a][b].QT.AI == "法系" and 取随机数() <= 25 then
							local sss = {
								"地狱烈火",
								"奔雷咒",
								"水漫金山",
								"泰山压顶"
							}
							self.取怪物[a][b].QT.主动技能 = {
								sss[取随机数(1, 4)]
							}
						else
							self.取怪物[a][b].QT.门派 = fenlei[self.取怪物[a][b].QT.AI][取随机数(1, #fenlei[self.取怪物[a][b].QT.AI])]
						end
					elseif 后缀 == "富豪" then
						self.取怪物[a][b].不可封印 = true
					elseif 后缀 == "刺客" then
						self.取怪物[a][b].QT.被动技能 = 列表2加入到列表1(self.取怪物[a][b].QT.被动技能 or {}, {
							"神出鬼没",
							"理直气壮",
							"超级连击"
						})
					end
				end
			end
		end
	end
end

function 雁塔地宫:加载数据()
	self.取怪物 = {
		{
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			}
		},
		{
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			}
		},
		{
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "天兵"
			},
			{
				模型 = "天兵"
			}
		},
		{
			{
				模型 = "锦毛貂精"
			},
			{
				模型 = "天兵"
			},
			{
				模型 = "天兵"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "白熊"
			},
			{
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				模型 = "天兵"
			},
			{
				模型 = "天兵"
			}
		},
		{
			{
				模型 = "雨师"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				模型 = "天兵"
			},
			{
				模型 = "天兵"
			}
		},
		{
			{
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				模型 = "雨师"
			}
		},
		{
			{
				模型 = "锦毛貂精"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗物的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "抗法的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强壮的",
				模型 = "雨师"
			},
			{
				前缀 = "强壮的",
				模型 = "雨师"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "进阶狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			}
		},
		{
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "好赌的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "入魔的",
				模型 = "蚌精"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "敏捷的",
				模型 = "蚌精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "强壮的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "自愈的",
				模型 = "雨师"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强壮的",
				模型 = "狂豹人形"
			},
			{
				后缀 = "富豪",
				前缀 = "裸衣的",
				模型 = "进阶锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			}
		},
		{
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				后缀 = "刺客",
				前缀 = "强壮的",
				模型 = "进阶天兵"
			},
			{
				后缀 = "刺客",
				前缀 = "强壮的",
				模型 = "进阶天兵"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			}
		},
		{
			{
				前缀 = "肥胖的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "肥胖的",
				模型 = "白熊"
			},
			{
				前缀 = "肥胖的",
				模型 = "白熊"
			},
			{
				前缀 = "肥胖的",
				模型 = "天兵"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "肥胖的",
				模型 = "狂豹人形"
			}
		},
		{
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "嗜血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			}
		},
		{
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "裸衣的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			}
		},
		{
			{
				前缀 = "无畏的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "无畏的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "虔诚的",
				模型 = "画魂"
			},
			{
				前缀 = "坚韧的",
				模型 = "画魂"
			},
			{
				前缀 = "坚韧的",
				模型 = "画魂"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "汗血的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "汗血的",
				模型 = "天兵"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "画魂"
			},
			{
				前缀 = "虔诚的",
				模型 = "画魂"
			},
			{
				前缀 = "肥胖的",
				模型 = "画魂"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			}
		},
		{
			{
				前缀 = "虔诚的",
				模型 = "画魂"
			},
			{
				后缀 = "死士",
				前缀 = "肥胖的",
				模型 = "进阶白熊"
			},
			{
				后缀 = "死士",
				前缀 = "肥胖的",
				模型 = "进阶白熊"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "聪慧的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "抗法的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "无畏的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "肥胖的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "肥胖的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "聪慧的",
				模型 = "混沌兽"
			},
			{
				前缀 = "抗物的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "裸衣的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "坚韧的",
				模型 = "混沌兽"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "虔诚的",
				模型 = "混沌兽"
			},
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "抗法的",
				模型 = "天兵"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "坚韧的",
				模型 = "混沌兽"
			},
			{
				前缀 = "强壮的",
				模型 = "白熊"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "强壮的",
				模型 = "雨师"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "画魂"
			},
			{
				前缀 = "坚韧的",
				模型 = "画魂"
			}
		},
		{
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "抗物的",
				模型 = "白熊"
			},
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "抗物的",
				模型 = "天兵"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "肥胖的",
				模型 = "天兵"
			},
			{
				前缀 = "坚韧的",
				模型 = "天兵"
			},
			{
				前缀 = "肥胖的",
				模型 = "天兵"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "肥胖的",
				模型 = "天兵"
			},
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			},
			{
				前缀 = "坚韧的",
				模型 = "白熊"
			}
		},
		{
			{
				前缀 = "狡猾的",
				模型 = "画魂"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "抗法的",
				模型 = "雨师"
			},
			{
				前缀 = "狡猾的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗法的",
				模型 = "蚌精"
			},
			{
				前缀 = "肥胖的",
				模型 = "画魂"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "无畏的",
				模型 = "混沌兽"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "疯癫的",
				模型 = "白熊"
			},
			{
				前缀 = "疯癫的",
				模型 = "天兵"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "聪慧的",
				模型 = "混沌兽"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "抗法的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "肥胖的",
				模型 = "画魂"
			},
			{
				前缀 = "狡猾的",
				模型 = "画魂"
			},
			{
				前缀 = "强壮的",
				模型 = "蚌精"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			}
		},
		{
			{
				后缀 = "富豪",
				前缀 = "坚韧的",
				模型 = "进阶锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "敏捷的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "狡猾的",
				模型 = "蚌精"
			},
			{
				前缀 = "狡猾的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "入魔的",
				模型 = "混沌兽"
			},
			{
				前缀 = "强壮的",
				模型 = "夜罗刹"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "肥胖的",
				模型 = "天兵"
			},
			{
				前缀 = "强壮的",
				模型 = "天兵"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "肥胖的",
				模型 = "混沌兽"
			}
		},
		{
			{
				前缀 = "狡猾的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "裸衣的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "无畏的",
				模型 = "混沌兽"
			},
			{
				前缀 = "裸衣的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "狡猾的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "狡猾的",
				模型 = "画魂"
			}
		},
		{
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗法的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好战的",
				模型 = "混沌兽"
			},
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			}
		},
		{
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "狡猾的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "裸衣的",
				模型 = "白熊"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			}
		},
		{
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好战的",
				模型 = "混沌兽"
			},
			{
				前缀 = "抗物的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "抗物的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			}
		},
		{
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "裸衣的",
				模型 = "天兵"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "裸衣的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "虔诚的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "坚韧的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "狡猾的",
				模型 = "葫芦宝贝"
			}
		},
		{
			{
				前缀 = "好赌的",
				模型 = "混沌兽"
			},
			{
				前缀 = "好赌的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "好赌的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "好赌的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "好战的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "敏捷的",
				模型 = "葫芦宝贝"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "抗法的",
				模型 = "混沌兽"
			},
			{
				前缀 = "无畏的",
				模型 = "混沌兽"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "肥胖的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "无畏的",
				模型 = "狂豹人形"
			}
		},
		{
			{
				前缀 = "强壮的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "肥胖的",
				模型 = "画魂"
			},
			{
				前缀 = "狡猾的",
				模型 = "画魂"
			},
			{
				前缀 = "强壮的",
				模型 = "蚌精"
			},
			{
				前缀 = "虔诚的",
				模型 = "蚌精"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			}
		},
		{
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "抗法的",
				模型 = "巴蛇"
			},
			{
				前缀 = "裸衣的",
				模型 = "巴蛇"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗物的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "虔诚的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "无畏的",
				模型 = "雨师"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "聪慧的",
				模型 = "混沌兽"
			}
		},
		{
			{
				前缀 = "肥胖的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "强制的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "强制的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "坚韧的",
				模型 = "雨师"
			},
			{
				前缀 = "笨重的",
				模型 = "雨师"
			},
			{
				前缀 = "抗物的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "抗法的",
				模型 = "巴蛇"
			}
		},
		{
			{
				前缀 = "裸衣的",
				模型 = "巴蛇"
			},
			{
				前缀 = "肥胖的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "抗法的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "无畏的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好赌的",
				模型 = "混沌兽"
			},
			{
				前缀 = "肥胖的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "抗物的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "强制的",
				模型 = "狂豹人形"
			}
		},
		{
			{
				前缀 = "汗血的",
				模型 = "白熊"
			},
			{
				前缀 = "嗜血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "嗜血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "抗法的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好赌的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "自愈的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "自愈的",
				模型 = "雨师"
			},
			{
				前缀 = "自愈的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "嗜血的",
				模型 = "巴蛇"
			}
		},
		{
			{
				前缀 = "敏捷的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "狡猾的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "坚韧的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "裸衣的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚定的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				后缀 = "百姓",
				前缀 = "好赌的",
				模型 = "混沌兽"
			},
			{
				前缀 = "暴怒的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "暴怒的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "狡猾的",
				模型 = "雨师"
			},
			{
				前缀 = "裸衣的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "好战的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "狡猾的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "抗物的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "抗法的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "强壮的",
				模型 = "蚌精"
			},
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "敏捷的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "汗血的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "虔诚的",
				模型 = "混沌兽"
			},
			{
				前缀 = "裸衣的",
				模型 = "巴蛇"
			},
			{
				前缀 = "狡猾的",
				模型 = "曼珠沙华"
			}
		},
		{
			{
				前缀 = "敏捷的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "狡猾的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "坚韧的",
				模型 = "曼珠沙华"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "裸衣的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "敏捷的",
				模型 = "雨师"
			},
			{
				前缀 = "坚定的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "汗血的",
				模型 = "巨力神猿"
			}
		},
		{
			{
				前缀 = "隐忍的",
				模型 = "噬天虎"
			},
			{
				前缀 = "无畏的",
				模型 = "噬天虎"
			},
			{
				前缀 = "嗜血的",
				模型 = "噬天虎"
			},
			{
				前缀 = "好赌的",
				模型 = "混沌兽"
			},
			{
				前缀 = "好赌的",
				模型 = "混沌兽"
			},
			{
				前缀 = "嗜血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "好战的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "嗜血的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "抗物的",
				模型 = "雨师"
			},
			{
				前缀 = "抗法的",
				模型 = "锦毛貂精"
			}
		},
		{
			{
				前缀 = "自愈的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "虔诚的",
				模型 = "雨师"
			},
			{
				前缀 = "坚韧的",
				模型 = "葫芦宝贝"
			},
			{
				前缀 = "聪慧的",
				模型 = "蚌精"
			},
			{
				前缀 = "抗物的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "好赌的",
				模型 = "雷鸟人"
			},
			{
				前缀 = "裸衣的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "无畏的",
				模型 = "幽萤娃娃"
			},
			{
				前缀 = "虔诚的",
				模型 = "混沌兽"
			},
			{
				前缀 = "嗜血的",
				模型 = "夜罗刹"
			}
		},
		{
			{
				前缀 = "好战的",
				模型 = "狂豹人形"
			},
			{
				前缀 = "抗物的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "抗法的",
				模型 = "巨力神猿"
			},
			{
				前缀 = "抗物的",
				模型 = "混沌兽"
			},
			{
				前缀 = "抗法的",
				模型 = "混沌兽"
			},
			{
				前缀 = "自愈的",
				模型 = "锦毛貂精"
			},
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "好战的",
				模型 = "夜罗刹"
			},
			{
				前缀 = "好战的",
				模型 = "巴蛇"
			},
			{
				前缀 = "裸衣的",
				模型 = "噬天虎"
			}
		}
	}

	for i = 71, 151 do
		self.取怪物[i] = self.取怪物[70]
	end

	self.染色 = {
		白熊 = {
			肥胖的 = {
				AI = "物理",
				染色方案 = 61,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			疯癫的 = {
				AI = "物理",
				染色方案 = 97,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			汗血的 = {
				AI = "物理",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "物理",
				变异 = true,
				被动技能 = {}
			},
			强壮的 = {
				AI = "物理",
				染色方案 = 90,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 90,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			}
		},
		天兵 = {
			肥胖的 = {
				染色方案 = 107,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			疯癫的 = {
				AI = "物理",
				染色方案 = 89,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			汗血的 = {
				染色方案 = 55,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			坚韧的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "物理",
				进阶 = true,
				饰品 = true,
				被动技能 = {}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				进阶 = true,
				饰品 = true,
				被动技能 = {}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			}
		},
		锦毛貂精 = {
			敏捷的 = {
				AI = "辅助",
				染色方案 = 89,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			肥胖的 = {
				AI = "辅助",
				染色方案 = 20103,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 3
				}
			},
			虔诚的 = {
				AI = "辅助",
				染色方案 = 70,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "辅助",
				染色方案 = 81,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "辅助",
				染色方案 = 70,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "辅助",
				染色方案 = 81,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		雨师 = {
			虔诚的 = {
				AI = "封系",
				染色方案 = 98,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "封系",
				染色方案 = 100,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "封系",
				染色方案 = 58,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "封系",
				染色方案 = 53,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "封系",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			笨重的 = {
				AI = "封系",
				染色方案 = 107,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			狡猾的 = {
				AI = "封系",
				染色方案 = 69,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "封系",
				染色方案 = 107,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "封系",
				染色方案 = 69,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		蚌精 = {
			坚韧的 = {
				AI = "法系",
				染色方案 = 85,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "法系",
				染色方案 = 69,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			入魔的 = {
				AI = "法系",
				染色方案 = 63,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "法系",
				染色方案 = 75,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			偏执的 = {
				AI = "法系",
				染色方案 = 2062,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			聪慧的 = {
				AI = "法系",
				染色方案 = 74,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "法系",
				染色方案 = 107,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 74,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 107,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			}
		},
		进阶蚌精 = {
			全能的 = {
				AI = "法系",
				染色方案 = 107,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			好赌的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 107,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			}
		},
		狂豹人形 = {
			肥胖的 = {
				AI = "物理",
				染色方案 = 2057,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 2057,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			汗血的 = {
				染色方案 = 107,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			强壮的 = {
				AI = "物理",
				被动技能 = {}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 2071,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				染色方案 = 2078,
				AI = "物理",
				饰品 = true,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			无畏的 = {
				染色方案 = 55,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			隐忍的 = {
				AI = "物理",
				染色方案 = 111,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			抗物的 = {
				染色方案 = 55,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 111,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			}
		},
		进阶狂豹人形 = {
			肥胖的 = {
				AI = "物理",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 55,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			好战的 = {
				AI = "物理",
				染色方案 = 114,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				AI = "物理",
				染色方案 = 85,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "物理",
				染色方案 = 112,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 98,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 112,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 98,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			}
		},
		雷鸟人 = {
			坚韧的 = {
				AI = "法系",
				染色方案 = 89,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			偏执的 = {
				AI = "法系",
				染色方案 = 97,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好赌的 = {
				AI = "法系",
				染色方案 = 2051,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "法系",
				染色方案 = 77,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			入魔的 = {
				AI = "法系",
				染色方案 = 85,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			聪慧的 = {
				AI = "法系",
				染色方案 = 67,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			肥胖的 = {
				AI = "法系",
				染色方案 = 2065,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 67,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 2065,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶雷鸟人 = {
			好赌的 = {
				AI = "法系",
				染色方案 = 2051,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			入魔的 = {
				AI = "法系",
				染色方案 = 85,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 2051,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 85,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		巨力神猿 = {
			肥胖的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			汗血的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "物理",
				染色方案 = 97,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				AI = "物理",
				饰品 = true,
				被动技能 = {
					"高级吸血"
				}
			},
			好战的 = {
				AI = "物理",
				饰品 = true,
				被动技能 = {}
			},
			抗物的 = {
				AI = "物理",
				饰品 = true,
				被动技能 = {
					"高级吸血"
				}
			},
			抗法的 = {
				AI = "物理",
				饰品 = true,
				被动技能 = {}
			}
		},
		幽萤娃娃 = {
			无畏的 = {
				AI = "法系",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			笨重的 = {
				AI = "法系",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				AI = "法系",
				染色方案 = 82,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			偏执的 = {
				AI = "法系",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好赌的 = {
				AI = "法系",
				染色方案 = 2065,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			聪慧的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 2065,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			}
		},
		进阶幽萤娃娃 = {
			坚韧的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			}
		},
		画魂 = {
			肥胖的 = {
				AI = "固伤",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "固伤",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "固伤",
				染色方案 = 100,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "固伤",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "固伤",
				染色方案 = 55,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			狡猾的 = {
				AI = "固伤",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "固伤",
				染色方案 = 55,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗法的 = {
				AI = "固伤",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			}
		},
		进阶画魂 = {
			肥胖的 = {
				AI = "固伤",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "固伤",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "固伤",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "固伤",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			}
		},
		混沌兽 = {
			肥胖的 = {
				染色方案 = 89,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "法系",
				染色方案 = 92,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "法系",
				染色方案 = 52,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "法系",
				染色方案 = 2079,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			好战的 = {
				AI = "法系",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			偏执的 = {
				AI = "法系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			隐忍的 = {
				AI = "法系",
				染色方案 = 97,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			入魔的 = {
				染色方案 = 78,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好赌的 = {
				染色方案 = 76,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			聪慧的 = {
				染色方案 = 96,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				染色方案 = 76,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				染色方案 = 96,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶混沌兽 = {
			肥胖的 = {
				染色方案 = 89,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				染色方案 = 92,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				染色方案 = 52,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好赌的 = {
				染色方案 = 64,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级法术波动",
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			聪慧的 = {
				染色方案 = 97,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级魔之心"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			入魔的 = {
				染色方案 = 78,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			暴怒的 = {
				染色方案 = 76,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				染色方案 = 96,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				染色方案 = 76,
				AI = "法系",
				饰品 = true,
				被动技能 = {
					"高级法术暴击"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				染色方案 = 96,
				AI = "法系",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		夜罗刹 = {
			强壮的 = {
				AI = "物理",
				染色方案 = 106,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				染色方案 = 2078,
				AI = "物理",
				饰品 = true,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			笨重的 = {
				AI = "物理",
				染色方案 = 20113,
				被动技能 = {},
				染色组 = {
					[1.0] = 4,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 67,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			隐忍的 = {
				AI = "物理",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				染色方案 = 2051,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				染色方案 = 2051,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶夜罗刹 = {
			虔诚的 = {
				AI = "物理",
				染色方案 = 2070,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "物理",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		葫芦宝贝 = {
			虔诚的 = {
				AI = "封系",
				染色方案 = 64,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "封系",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			轻灵的 = {
				AI = "封系",
				染色方案 = 82,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "封系",
				染色方案 = 80,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "封系",
				染色方案 = 85,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "封系",
				染色方案 = 74,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				染色方案 = 98,
				AI = "封系",
				饰品 = true,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "封系",
				染色方案 = 74,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				染色方案 = 98,
				AI = "封系",
				饰品 = true,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶葫芦宝贝 = {
			全能的 = {
				AI = "封系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "封系",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "封系",
				染色方案 = 2078,
				被动技能 = {},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "封系",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		巴蛇 = {
			裸衣的 = {
				AI = "物理",
				染色方案 = 114,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				AI = "物理",
				染色方案 = 80,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "物理",
				染色方案 = 2065,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			隐忍的 = {
				AI = "物理",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				AI = "物理",
				染色方案 = 82,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 82,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶巴蛇 = {
			裸衣的 = {
				AI = "物理",
				染色方案 = 114,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				AI = "物理",
				染色方案 = 80,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "物理",
				染色方案 = 2065,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			疯癫的 = {
				染色方案 = 60,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				AI = "物理",
				染色方案 = 82,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				染色方案 = 60,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 82,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		曼珠沙华 = {
			肥胖的 = {
				AI = "法系",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "法系",
				染色方案 = 100,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "法系",
				染色方案 = 51,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "法系",
				染色方案 = 82,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "法系",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "法系",
				染色方案 = 114,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 60,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 114,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶曼珠沙华 = {
			肥胖的 = {
				AI = "法系",
				染色方案 = 98,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "法系",
				染色方案 = 98,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "法系",
				染色方案 = 98,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		噬天虎 = {
			汗血的 = {
				AI = "物理",
				染色方案 = 0,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "物理",
				染色方案 = 106,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			裸衣的 = {
				AI = "物理",
				染色方案 = 77,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "物理",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			隐忍的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			笨重的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶噬天虎 = {
			嗜血的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 2000,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 2,
					[2.0] = 0
				}
			}
		},
		鬼将 = {
			全能的 = {
				AI = "物理",
				染色方案 = 2051,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			嗜血的 = {
				染色方案 = 2078,
				AI = "物理",
				饰品 = true,
				被动技能 = {
					"高级吸血"
				},
				染色组 = {
					[1.0] = 5,
					[2.0] = 0
				}
			},
			无畏的 = {
				AI = "物理",
				染色方案 = 67,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "物理",
				染色方案 = 2065,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "物理",
				染色方案 = 119,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			轻灵的 = {
				AI = "物理",
				染色方案 = 90,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "物理",
				染色方案 = 119,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "物理",
				染色方案 = 90,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			}
		},
		藤蔓妖花 = {
			虔诚的 = {
				AI = "封系",
				染色方案 = 56,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 1
				}
			},
			全能的 = {
				AI = "封系",
				染色方案 = 106,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "封系",
				染色方案 = 82,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			狡猾的 = {
				AI = "封系",
				染色方案 = 76,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "封系",
				染色方案 = 77,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			轻灵的 = {
				AI = "封系",
				染色方案 = 2051,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "封系",
				染色方案 = 77,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "封系",
				染色方案 = 2051,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶藤蔓妖花 = {
			虔诚的 = {
				AI = "封系",
				染色方案 = 20113,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 4,
					[2.0] = 1
				}
			},
			全能的 = {
				AI = "封系",
				染色方案 = 2057,
				被动技能 = {},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			肥胖的 = {
				AI = "封系",
				染色方案 = 107,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "封系",
				染色方案 = 100,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			轻灵的 = {
				AI = "封系",
				染色方案 = 89,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "封系",
				染色方案 = 100,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "封系",
				染色方案 = 89,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		律法女娲 = {
			肥胖的 = {
				AI = "物理",
				染色方案 = 101,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			汗血的 = {
				AI = "物理",
				染色方案 = 54,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "物理",
				染色方案 = 60,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			强壮的 = {
				AI = "物理",
				染色方案 = 85,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				染色方案 = 83,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			好战的 = {
				染色方案 = 114,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				染色方案 = 83,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				染色方案 = 114,
				AI = "物理",
				饰品 = true,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		金身罗汉 = {
			肥胖的 = {
				AI = "辅助",
				染色方案 = 83,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "辅助",
				染色方案 = 106,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			坚韧的 = {
				AI = "辅助",
				染色方案 = 64,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "辅助",
				染色方案 = 77,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			敏捷的 = {
				AI = "辅助",
				染色方案 = 2051,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "辅助",
				染色方案 = 76,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗物的 = {
				AI = "辅助",
				染色方案 = 2051,
				被动技能 = {
					"高级敏捷"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "辅助",
				染色方案 = 76,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			}
		},
		进阶金身罗汉 = {
			肥胖的 = {
				AI = "辅助",
				染色方案 = 81,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			虔诚的 = {
				AI = "辅助",
				染色方案 = 20103,
				被动技能 = {
					"高级神佑复生"
				},
				染色组 = {
					[1.0] = 0,
					[2.0] = 3
				}
			},
			坚韧的 = {
				AI = "辅助",
				染色方案 = 51,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			全能的 = {
				AI = "辅助",
				染色方案 = 53,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			自愈的 = {
				AI = "辅助",
				染色方案 = 111,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			},
			抗物的 = {
				AI = "辅助",
				染色方案 = 53,
				被动技能 = {},
				染色组 = {
					[1.0] = 1,
					[2.0] = 0
				}
			},
			抗法的 = {
				AI = "辅助",
				染色方案 = 111,
				被动技能 = {
					"高级再生"
				},
				染色组 = {
					[1.0] = 0,
					[2.0] = 1
				}
			}
		}
	}
	local 坐标 = {
		{
			x = 37,
			y = 57
		},
		{
			x = 65,
			y = 21
		},
		{
			x = 73,
			y = 64
		},
		{
			x = 61,
			y = 21
		},
		{
			x = 96,
			y = 31
		}
	}
	local sss = {
		1004,
		1005,
		1006,
		1007,
		1008
	}
	self.ditu = {
		层数 = {},
		传送坐标 = {}
	}
	local b = 1
	local a = 1

	for i = 3000, 3150 do
		self.ditu.层数[b] = i
		self.ditu.传送坐标[b] = table.copy(坐标[a])
		a = a + 1
		b = b + 1

		if a > 5 then
			a = 1
		end
	end
end

return 雁塔地宫
