local 打造处理类 = class()
local floor = math.floor
local random = 取随机数
local remove = table.remove
local 附加上限 = {
	[60] = {
		27,
		22
	},
	[80] = {
		30,
		25
	},
	[90] = {
		33,
		28
	},
	[100] = {
		36,
		31
	},
	[110] = {
		39,
		34
	},
	[120] = {
		42,
		37
	},
	[130] = {
		45,
		40
	},
	[140] = {
		48,
		43
	},
	[150] = {
		51,
		46
	},
	[160] = {
		54,
		49
	}
}
local 附加范围 = {
	"力量",
	"敏捷",
	"体质",
	"耐力",
	"魔力"
}

local function 绑定等级物品()
	local n = {
		{
			"红缨枪",
			"曲尖枪",
			"锯齿矛",
			"乌金三叉戟",
			"火焰枪",
			"墨杆金钩",
			"玄铁矛",
			"金蛇信",
			"丈八点钢矛",
			"暗夜",
			"梨花",
			"梨花",
			"刑天之逆",
			"五虎断魂",
			"飞龙在天",
			"天龙破城",
			"弑皇"
		},
		{
			"青铜斧",
			"开山斧",
			"双面斧",
			"双弦钺",
			"精钢禅钺",
			"黄金钺",
			"乌金鬼头镰",
			"狂魔镰",
			"恶龙之齿",
			"破魄",
			"肃魂",
			"无敌",
			"五丁开山",
			"元神禁锢",
			"护法灭魔",
			"碧血干戚",
			"裂天"
		},
		{
			"青铜短剑",
			"铁齿剑",
			"吴越剑",
			"青锋剑",
			"龙泉剑",
			"黄金剑",
			"游龙剑",
			"北斗七星剑",
			"碧玉剑",
			"鱼肠",
			"倚天",
			"湛卢",
			"魏武青虹",
			"灵犀神剑",
			"四法青云",
			"霜冷九州",
			"擒龙"
		},
		{
			"双短剑",
			"镔铁双剑",
			"龙凤双剑",
			"竹节双剑",
			"狼牙双剑",
			"鱼骨双剑",
			"赤焰双剑",
			"墨玉双剑",
			"梅花双剑",
			"阴阳",
			"月光双剑",
			"灵蛇",
			"金龙双剪",
			"连理双树",
			"祖龙对剑",
			"紫电青霜",
			"浮犀"
		},
		{
			"五色缎带",
			"幻彩银纱",
			"金丝彩带",
			"无极丝",
			"天蚕丝带",
			"云龙绸带",
			"七彩罗刹",
			"缚神绫",
			"九天仙绫",
			"彩虹",
			"流云",
			"碧波",
			"秋水落霞",
			"晃金仙绳",
			"此最相思",
			"揽月摘星",
			"九霄"
		},
		{
			"铁爪",
			"天狼爪",
			"幽冥鬼爪",
			"青龙牙",
			"勾魂爪",
			"玄冰刺",
			"青刚刺",
			"华光刺",
			"龙鳞刺",
			"撕天",
			"毒牙",
			"胭脂",
			"九阴勾魂",
			"雪蚕之刺",
			"贵霜之牙",
			"忘川三途",
			"离钩"
		},
		{
			"折扇",
			"铁骨扇",
			"精钢扇",
			"铁面扇",
			"百折扇",
			"劈水扇",
			"神火扇",
			"阴风扇",
			"风云雷电",
			"太极",
			"玉龙",
			"秋风",
			"画龙点睛",
			"秋水人家",
			"逍遥江湖",
			"浩气长舒",
			"星瀚"
		},
		{
			"细木棒",
			"金丝魔棒",
			"玉如意",
			"点金棒",
			"云龙棒",
			"幽路引魂",
			"满天星",
			"水晶棒",
			"日月光华",
			"沧海",
			"红莲",
			"盘龙",
			"降魔玉杵",
			"青藤玉树",
			"墨玉骷髅",
			"丝萝乔木",
			"醍醐"
		},
		{
			"松木锤",
			"镔铁锤",
			"八棱金瓜",
			"狼牙锤",
			"烈焰锤",
			"破甲战锤",
			"震天锤",
			"巨灵神锤",
			"天崩地裂",
			"八卦",
			"鬼牙",
			"雷神",
			"混元金锤",
			"九瓣莲花",
			"鬼王蚀日",
			"狂澜碎岳",
			"碎寂"
		},
		{
			"牛皮鞭",
			"牛筋鞭",
			"乌龙鞭",
			"钢结鞭",
			"蛇骨鞭",
			"玉竹金铃",
			"青藤柳叶鞭",
			"雷鸣嗜血鞭",
			"混元金钩",
			"龙筋",
			"百花",
			"吹雪",
			"游龙惊鸿",
			"仙人指路",
			"血之刺藤",
			"牧云清歌",
			"霜陨"
		},
		{
			"黄铜圈",
			"精钢日月圈",
			"离情环",
			"金刺轮",
			"风火圈",
			"赤炎环",
			"蛇形月",
			"子母双月",
			"斜月狼牙",
			"如意",
			"乾坤",
			"月光双环",
			"别情离恨",
			"金玉双环",
			"九天金线",
			"无关风月",
			"朝夕"
		},
		{
			"柳叶刀",
			"苗刀",
			"夜魔弯刀",
			"金背大砍刀",
			"雁翅刀",
			"破天宝刀",
			"狼牙刀",
			"龙鳞宝刀",
			"黑炎魔刀",
			"冷月",
			"屠龙",
			"血刃",
			"偃月青龙",
			"晓风残月",
			"斩妖泣血",
			"业火三灾",
			"鸣鸿"
		},
		{
			"曲柳杖",
			"红木杖",
			"白椴杖",
			"墨铁拐",
			"玄铁牛角杖",
			"鹰眼法杖",
			"腾云杖",
			"引魂杖",
			"碧玺杖",
			"业焰",
			"玉辉",
			"鹿鸣",
			"庄周梦蝶",
			"凤翼流珠",
			"雪蟒霜寒",
			"碧海潮生",
			"弦月"
		},
		{
			"硬木弓",
			"铁胆弓",
			"紫檀弓",
			"宝雕长弓",
			"錾金宝弓",
			"玉腰弯弓",
			"连珠神弓",
			"游鱼戏珠",
			"灵犀望月",
			"非攻",
			"幽篁",
			"百鬼",
			"冥火薄天",
			"龙鸣寒水",
			"太极流光",
			"九霄风雷",
			"若木"
		},
		{
			"琉璃珠",
			"水晶珠",
			"珍宝珠",
			"翡翠珠",
			"莲华珠",
			"夜灵珠",
			"如意宝珠",
			"沧海明珠",
			"无量玉璧",
			"离火",
			"飞星",
			"月华",
			"回风舞雪",
			"紫金葫芦",
			"裂云啸日",
			"云雷万里",
			"赤明"
		},
		{
			"钝铁重剑",
			"桃印铁刃",
			"赭石巨剑",
			"壁玉长铗",
			"青铜古剑",
			"金错巨刃",
			"惊涛雪",
			"醉浮生",
			"沉戟天戊",
			"鸦九",
			"昆吾",
			"弦歌",
			"墨骨枯麟",
			"腾蛇郁刃",
			"秋水澄流",
			"百辟镇魂",
			"长息"
		},
		{
			"油纸伞",
			"红罗伞",
			"紫竹伞",
			"锦绣椎",
			"幽兰帐",
			"琳琅盖",
			"孔雀羽",
			"金刚伞",
			"落梅伞",
			"鬼骨",
			"云梦",
			"枕霞",
			"碧火琉璃",
			"雪羽穿云",
			"月影星痕",
			"浮生归梦",
			"晴雪"
		},
		{
			"素纸灯",
			"竹骨灯",
			"红灯笼",
			"鲤鱼灯",
			"芙蓉花灯",
			"如意宫灯",
			"玲珑盏",
			"玉兔盏",
			"冰心盏",
			"蟠龙",
			"云鹤",
			"风荷",
			"金风玉露",
			"凰火燎原",
			"月露清愁",
			"夭桃秾李",
			"荒尘"
		},
		{
			{
				"方巾",
				"簪子"
			},
			{
				"布帽",
				"玉钗"
			},
			{
				"面具",
				"梅花簪子"
			},
			{
				"纶巾",
				"珍珠头带"
			},
			{
				"缨络丝带",
				"凤头钗"
			},
			{
				"羊角盔",
				"媚狐头饰"
			},
			{
				"水晶帽",
				"玉女发冠"
			},
			{
				"乾坤帽",
				"魔女发冠"
			},
			{
				"黑魔冠",
				"七彩花环"
			},
			{
				"白玉龙冠",
				"凤翅金翎"
			},
			{
				"水晶夔帽",
				"寒雉霜蚕"
			},
			{
				"翡翠曜冠",
				"曜月嵌星"
			},
			{
				"金丝黑玉冠",
				"郁金流苏簪"
			},
			{
				"白玉琉璃冠",
				"玉翼附蝉翎"
			},
			{
				"兽鬼珐琅面",
				"鸾羽九凤冠"
			},
			{
				"紫金磐龙冠",
				"金珰紫焰冠"
			},
			{
				"浑天玄火盔",
				"乾元鸣凤冕"
			}
		},
		{
			"护身符",
			"五色飞石",
			"珍珠链",
			{
				"骷髅吊坠",
				"苍魂珠"
			},
			{
				"江湖夜雨",
				"九宫坠"
			},
			{
				"荧光坠子",
				"高速之星"
			},
			{
				"风月宝链",
				"八卦坠"
			},
			{
				"碧水青龙",
				"鬼牙攫魂"
			},
			{
				"万里卷云",
				"疾风之铃"
			},
			"七彩玲珑",
			"黄玉琉佩",
			"鸾飞凤舞",
			"衔珠金凤佩",
			"七璜珠玉佩",
			"鎏金点翠佩",
			"紫金碧玺佩",
			"落霞陨星坠"
		},
		{
			{
				"布裙",
				"布衣"
			},
			{
				"丝绸长裙",
				"皮衣"
			},
			{
				"五彩裙",
				"鳞甲"
			},
			{
				"龙鳞羽衣",
				"锁子甲"
			},
			{
				"天香披肩",
				"紧身衣"
			},
			{
				"金缕羽衣",
				"钢甲"
			},
			{
				"霓裳羽衣",
				"夜魔披风"
			},
			{
				"流云素裙",
				"龙骨甲"
			},
			{
				"七宝天衣",
				"死亡斗篷"
			},
			{
				"飞天羽衣",
				"神谕披风"
			},
			{
				"穰花翠裙",
				"珊瑚玉衣"
			},
			{
				"金蚕丝裙",
				"金蚕披风"
			},
			{
				"紫香金乌裙",
				"乾坤护心甲"
			},
			{
				"碧霞彩云衣",
				"蝉翼金丝甲"
			},
			{
				"金丝蝉翼衫",
				"金丝鱼鳞甲"
			},
			{
				"五彩凤翅衣",
				"紫金磐龙甲"
			},
			{
				"鎏金浣月衣",
				"混元一气甲"
			}
		},
		{
			"腰带",
			"缎带",
			"银腰带",
			{
				"水晶腰带",
				"玉树腰带"
			},
			{
				"琥珀腰链",
				"白面狼牙"
			},
			{
				"乱牙咬",
				"魔童大牙"
			},
			{
				"攫魂铃",
				"双魂引"
			},
			{
				"兽王腰带",
				"百窜云"
			},
			{
				"八卦锻带",
				"圣王坠"
			},
			"幻彩玉带",
			"珠翠玉环",
			"金蟾含珠",
			"乾坤紫玉带",
			"琉璃寒玉带",
			"蝉翼鱼佩带",
			"磐龙凤翔带",
			"紫霄云芒带"
		},
		{
			"布鞋",
			"牛皮靴",
			"马靴",
			"侠客履",
			"神行靴",
			"绿靴",
			"追星踏月",
			"九州履",
			"万里追云履",
			"踏雪无痕",
			"平步青云",
			"追云逐电",
			"乾坤天罡履",
			"七星逐月靴",
			"碧霞流云履",
			"金丝逐日履",
			"辟尘分光履"
		},
		{
			"竹编护腕",
			"皮腕",
			"针腕",
			"骨镯",
			"青铜护腕",
			"玛瑙护腕",
			"琉璃护腕",
			"镂空银镯",
			"笼玉镯",
			"嵌宝金腕",
			"玳瑁护腕",
			"七星宝腕",
			"缚龙筋",
			"凤翎护腕",
			"织锦彩带",
			"冰蚕丝带"
		},
		{
			"竹编脖环",
			"钢圈",
			"荆棘环",
			"骨环",
			"青铜颈环",
			"玛瑙石环",
			"琉璃环",
			"九曲环",
			"笼玉环",
			"嵌宝金环",
			"玳瑁环",
			"七星宝环",
			"缚龙圈",
			"鸾尾环",
			"织锦颈圈",
			"冰蚕丝圈"
		},
		{
			"皮甲",
			"皮甲",
			"刺甲",
			"骨排甲",
			"青铜披甲",
			"玛瑙软甲",
			"琉璃罩甲",
			"连环铠甲",
			"笼玉甲",
			"嵌宝金甲",
			"玳瑁衣",
			"七星宝甲",
			"缚龙甲",
			"凤凰彩衣",
			"织锦软褡",
			"冰蚕织甲"
		}
	}

	return n
end

local function 绑定装备物品()
	local n = {
		"弑皇",
		"裂天",
		"擒龙",
		"浮犀",
		"九霄",
		"离钩",
		"星瀚",
		"醍醐",
		"碎寂",
		"霜陨",
		"朝夕",
		"鸣鸿",
		"弦月",
		"若木",
		"赤明",
		"长息",
		"晴雪",
		"荒尘",
		"浑天玄火盔",
		"乾元鸣凤冕",
		"落霞陨星坠",
		"鎏金浣月衣",
		"混元一气甲",
		"紫霄云芒带",
		"辟尘分光履"
	}

	return n
end

local function 绑定元身物品()
	local n = {
		"枪·元身",
		"斧·元身",
		"剑·元身",
		"双剑·元身",
		"飘带·元身",
		"爪刺·元身",
		"扇·元身",
		"魔棒·元身",
		"锤·元身",
		"长鞭·元身",
		"双环·元身",
		"刀·元身",
		"长杖·元身",
		"弓·元身",
		"宝珠·元身",
		"巨剑·元身",
		"伞·元身",
		[18] = "灯笼·元身",
		[19] = "头盔·元身",
		[20] = "冠冕·元身",
		[21] = "挂坠·元身",
		[22] = "纱衣·元身",
		[23] = "坚甲·元身",
		[24] = "束带·元身",
		[25] = "鞋履·元身"
	}

	return n
end

function 打造处理类:初始化()
	self.打造物品 = 绑定等级物品()
	self.装备物品 = 绑定装备物品()
	self.元身物品 = 绑定元身物品()
end

function 打造处理类:数据处理(连接id, 序号, id, 内容)
	if 序号 == 5000 then
		if 内容.打造方式.界面 == "打造" and (内容.打造方式.选项 == "强化打造装备" or 内容.打造方式.选项 == "强化打造灵饰") and 玩家数据[id].角色:取任务(5) ~= 0 then
			常规提示(id, "#Y/你已经有一个打造任务在进行了")

			return
		end

		self:打造类型处理(连接id, 序号, id, 内容)
	end
end

function 打造处理类:打造类型处理(连接id, 序号, id, 内容)
	local 物品序号1 = 玩家数据[id].角色.数据.道具[内容.序列]
	local 物品序号2 = 玩家数据[id].角色.数据.道具[内容.序列1]
	local 道具1 = 玩家数据[id].道具.数据[物品序号1]
	local 道具2 = 玩家数据[id].道具.数据[物品序号2]
	local 道具属性 = 玩家数据[id].道具.数据
	local 打造方式界面 = 内容.打造方式.界面
	local 打造方式选项 = 内容.打造方式.选项

	if 道具1 == nil or 道具2 == nil then
		道具刷新(id)

		return
	end

	if 玩家数据[id].打造方式 == 1 then
		if 打造方式界面 == "打造" then
			if 打造方式选项 == "强化打造装备" or 打造方式选项 == "普通打造装备" then
				if 打造方式选项 == "强化打造装备" and 道具1.总类 == 66 or 道具1.总类 == 67 then
					self:强化打造160装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
				else
					常规提示(id, "只能打造元身")

					return
				end
			elseif 打造方式选项 == "强化打造灵饰" or 打造方式选项 == "普通打造灵饰" then
				self:打造灵饰处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 打造方式选项, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "召唤兽装备" then
				self:打造召唤兽装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "镶嵌" then
			if 打造方式选项 == "宝石" then
				self:宝石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "精魄灵石" then
				self:灵石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "钟灵石" then
				self:钟灵石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "星辉石" then
				self:星辉石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "点化石" then
				self:宝宝点化装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "合成" then
			常规提示(id, "暂时未开放此功能")

			return
		elseif 打造方式界面 == "修理" then
			常规提示(id, "暂时未开放此功能")

			return
		elseif 打造方式界面 == "熔炼" then
			if 打造方式选项 == "熔炼装备" then
				self:熔炼装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "分解" then
			if 打造方式选项 == "分解装备" then
				self:分解装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		end
	elseif 玩家数据[id].打造方式 == 2 then
		if 打造方式界面 == "打造" then
			if 打造方式选项 == "强化打造装备" or 打造方式选项 == "普通打造装备" then
				if 打造方式选项 == "强化打造装备" and 道具1.总类 == 66 or 道具1.总类 == 67 then
					self:强化打造160装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
				else
					常规提示(id, "只能打造元身")

					return
				end
			elseif 打造方式选项 == "强化打造灵饰" or 打造方式选项 == "普通打造灵饰" then
				self:打造灵饰处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 打造方式选项, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "召唤兽装备" then
				self:打造召唤兽装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "镶嵌" then
			if 打造方式选项 == "宝石" then
				self:宝石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "精魄灵石" then
				self:灵石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "钟灵石" then
				self:钟灵石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "星辉石" then
				self:星辉石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			elseif 打造方式选项 == "点化石" then
				self:宝宝点化装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "合成" then
			常规提示(id, "暂时未开放此功能")

			return
		elseif 打造方式界面 == "修理" then
			常规提示(id, "暂时未开放此功能")

			return
		elseif 打造方式界面 == "熔炼" then
			if 打造方式选项 == "熔炼装备" then
				self:熔炼装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		elseif 打造方式界面 == "分解" then
			if 打造方式选项 == "分解装备" then
				self:分解装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 内容.序列, 内容.序列1)
			else
				常规提示(id, "暂时未开放此功能")

				return
			end
		end
	end
end

function 打造处理类:取可以镶嵌灵石(装备, 宝石)
	if 装备 == 8 and 宝石 == 1 then
		return true
	elseif 装备 == 9 and 宝石 == 2 then
		return true
	elseif 装备 == 7 and 宝石 == 3 then
		return true
	end
end

function 打造处理类:分解所需分解符(装备等级, 装备分类)
	if 装备分类 >= 10 then
		if 装备等级 <= 60 then
			return 4
		elseif 装备等级 <= 80 then
			return 6
		elseif 装备等级 <= 100 then
			return 8
		elseif 装备等级 <= 120 then
			return 10
		elseif 装备等级 <= 140 then
			return 12
		elseif 装备等级 <= 160 then
			return 14
		else
			return 1000
		end
	elseif 装备等级 <= 80 then
		return 5
	elseif 装备等级 <= 100 then
		return 6
	elseif 装备等级 <= 110 then
		return 7
	elseif 装备等级 <= 120 then
		return 12
	elseif 装备等级 <= 130 then
		return 16
	elseif 装备等级 <= 140 then
		return 23
	elseif 装备等级 <= 160 then
		return 30
	else
		return 1000
	end
end

function 打造处理类:分解装备获取吸附石数量(装备等级)
	if 装备等级 <= 60 then
		return 1
	elseif 装备等级 <= 70 then
		return 取随机数(1, 2)
	elseif 装备等级 <= 80 then
		return 取随机数(2, 3)
	elseif 装备等级 <= 90 then
		return 取随机数(3, 4)
	elseif 装备等级 <= 110 then
		return 取随机数(4, 5)
	elseif 装备等级 <= 120 then
		return 取随机数(5, 6)
	elseif 装备等级 <= 140 then
		return 取随机数(7, 8)
	elseif 装备等级 <= 150 then
		return 取随机数(8, 9)
	end
end

function 打造处理类:分解灵饰获取星辉石(装备等级)
	if 装备等级 <= 60 then
		return 5
	elseif 装备等级 <= 80 then
		return 8
	elseif 装备等级 <= 100 then
		return 10
	elseif 装备等级 <= 120 then
		return 15
	elseif 装备等级 <= 140 then
		return 20
	elseif 装备等级 <= 160 then
		return 25
	end
end

function 打造处理类:分解装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 装备格子, 道具格子)
	local 装备序号 = 0
	local 分解符序号 = 0

	if 道具1.总类 == 5 then
		分解符序号 = 物品序号1
		装备序号 = 物品序号2
	else
		分解符序号 = 物品序号2
		装备序号 = 物品序号1
	end

	if 道具属性[分解符序号].名称 ~= "分解符" then
		常规提示(id, "只有分解符才可以进行装备分解操作！" .. (道具属性[分解符序号].名称 or "a"))

		return
	end

	if 道具属性[装备序号].级别限制 < 55 and 通灵装备1[道具属性[装备序号].名称] == nil then
		常规提示(id, "必须55级以上的装备才能进行分解！")

		return
	end

	local 所需分解符数量 = self:分解所需分解符(道具属性[装备序号].级别限制, 道具属性[装备序号].分类)

	if 道具属性[分解符序号].数量 < 所需分解符数量 then
		常规提示(id, "分解符数量不够,无法进行分解操作！分解该装备需要#R" .. 所需分解符数量 .. "#G张分解符！")

		return
	end

	if 玩家数据[id].角色.数据.体力 < (道具属性[装备序号].级别限制 or 0) / 10 + 10 then
		常规提示(id, "#Y您的体力好像不够了！")

		return
	end

	if 玩家数据[id].角色.数据.银子 < math.max(道具属性[装备序号].级别限制 * 500, 30000) then
		常规提示(id, "#Y您的银子不够分解的费用哦！")

		return
	end

	local 获取物品, 获取数量, 文字单位 = nil

	if 通灵装备1[道具属性[装备序号].名称] ~= nil then
		获取物品 = 重置丹列表[通灵装备1[道具属性[装备序号].名称]]
		获取数量 = 2
		文字单位 = "个"
	elseif 道具属性[装备序号].分类 >= 10 then
		获取物品 = "星辉石"
		获取数量 = self:分解灵饰获取星辉石(道具属性[装备序号].级别限制)
		文字单位 = "级"
	else
		获取物品 = "吸附石"
		获取数量 = self:分解装备获取吸附石数量(道具属性[装备序号].级别限制)
		文字单位 = "个"
	end

	if 获取数量 == nil and 道具属性[装备序号].级别限制 < 160 then
		常规提示(id, "#Y/分解遇到了错误。")

		return
	end

	local 打造金钱 = math.max(道具属性[装备序号].级别限制 * 500, 30000)
	local 打造体力 = math.floor(道具属性[装备序号].级别限制 / 10 + 10)
	local 道具等级 = 道具属性[装备序号].级别限制 or 0
	local 元身序列 = 道具属性[装备序号].元身序列

	if 道具等级 == 160 then
		if 取随机数() <= 50 and 元身序列 ~= nil then
			道具属性[装备序号] = nil
			local 幻化名字 = self.元身物品[元身序列]
			local 道具 = 物品类()

			道具:置对象(幻化名字)

			道具属性[装备序号] = 幻化处理类:分解幻化处理(id, 幻化名字, 元身序列)

			常规提示(id, "#Y/你获得了 #R/【" .. 幻化名字 .. "】")
		else
			获取物品 = "陨铁"
			获取数量 = 取随机数(2, 4)
			文字单位 = "个"

			快捷给道具(id, 获取物品, 获取数量)

			道具属性[装备序号] = nil
		end
	else
		道具属性[装备序号] = nil
		local 道具 = 物品类()

		道具:置对象(获取物品)

		if 获取物品 == "星辉石" then
			道具.级别限制 = 获取数量

			快捷给道具(id, 获取物品, 1, 获取数量)
		else
			道具.数量 = 获取数量

			快捷给道具(id, 获取物品, 获取数量)
		end

		道具属性[装备序号] = nil

		常规提示(id, "#Y/你获得了" .. 获取数量 .. 文字单位 .. " #R/【" .. 获取物品 .. "】")
	end

	if 分解符序号 == 物品序号1 then
		道具属性[分解符序号].数量 = 道具属性[分解符序号].数量 - 所需分解符数量

		if 道具属性[分解符序号].数量 < 1 then
			道具属性[分解符序号] = nil
		end
	else
		道具属性[分解符序号].数量 = 道具属性[分解符序号].数量 - 所需分解符数量

		if 道具属性[分解符序号].数量 < 1 then
			道具属性[分解符序号] = nil
		end
	end

	常规提示(id, "装备分解成功")
	刷新道具行囊单格(id, "道具", 装备格子, 装备序号)
	刷新道具行囊单格(id, "道具", 道具格子, 分解符序号)
	玩家数据[id].角色:扣除银子(math.abs(打造金钱), 0, 0, "分解装备", 1)
	玩家数据[id].角色:扣除体力(打造体力, "分解装备", 1)
	玩家数据[id].角色:刷新信息()
	发送数据(玩家数据[id].连接id, 14.2)
end

function 打造处理类:灵石镶嵌处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性)
	local 宝石格子 = 0
	local 装备格子 = 0

	if 道具1.总类 == 5 then
		宝石格子 = 物品序号1
		装备格子 = 物品序号2
	else
		宝石格子 = 物品序号2
		装备格子 = 物品序号1
	end

	if 道具属性[宝石格子].分类 ~= 11 then
		常规提示(id, "只有精魄灵石才可以镶嵌在装备上")

		return
	end

	if self:取可以镶嵌灵石(道具属性[装备格子].分类, 道具属性[宝石格子].子类) then
		local 锻造级别 = 0

		if 道具属性[装备格子].锻炼等级 ~= nil then
			锻造级别 = 道具属性[装备格子].锻炼等级
		end

		锻造级别 = 锻造级别 + 1

		if 道具属性[宝石格子].级别限制 ~= 锻造级别 then
			常规提示(id, "该装备目前只能用#R/" .. 锻造级别 .. "#Y/级精魄灵石镶嵌")

			return
		end

		local 打造金钱 = 道具属性[宝石格子].级别限制 * 10000

		if 玩家数据[id].角色.数据.银子 < 锻造级别 * 10000 then
			常规提示(id, "#Y您的银子不够镶嵌的费用哦！")

			return
		end

		if 道具属性[装备格子].镶嵌宝石 == nil then
			道具属性[装备格子].镶嵌宝石 = {}
			道具属性[装备格子].镶嵌类型 = {}
			道具属性[装备格子].灵石属性 = {}
		end

		if 道具属性[装备格子].镶嵌宝石[1] == nil then
			道具属性[装备格子].镶嵌宝石[1] = 道具属性[宝石格子].类型
		elseif 道具属性[装备格子].镶嵌宝石[1] ~= 道具属性[宝石格子].类型 then
			常规提示(id, "BB装备只能镶嵌一种类型的宝石")

			return
		end

		道具属性[装备格子].锻炼等级 = 锻造级别
		道具属性[装备格子].镶嵌类型[锻造级别] = 道具属性[宝石格子].名称

		if 道具属性[宝石格子].类型 == "伤害" then
			道具属性[装备格子].灵石属性.伤害 = 锻造级别 * 10
		elseif 道具属性[宝石格子].类型 == "灵力" then
			道具属性[装备格子].灵石属性.灵力 = 锻造级别 * 4
		elseif 道具属性[宝石格子].类型 == "防御" then
			道具属性[装备格子].灵石属性.防御 = 锻造级别 * 8
		elseif 道具属性[宝石格子].类型 == "气血" then
			道具属性[装备格子].灵石属性.气血 = 锻造级别 * 30
		elseif 道具属性[宝石格子].类型 == "速度" then
			道具属性[装备格子].灵石属性.速度 = 锻造级别 * 6
		end

		if 宝石格子 == 物品序号1 then
			物品序号1 = nil
			道具属性[宝石格子] = nil
		else
			物品序号2 = nil
			道具属性[宝石格子] = nil
		end

		常规提示(id, "镶嵌召唤兽装备成功")
		刷新道具行囊单格(id, "道具", 物品序号1, 装备格子)
		刷新道具行囊单格(id, "道具", 物品序号2, 道具格子)
		玩家数据[id].角色:扣除银子(math.abs(打造金钱), 0, 0, "镶嵌精魄灵石", 1)
	else
		常规提示(id, "这种精魄灵石无法镶嵌到此类召唤兽装备上")

		return
	end
end

function 打造处理类:添加强化打造160装备(id, 任务id, 技能, 熟练度)
	local 新格子 = 玩家数据[id].角色:取道具格子()

	if 新格子 == 0 then
		常规提示(id, "#Y/你的道具栏已满。")

		return
	end

	local 道具 = 物品类()

	道具:置对象(任务数据[任务id].名称)

	道具.级别限制 = 任务数据[任务id].级别
	道具.元身序列 = 任务数据[任务id].元身属性.元身序列
	local dz = self:强化打造160级公式(id, 任务数据[任务id].级别, 任务数据[任务id].序列, 技能, 任务数据[任务id].元身属性.幻化元身属性, 熟练度)
	local 属性 = {
		"命中",
		"伤害",
		"防御",
		"魔法",
		"灵力",
		"气血",
		"敏捷",
		"体质",
		"力量",
		"耐力",
		"魔力",
		"特效",
		"特技"
	}
	local 打造特效 = 通用特效
	local 打造特技 = 通用特技
	local 元身属性 = 任务数据[任务id].元身属性.幻化元身属性

	for n = 1, #属性 do
		if dz[n] ~= nil then
			if n == 12 then
				道具 = 添加装备特效(道具, true)
			elseif n == 13 then
				道具[属性[n]] = 打造特技[random(1, #打造特技)]
			else
				道具[属性[n]] = math.floor(dz[n])
			end
		end
	end

	if 祝福特效[id] == true then
		if 道具.新特效 == nil then
			道具.新特效 = {
				"祝福"
			}
		else
			table.insert(道具.新特效, "祝福")
		end

		祝福特效[id] = false

		常规提示(id, "#Y/恭喜你得到了一件160级#R/祝福#Y装备。")
	end

	道具.制造者 = (任务数据[任务id].制造者 or 玩家数据[id].角色.数据.名称) .. "强化打造"
	local 制造格子 = 玩家数据[id].道具:取新编号()
	玩家数据[id].道具.数据[制造格子] = 道具
	玩家数据[id].道具.数据[制造格子].超级五行 = 取超级五行处理(道具.级别限制, 20, 熟练度)
	玩家数据[id].道具.数据[制造格子].五行 = 玩家数据[id].道具.数据[制造格子].超级五行.类型 or 取五行()

	if 玩家数据[id].道具.数据[制造格子].超级五行.类型 ~= nil then
		常规提示(id, "#Y/你得到了一件#R/超级五行#Y装备。")
	end

	if 玩家数据[id].角色.数据.百炼次数 ~= nil and math.floor(玩家数据[id].角色.数据.百炼次数) > 0 then
		玩家数据[id].道具.数据[制造格子].百炼效果 = 取百炼处理(道具.级别限制)
		玩家数据[id].角色.数据.百炼次数 = 玩家数据[id].角色.数据.百炼次数 - 1

		常规提示(id, "#Y/恭喜你打造了一件#R/百炼#Y装备。")
	end

	玩家数据[id].道具.数据[制造格子].耐久 = 取随机数(500, 700)
	玩家数据[id].道具.数据[制造格子].识别码 = id .. "_" .. os.time() .. "_" .. 取随机数(1000, 9999999) .. "_" .. 随机序列
	随机序列 = 随机序列 + 1
	玩家数据[id].角色.数据.道具[新格子] = 制造格子

	玩家数据[id].角色:取消任务(任务id)

	任务数据[任务id] = nil
	玩家数据[id].道具.数据[制造格子].鉴定 = false

	常规提示(id, "#Y/你得到了#R/" .. 玩家数据[id].道具.数据[制造格子].名称)
	刷新道具行囊单格(id, "道具", 新格子, 制造格子)
end

强化打造160属性系数 = 1
强化打造160属性加强概率 = 10
强化打造160属性加强系数 = 1.1

function 打造处理类:强化打造160级公式(id, 元身等级, 制造种类, 技能, 元身属性, 熟练度)
	熟练度 = (熟练度 or 0) + 0
	local 打造属性 = {}
	local 特效 = 取随机数(1, 10000)
	local 特技 = 取随机数(1, 10000)
	local 技能等级 = 0
	local 特效概率 = 元身属性.特效概率 or 0
	local 特技概率 = 元身属性.特技概率 or 0

	if 制造种类 < 19 then
		技能等级 = 技能[7].等级
	elseif 制造种类 == 19 or 制造种类 == 20 or 制造种类 == 22 or 制造种类 == 23 then
		技能等级 = 技能[8].等级
	elseif 制造种类 == 21 or 制造种类 == 24 or 制造种类 == 25 then
		技能等级 = 技能[9].等级
	end

	if 元身等级 == nil or 制造种类 == nil then
		return false
	end

	local 系数 = 强化打造160属性系数
	local 系数1 = 强化打造160属性加强系数

	if 取随机数(1, 10000) <= (祝福特效概率 + 取熟练度加成(熟练度, "祝福")) * 100 then
		祝福特效[id] = true
		系数 = 系数 * 1.1
	else
		祝福特效[id] = false
	end

	if 制造种类 < 19 then
		打造属性[1] = 熟练度影响计算(元身属性.命中 * 0.98, 元身属性.命中 * 1.1, 熟练度) * 系数
		打造属性[2] = 熟练度影响计算(元身属性.伤害 * 0.98, 元身属性.伤害 * 1.1, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[1] = 打造属性[1] * 系数1
			打造属性[2] = 打造属性[2] * 系数1
		end
	elseif 制造种类 == 19 or 制造种类 == 20 then
		打造属性[3] = 熟练度影响计算(元身属性.防御 * 0.98, 元身属性.防御 * 1.1, 熟练度) * 系数
		打造属性[4] = 熟练度影响计算(元身属性.魔法 * 0.98, 元身属性.魔法 * 1.1, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[3] = 打造属性[3] * 系数1
			打造属性[4] = 打造属性[4] * 系数1
		end
	elseif 制造种类 == 21 then
		打造属性[5] = 熟练度影响计算(元身属性.灵力 * 0.98, 元身属性.灵力 * 1.05, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[5] = 打造属性[5] * 系数1
		end
	elseif 制造种类 == 22 or 制造种类 == 23 then
		打造属性[3] = 熟练度影响计算(元身属性.防御 * 0.98, 元身属性.防御 * 1.1, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[3] = 打造属性[3] * 系数1
		end
	elseif 制造种类 == 24 then
		打造属性[3] = 熟练度影响计算(元身属性.防御 * 0.98, 元身属性.防御 * 1.1, 熟练度) * 系数
		打造属性[6] = 熟练度影响计算(元身属性.气血 * 0.98, 元身属性.气血 * 1.1, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[3] = 打造属性[3] * 系数1
			打造属性[6] = 打造属性[6] * 系数1
		end
	elseif 制造种类 == 25 then
		打造属性[3] = 熟练度影响计算(元身属性.防御 * 0.98, 元身属性.防御 * 1.1, 熟练度) * 系数
		打造属性[7] = 熟练度影响计算(元身属性.敏捷 * 0.98, 元身属性.敏捷 * 1.1, 熟练度) * 系数

		if 取随机数(1, 10000) <= 强化打造160属性加强概率 * 100 then
			打造属性[3] = 打造属性[3] * 系数1
			打造属性[7] = 打造属性[7] * 系数1
		end
	end

	local 属性个数 = 0
	local 选取属性 = 0
	local 开始数 = 7

	if 打造属性[7] ~= nil then
		开始数 = 8
	end

	local 范围 = {
		"命中",
		"伤害",
		"防御",
		"魔法",
		"灵力",
		"气血",
		"敏捷",
		"体质",
		"力量",
		"耐力",
		"魔力",
		"特效",
		"特技"
	}

	for n = 开始数, #范围 - 2 do
		if 元身属性[范围[n]] ~= nil then
			local 判断字 = 分割文本(元身属性[范围[n]], 范围[n])

			if 判断字[1] == "增加" then
				属性个数 = 属性个数 + 1
				打造属性[n] = (打造属性[n] or 0) + 取随机数(40, 80)
				选取属性 = n
			elseif 判断字[1] == "减少" then
				属性个数 = 属性个数 + 1
				打造属性[n] = (打造属性[n] or 0) - 取随机数(30, 60)
				选取属性 = n
			else
				属性个数 = 属性个数 + 1
				打造属性[n] = (打造属性[n] or 0) + 取随机数(40, 80)
				选取属性 = n
			end
		end
	end

	if 特效 <= (特效概率 + 取熟练度加成(熟练度, "特效")) * 100 then
		打造属性[12] = 1
	end

	if 特技 <= (特技概率 + 取熟练度加成(熟练度, "特技")) * 100 then
		打造属性[13] = 1
	end

	return 打造属性
end

function 打造处理类:强化打造160装备处理(id, 物品序号1, 物品序号2, 道具1, 道具2, 道具属性, 背包编号1, 背包编号2)
	if 玩家数据[id].角色:取任务(5) ~= 0 then
		常规提示(id, "#Y/你已经领取了一个强化打造任务，赶快去完成吧")

		return
	end

	local 元身 = 0
	local 战魂 = 0

	if 道具1.总类 == 66 and 道具2.总类 == 67 then
		元身 = 物品序号1
		战魂 = 物品序号2
	elseif 道具1.总类 == 67 and 道具2.总类 == 66 then
		元身 = 物品序号2
		战魂 = 物品序号1
	end

	if 道具属性[元身] == nil or 道具属性[战魂] == nil or 道具属性[元身].元身序列 == nil then
		常规提示(id, "#Y/错误的打造材料。")

		return
	end

	local 临时序列 = 道具属性[元身].元身序列
	local 打造符 = 0

	if 临时序列 <= 18 then
		打造符 = 打造符处理(id, "打造符", 道具属性[元身].级别限制)

		if 打造符 == 0 and 道具属性[元身].级别限制 > 玩家数据[id].角色.数据.辅助技能[角色辅助技能列表1.打造技巧].等级 + 打造技能高于等级 then
			常规提示(id, "#Y打造160级武器，需要#R 打造技巧 #Y/达到" .. tostring(160 - 打造技能高于等级) .. "级才能打造哟！")

			return
		end
	elseif 临时序列 == 23 or 临时序列 == 22 or 临时序列 == 20 or 临时序列 == 19 then
		打造符 = 打造符处理(id, "裁缝符", 道具属性[元身].级别限制)

		if 打造符 == 0 and 道具属性[元身].级别限制 > 玩家数据[id].角色.数据.辅助技能[角色辅助技能列表1.裁缝技巧].等级 + 打造技能高于等级 then
			常规提示(id, "#Y打造160级防具，需要#R 裁缝技巧 #Y/达到" .. tostring(160 - 打造技能高于等级) .. "级才能打造哟！")

			return
		end
	elseif 临时序列 == 25 or 临时序列 == 24 or 临时序列 == 21 then
		打造符 = 打造符处理(id, "炼金符", 道具属性[元身].级别限制)

		if 打造符 == 0 and 道具属性[元身].级别限制 > 玩家数据[id].角色.数据.辅助技能[角色辅助技能列表1.炼金术].等级 + 打造技能高于等级 then
			常规提示(id, "#Y打造160级饰品，需要#R 炼金术 #Y/达到" .. tostring(160 - 打造技能高于等级) .. "级才能打造哟！")

			return
		end
	else
		常规提示(id, "错误的打造材料。")

		return
	end

	local 扣除金钱 = 打造金钱公式(道具属性[元身].级别限制)
	local 扣除体力 = 打造体力公式(道具属性[元身].级别限制)

	if 取银子(id) < 扣除金钱 then
		常规提示(id, "#Y你银子不够打造装备哦！")

		return
	elseif 玩家数据[id].角色.数据.体力 < 扣除体力 and 打造符 == 0 then
		常规提示(id, "#Y你的体力不足#R" .. 扣除体力)

		return
	end

	if 打造符 == 0 then
		角色扣除体力(id, 扣除体力)
	end

	玩家数据[id].角色:扣除银子(math.abs(扣除金钱), 0, 0, "打造160装备", 1)

	local 打造熟练度 = 0
	打造熟练度 = 扣除打造符处理(id, 打造符, 强化打造160熟练度)

	if 打造符 ~= 0 then
		常规提示(id, "你使用了制造符打造160装备。")
	end

	local 临时类型 = self.装备物品[临时序列]

	任务处理类:设置打造160级装备任务(id, 临时类型, 道具属性[元身].级别限制, 临时序列, 道具属性[元身], 打造符主人, 打造熟练度)

	道具属性[元身] = nil

	if 元身 == 物品序号1 then
		刷新道具行囊单格(id, "道具", 背包编号1, 元身)
		扣除背包位置道具(id, 背包编号2, 1)
	else
		刷新道具行囊单格(id, "道具", 背包编号2, 元身)
		扣除背包位置道具(id, 背包编号1, 1)
	end
end

function 打造处理类:更新(dt)
end

function 打造处理类:显示(x, y)
end

return 打造处理类
