符石置对象 = function(id, 临时装备id)
	玩家数据[id].道具.数据[临时装备id].符石组合 = nil

	if 玩家数据[id].道具.数据[临时装备id].符石 ~= nil then
		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "万丈霞光"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "万丈霞光"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "万丈霞光"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "万丈霞光"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "百步穿杨"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "百步穿杨"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "百步穿杨"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "百步穿杨"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "隔山打牛"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "隔山打牛"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "隔山打牛"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "隔山打牛"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "心随我动"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "心随我动"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "心随我动"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "心随我动"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "云随风舞"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "云随风舞"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "云随风舞"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "云随风舞"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "凤舞九天"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "凤舞九天"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "凤舞九天"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "望穿秋水"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "万里横行"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "日落西山"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "网罗乾坤"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "网罗乾坤"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "网罗乾坤"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "石破天惊"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "石破天惊"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "石破天惊"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天雷地火"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天雷地火"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天雷地火"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "烟雨飘摇"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "烟雨飘摇"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "烟雨飘摇"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "索命无常"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "索命无常"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "索命无常"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "行云流水"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "行云流水"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "行云流水"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "福泽天下"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "福泽天下"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "福泽天下"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "无心插柳"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "无心插柳"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "无心插柳"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "无心插柳"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
					if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 4,
							符石组合 = "风卷残云"
						}
					else
						玩家数据[id].道具.数据[临时装备id].符石组合 = {
							等级 = 3,
							符石组合 = "风卷残云"
						}
					end
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "风卷残云"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "风卷残云"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天降大任"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天降大任"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天降大任"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "高山流水"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "高山流水"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "高山流水"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "百无禁忌"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "百无禁忌"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "百无禁忌"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "无懈可击"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "点石成金"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "为官之道符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "为官之道符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "为官之道符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "黄庭经符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "黄庭经符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "黄庭经符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "小乘佛法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "小乘佛法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "小乘佛法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "毒经符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "毒经符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "毒经符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天罡气符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天罡气符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天罡气符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "九龙诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "九龙诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "九龙诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "周易学符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "周易学符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "周易学符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "灵性符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "灵性符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "灵性符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "灵通术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "灵通术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "灵通术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "牛逼神功符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "牛逼神功符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "牛逼神功符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "魔兽神功符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "魔兽神功符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "魔兽神功符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "蛛丝阵法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "蛛丝阵法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "蛛丝阵法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "文韬武略符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "文韬武略符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "文韬武略符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "归元心法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "归元心法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "归元心法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "佛光普照符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "佛光普照符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "佛光普照符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "倾国倾城符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "倾国倾城符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "倾国倾城符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "傲世诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "傲世诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "傲世诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "逆鳞符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "逆鳞符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "逆鳞符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "明性修身符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "明性修身符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "明性修身符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "五行扭转符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "五行扭转符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "五行扭转符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "拘魂诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "拘魂诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "拘魂诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "回身击符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "回身击符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "回身击符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "魔兽反嗜符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "魔兽反嗜符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "魔兽反嗜符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "盘丝大法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "盘丝大法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "盘丝大法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "十方无敌符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "十方无敌符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "十方无敌符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "符之术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "符之术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "符之术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "歧黄之术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "歧黄之术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "歧黄之术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "闭月羞花符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "闭月羞花符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "闭月羞花符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "乾坤塔符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "乾坤塔符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "乾坤塔符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "乾坤塔符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "乾坤塔符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "乾坤塔符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "呼风唤雨符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "呼风唤雨符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "呼风唤雨符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "乾坤袖符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "乾坤袖符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "乾坤袖符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "金刚经符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "金刚经符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "金刚经符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "幽冥术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "幽冥术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "幽冥术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "火牛阵符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "火牛阵符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "火牛阵符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "生死搏符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "生死搏符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "生死搏符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "催情大法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "催情大法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "催情大法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "神兵鉴赏符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "神兵鉴赏符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "神兵鉴赏符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "霹雳咒符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "霹雳咒符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "霹雳咒符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "诵经符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "诵经符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "诵经符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "沉鱼落雁符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "沉鱼落雁符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "沉鱼落雁符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "宁气诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "宁气诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "宁气诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "破浪诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "破浪诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "破浪诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "潇湘仙雨符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "潇湘仙雨符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "潇湘仙雨符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "五行学说符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "五行学说符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "五行学说符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "尸腐恶符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "尸腐恶符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "尸腐恶符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "牛虱阵符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "牛虱阵符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "牛虱阵符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "阴阳二气诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "阴阳二气诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "阴阳二气诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "姊妹相随符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "姊妹相随符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "姊妹相随符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "暗度陈仓"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "无双一击符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "无双一击符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "无双一击符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
			玩家数据[id].道具.数据[临时装备id].符石组合 = {
				等级 = 1,
				符石组合 = "化敌为友"
			}
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "磬龙灭法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "磬龙灭法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "磬龙灭法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "金刚伏魔符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "金刚伏魔符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "金刚伏魔符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "玉质冰肌符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "玉质冰肌符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "玉质冰肌符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "混天术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "混天术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "混天术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "龙附符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "龙附符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "龙附符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "修仙术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "修仙术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "修仙术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "护法金刚符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "护法金刚符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "护法金刚符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "六道轮回符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "六道轮回符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "六道轮回符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "震天诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "震天诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "震天诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "狂兽诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "狂兽诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "狂兽诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "秋波暗送符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "秋波暗送符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "秋波暗送符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "紫薇之术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "紫薇之术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "紫薇之术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "神道无念符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "神道无念符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "神道无念符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "大慈大悲符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "大慈大悲符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "大慈大悲符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "香飘兰麝符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "香飘兰麝符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "香飘兰麝符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "清明自在符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "清明自在符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "清明自在符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "龙腾符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "龙腾符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "龙腾符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "混元道果符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "混元道果符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "混元道果符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "观音咒符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "观音咒符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "观音咒符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "九幽阴魂符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "九幽阴魂符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "九幽阴魂符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "火云术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "火云术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "火云术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "训兽诀符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "训兽诀符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "训兽诀符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天外魔音符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天外魔音符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天外魔音符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "疾风步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "疾风步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "疾风步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "斜月步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "斜月步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "斜月步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "渡世步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "渡世步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "渡世步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "清歌妙舞符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "清歌妙舞符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "清歌妙舞符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "云霄步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "云霄步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "云霄步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "游龙术符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "游龙术符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "游龙术符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "七星遁符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "七星遁符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "七星遁符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "莲花宝座符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "莲花宝座符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "莲花宝座符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "无常步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "无常步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "无常步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "裂石步符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "裂石步符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "裂石步符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "大鹏展翅符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "大鹏展翅符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "大鹏展翅符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "移形换影符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "移形换影符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "移形换影符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "蓝色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天地无极符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天地无极符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天地无极符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "啸傲符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "啸傲符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "啸傲符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "法天象地符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "法天象地符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "法天象地符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "气吞山河符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "气吞山河符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "气吞山河符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "武神显圣符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "武神显圣符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "武神显圣符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "诛魔符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "诛魔符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "诛魔符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "九转玄功符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "九转玄功符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "九转玄功符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天人庇护符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天人庇护符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天人庇护符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "神木恩泽符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "神木恩泽符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "神木恩泽符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "驭灵咒符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "驭灵咒符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "驭灵咒符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "瞬息万变符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "瞬息万变符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "瞬息万变符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "万物轮转符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "万物轮转符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "万物轮转符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "巫咒符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "巫咒符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "巫咒符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "万灵诸念符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "万灵诸念符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "万灵诸念符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "秘影迷踪符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "秘影迷踪符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "秘影迷踪符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "混元神功符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "混元神功符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "混元神功符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "鬼蛊灵蕴符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "鬼蛊灵蕴符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "鬼蛊灵蕴符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "白色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "阴风绝章符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "阴风绝章符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "阴风绝章符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "地冥妙法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "地冥妙法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "地冥妙法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黑色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "燃灯灵宝符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "燃灯灵宝符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "燃灯灵宝符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "枯骨心法符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "枯骨心法符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "枯骨心法符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "蓝色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "飞檐走壁"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "飞檐走壁"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "飞檐走壁"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天火献誓符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天火献誓符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天火献誓符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "藻光灵狱符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "藻光灵狱符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "藻光灵狱符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "煌火无明符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "煌火无明符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "煌火无明符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "化神以灵符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "化神以灵符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "化神以灵符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "弹指成烬符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "弹指成烬符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "弹指成烬符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "天罚之焰符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "天罚之焰符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "天罚之焰符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "离魂符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "离魂符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "离魂符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "神工无形符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "神工无形符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "神工无形符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "千机奇巧符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "千机奇巧符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "千机奇巧符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "匠心不移符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "匠心不移符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "匠心不移符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "蓝色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "攻玉以石符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "攻玉以石符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "攻玉以石符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "紫色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "红色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "擎天之械符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "擎天之械符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "擎天之械符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "探奥索隐符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "探奥索隐符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "探奥索隐符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黄色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "运思如电符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "运思如电符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "运思如电符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "紫色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "灵猴九窍符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "灵猴九窍符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "灵猴九窍符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "紫色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "绿色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黑色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "金刚之躯符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "金刚之躯符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "金刚之躯符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "绿色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "白色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "七十二变符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "七十二变符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "七十二变符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "红色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "绿色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "白色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "神通广大符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "神通广大符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "神通广大符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "蓝色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "黄色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "绿色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "如意金箍符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "如意金箍符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "如意金箍符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "红色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "紫色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "白色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "齐天逞胜符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "齐天逞胜符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "齐天逞胜符石"
				}
			end
		end

		if 玩家数据[id].道具.数据[临时装备id].符石[1] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[1].颜色 == "黑色" and 玩家数据[id].道具.数据[临时装备id].符石[2] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[2].颜色 == "黄色" and 玩家数据[id].道具.数据[临时装备id].符石[3] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[3].颜色 == "黑色" then
			if 玩家数据[id].道具.数据[临时装备id].符石[4] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[4].颜色 == "红色" then
				if 玩家数据[id].道具.数据[临时装备id].符石[5] ~= nil and 玩家数据[id].道具.数据[临时装备id].符石[5].颜色 == "黄色" then
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 3,
						符石组合 = "腾云驾霧符石"
					}
				else
					玩家数据[id].道具.数据[临时装备id].符石组合 = {
						等级 = 2,
						符石组合 = "腾云驾霧符石"
					}
				end
			else
				玩家数据[id].道具.数据[临时装备id].符石组合 = {
					等级 = 1,
					符石组合 = "腾云驾霧符石"
				}
			end
		end
	else
		常规提示(id, "你想要镶嵌的符石呢")
	end
end
